{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Charge-spin correlation in van der Waals antiferromagenet $\\mathrm{NiPS}_{3}$ }\n\n\n\\author{So Yeun Kim, ${ }^{1,2}$ Tae Yun Kim,,$^{2,3}$ Luke J. Sandilands, ${ }^{1,2}$ Soobin Sinn, ${ }^{1,2}$ Min-Cheol Lee, ${ }^{1,2}$\\\\\nJaeseok Son, ${ }^{1,2}$ Sungmin Lee, ${ }^{1,2}$ Ki-Young Choi, ${ }^{1,2}$ Wondong Kim, ${ }^{4}$ Byeong-Gyu Park, ${ }^{5}$ C. Jeon, ${ }^{6}$\\\\\nHyeong-Do Kim, ${ }^{1,2}$ Cheol-Hwan Park, ${ }^{2,3}$ Je-Geun Park,, $2 \\ddagger$ S. J. Moon, ${ }^{1 *}$ and T. W. Noh,, $2 \\dagger$\\\\\n${ }^{1}$ Center for Correlated Electron Systems, Institute for Basic Science (IBS), Seoul 08826, Republic of Korea\\\\\n${ }^{2}$ Department of Physics \\& Astronomy, Seoul National University (SNU), Seoul 08826, Republic of Korea\\\\\n${ }^{3}$ Center for Theoretical Physics, SNU, Seoul 08826, Republic of Korea\\\\\n${ }^{4}$ Korea Research Institute of Standards and Science (KRISS), Daejeon 34113, Republic of Korea\\\\\n${ }^{5}$ Pohang Accelerator Laboratory, Pohang University of Science and Technology (POSTECH), Pohang 37673, Republic of Korea\\\\\n${ }^{6}$ Advanced Nano-Surface Group, Korea Basic Science Institute (KBSI), Daejeon 34133, Republic of Korea\\\\\n${ }^{7}$ Department of Physics, Hanyang University, Seoul 04763, Republic of Korea}\n\\date{}\n\n\n\\DeclareUnicodeCharacter{2021}{$\\ddagger$}\n\n\\begin{document}\n\\maketitle\n\n\n\\begin{abstract}\nStrong charge-spin coupling is found in a layered transition-metal trichalcogenide $\\mathrm{NiPS}_{3}$, a van der Waals antiferromagnet, from our study of the electronic structure using several experimental and theoretical tools: spectroscopic ellipsometry, x-ray absorption and photoemission spectroscopy, and density-functional calculations. $\\mathrm{NiPS}_{3}$ displays an anomalous shift in the optical spectral weight at the magnetic ordering temperature, reflecting a strong coupling between the electronic and magnetic structures. X-ray absorption, photoemission and optical spectra support a self-doped ground state in $\\mathrm{NiPS}_{3}$. Our work demonstrates that layered transition-metal trichalcogenide magnets are a useful candidate for the study of correlated-electron physics in two-dimensional magnetic material.\n\\end{abstract}\n\nPACS numbers: 71.20.-b, \\href{http://75.50.Ee}{75.50.Ee}, \\href{http://78.20.Ci}{78.20.Ci}\n\nIt is a fundamental question of modern condensed matter physics how the three-dimensional (3D) physics that we are familiar with breaks down upon reducing the dimension. It is generally believed that in one-dimensional physical systems, dimensional fluctuations will become stronger and ultimately destroy any long-range order. However, the same question for two dimensions is nontrivial and extremely hard to solve.\n\nFor this goal of new physics, layered van der Waals $(\\mathrm{vdW})$ materials, such as graphene and transition metal (TM) dichalcogenides, have attracted much attention over the last decade [1]3. A remarkable advantage of these materials is that they can easily be mechanically exfoliated to produce two-dimensional (2D) crystals [1]3. The intriguing collective quantum phenomena found in $2 \\mathrm{D}$ vdW materials include charge density waves and superconductivity 4 8. These observations open a new window of opportunity for novel device applications through the manipulation of collective quantum states in atomically thin $2 \\mathrm{D}$ phases [3, 6, 9. Despite the extensive study of vdW materials, it is striking that there have been very few studies of magnetic $2 \\mathrm{D}$ vdW materials.\n\nOnly recently has attention been focused on new magnetic $2 \\mathrm{D}$ vdW materials of ternary transition-metal trichalcogenide (TMTC) families, such as $\\mathrm{Cr} B \\mathrm{Te}_{3}(B=$ Si or Ge) and $T M \\mathrm{PX}_{3}(T M=3 d \\mathrm{TMs} ; X=$ chalcogens $)$ 10. 12, 13. These TMTC bulk samples exhibit various magnetic orderings: ferromagnetic (FM), zig-zag antiferromagnetic (AF), Néel AF, and stripy AF 12, 13. Moreover, all three key magnetic Hamiltonians, i.e., Ising, XY, and Heisenberg types, are realized in $T M \\mathrm{P}_{3}$ [14 17. Of further interest, long-range magnetic ordering has recently been reported to persist even in the monolayer limit, e.g., $\\mathrm{FePS}_{3}$ and $\\mathrm{CrGeTe}_{3}$ [10, 11, 15. Thus, it has become clear that the TMTC families, i.e., the lay- ered $\\mathrm{vdW}$ magnets, are a fertile playground for exploring rich and intriguing phenomena related to 2D magnetism, which will ultimately pave the way to novel applications in spintronics.\n\nCompared with other nonmagnetic vdW materials, these new magnetic vdW materials offer another distinct and fundamental opportunity, namely insight into strongly correlated electronic systems in the 2D limit. Over the past few decades, researchers have attempted to unravel correlation physics using 2D materials [18 20; e.g., oxide ultrathin films produced by pulsed laser deposition (PLD) and molecular beam epitaxy (MBE), where a variety of emergent phenomena are reported to take place [21, 22. With magnetism being an intrinsic property of TMTC, it is natural for us to expect to see some correlation physics, even in the 2D limit of those materials. It is well-known that in magnetic TM oxides, electron-electron correlation plays a central role in magnetic interactions, including superexchange and double exchange mechanisms [23, 24]. For instance, many $3 d$ TM oxides exhibit AF ordering as a consequence of the superexchange processes associated with $d-d$ hopping, whose amplitude is directly related to the correlation interaction energy. To date, the electron correlation effects in TMTC remain largely unexplored experimentally, despite their potential importance.\n\nIn this Letter, we report on the electronic structure of bulk $\\mathrm{NiPS}_{3}$ single crystal, a TMTC antiferromagnet in which the electronic and spin (or magnetic) structures are closely related to one another. Using optical spectroscopy techniques we observed clear anomalies in the optical spectral weight at the Néel temperature, driven mainly by the magnetic ordering, which is a hallmark of correlated electronic systems [25, 26]. Subsequent $x-$ ray absorption and photoemission studies also showed, (a) Zig-zag AF\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_cc792b66f9a5779f9798g-2_256_1060_215_625}\n\n(b) $\\mathrm{H} / / \\mathrm{ab}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cc792b66f9a5779f9798g-2_222_618_606_999}\n\\end{center}\n\n(d) $2.63-5.00 \\mathrm{eV}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cc792b66f9a5779f9798g-2_664_1060_627_999}\n\\end{center}\n\nFIG. 1. (color online). (a) Schematic diagram of the zigzag antiferromagnetic ordering. The honeycomb lattice of $\\mathrm{Ni}$ ions is shown by black lines, with the spin depicted as an arrow in each site. (b) The magnetic susceptibility $(\\chi)$ of $\\mathrm{NiPS}_{3}$ measured under in-plane bias fields (lower panel) and its first derivative with respect to $T$ (upper panel). (c)-(d) The spectral weight $\\omega_{p}^{2}$ and its first derivative (upper panel) obtained for the energy range of (c) 1.52-2.62 eV and (d) 2.63-5.00 eV. The Néel temperature of $\\mathrm{NiPS}_{3}\\left(T_{N} \\sim 154 \\mathrm{~K}\\right)$ is represented as a red vertical line in panels (b) $(\\mathrm{d})$.\n\ntogether with cluster model calculations, that $\\mathrm{NiPS}_{3}$ is a self-doped negative charge transfer (NCT) insulator. That is, the ligand (sulfur atoms) has a strong holelike character due to a NCT energy, unlike more conventional systems. Such an intriguing electronic and magnetic ground state was also confirmed by density functional theory (DFT) with Coulomb interaction $(U)$ calculations. Our studies identify $\\mathrm{NiPS}_{3}$ as a unique vdW magnet showing clear evidence of strong correlation and NCT behavior.\n\nHigh-quality single crystals of $\\mathrm{NiPS}_{3}$ were grown by a chemical vapor transport method, as described in Ref. 27. 28. For the optical measurements, we used a 55- $\\mu$ mthick single crystal sample and an M-2000 ellipsometer (J. A. Woollam Co.). In addition, we carried out the DFT $+U$ calculations using the Quantum Espresso package 31 38] (for details on the DFT method, see Supplemental Materials (a-1) 30$]$.\n\n$\\mathrm{NiPS}_{3}$ is one of the transition-metal phosphorous trichalcogenides $\\left(T M \\mathrm{P}_{3}\\right)$ with an AF long-range ordering at $154 \\mathrm{~K}$. It has a monoclinic structure with $\\mathrm{C}_{2 h}^{2}$ symmetry and features edge-sharing $\\mathrm{NiS}_{6}$ octahedra arranged on a honeycomb lattice [27, 39. At the center of the honeycomb lattice, two $\\mathrm{P}$ atoms are located above\n\nand below the TM plane. They are then connected to the $\\mathrm{S}$ atoms like a dumbbell, forming a $\\left(\\mathrm{P}^{2} \\mathrm{~S}^{6}\\right)^{4-}$ bipyramid structure 39,40 . It is known that the magnetic moments of Ni ions are aligned in a so-called zig-zag pattern; i.e., chains of ferromagnetically coupled spins are arranged antiferromagnetically, as shown in Fig. 1(a) 32. Our in-plane magnetic susceptibility $\\chi(T)$ shows an AF magnetic anomaly at the Néel temperature $\\left(T_{N}\\right.$ $\\sim 154 \\mathrm{~K}$ ) [Fig. $1(\\mathrm{~b})]$\n\nThe optical conductivity spectra $\\sigma_{1}(\\omega)$ show that $\\mathrm{NiPS}_{3}$ is an insulator with an optical gap of about $1.8$ $\\mathrm{eV}[$ Fig. 2(a)]. At the same time, there are strong narrow absorption peaks in the visible-ultraviolet energy regions, near $2.2,3.5$, and $4.6 \\mathrm{eV}$ [labeled $\\mathrm{A}, \\mathrm{B}$, and $\\mathrm{C}$, respectively, in Fig. 2(a)]. Below the gap, there exists two additional weak peaks near $1.1$ and $1.7 \\mathrm{eV}$ denoted as $\\alpha$ and $\\beta$, respectively [see the inset of Fig. 2(a)]. For comparison, $\\mathrm{NiO}$, which has the same formal valence of $\\mathrm{Ni}(+2)$ as $\\mathrm{NiPS}_{3}$, is reported to have weak on-site $d-d$ transitions at $1.13$ and $1.75 \\mathrm{eV}$ [41]. Due to the similarities in the energy positions and strengths of the peaks, it is most likely that the $\\alpha$ and $\\beta$ peaks are the on-site $d-d$ transitions, a transition within one Ni ion. It should be noted that the hybridization of Ni $3 d$ orbitals with $\\mathrm{S}$ $3 p$ can provide a much larger bandwidth than that with $\\mathrm{O} 2 p$ in $\\mathrm{NiO}$. Nonetheless, the narrowness of the $\\mathrm{A}, \\mathrm{B}$, and $\\mathrm{C}$ peaks, in addition to the existence of the $\\alpha$ and $\\beta$ peaks, suggest the presence of well-localized Ni $3 d$ orbital states near the Fermi surface $\\left(E_{F}\\right)$ in the electronic structure.\n\nWhen we measure the temperature dependence of the optical conductivity of $\\mathrm{NiPS}_{3}$, it displays strong temperature variations. For example, Fig. 2(b) shows the difference curve of $\\sigma_{1}(\\omega)$ at various temperatures after subtracting off the $400 \\mathrm{~K}$ spectrum. Note that peak A shows strong enhancement in intensity while peaks B and $\\mathrm{C}$ sharpen without much change in intensity upon cooling. To quantify the temperature evolution, we calculated the squares of the plasma frequency $\\omega_{p}^{2}: \\omega_{p}^{2}(T)$ $=8 \\int \\sigma_{1}(\\omega, T) d \\omega$, 42 , which we refer to as the spectral weight $(S W)$. The optical sum rule is satisfied when we integrate up to $4.2 \\mathrm{eV}$, implying the clear $S W$ shifts from peak A to peaks B and C (see Supplemental Materials (b) 30]). At the same time, satisfaction of the optical sum rule indicates that most of the temperature-dependent changes in the electronic structure should occur near the Fermi level, $E_{F}$.\n\nWhen we further examined the temperature dependence, we found clear anomalies in the $S W$ changes of the main peaks occurring at $T_{N}$. Figures $1(\\mathrm{c})$ and $1(\\mathrm{~d})$ show the $S W$ changes in the energy ranges of $1.52-2.63$ $\\mathrm{eV}$ and of 2.63-5.00 eV, respectively. The former represents the $S W$ changes of peak A, and the latter represents those of peaks $B$ and C. The lower panel of Fig. 1 (c) shows that the $\\omega_{p}^{2}(T)$ of peak A increased with decreasing temperature, with a kink structure at $E_{F}$. The anomaly was seen more clearly in the first derivative of\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cc792b66f9a5779f9798g-3_173_1122_213_1002}\n\\end{center}\n\nFIG. 2. (color online). (a) Real part of the optical conductivity $\\sigma_{1}(\\omega)$ of $\\mathrm{NiPS}_{3}$ measured between 10 and $400 \\mathrm{~K}$. The three main optical transitions are labeled A, B, and C. Two weak on-site $d-d$ transitions $(\\alpha$ and $\\beta$ ) are located below 2 $\\mathrm{eV}$. The inset shows the $\\alpha$ and $\\beta$ transitions in detail. (b) Difference spectra $\\sigma_{1}(\\omega, T)-\\sigma_{1}(\\omega, 400 K)$. Fabry-Pérot interference fringes are observed in a narrow energy range near $1.4$ $\\mathrm{eV}$ and below $0.9 \\mathrm{eV}$, where the sample becomes transparent; these are not shown.\n\n$\\omega_{p}^{2}$, as plotted on the upper panel. A similar feature was also observed in the temperature evolution of the $S W$ of peaks B and C, as shown in Fig. 1(d). Thus, the observation of $S W$ anomalies at $E_{F}$ constitutes the compelling evidence of strong coupling between the electronic and spin structures in $\\mathrm{NiPS}_{3}$.\n\nConventionally, most ground states of strongly correlated compounds can be categorized via the ZaanenSawatzky-Allen (ZSA) classification scheme 43, 44. Depending on the relative size of on-site $U$ and chargetransfer energy $(\\Delta)$, the insulating ground state can be classified as either Mott-Hubbard or charge transfer insulators. In the former, the lowest energy charge fluctuation occurs between inter-site TM ions $\\left(d^{n} d^{n}\\right) \\rightarrow$ $\\left(d^{n+1} d^{n-1}\\right)$ with an energy cost of $U$, and in the latter, between ligand and TM ions $\\left(d^{n} p^{6} \\rightarrow d^{n+1} p^{5}\\right)$ with $\\Delta$ (see Supplemental Materials (d) [30]. However, there is a less-explored region in the ZSA scheme, where compounds can have NCT energy $(\\Delta<0)$. In this region, electrons of the ligand $p$-orbital transfer to the TM $d$ levels in the ground state, creating holes at the ligands without external doping. Because of this, they are often referred to as \"self-doped\" [45]. The ligand hole can naturally make an important contribution to the conductivity and magnetism [46]. To some extent, the nature of the self-doped state is analogous to the ground state of the Zhang-Rice singlet states found in hole-doped cuprates [47, 48].\n\nIndeed, this interpretation of the self-doped ground state agrees with XAS and XPS results of $\\mathrm{NiPS}_{3}$. We obtained the $\\mathrm{Ni} L_{2,3}$ edge XAS spectra of bulk $\\mathrm{NiPS}_{3}$ which was subsequently analyzed using a cluster model (see Supplemental Materials (e-2) [30]). At the $L_{3}$ edge, $\\mathrm{NiPS}_{3}$ show a main peak near $851 \\mathrm{eV}$, which are clearly distinguished from that of compounds with large positive $\\Delta$ values, such as $\\mathrm{NiO}(\\Delta \\sim 4.6 \\mathrm{eV})$ or $\\mathrm{NiCl}_{2}(\\Delta \\sim$ $3.6 \\mathrm{eV})$, where the main peak shows clear splitting [49. We simulated the $\\mathrm{Ni} L_{2,3}$ edge XAS spectra using cluster model and found the $\\mathrm{NiPS}_{3}$ belongs to the regime of $\\Delta \\leq$ $0 \\mathrm{eV}$ (see Supplemental Materials (e-3) [30]). In addition, the Ni $2 p_{3 / 2}$ core XPS spectrum is found to be nearly identical to that of $\\mathrm{NiGa}_{2} \\mathrm{~S}_{4}$, a first reported NCT sulfide [50, 55] (see Supplemental Materials (e-2) [30]). The $\\mathrm{NiS}_{6}$ cluster model used on $\\mathrm{NiGa}_{2} \\mathrm{~S}_{4}$ also reproduces the Ni $2 p_{3 / 2}$ XPS spectrum of $\\mathrm{NiPS}_{3}$ well, using the parameters of $\\Delta=-1.0$ and $U=5.0 \\mathrm{eV}$. Note the calculated ground state is given as $\\Psi_{g}=\\alpha\\left|d^{8}\\right\\rangle+\\beta\\left|d^{9} \\underline{L}\\right\\rangle+\\gamma\\left|d^{10} \\underline{L}^{2}\\right\\rangle$, where $\\underline{L}$ indicates a ligand (sulfur) hole, with $\\alpha^{2}=0.25$, $\\beta^{2}=0.60$ and $\\gamma^{2}=0.15$. Above findings support $\\mathrm{NiPS}_{3}$ should have a self-doped ground state with dominant $d^{9} \\underline{L}$ character, and demonstrate $\\mathrm{NiPS}_{3}$ as the only known example of a magnetically ordered vdW material with an NCT insulating state.\n\nTo gain further insight, we performed DFT $+U$ calculations. We used a magnetic ground state with a zig-zag $\\mathrm{AF}$ ordering [Fig. 1(a)] and an effective $U$ value of $4 \\mathrm{eV}$. The solid line in Fig. 3(a) shows the theoretical calculation of in-plane $\\sigma_{1}(\\omega)$ after rescaling the data, in a way that satisfies the sum rule, to match the energy position of the first transition peak (see Supplemental Materials (a-2) 30]. The theoretical $\\sigma_{1}(\\omega)$ reproduced most of the key features found in our experimental data.\n\nThe DFT $+U$ calculations also support our interpretation of the self-doped NCT ground state for $\\mathrm{NiPS}_{3}$. Figure 3(b) shows the projected density of states (PDOS) for $\\mathrm{Ni}, \\mathrm{P}$, and $\\mathrm{S}$ orbitals in $\\mathrm{NiPS}_{3}$; as shown by the dashed curve, the P $3 p$ states are located mostly above $2 \\mathrm{eV}$ or below $-5 \\mathrm{eV}$, and show a strong hybridization with the S $3 p$ orbitals as a result of covalent bonding in the $\\mathrm{P}_{2} \\mathrm{~S}_{6}$ bipyramids [39, 40. On the other hand, the PDOS for $\\mathrm{Ni}$ and $\\mathrm{S}$ orbitals is much higher near $E_{F}$ than that of P $3 p$ [Fig. 3(b)]. Thus, the valence bands near $E_{F}$ are mainly $\\mathrm{S} 3 p$ orbital states, and the occupied Ni $3 d$ orbital states are located mostly at lower energies. Narrow Ni $3 d$ bands hybridized with the $\\mathrm{S} 3 p$ show up at $\\sim 1.3$ $\\mathrm{eV}$ above $E_{F}$. The $\\mathrm{S} 3 p$ orbitals are located at higher energies than most Ni $d$ orbitals, which indicates charge transfer from $\\mathrm{S}$ to $\\mathrm{Ni}$ ions in the ground state, and is consistent with the NCT picture [46]. Thus, the ground state is expected to have strong contributions from $d^{9} \\underline{L}$ and $d^{10} \\underline{L}^{2}$ configurations, in addition to $d^{8}$.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_cc792b66f9a5779f9798g-4_176_960_215_999}\n\nFIG. 3. (color online). (a) Real part of the optical conductivity $\\sigma_{1}(\\omega)$ obtained from experiments conducted at $10 \\mathrm{~K}$ (circle) and from DFT $+U$ after a stretch in the energy axis by $1.39$ and a proper renormalization satisfying the sum rules [27. (b) Projected density of states (PDOS) for Ni (gray oblique lines), S (yellow), and $\\mathrm{P}$ (dashed line) obtained from DFT $+U$ calculations.\n\nThe total number of $d$-electrons from the PDOS analysis of our DFT $+U$ was larger than expected from the formal valence, which is consistent with a self-doped NCT ground state. While $\\mathrm{Ni}^{2+}$ ion in the formal valence is expected to have an occupation number of 8 , we obtained $8.6$ from our PDOS analysis. Such an increase in the occupation number was also found in a DFT study of $\\mathrm{Cs}_{2} \\mathrm{Au}_{2} \\mathrm{Cl}_{6}$, which showed a larger occupation number of $d$-electrons than expected from the formal valence because $\\Delta<0$ [56].\n\nThe picture of the self-doped ground state also finds support from the magnetic properties. According to our DFT $+U$ calculations, the theoretical value of the ordered magnetic moment is $1.24 \\mu_{B}$ per Ni ions, as opposed to the formal value of $2 \\mu_{B}$. This reduction in the magnetic moment can be easily understood using the results of our cluster calculations. As mentioned earlier, the ground state consists of three configurations, each with different spin numbers: $d^{8}\\left(S_{N i}=1\\right), d^{9} \\underline{L}\\left(S_{N i}=1 / 2\\right)$, and $d^{10} \\underline{L}^{2}$ $\\left(S_{N i}=0\\right)$. In addition, our calculations show that four S ions in each $\\mathrm{NiS}_{6}$ octahedron have spin polarizations $\\left(0.15 \\mu_{B}\\right)$ aligned in the same direction as the spin of the central Ni ion. The remaining $\\mathrm{S}$ positioned in the middle of two adjacent FM chains, as well as the $\\mathrm{P}$ ions, are nonmagnetic (see Supplemental Materials (a-3) 30]. Here, we would like to point out that a recent neutron diffraction experiment on $\\mathrm{NiPS}_{3}$ also reported a large reduction in the Ni moment with an experimental ordered moment of $1.05 \\mu_{B}$ [32]. We speculate that this reduction in the magnetic moment of $\\mathrm{Ni}$ ions, consistently supported by our theory and experiment, is a natural consequence of the charge transfer energy being negative.\n\nLet us revisit the temperature-dependent $S W$ anomaly, shown in Figs. 1(c) and 1(d), within the simple cluster picture. In the $d^{9} \\underline{L}$ state, the lowest energy transition, peak A, is expected to be enhanced when the neighboring $\\mathrm{Ni}$ ions are bonded antiferromagnetically. The corresponding ground state should be composed of $t_{2 g}{ }^{6} e_{g}{ }^{3}$ electrons at Ni $3 d$ orbitals and one hole at S $3 p$ orbitals $(\\underline{L})$; i.e., $t_{2 g}{ }^{6} e_{g}{ }^{3} \\underline{L}$, with the ${ }^{3} A_{2 g}$ symmetry [50] (see Supplemental Materials (f) [30]). According to the $\\mathrm{NiS}_{6}$ cluster model, the lowest-energy ionization state was found to have ${ }^{2} E_{g}$ symmetry [50, 57, and the corresponding state is clearly seen in XPS valence spectra (see Supplemental Materials (e-4) [30]. This suggests that peak A could be assigned as an inter-site transition between $\\mathrm{NiS}_{6}$ clusters that transfer an electron between two $t_{2 g}{ }^{6} e_{g}{ }^{3} \\underline{L}\\left({ }^{3} A_{2 g}\\right)$ clusters. These transitions would split the ground state into a low spin $t_{2 g}{ }^{6} e_{g}{ }^{2} \\underline{L} / t_{2 g}{ }^{6} e_{g}{ }^{3} \\underline{L}^{2}$ state on one site and a low spin $t_{2 g}{ }^{6} e_{g}{ }^{3} / t_{2 g}{ }^{6} e_{g}{ }^{4} \\underline{L}$ state on the other site. Considering spin conservation, such transitions may be allowed between AF-bonded clusters, but forbidden between FM-bonded clusters.\n\nTherefore, the temperature-dependent $S W$ and its anomaly should arise from the increased AF bonds in zig-zag-ordered honeycomb lattice. At the temperature above $T_{N}$, there will be no preference between $\\mathrm{AF}$ and FM bonds of $\\mathrm{NiS}_{6}$ clusters. Below $T_{N}$, however, the number of $\\mathrm{AF}$ and FM bonds will differ: For the nearest neighboring $\\mathrm{Ni}$ ions (with exchange interaction $J_{1}$ ), there will be $2 \\mathrm{FM}$ and a AF bonds; for the secondnearest $\\left(J_{2}\\right), 2 \\mathrm{FM}$ and $4 \\mathrm{AF}$ bonds; and for the thirdnearest $\\left(J_{3}\\right), 3 \\mathrm{AF}$ bonds only. Recent calculations on the monolayer of the $\\mathrm{NiPS}_{3}$ predicted that $J_{3}$ is nearly four times larger than $J_{1}$, while the value of $J_{2}$ is very small [58, 59]. Likewise, the dominant strength of $J_{3}$ is consistent with the increased number of AF bonds below $T_{N}$, and consequently the increased intensity of peak A. The $S W$, therefore, should reflect the degree of AF correlation present at a given temperature, which is consistent with $S W$ anomalies observed across $T_{N}$ in the experiments [Fig. 1(c)].\n\nIn summary, we investigated the electronic structures of $\\mathrm{NiPS}_{3}$, one of the layered vdW antiferromagnets. Our results showed strong charge-spin coupling; i.e., a close relationship between the electronic structure and the magnetic ordering. We also found that $\\mathrm{NiPS}_{3}$ is a rare self-doped NCT insulator; i.e., a strong hole-character is present in the ground state. Our findings provide a basis to explore a novel material class of vdW magnets, which could lead to rich and intriguing phenomena related to 2D magnetism and enable new applications in novel spintronic devices.\n\nWe gratefully acknowledge insightful discussions with K. W. Kim, K. Burch and B. C. Park. This work was supported by Institute for Basic Science (IBS) in Ko- rea (Grant No. IBS-R009-D1, IBS-R009-G1). S. J. Moon was supported by Basic Science Research Program through the National Research Foundation of Korea (NRF) funded by the Ministry of Science, ICT and Future Planning (Grant No. 2014R1A2A1A11054351 and 2017R1A2B4009413). T. Y. Kim and C. -H. Park were supported by Korean NRF-2016R1A1A1A05919979. Experiments at PLS-II were supported in part by MSIP and POSTECH. The STXM experiment was supported by the National Council of Science \\& Technology grant (Grant No. CAP-16-01-KIST and NRF2016K1A3A7A09005335). W. Kim specially thanks to N. Kim and H. Shin for their supporting for STXM measurement at PLS-II.\n\nE-mail address:\n\n*soonjmoon@hanyang.ac.kr\n\n$\\dagger$ \\href{mailto:twnoh@snu.ac.kr}{twnoh@snu.ac.kr}\n\n‡jgpark10@snu.ac.kr\n\n[1] K. S. Novoselov, D. Jiang, F. Schedin, T. J. Booth, V. V Khotkevich, S. V Morozov, and A. K. Geim, Proc. Natl. Acad. Sci. 102, 10451 (2005).\n\n[2] K. S. Novoselov, A. K. Geim, S. V. Morozov, D. Jiang, Y. Zhang, S. V. Dubonos, I. V. Grigorieva, and A. A. Firsov, Scinece 306, 666 (2004).\n\n[3] A. K. Geim, and I. V Grigorieva, Nature 499, 419 (2014).\n\n[4] X. Xi, L. Zhao, Z. Wang, H. Berger, L. Forr, J. Shan, and K. F. Mak Nat. Nanotechnol. 10, 765 (2015).\n\n[5] K. F. Mak, K. He, J. Shan, and T. F. Heinz, Nat. Nanotechnol. 7, 496 (2012).\n\n[6] K. S. Novoselov, A. Mishchenko, A. Carvalho, and A. H. Castro Neto, Science 353, 461 (2016).\n\n[7] M. V. Sadavskii, Physics-Uspekhi 59, 947 (2016).\n\n[8] A. H. Castro Neto, Phys. Rev. Lett. $8 \\mathbf{6}, 4382$ (2001).\n\n[9] X. Li and J. Yang, Natl. Sci. Rev. 3, 365 (2016).\n\n[10] C. Gong, L. Li, Z. Li, H. Ji, A. Stern, Y. Xia, T. Cao, C. Wang, Y. Wang, Z. Q. Qiu, R. J. Cava, S. G. Louie, and J. Xia, Nature 546, 265 (2017).\n\n[11] Additionally, the ferromagnetism in monolayer was reported in $\\mathrm{CrI}_{3}$ compound; see Bevin Huang, Genevieve Clark, Efrén Navarro-Moratalla, Dahlia R. Klein, Ran Cheng, Kyle L. Seyler, Ding Zhong, Emma Schmidgall, Michael A. McGuire, David H. Cobden, Wang Yao, Di Xiao, Pablo Jarillo-Herrero, and Xiaodong Xu, Nature 546, 270 (2017).\n\n[12] N. Sivadas, M. W. Daniels, R. H. Swendsen, S. Okamoto, and D. Xiao, Phys. Rev. B 91, 235425 (2015).\n\n[13] B. L. Chittari, Y. Park, D. Lee, M. Han, and A. H. Macdonald, Phys. Rev. B 94, 184428 (2016).\n\n[14] A. R. Wildes, K. C. Rule, R. I. Bewley, M. Enderle, and T. J. Hicks, J. Phys. Condens. Matter 24, 416004 (2012).\n\n[15] J.-U. Lee, S. Lee, J. H. Ryoo, S. Kang, T. Y. Kim, P. Kim, C.-H. Park, J. Park, and H. Cheong, Nano Lett. 16, 7433 (2016).\n\n[16] A. R. Wildes, B. Roessli, B. Lebech, and K. W. Godfrey, J. Phys. Condens. Matter 10, 6417 (1998).\n\n[17] J. Park, J. Phys. Condens. Matter 28, 301001 (2016).\n\n[18] D. Neilson, A. Perali, and M. Zarenia, J. Phys. Conf. Ser 702, 012008 (2016) . [19] J. Sabio, J. Nilsson, and A. H. Castro Neto, Phys. Rev. B 78, 075410 (2008).\n\n[20] J. Crossno, J. K. Shi, K. Wang, X. Liu, A. Harzheim, A. Lucas, S. Sachdev, P. Kim, T. Taniguchi, K. Watanebe, T. A. Ohki, and K. C. Fong, Science 351, 1058 (2016).\n\n[21] J. H. Ngai, F. J. Walker, and C. H. Ahn, Annu. Rev. Mater. Res. 44, 1 (2014).\n\n[22] P. Zubko, S. Gariglio, M. Gabay, P. Ghosez, and J.M. Triscone, Annu. Rev. Condens. Matter Phys. 2, 141 (2011).\n\n[23] D. I. Khomskii, Basic Aspects of the Quantum Theory of Solids (Cambridge University Press, New York, 2010).\n\n[24] D. I. Khomskii, Transition Metal Compounds (Cambridge University Press, New York, 2014), 1st ed..\n\n[25] D. N. Basov, R. D. Averitt, D. Van Der Marel, M. Dressel, and K. Haule, Rev. Mod. Phys. 83, 471 (2011).\n\n[26] Millis, A. J., Optical Conductivity and Correlated Electron Physics, edited by D. Baeriswyl and L. Degiorgi, Strong Interactions in Low Dimensions, (Kluwer Academic Publishers, Dordrecht, 2004), pp. 195-236.\n\n[27] C. T. Kuo, M. Neumann, K. Balamurugan, H. J. Park, S. Kang, H. W. Shiu, J. H. Kang, B. H. Hong, M. Han, T. W. Noh, and J. G. Park, Sci. Rep. 6, 20904 (2016).\n\n[28] We subsequently checked the stoichiometry using a scanning electron microscope (COXI EM30; COXEM), equipped with an energy-dispersive x-ray spectrometer (Bruker Quantax 100), which was followed by magnetic susceptibility measurements obtained with a SQUIDVSM (MPMS 3; Quantum Design).\n\n[29] E. Stavitski and F. M. F. de Groot, Micron 41, 687 (2010).\n\n[30] See Supplemental Materials\n\n[31] S. L. Dudarev, G. A. Botton, S. Y. Savrasov, C. J. Humphreys, and A. P. Sutton, Phys. Rev. B 57, 1505 (1998).\n\n[32] A. R. Wildes, V. Simonet, E. Ressouche, G. J. McIntyre, M. Avdeev, E. Suard, S. A. J. Kimber, D. Lanon, G. Pepe, B. Moubaraki, and T. J. Hicks, Phys. Rev. B 92, 224408 (2015).\n\n[33] D. R. Hamann, Phys. Rev. B 88, 85117 (2013).\n\n[34] M. Schlipf and F. Gygi, Comput. Phys. Commun. 196, $36(2015)$.\n\n[35] J. P. Perdew, K. Burke, and M. Ernzerhof, Phys. Rev. Lett. 77, 3865 (1996).\n\n[36] A. Marini, C. Hogan, M. Gruning, and D. Varsano, Comput. Phys. Commun. 180, 1392 (1996).\n\n[37] Z. H. Levine and D. C. Allen, Phys. Rev. B 63, 1719 (1996).\n\n[38] P. Giannozzi, S. Baroni, N. Bonini, M. Calandra, R. Car, C. Cavazzoni, D. Ceresoli, G. L. Chiarotti, M. Cococcioni, I. Dabo, A. D. Corso, S. Fabris, G. Fratesi, S. de Gironcoli, R. Gebauer, U. Gerstmann, C. Gougoussis, A. Kokalj, M. Lazzeri, L. Martin-Samos, N. Marzari, F. Mauri, R. Mazzarello, S. Paolini, A. Pasquarello, L. Paulatto, C. Sbraccia, S. Scandolo, G. Sclauzero, A. P. Seitsonen, A. Smogunov, P. Umari, and R. M. Wentzcovitch, J. Phys. Condens. Matter 21, 395502 (2009).\n\n[39] R. Brec, Solid State Ionics 22, 3 (1986).\n\n[40] M. Piacentini, V. Grasso, S. Santangelo, M. Fanfoni, S. Modesti, and A. Savoia, Solid State Commun. 51, 467 (1984).\n\n[41] R. Newman and R. Chrenko, Phys. Rev. 114, 1507 (1959).\n\n[42] M. Dressel and G. Gruner, Electrodynamics of Solids: Optical Properties of Electrons in Matter (Cambridge University Press, New Yok, 2002).\n\n[43] J. Zaanen, G. A. Sawatzky, and J. W. Allen, Phys. Rev. Lett. 55, 418 (1985).\n\n[44] A. E. Bocquet, T. Mizokawa, T. Saitoh, H. Namatame, and A. Fujimori, Phys. Rev. B 46, 3771 (1992).\n\n[45] M. A. Korotin, V. I. Anisimov, D. I. Khomskii, and G. A. Sawatzky, Phys. Rev. Lett. 80, 4305 (1998).\n\n[46] G. Sawatzky, R. Green, J. van den Brink, E. Koch, and E. Pavarini, The Explicit Role of Anion States in HighValence Metal Oxides, Modeling and Simulation 6, 420 (2016).\n\n[47] C. Monney, V. Bisogni, K. J. Zhou, R. Kraus, V. N. Strocov, G. Behr, S. L. Drechsler, H. Rosner, S. Johnston, J. Geck, and T. Schmitt, Phys. Rev. B 94, 165118 (2016).\n\n[48] D. Choudhury, P. Rivero, D. Meyers, X. Liu, Y. Cao, S. Middey, M. J. Whitaker, S. Barraza-Lopez, J. W. Freeland, M. Greenblatt, and J. Chakhalian, Phys. Rev. B 92, 201108 (2015).\n\n[49] G. van der Laan, J. Zaanen, G. A. Sawatzky, R. Karnatak, and J.-M. Esteva, Phys. Rev. B 33, 4253 (1986).\n\n[50] K. Takubo, T. Mizokawa, J. Y. Son, Y. Nambu, S. Nakatsuji, and Y. Maeno, Phys. Rev. Lett. 99, 037203 (2007).\n\n[51] S. Nakatsuji, Y. Nambu, H. Tonomura, O. Sakai, S. Jonas, C. Broholm, H. Tsunetsugu, Y. Qiu, and Y. Maeno, Science 309, 1697 (2005).\n\n[52] J. P. Perdew, Int. J. Quantum Chem. 28, 497 (1985).\n\n[53] X. Li, T. Cao, Q. Niu, J. Shi, and J. Feng, Proc. Natl. Acad. Sci. 110, 3738 (2013).\n\n[54] M. Bernasconi, G. L. Marra, G. Benedek, L. Miglio, M. Jouanne, C. Julien, M. Scagliotti, and M. Balkanski, Phys. Rev. B 38, 12089 (1988).\n\n[55] It seems that the lower electronegativity of chalcogen ions in TMTC can also drive the system into NCT regime, as in the cases of some TM oxides [44,47].\n\n[56] A. V Ushakov, S. V Streltsov, and D. I. Khomskii, J. Phys. Condens. Matter 23, 445601 (2011).\n\n[57] K. Takubo, T. Mizokawa, Y. Nambu, and S. Nakatsuji, Phys. Rev. B 79, 134422 (2009).\n\n[58] B. L. Chittari, Y. Park, D. Lee, M. Han, A. H. MacDonald, E. Hwang, and J. Jung, Phys. Rev. B 94, 184428 (2016).\n\n[59] The calculated exchange interaction strength value of bulk $\\mathrm{NiPS}_{3}$ in our work also gave similar results for $J_{1}$, $J_{2}$ and $J_{3}$ as in the monolayer case [58.\n\n\n\\end{document}", "record_id": "2023_09_22_cc792b66f9a5779f9798g"}