{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{Binding Sites of Deprotonated Citric Acid and Ethylenediaminetetraacetic Acid in the Chelation with $\\mathrm{Ba}^{2+}$, $\\mathrm{Y}^{3+}$, and $\\mathrm{Zr}^{4+}$ and Their Electronic Properties: a Density Functional Theory Study }\n\n\n\\author{Nor Ain Fathihah Abdullah and Lee Sin Ang*\\\\\nFaculty of Applied Sciences (Physics), Universiti Teknologi MARA Cawangan Perlis, 02600 Arau, Malaysia\\\\\n* Corresponding author: E-mail: anglee631@perlis.uitm.edu.my\\\\\nTel: +6049882573}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nReceived: 02-10-2017\n\n\\begin{abstract}\nDensity functional calculations were performed on the metal complexes formed during the synthesis of barium zirconate (BZY). This compound has been synthesized previously, but the molecular interactions present during the formation of the ligand-metal complexes are unknown. In this study, calculations were carried out to determine the preferred coordination sites for the metal complexes. The cations $\\mathrm{Ba}^{2+}, \\mathrm{Y}^{3+}$, and $\\mathrm{Zr}^{4+}$ were modeled to interact with two deprotonated chelating agents (citric acid [CA] and ethylenediaminetetraacetic acid [EDTA]) at strategic positions. Density functional theory (DFT) at the B3LYP level of theory with basis set 6-31G* and Universal Gaussian Basis Set (UGBS) was used. The relevant geometries, binding energies, and charge distributions of the complexes are reported. It was found that both CA and EDTA can bind the metal cations investigated in this study. Metal cations prefer to form bonds at the electron-rich sites of the chelating agents. Of the three metal cations considered, $\\mathrm{Zr}^{4+}$ was found to possess the strongest bonds to deprotonated $\\mathrm{CA}$ and EDTA, followed by $\\mathrm{Y}^{3+}$ and then $\\mathrm{Ba}^{2+}$.\n\\end{abstract}\n\nKeywords: Density functional theory, cations, chelating agents, binding energies, charges\n\n\\section{Introduction}\nCurrently, perovskite is one of the most studied compounds in the field of materials science. ${ }^{1-3}$ Ceramic perovskite-type oxides, with a general formula $\\mathrm{ABO}_{3}$ where $\\mathrm{A}$ and $\\mathrm{B}$ are two metal cations of different sizes, have been studied due to their high conductivity and low activation energy. ${ }^{4,5}$ Cerate zirconate attracts much attention among perovskite-type oxides because it is important for the future development of electrochemical devices such as fuel cells, magnetic refrigeration, and solar cells. ${ }^{6-8}$ Perovskite can be synthesized at low cost as it can be made from common metals and industrial chemicals ${ }^{9}$ and is convenient to prepare. $^{7}$\n\nMany researchers have investigated the role of the chelating agents in the formation of perovskite. ${ }^{10-12}$ As the formation of perovskite involves the complexation process, the interaction between the metal and chelating agent is of utmost importance. Liu et al ${ }^{12}$ identified that citric acid (CA) is more effective than ethylenediaminetetraacet- ic acid (EDTA) in forming perovskite at low temperatures $\\left(<1000{ }^{\\circ} \\mathrm{C}\\right)$. When the chelating agents are used together, the combined CA and EDTA increases the chelating strength to the metal ion, as demonstrated in a study by Osman et $\\mathrm{al}^{11}$ in which the CA and EDTA were mixed into a metal nitrate solution to form metal-CA-EDTA complexes with a ratio of 2:1:1. A similar effect was also observed by Tao et al ${ }^{13}$ in the synthesis of $\\mathrm{La}_{0.6} \\mathrm{Sr}_{0.4} \\mathrm{CoO}_{3-\\delta}$. CA has three carboxyl groups that can bind with metal cations whereas EDTA has four carboxyl and two amine groups, demonstrating that the strength of the chelating agents affects the interactions during the chelation process. ${ }^{12,14}$\n\nDespite previous research showing that the use of chelating agents provides a good platform for the production of perovskites, the molecular interactions involved are still unclear. The microscopic behaviors and characteristics of the intermediate structures, as well as the ligandmetal complexes, are unknown. Furthermore, research into the microscopic properties of metal cation complexation with chelating agents is scarce. Several theoretical studies into the favored sites for complexation have been carried out to find the most stable structure in the intermediate state. ${ }^{15-17}$ Primikyri et al ${ }^{15}$ performed DFT studies on the chelation of $\\mathrm{Zn}$ to quercetin and luteolin in their neutral and deprotonated forms. It was found that the preferred cation bonding sites were in between the carbonyl and deprotonated hydroxyl groups of quercetin and luteolin. This is in line with the work reported by Leopoldini et al. ${ }^{16}$ The preference of metal cations to form complexes at these sites is due to the lone pairs of electrons from the $\\mathrm{O}$ atoms at the carbonyl and deprotonated hydroxyl groups.\n\nIn this study, we intended to confirm the important initial step involved in the one-pot synthesis of barium zirconate (BZY). Metal cations $\\mathrm{Y}^{3+}, \\mathrm{Ba}^{2+}$, and $\\mathrm{Zr}^{4+}$ were modeled to combine with two chelating agents, CA and EDTA. DFT was employed to determine the interactions between the chelating agents and the metal cations at the microscopic level. This included possible metal cation attachment sites and the electronic structure of the complexes formed. This study focusses only on the interaction between metal and chelating agent with a ratio of $1: 1$, therefore the effects of coordination sphere saturation in the metal ions has not been discussed.\n\n\\section{Computational Details}\nIn a previous study, $\\mathrm{Ba}\\left(\\mathrm{NO}_{3}\\right)_{2}, \\mathrm{Zr}\\left(\\mathrm{NO}_{3}\\right)_{2} \\mathrm{O} . \\mathrm{xH}_{2} \\mathrm{O}$, and $\\mathrm{Y}\\left(\\mathrm{NO}_{3}\\right) 3.5 \\mathrm{H}_{2} \\mathrm{O}$ were dissolved to produce the metal cations and form the metal-chelating agent complexes. ${ }^{11}$ In order to portray correctly the charge state of the metal cations, they have been modeled as having the indicated positive charges in the calculations. To further facilitate the calculations, the existence of $\\mathrm{Zr}^{4+}$ in the one-pot synthesis is approximated.\n\nThe structures of chelating agents CA and EDTA were obtained from the Chemspider database. ${ }^{18} \\mathrm{CA}$ and EDTA were deprotonated at the carboxylic acid groups $(\\mathrm{COOH})$, making them negatively charged as in the real system these protons would be dissociated. The deprotonated chelating agents were labeled as $\\mathrm{CA}_{3 \\mathrm{H}}$ and $\\mathrm{EDTA}_{4 \\mathrm{H}}$. The metal cations were then attached to the chelating agents at five positions labeled P1 to P5. These positions are shown in Fig. 1.\n\nAll calculations were carried out using the Gaussian 09 suite of programs. ${ }^{19}$ The B3LYP functional with dual basis sets 6-31G $\\mathrm{G}^{*}$ for $\\mathrm{C}, \\mathrm{O}, \\mathrm{N}$, and $\\mathrm{H}$ atoms and Universal Gaussian Basis Set (UGBS) for metal cations was used. The D3 version of Grimme's dispersion correction with Becke-Johnson (BJ) damping was adopted in the metal-complex calculations $^{20,21}$ to improve the dispersion energy in the B3LYP method. All the results were visualized using GaussView ${ }^{22}$ and Chem3D molecular modeling software.\n\nThe binding energy $\\left(E_{\\mathrm{b}}\\right)$ was used to compute the stability of the complexes. The $E_{\\mathrm{b}}$ of the metal complexes was calculated from the expression: ${ }^{23}$\n\n\\[\nE_{\\mathrm{b}}=E_{\\mathrm{M} \\text {-complex }}-E_{\\mathrm{M}}-E_{\\text {chelate }}\n\\]\n\nwhere $E_{\\mathrm{M} \\text {-complex }}$ is the energy of the metal and chelating agent, $E_{\\text {chelate }}^{\\text {represents the energy of the chelating agent, }}$ and $E_{M}$ is the energy of the metal cation.\n\na)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-2_464_1345_1019_1810}\n\\end{center}\n\nFig. 1. Molecular structure of (a) $\\mathrm{CA}_{3 \\mathrm{H}}$ and (b) $\\mathrm{EDTA}_{\\mathrm{H}}$ with metal attachment $\\left(\\mathrm{Ba}^{2+}, \\mathrm{Y}^{3+}, \\mathrm{Zr}^{4+}\\right)$ at different positions ( $\\mathrm{P} 1$ to $\\left.\\mathrm{P} 5\\right)$. Metal cations are green and $\\mathrm{C}, \\mathrm{O}, \\mathrm{N}$, and $\\mathrm{H}$ are colored grey, red, blue, and turquoise, respectively.\n\n\\section{Results and Discussion}\n\\section{1. Binding Energies}\nEDTA and CA are chelating agents that can bind to metal cations to form complexes. EDTA is a type of polyamino carboxylic acid that can bind to a metal via four carboxyl and two amine groups, meaning it has six sites with a lone pair of electrons. CA is a polydentate ligand and can bind to metals via three carboxyl groups with a lone pair of electrons at each. In this study, the binding energies of metal- $\\mathrm{CA}_{3 \\mathrm{H}}$ and metal-EDTA ${ }_{4 \\mathrm{H}}$ complexes were calculated in order to determine their stability.\n\nAt the level of theory B3LYP/6-31G $\\mathrm{G}^{*}$ and UGBS geometry optimization, the following results were obtained: $E\\left(\\mathrm{CA}_{3 \\mathrm{H}}\\right)=-20626.57 \\mathrm{eV}, E\\left(\\mathrm{EDTA}_{4 \\mathrm{H}}\\right)=-29911.50 \\mathrm{eV}$, $E\\left(\\mathrm{Ba}^{2+}\\right)=-214598.65 \\mathrm{eV}, E\\left(\\mathrm{Y}^{3+}\\right)=-90707.64 \\mathrm{eV}$, and $E\\left(\\mathrm{Zr}^{4+}\\right)=-96342.96 \\mathrm{eV}$.\n\nThe binding energies of $\\mathrm{CA}_{3 \\mathrm{H}}$ and $\\mathrm{EDTA}_{4 \\mathrm{H}}$ metal complexes were calculated from equation (1) and are shown in Tables 1 and 2. A higher negative value of $E_{b}$ indicates higher stability of the complex. Table 1 shows the $E_{b}$ of metal-CA ${ }_{3 \\mathrm{H}}$ complexes at five different positions of metal attachment. $\\mathrm{Ba}^{2+}$ attaches strongly at $\\mathrm{P} 2$ and has an $E_{\\mathrm{b}}$ of $-19.39 \\mathrm{eV}$. Interestingly, in $\\mathrm{Y}-\\mathrm{CA}_{3 \\mathrm{H}}$, the $E_{\\mathrm{b}}$ is highest at $\\mathrm{P} 4$ and $\\mathrm{P} 5$ and both sites have the same $E_{\\mathrm{b}}$ of $-21.82 \\mathrm{eV}$. In the $\\mathrm{Zr}-\\mathrm{CA}_{3 \\mathrm{H}}$ complex, the $E_{\\mathrm{b}}$ values at $\\mathrm{P} 4$ and $\\mathrm{P} 5$ are similar at $-24.89 \\mathrm{eV}$. The highest and most stable $E_{\\mathrm{b}}$ was at P3 $(-25.69 \\mathrm{eV})$.\n\nThe calculated $E_{\\mathrm{b}}$ values of metal-EDTA ${ }_{4 \\mathrm{H}}$ complexes are tabulated in Table 2. In Ba-EDTA ${ }_{4 \\mathrm{H}}$ complexes, $\\mathrm{Ba}^{2+}$ prefers to attach at $\\mathrm{P} 2$ as this $E_{\\mathrm{b}}(-26.67 \\mathrm{eV})$ is the highest compared to other sites. Table 2 also shows that the $E_{\\mathrm{b}}$ for P1 differs from P2 by $0.01 \\mathrm{eV}$. Hence, these two sites in EDTA $_{4 \\mathrm{H}}$ are favorable to $\\mathrm{Ba}^{2+}$ for attachment. In the Y-ED$\\mathrm{TA}_{4 \\mathrm{H}}$ and $\\mathrm{Zr}-\\mathrm{EDTA}_{4 \\mathrm{H}}$ complexes, the cations bonded strongly at $\\mathrm{P} 5$ and exhibited a high $E_{\\mathrm{b}}$ values of $-33.12 \\mathrm{eV}$ and $-37.33 \\mathrm{eV}$, respectively.\n\nTable 1. Binding energies $\\left(E_{b}\\right)$ of $\\mathrm{CA}_{3 H}$ complexes. Numbers in bold represent the most stable metal complexes.\n\n\\begin{center}\n\\begin{tabular}{cccc}\n\\hline\nPositions & \\multicolumn{3}{c}{$\\boldsymbol{E}_{\\mathbf{b}}(\\mathbf{e V})$} \\\\\n & Ba-CA $_{3 \\mathbf{H}}$ & $\\mathbf{Y}-\\mathbf{C A}_{\\mathbf{3 H}}$ & $\\mathbf{Z r}-\\mathbf{C A}_{3 \\mathbf{H}}$ \\\\\n\\hline\nP1 & $-18.92$ & $-21.65$ & $-24.23$ \\\\\nP2 & $\\mathbf{- 1 9 . 3 9}$ & $-21.65$ & $-24.23$ \\\\\nP3 & $-19.01$ & $-21.72$ & $-\\mathbf{2 5 . 6 9}$ \\\\\nP4 & $-18.92$ & $-\\mathbf{2 1 . 8 2}$ & $-24.89$ \\\\\nP5 & $-18.92$ & $-\\mathbf{2 1 . 8 2}$ & $-24.89$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nTable 2. Binding energies $\\left(E_{\\mathrm{b}}\\right)$ of $\\mathrm{EDTA}_{4 \\mathrm{H}}$ complexes. Numbers in bold represent the most stable metal complexes.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-3_1507_1831_186_1003}\n\\end{center}\n\nThe results discussed in the preceding paragraph can be explained using electrostatic potential (ESP) maps for the molecules of CA and EDTA as illustrated in Fig. 2. ESP enables visualization of charge distribution in the molecules using color codes. The red regions indicate more negative potential, while the blue regions indicate less negative potential (or positive potential). As displayed in Fig. 2 (a), the most negative potential is distributed around P4 and P5, in between the central carboxyl group and on the carboxyl groups at either end of the CA molecule. These groups are susceptible to electrophilic attack, hence $\\mathrm{Ba}^{2+}$, $\\mathrm{Y}^{3+}$, and $\\mathrm{Zr}^{4+}$ prefer to bind to $\\mathrm{CA}$ at these two positions. EDTA has four carboxyl and two amine groups susceptible to electrophilic attack, therefore these sites have a high possibility of metal complexation (in Fig. 2 (b), these sites are shown in orange). As can be seen in Table 2 , the binding energies are low at $\\mathrm{P} 3$ and $\\mathrm{P} 4$ compared to other positions due to the low negative potential.\n\nAt each preferred site, the Ba complexes have the smallest $E_{\\mathrm{b}}$ values compared to the other metal complexes. The larger size of $\\mathrm{Ba}^{2+}$ makes it less stable and prevents the ligand from chelating completely. ${ }^{24-26} \\mathrm{Zr}^{4+}$ complexes exhibit higher $E_{\\mathrm{b}}$ values than $\\mathrm{Y}^{3+}$ complexes despite being larger in size. The ionic charge for $\\mathrm{Zr}^{4+}$ is larger than for $\\mathrm{Y}^{3+}$ and the stability of the metal complex decreases with decreasing ionic charge. ${ }^{24,27}$ These results are supported by Bohm et $\\mathrm{al}^{28}$ in that the interaction energy increases as the size of the metal decreases, $\\mathrm{K}^{+}>\\mathrm{Na}^{+}>\\mathrm{Li}^{+}$with values of $-5.65 \\mathrm{eV},-8.71 \\mathrm{eV}$, and $-12.05 \\mathrm{eV}$, respectively.\n\n$-0.06923 \\mathrm{kcal} / \\mathrm{mol} \\quad+0.06923 \\mathrm{kcal/mol}$\n\na)\n\nb)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-3_925_1559_1079_1872}\n\\end{center}\n\nFig. 2. The electrostatic potential map of (a) CA and (b) EDTA. Isovalue of electron density $=0.0002 \\mathrm{au}\\left(\\mathrm{e} / \\mathrm{a}_{\\mathrm{o}}{ }^{3}\\right)$. Refer to figure 1 for the structures without the isosurface.\n\nBased on Tables 1 and 2, similar $E_{\\mathrm{b}}$ values are observed at $\\mathrm{P} 1 / \\mathrm{P} 2$ and $\\mathrm{P} 4 / \\mathrm{P} 5$ in $\\mathrm{Y}-\\mathrm{CA}_{3 \\mathrm{H}}$ and $\\mathrm{Zr}-\\mathrm{CA}_{3 \\mathrm{H}}$ complexes. This is due to the symmetrical arrangement of the atoms in CA. However, this is not observed in $\\mathrm{Ba}-\\mathrm{CA}_{3 \\mathrm{H}}$, potentially due to the larger size of $\\mathrm{Ba}^{2+}$. Similarly in the $\\mathrm{Ba}-\\mathrm{EDTA}_{4 \\mathrm{H}}$ complex, it is difficult for $\\mathrm{Ba}^{2+}$ to reside at any other site on EDTA due to its larger size.\n\n\\section{2. Geometry Optimization}\nGeometry optimizations were performed on the metal complexes using $6-31 G^{*}$ and UGBS basis sets and no imaginary frequencies were observed. The stationary point of each structure where the energy was at a minimum was therefore ascertained. ${ }^{29}$ The geometrically optimized structures of the most stable metal- $\\mathrm{CA}_{3 \\mathrm{H}}$ and metal-EDTA ${ }_{4 \\mathrm{H}}$ complexes formed are shown in Fig. 3 to 8 . The bond lengths between metal and $\\mathrm{O}$ are discussed since $\\mathrm{O}$ and $\\mathrm{N}$ donate electrons and play an important role in the metal interaction.\n\nIn general, metal complexation marginally changes the shape of $\\mathrm{CA}_{3 \\mathrm{H}}$. $\\mathrm{Ba}^{2+}$ was found most stable at $\\mathrm{P} 2$ with bond lengths of $\\mathrm{Ba}-\\mathrm{O} 5=2.704 \\AA, \\mathrm{Ba}-\\mathrm{O} 9=2.602 \\AA$, and $\\mathrm{Ba}-\\mathrm{O} 11$ $=2.602 \\AA$ (the optimized structure of $\\mathrm{Ba}-\\mathrm{CA}_{3 \\mathrm{H}}$ is shown in Fig. 3). These results concur with findings from a previous study by Makrlik et al ${ }^{30}$ where the bond length of $\\mathrm{Ba}^{2+}$ to oxygen atoms in the beauvericin ligand are $2.5 \\sim 4.9 \\AA$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-4_670_1113_146_942}\n\\end{center}\n\nFig. 3. Optimized structure of the most stable $\\mathrm{Ba}-\\mathrm{CA}_{3 \\mathrm{H}}$ complex (P2)\n\n$\\mathrm{a}) \\quad \\mathrm{Y}-\\mathrm{O}=2.340 \\AA$\\\\\n$\\mathrm{Y}-\\mathrm{O} 9=2.160 \\AA$\n\nY-O11-2.155 A\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-4_1435_1717_361_982}\n\\end{center}\n\n$\\mathrm{Y}^{3+}$ was found to be the most stable at equivalent sites P4 and P5 (Fig. 4). The cation bonds to three $\\mathrm{O}$ atoms, two from the carboxyl group and one from the hydroxyl group. The bond lengths obtained for Y-O9 at P4 and P5 are $2.160$ $\\AA$. Y-O13 and Y-O11 at P4 and P5, respectively, also had the same bond length at $2.155 \\AA$. The bond length observed for Y-O5 at P4 and P5 differed by $0.001 \\AA$. This small difference in bond length is negligible. These were in accordance with the Y-O bond lengths observed in a previous study. ${ }^{31}$\n\nAs depicted in Fig. 5, $\\mathrm{Zr}^{4+}$ favored $\\mathrm{P} 3$ in the $\\mathrm{Zr}-\\mathrm{CA}_{3 \\mathrm{H}}$ complex. $\\mathrm{Zr}^{4+}$ is bonded to three $\\mathrm{O}$ atoms (O8, $\\mathrm{O}$ 9, and O11) on the carboxyl groups of $\\mathrm{CA}_{3 \\mathrm{H}}$. The bond lengths for $\\mathrm{Zr}-\\mathrm{O}$,, $\\mathrm{Zr}-\\mathrm{O}$ 9, and $\\mathrm{Zr}-\\mathrm{O} 11$ are $2.035 \\AA, 2.021 \\AA$, and\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_1b00ed3a142a7a1b2582g-4_785_828_1012_1822}\\\\\nby Vlaic et $\\mathrm{al}^{32}$ where bond lengths of $\\mathrm{Zr}-\\mathrm{O}$ in $\\mathrm{Rh} /$ $\\mathrm{Ce}_{0.5} \\mathrm{Zr}_{0.5} \\mathrm{O}_{2}$ were 1.11 2.34 . The most stable sites in $\\mathrm{Ba}^{-}$ $\\mathrm{CA}_{3 \\mathrm{H}}, \\mathrm{Y}-\\mathrm{CA}_{3 \\mathrm{H}}$, and $\\mathrm{Zr}-\\mathrm{CA}_{3 \\mathrm{H}}$ were observed between carboxyl and hydroxyl groups and this is in accordance with results reported by Primikyri et al ${ }^{15}$ and Leopoldini et al. ${ }^{16}$\n\nFigs 6 to 8 show the optimized structure of the most stable metal-EDTA ${ }_{4 \\mathrm{H}}$ complexes. There were significant changes to the shape of $\\mathrm{EDTA}_{4 \\mathrm{H}}$ after metal complexation. EDTA is able to form bonds with any metal and its chela-\n\nb)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-4_1370_1713_1018_1673}\n\\end{center}\n\nFig. 4. Optimized structure of the most stable $\\mathrm{Y}-\\mathrm{CA}_{3 \\mathrm{H}}$ complex at (a) P4 (b) P5\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-4_1905_2425_649_1442}\n\\end{center}\n\nFig. 5. Optimized structure of the most stable $\\mathrm{Zr}-\\mathrm{CA}_{3 \\mathrm{H}}$ complex (P3) tion depends on the size and ionic charge of the metal cation. ${ }^{33}$ The most stable geometrical structure of metal-ED$\\mathrm{TA}_{4 \\mathrm{H}}$ shows carboxyl $\\mathrm{O}$ atoms and $\\mathrm{N}$ atoms moving closer to the metal cation, almost encasing it. Both $\\mathrm{O}$ and $\\mathrm{N}$ atoms are able to create bonds with the metal cations as they consist of a lone pair electron.\n\nIn the optimized structure of the Ba-EDTA ${ }_{4 \\mathrm{H}}$ complex shown in Fig 6, $\\mathrm{Ba}^{2+}$ is found to be the most stable at $\\mathrm{P} 2 . \\mathrm{Ba}^{2+}$ bonds to the four nearest $\\mathrm{O}$ atoms from the carboxyl groups with bond lengths of $\\mathrm{Ba}-\\mathrm{O} 1, \\mathrm{Ba}-\\mathrm{O} 3, \\mathrm{Ba}-\\mathrm{O}$, and Ba-O7 are $2.764 \\AA, 2.750 \\AA, 2.710 \\AA$ and $2.725 \\AA$, respectively. Furthermore, the geometrical structure of $\\mathrm{Ba}-$ $\\mathrm{EDTA}_{4 \\mathrm{H}}$ was similar to the original structure before the addition of $\\mathrm{Ba}^{2+}$. Several experimental studies encountered problems with $\\mathrm{BaCO}_{3}$ impurities after synthesizing a single layer of perovskites, due to the use of EDTA as the chelating agent. ${ }^{11,34}$ In other reports, triethylenetetraamine (TETA) has been shown to help solve the problem of $\\mathrm{BaCO}_{3}$ impurities at a lower temperature. ${ }^{10,35}$ This may be due to the ability of chelating agents to bind with $\\mathrm{Ba}^{2+}$. It can be concluded that $\\mathrm{Ba}^{2+}$ is effectively complexed by the amine group.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-5_1141_1836_203_996}\n\\end{center}\n\nFig. 6. Optimized structure of the most stable Ba-EDTA ${ }_{4 \\mathrm{H}}$ complex (P2)\n\nFrom Fig. 7 shows that $Y^{3+}$ is embraced by EDTA $_{4 H} \\cdot$ A similar geometry was found by Thomas et $\\mathrm{al}^{36}$ in an investigation into the molecular structure of aqueous $\\mathrm{Hg}$ (II)EDTA. Unlike the Ba-EDTA 4 complex, the four carboxyl $\\mathrm{O}$ atoms and two $\\mathrm{N}$ atoms in $\\mathrm{EDTA}_{4 \\mathrm{H}}$ bind strongly to $\\mathrm{Y}^{3+}$ due to its smaller size, making it easy to be caught by the EDTA ligand. The bond lengths for $\\mathrm{Y}^{-\\mathrm{EDTA}_{4 \\mathrm{H}}}$ are as follows: $\\mathrm{Y}-\\mathrm{O} 5=2.273 \\AA, \\mathrm{Y}-\\mathrm{O} 6=2.297 \\AA, \\mathrm{Y}-\\mathrm{O} 7=2.273 \\AA$, $\\mathrm{Y}-\\mathrm{O} 8=2.297 \\AA, \\mathrm{Y}-\\mathrm{N} 9=2.528 \\AA$, and Y-N10 $=2.527 \\AA$. These bond lengths are consistent with $\\mathrm{Y}-\\mathrm{O}$ and $\\mathrm{Y}-\\mathrm{N}$ bond lengths observed previously in the formation of guanidinate yttrium complexes. ${ }^{31}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-5_210_1000_1120_1804}\n\\end{center}\n\nFig. 7. Optimized structure of the most stable $Y-E^{2 D T A}{ }_{4 H}$ complex (P5)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-5_1125_2011_1100_1867}\n\\end{center}\n\nFig. 8. Optimized structure of the most stable $\\mathrm{Zr} \\mathrm{EDTA}_{4 \\mathrm{H}}$ complex (P5)\n\n$\\mathrm{Zr}^{4+}$ was similarly encased by $\\mathrm{EDTA}_{4 \\mathrm{H}}$ at $\\mathrm{P} 5$ in the $\\mathrm{Zr}-\\mathrm{EDTA}_{4 \\mathrm{H}}$ complex (Fig. 8). $\\mathrm{Zr}^{4+}$ was bonded to four carboxyl groups and two amine groups from EDTA $_{4 \\mathrm{H}}$. $\\mathrm{EDTA}_{4 \\mathrm{H}}$ is able to strongly wrap around metal cations due to lone pairs of electrons from two types of ligand (carbox$\\mathrm{yl}$ and amine groups). The interaction between $\\mathrm{Zr}^{4+}$ and $\\mathrm{EDTA}_{4 \\mathrm{H}}$ is the strongest with bond lengths of $\\mathrm{Zr}-\\mathrm{O} 5=$ $2.119 \\AA, \\mathrm{Zr}-\\mathrm{O} 6=2.143 \\AA, \\mathrm{Zr}-\\mathrm{O} 7=2.118 \\AA, \\mathrm{Zr}-\\mathrm{O} 8=$ $2.143 \\AA, \\mathrm{Zr}-\\mathrm{N} 9=2.415 \\AA$ Å and $\\mathrm{Zr}-\\mathrm{N} 10=2.415 \\AA$ A. The bond lengths measured were in agreement with findings by Suzuki et al, ${ }^{37}$ where the bond length of $\\mathrm{Zr}-\\mathrm{O}$ in $[\\mathrm{Zr}$ $\\left(\\mathrm{CO}_{3}\\right) \\mathrm{EDTA}^{2+}$ was determined. Similarly, the bond length is in accordance with findings by Pozhidaev et al $^{38}$ where the bond length of $\\mathrm{Zr}-\\mathrm{O}$ in the crystal structure of $\\mathrm{Zr}-\\mathrm{eth}$ ylenediaminetetracetate tetrahydrate was measured to within a range of $2.1 \\sim 2.3 \\AA$, and $\\mathrm{Zr}-\\mathrm{N}$ was $2.43 \\AA$.\n\n\\section{3. Mulliken Charges}\nThe Mulliken charges of the most stable metal- $\\mathrm{CA}_{3 \\mathrm{H}}$ and metal-EDTA ${ }_{4 \\mathrm{H}}$ complexes are shown in Tables 3 and 4. The initial ionic charges of $\\mathrm{Ba}^{2+}, \\mathrm{Y}^{3+}$, and $\\mathrm{Zr}^{4+}$ decrease after complexation with $\\mathrm{CA}_{3 \\mathrm{H}}$ and $\\mathrm{EDTA}_{4 \\mathrm{H}}$. The decreasing in charge can be attributed to the transfer of electrons from CA and EDTA to the metal. ${ }^{39,40}$ The charge transfer in metal complexes is of utmost important as it influences the interaction between metal and chelating agent. It can be inferred that the greater the charge reduction in the metal the stronger the interaction in the metal complex. ${ }^{41}$\n\nTable 3. Charge of metals after complexation with the chelating agent.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-6_423_750_1011_1828}\n\\end{center}\n\nThe $\\mathrm{C}$ atoms, $\\mathrm{C} 2$ and $\\mathrm{C} 3$ in $\\mathrm{CA}_{3 \\mathrm{H}}$ and $\\mathrm{C} 11$ to $\\mathrm{C} 16$ in $\\mathrm{EDTA}_{4 \\mathrm{H}}$ (Table 4), carry negative charges as they are bonded to $\\mathrm{C}$ and $\\mathrm{N}$ atoms, respectively. Both atoms attract the bonding pair of electrons to exactly the same extent. That\n\nTable 4. Mulliken charges of the most stable metal-CA ${ }_{3 \\mathrm{H}}$ complexes\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-6_1056_1650_460_1492}\n\\end{center}\n\nTable 5. Mulliken charges of the most stable metal-EDTA ${ }_{4 H}$ complexes\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_1b00ed3a142a7a1b2582g-6_1756_2521_184_1768}\n\\end{center}\n\nmeans, on average, the electron pair is found halfway between the two atoms and possesses similar negative charges. These results are consistent with results from Arivazhagan et $\\mathrm{al}^{42}$ that show higher electronegativity attracts more electrons and vice versa.\n\nC1, C4, C6, and C7 in $\\mathrm{CA}_{3 \\mathrm{H}}$ and $\\mathrm{C} 17$ to $\\mathrm{C} 20$ in ED$\\mathrm{TA}_{4 \\mathrm{H}}$ (shown in Tables 4 and 5) carry positive charges as they are bonded to O. O atoms have a higher electronegativity than $\\mathrm{C}$ atoms, meaning an $\\mathrm{O}$ bond more strongly attracts the bonding pair of electrons compared to a $C$ atom. Consequently, the electron pair is pulled towards the $\\mathrm{O}$ atom, making the carbon atom positively charged. The same is observed in $\\mathrm{H}$ atoms. All $\\mathrm{H}$ atoms have a positive charge. H18 in $\\mathrm{CA}_{3 \\mathrm{H}}$ has a higher positive charge than other $\\mathrm{H}$ atoms as it is bonded to an $\\mathrm{O}$ atom. This is confirmed in a recent study by Gangadhara and Krishnan. ${ }^{43}$\n\n\\section{Conclusion}\nThe density functional B3LYP method was used to investigate interactions between chelating agents and metal cations in forming a specific barium zirconate (BZY) compound. The aim of the study was to determine the preferred coordinaton sites for $\\mathrm{Ba}^{2+}, \\mathrm{Y}^{3+}$, and $\\mathrm{Zr}^{4+}$ in $\\mathrm{CA}_{3 \\mathrm{H}}$ and EDTA $_{4 \\mathrm{H}}$. The results show that $\\mathrm{CA}_{3 \\mathrm{H}}$ and $\\mathrm{EDTA}_{4 \\mathrm{H}}$ can bind to the metal cations considered. The metal cations were observed to bind to the electron-rich sites of the chelating agents. Not all sites had the same binding energy, however. Moreover, different cations showed different bonding strengths. Based on the results, $\\mathrm{Zr}^{4+}$ complexation was found to be the most stable compared to the other complexes. $\\mathrm{Ba}^{2+}$ did not fully chelate to $\\mathrm{EDTA}_{4 \\mathrm{H}}$, rendering $\\mathrm{Ba}-$ $\\mathrm{EDTA}_{4 \\mathrm{H}}$ the least stable complex. The greater binding energies of EDTA, alongside its ability to bind metals through four carboxyl and two amine groups, confirm its stronger chelating power with respect to CA.\n\n\\section{References}\n\\begin{enumerate}\n  \\item J. Li, J.-L. Luo, K. T. Chuang, A. R. Sanger, Electrochim. Acta. 2008, 53, 37013707. DOI:10.1016/j.electacta.2007.12.020\n\n  \\item D. Medvedev, A. Murashkina, E. Pikalova, A. Demin, A. Podias, P. Tsiakaras, Prog. Mater. Sci. 2013, 60, 72-129.\n\n\\end{enumerate}\n\nDOI:10.1016/j.pmatsci.2013.08.001\n\n\\begin{enumerate}\n  \\setcounter{enumi}{2}\n  \\item N. A. Ibarahim, M. A. M. Ishak, A. Ramli, N. Osman, Int. J. Ind. Chem. 2014, 5, 1-6. DOI:10.1007/s40090-014-0018-4\n\n  \\item W. G. Coors, In: C. Sikalidis (Ed.) Advances in Ceramics Synthesis and Characterization, Processing and Specific Applications, CoorsTek, Inc., USA, 2011, pp 479-498.\n\n  \\item J. Tong, D. Clark, L. Bernau, A. Subramaniyan, R. O'Hayre, Solid State Ionics. 2010, 181, 1486-1498.\n\n\\end{enumerate}\n\nDOI:10.1016/j.ssi.2010.08.022\n\n\\begin{enumerate}\n  \\setcounter{enumi}{5}\n  \\item A. B. Stambouli, E. Traversa, Renew. Sustain. Energy Rev. 2002, 6, 433-455. DOI:10.1016/S1364-0321(02)00014-X 7. Z. Wei, A. Chak-Tong, D. You-Wei, Chin. Phys. B. 2013, 22, 1-11. \\href{https://iopscience.iop.org/article/10.1088/16741056/22/5/057501/meta}{https://iopscience.iop.org/article/10.1088/16741056/22/5/057501/meta}\n\n  \\item N. G. Park, Mater. Today. 2015, 18, 65-72. DOI:10.1016/j.mattod.2014.07.007\n\n  \\item U. Wang, 2014, \\href{https://www.wsj.com/articles/perovskite-offers-shot-at-cheaper-solar-energy-1411937799}{https://www.wsj.com/articles/perovskite-offers-shot-at-cheaper-solar-energy-1411937799} (accessed: February, 2014)\n\n  \\item N. A. Abdullah, N. Osman, S. Hasan, O. H. Hassan, Int. J. Electrochem. Sci. 2012, 7, 9401-9409.\n\n\\end{enumerate}\n\nDOI:10.4028/www.scientific.net/AMR.896.112\n\n\\begin{enumerate}\n  \\setcounter{enumi}{10}\n  \\item N. A. Abdullah, S. Hasan, N. Osman, J. Chem. 2013, 2013, 1-7. DOI:10.1155/2013/908340\n\n  \\item S. Liu, X. Tan, K. Li, R. Hughes, Ceram. Int. 2002, 28, 327-335. DOI:10.1016/S0272-8842(01)00098-0\n\n  \\item Y. Tao, J. Shao, J. Wang, W. G. Wang, J. Power Sources. 2008, 185, 609-614. DOI:10.1016/j.jpowsour.2008.09.021\n\n  \\item M. Motta, C. V. Deimling, M. J. Saeki, P. N. Lisboa-Filho, J. Sol-Gel Sci. Technol. 2008, 46, 201-207.\n\n\\end{enumerate}\n\nDOI:10.1007/s10971-007-1673-0\n\n\\begin{enumerate}\n  \\setcounter{enumi}{14}\n  \\item A. Primikyri, G. Mazzone, C. Lekka, A. G. Tzakos, N. Russo, I. P. Gerothanassis, J. Phys. Chem. 2014, 119, 83-95.\n\\end{enumerate}\n\nDOI:10.1021/jp509752s\n\n\\begin{enumerate}\n  \\setcounter{enumi}{15}\n  \\item M. Leopoldini, N. Russo, S. Chiodo, M. Toscano, J. Agr. Food. Chem. 2006, 54, 6343-6351. DOI:10.1021/jf060986h\n\n  \\item A. Galano, G. Mazzone, R. Alvarez-Diduk, T. Marino, J. R. Alvarez-Idaboy, N. Russo, Annu. Rev. Food Sci. Technol. 2016, 7,335-352. DOI:10.1146/annurev-food-041715-033206\n\n  \\item Chemspider Search and Share Chemistry, 2014, \\href{https://www}{https://www}. \\href{http://chemspider.com/}{chemspider.com/} (accessed: March, 2014)\n\n  \\item M. J. Frisch, G. W. Trucks, H. B. Schlegel, G. E. Scuseria, M. A. Robb, J. R. Cheeseman, G. Scalmani, V. Barone, B. Mennucci, G. A. Petersson, H. Nakatsuji, M. Caricato, X. Li, H. P. Hratchian, A. F. Izmaylov, J. Bloino, G. Zheng, J. L. Sonnenberg, M. Hada, M. Ehara, K. Toyota, R. Fukuda, J. Hasegawa, M. Ishida, T. Nakajima, Y. Honda, O. Kitao, H. Nakai, T. Vreven, J. A. Montgomery, Jr., J. E. Peralta, F. Ogliaro, M. Bearpark, J. J. Heyd, E. Brothers, K. N. Kudin, V. N. Staroverov, R. Kobayashi, J. Normand, K. Raghavachari, A. Rendell, J. C. Burant, S. S. Iyengar, J. Tomasi, M. Cossi, N. Rega, M. J. Millam, M. Klene, J. E. Knox, J. B. Cross, V. Bakken, C. Adamo, J. Jaramillo, R. Gomperts, R. E. Stratmann, O. Yazyev, A. J. Austin, R. Cammi, C. Pomelli, J. W. Ochterski, R. L. Martin, K. Morokuma, V. G. Zakrzewski, G. A. Voth, P. Salvador, J. J. Dannenberg, S. Dapprich, A. D. Daniels, Ö. Farkas, J. B. Foresman, J. V. Ortiz, J. Cioslowski, D. J. Fox, Gaussian, Inc., Wallingford CT USA, 2009.\n\n  \\item S. Grimme, J. Antony, S. Ehrlich, H. Krieg, J. Chem. Phys. 2010, 132, 1456-1465. DOI:10.1063/1.3382344\n\n  \\item S. Grimme, S. Ehrlich, L. Goerigk, J. Comput. Chem. 2011, 32, 1456-1465. DOI:10.1002/jcc.21759\n\n  \\item R. D. Dennington II, T. A. Keith, J. Millam, Semichem, Inc., USA, 2007.\n\n  \\item T. Sakajiri, H. Yajima, T. Yamamura, ISRN Biophys. 2012, 2012, 1-5. DOI:10.5402/2012/124803\n\n  \\item C. E. Housecroft, A. G. Sharpe, Inorganic Chemistry, Ashford Colour Press Ltd., Gosport, London, UK, 2005.\n\n  \\item M. Satterfield, J. S. Brodbelt, lnorg. Chem. 2001, 40, 53935400. DOI:10.1021/ic010356r\n\n  \\item N. F. Dalleska, K. Honma, L. S. Sunderlin, P. B. Armentrout, J. Am. Chem. Soc. 1994, 116, 3519-3528.\n\n\\end{enumerate}\n\nDOI:10.1021/ja00087a044\n\n\\begin{enumerate}\n  \\setcounter{enumi}{26}\n  \\item T. Dudev, C. Lim, J. Am. Chem. Soc. 2013, 114, 538-556. DOI:10.1021/cr4004665\n\n  \\item S. Bohm, E. Makrlik, P. Vanura, Monatsh. Chem. 2015, 146, 1229-1231. DOI:10.1007/s00706-014-1393-4\n\n  \\item B. G. Johnson, C. A. Gonzales, P. M. W. Gill, J. A. Pople, Chem. Phys. Lett. 1994, 221, 100-108.\n\n\\end{enumerate}\n\nDOI:10.1016/0009-2614(94)87024-1\n\n\\begin{enumerate}\n  \\setcounter{enumi}{29}\n  \\item E. Makrlik, P. Toman, P. Vanura, J. Radioanal. Nucl. Chem. 2013, 295, 1887-1891. DOI:10.1007/s10967-012-2107-1\n\n  \\item M. P. Coles, P. B. Hitchcock, Inorg. Chim. Acta. 2004, 357, 4330-4334. DOI:10.1016/j.ica.2004.06.015\n\n  \\item G. Vlaic, P. Fornasiero, S. Geremia, J. Kaspar, M. Graziani, J. Catal. 1997, 168, 386-392.\n\n  \\item A. Kovacs, D. S. Nemcsok, T. Kocsis, J. Mol. Struct. 2010, 950, 93-97. DOI:10.1016/j.theochem.2010.03.036\n\n  \\item N. Osman, N. A. Abdullah, S. Hasan, in: K. Junichi (Ed.), Thermal Decomposition and Phase Formation of Cerate-Zirconate Ceramics Prepared with Different Chelating Agents: Solid State Ionics: Ionics for Sustainable World - Proceedings of the $13^{\\text {th }}$ Asian Conference, 2013, pp. 317-323.\n\n  \\item N. Osman, N. A. Abdullah, S. Hasan, Adv. Mater. Res. (Durnten-Zurich, Switz.) 2014, 896, 112-115.\n\n\\end{enumerate}\n\nDOI:10.4028/www.scientific.net/AMR.896.112\n\n\\begin{enumerate}\n  \\setcounter{enumi}{35}\n  \\item S. A. Thomas, J. F. Gaillard, J. Phys. Chem. 2015, 119, 28782884. DOI:10.1021/acs.jpca.5b00343\n\n  \\item T. M. Suzuki, D. A. P. Tanaka, M. A. L. Tanco, M. Kanesato, T. Yokoyama, J. Environ. Monit. 2000, 2, 550-555.\n\n\\end{enumerate}\n\nDOI:10.1039/B006738P\n\n\\begin{enumerate}\n  \\setcounter{enumi}{37}\n  \\item A. I. Pozhidaev, M. A. Porai-Koshits, T. N. Polynova, J. Struct. Chem. 1974, 15, 548-553. DOI:10.1007/BF00747194\n\n  \\item F. Y. Adeowo, B. Honarparvar, A. A. Skelton, RSC Adv. 2016, 6, 79485-79496. DOI:10.1039/C6RA20203A\n\n  \\item A. A. Skelton, N. Agrawal, J. R. Fried, RSC Adv. 2015, 5 , 55033-55047. DOI:10.1039/C4RA14000A\n\n  \\item F. Y. Adeowo, B. Honarparvar, A. A. Skelton, J. Phys. Chem. A. 2017, 121, 6054-6062. DOI:10.1021/acs.jpca.7b01017\n\n  \\item M. Arivazhagan, S. Manivel, S. Jeyavijayan, R. Meenakshi, Spectrochim. Acta. A. Mol. Biomol. Spectrosc. 2015, 134, 493501. DOI:10.1016/j.saa.2014.06.108\n\n  \\item R. P. Gangadharan, S. Krishnan, Acta Phys. Pol. A. 2014, 125, 18-22. DOI:10.12693/APhysPolA.125.18\n\n\\end{enumerate}\n\n\\section{Povzetek}\nZ izračuni gostotnega funkcionala smo proučevali kovinske komplekse, ki nastanejo med sintezo barijevega cirkonata (BZY). Molekularne interakcije med tvorbo kompleksov ligand-kovin tekom te sinteze namreč niso znane. V tej študiji so bili izvedeni izračuni za določitev prednostnih koordinacijskih mest za kovinske komplekse. Katione $^{2} \\mathrm{Ba}^{2+}, \\mathrm{Y}^{3+}$ in $\\mathrm{Zr}^{4+}$ smo modelirali tako, da bi na strateških položajih interagirali z dvema deprotoniranima kelatnima reagentoma (citronska kislina [CA] in etilendiaminetetraocetna kislina [EDTA]). Uporabili smo teorijo gostotnega funkcionalna (DFT) na B3LYP nivoju z osnovnim 6-31G* in univerzalnim Gaussovim (UGBS) baznim setom. Iz dobljenih geometrijskih podatkov, veznih energij in porazdelitev naboja smo ugotovili, da lahko CA in EDTA vežeta proučevane kovinske katione, ki pa težijo k tvorbi vezi na mestih z večjo elektronsko gostoto. Od treh kovinskih kationov je bilo ugotovljeno, da najmočnejše vezi z deprotoniranim CA in EDTA tvori $\\mathrm{Zr}^{4+}$, sledi $\\mathrm{Y}^{3+}$ in nato $\\mathrm{Ba}^{2+}$.\n\n\n\\end{document}", "record_id": "2023_09_22_1b00ed3a142a7a1b2582g"}