{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{HHS Public Access }\n\n\n\\author{Huo-Lei Peng ${ }^{*}$ and Robert Callender\\\\\nDepartment of Biochemistry, Albert Einstein College of Medicine, New York, New York 10461,\\\\\nUnited States}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nAuthor manuscript\n\nJ Phys Chem B. Author manuscript; available in PMC 2019 June 28.\n\nPublished in final edited form as:\n\nJ Phys Chem B. 2018 June 28; 122(25): 6483–6490. doi:10.1021/acs.jpcb.8b02433.\n\n\\section{Mechanism for Fluorescence Quenching of Tryptophan by Oxamate and Pyruvate: Conjugation and Solvation-Induced Photoinduced Electron Transfer}\n\n\n\\begin{abstract}\nOxamate and pyruvate are isoelectronic molecules. They both quench tryptophan fluorescence with Stern-Volmer constants of 16 and $20 \\mathrm{M}^{-1}$, respectively, which are comparable to that of arcrylamide, a commonly used probe for protein structure. On the other hand, it is well known that neither the carboxylate group of these molecules nor the amide group is a good quencher. To find the mechanism of the quenching by oxamate and pyruvate, density functional theory computations with a polarizable continuum model, solvation based on density, and explicit waters, were performed. Results indicate that both molecules can be an electron acceptor via photoinduced electron transfer. There are two requirements. First, the carboxylate and amide moieties must be in direct contact to bring about noticeable quenching. The conjugation between the amide (or the keto) group and the carboxylate group leads to a lower $\\pi^{*}$ orbital, which is the lowest unoccupied molecular orbital (LUMO), and can then accept an electron from the excited tryptophan. Second, since oxamate and pyruvate ions have high electron density, hydrogen bonds with waters, which can be simulated by an explicit water model, are essential. Their LUMO energies are strongly influenced by water in aqueous solution. The above findings demonstrate how tryptophan fluorescence gets quenched in aqueous solution. The findings may be important in dealing with those problems where frontier orbitals are considered, especially with molecules having high electron density.\n\\end{abstract}\n\n\\section{Graphical Abstract}\n*Corresponding Author: \\href{mailto:peng.huolei@live.com}{peng.huolei@live.com}. ORCID\n\nHuo-Lei Peng: 0000-0002-3454-233X\n\nNotes\n\nThe authors declare no competing financial interest.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-02_210_798_687_1438}\n\\end{center}\n\n\\section{INTRODUCTION}\nSince tryptophan naturally exists in most proteins, its fluorescence is widely employed in protein structural and dynamic studies. ${ }^{1,2}$ Its fluorescence properties have been extensively investigated and are well known. For example, the position of fluorescence maximum is a suitable marker to determine hydrophobicity of tryptophan environment. The quenching by small molecules, such as acrylamide ${ }^{3-6}$ and iodide ion, ${ }^{7,8}$ has been used in assessing the accessibility and proximity between tryptophan and quenchers in protein. The quantum yield of tryptophan in proteins varies depending on where they are. Theoretical approaches have been used to estimate the quantum yield with some success. ${ }^{9-11}$ But broadly speaking, satisfactory results are hard to obtain. One reason is due to the complexity of protein structure. It is normally accepted that tryptophan fluorescence is largely quenched in proteins by main chain amides and side chains of some amino acids through a photoelectron transfer mechanism where tryptophan is the electron donor. ${ }^{10-14}$ A study has shown that at least two close amides, but not a single amide, like acetamide, will quench the tryptophan fluorescence. ${ }^{14}$ However, an amide with an electron-withdrawing group, as the case of trifluoroacetamide, is a good quencher. ${ }^{15}$ In contrast to this conclusion, we report here that oxamate, a molecule with an amide group and a carboxylate group (nonelectronwithdrawing group) (refer to Figure 1), quenches tryptophan fluorescence with a comparable efficiency to acrylamide. In a previous study, we have shown that oxamate could be an electron acceptor in the quenching of $\\mathrm{NADH}$ fluorescence when bound to ternary lactate dehydrogenase (LDH) complexes. ${ }^{16}$ This prompts us to consider that the quenching of tryptophan fluorescence by oxamate is also a result of photoinduced electron transfer (PET).\n\nPyruvate, an isoelectronic molecule to oxamate, was previously reported to quench tryptophan fluorescence through an energy-transfer mechanism. The conclusion was based on the idea that pyruvate's $n-\\pi^{*}$ absorption band with a maximum at $325 \\mathrm{~nm}$ would quench the fluorescence of tryptophan and 2-aminopyrimidine due to spectral overlap, whereas pyruvate does not quench fluorescence of fluorescein and rhodamine $6 \\mathrm{G}$ as there is no spectral overlap. ${ }^{17}$ However, fluorescein and rhodamine $6 \\mathrm{G}$ are electron acceptors. ${ }^{18-20}$ Hence, we consider if pyruvate can serve as an electron acceptor in fluorescence quenching, which would be compatible with no quenching by fluorescein or rhodamine 6G. This would additionally be compatible with tryptophan and 2-aminopyrimidine being electron donors in fluorescence quenching. ${ }^{21}$ Pyruvate has some very similar properties to oxamate. For example, their conjugate acids, pyruvic acid and oxamic acid, have close $\\mathrm{p} K_{\\mathrm{a}}$ values: $2.93$ (or $2.45^{22}$ ) and 2.49, respectively, according to DrugBank. ${ }^{23}$ This means that acetyl and amide groups in each molecule have similar electron-withdrawing potentials. We examine the possibility that fluorescence quenching of tryptophan by pyruvate may proceed through an electron-transfer mechanism in this report.\n\nIn a general view, the frontier orbitals, namely lowest unoccupied molecular orbital (LUMO) and the highest occupied molecular orbital (HOMO) of quencher and fluorophore, are described in Figure 2. Normally, the quencher could be the electron acceptor in PET when its LUMO is lower than the fluorophore's LUMO or be the electron donor when its HOMO is higher than that of the fluorophore. Furthermore, as has been shown previously, the correlation between the energies of frontier orbitals of quenchers and Stern-Volmer constants can be established when PET is responsible for the fluorescence quenching. ${ }^{16} \\mathrm{By}$ comparing the frontier orbital energies of quenchers, one then could tell whether a molecule can be a PET donor or acceptor in fluorescence quenching qualitatively or even quantitatively. We apply this concept to the study of the quenching of tryptophan fluorescence by oxamate and pyruvate. The frontier orbital energies are obtained from density functional theory computations.\n\n\\section{MATERIALS AND METHODS}\nChemicals used in this study, including sodium oxamate, sodium pyruvate, L-tryptophan, and $N$-acetyl-tryptophanamide (NATA), were purchased from Sigma-Aldrich.\n\nTrifluroacetate and trifluroacetamide were purchased from Alfa Aesar. Other chemicals are from Thermo Fisher Scientific (Acros). Those chemicals, generally having 97, 98\\%, or greater purity, were used as purchased except oxamate was recrystallized in $3: 1(\\mathrm{v} / \\mathrm{v})$ water/ ethanol to avoid any interference from impurities. No difference was observed in the fluorescence quenching for oxamate from different resources.\n\nFluorescence spectra were measured on a FluoroMax-2 spectrometer. The solutions were freshly made right before measurements in $100 \\mathrm{mM}$ phosphate buffer at $\\mathrm{pH} 7$ or final $\\mathrm{pHs}$ were adjusted by adding $\\mathrm{HCl}$ or $\\mathrm{NaOH}$. Excitation wavelength was set at $295 \\mathrm{~nm}$. The absorbance, measured on a Beckman DU-7400 spectrometer, at the excitation wavelength was about $0.1$ OD or below. Inner filter correction and subtraction of buffer background were performed to obtain final fluorescence intensities for Stern-Volmer plots.\n\nAll of the molecules were optimized at B3LYP/6-311+ +G(d,p) level with GAMESS package (version Aug 18, 2016(R1) or newer). ${ }^{24,25}$ Water effect was modeled with polarizable continuum model (PCM), solvation model based on density (SMD), ${ }^{26}$ and explicit water with PCM, where water molecules before optimizations were placed at the possible positions where a water is allowed to form multiple hydrogen bonds with the solute or other water and the angle of $\\mathrm{OH}-\\mathrm{O}$ is about $180^{\\circ}$ and $\\mathrm{O}-\\mathrm{O}$ distance is about $2.8 \\AA$.\n\n\\section{RESULTS AND DISCUSSION}\n\\section{Fluorescence Quenching in Aqueous Solution}\nIn phosphate buffer $(\\mathrm{pH}=7)$, a Stern-Volmer plot (Figure 3) shows oxamate, which can readily quench tryptophan fluorescence with Stern-Volmer constant of $16 \\mathrm{M}^{-1}$, which is comparable to that of acrylamide (Table 1). Here, the well-known quencher, acrylamide, quenches tryptophan fluorescence through a photoinduced electron transfer (PET) mechanism, where acrylamide is the electron acceptor. ${ }^{27,28}$ Since oxamate is a negative charged molecule and a hydrogen bond acceptor, electrostatic and hydrogen bonding interactions with tryptophan may be possible. To exclude the possibility that the interactions between the functional groups (carboxylate, ammonium ion, and indole $-\\mathrm{NH}$ ) and oxamate result in high efficient fluorescence quenching, tryptophan derivatives, $N$-acetyltryptophanamide (NATA), and 1-methyl-tryptophan were also studied. The changes from two charged groups, the carboxylate group and the ammonium group in tryptophan to amide groups in NATA, have a small effect. Their $K_{\\text {sv }}$ 's are basically the same. One can then rule out any role the groups may have. The $K_{\\mathrm{sv}}$ for 1-methyl-tryptophan fluorescence quenching was $16.5 \\mathrm{M}^{-1}$. No change of $K_{\\mathrm{sv}}$ suggests that the $-\\mathrm{NH}$ group does not interfere with the quenching, especially via hydrogen bonding or hydrogen abstraction. The above-mentioned results can safely rule out the possibility of the formation of static complexes.\n\nOn the other hand, malonamate and succinamate, although having both the amide group and the carboxylate group as oxamate does, do not show noticeable quenching of tryptophan fluorescence. An obvious structural difference among them is the two groups in malonamate and succinamate are separated by one and two methylene groups, respectively.\n\nAcetamide is not a quencher for tryptophan fluorescence. But with a strong electronwithdrawing group, trifluoromethyl, trifluoroacetamide quenches but with a smaller $K_{\\mathrm{sv}}$ (of $6 \\mathrm{M}^{-1}$ ) compared to oxamate, where the attached carboxylate group is regarded as a nonelectron-withdrawing group. Molecules having two amide groups show some quenching potential. It has been reported that $N$-acetyl-glycinamide (NAGA) and $N$-acetyl- $N^{\\prime}$-methylglycinamide ( $N$-Me-NAGA) have small $K_{\\mathrm{sv}}$ 's for 3-methyl-indole fluorescence. ${ }^{14}$ As the amide groups are actually separated by a methylene group, these molecules more likely mimic peptide bond chain in proteins. Malonamide, where two amide groups are connected via a methylene group in a different direction, also has a small $K_{\\mathrm{sv}}$. In comparison, when two amides are connected as in $N, N^{\\prime}$-dimethyl-oxamide, a strong quenching potential with $K_{\\mathrm{sv}}$ being $17.8 \\mathrm{M}^{-1}$, was observed. It may be noted that oxamide has poor solubility in water so that $N, N^{\\prime}$-dimethyl-oxamide was used.\n\nFrom above results, one may see that when an amide and a carboxylate groups, or two amide groups, are connected directly as in the case of oxamate or oxamide, a large $K_{\\mathrm{sv}}$ is observed. When the groups are separated by at least one methylene group, small $K_{\\mathrm{sv}}$ or no detectable quenching is found. These results may suggest some interactions between the amide group and the carboxylate group in oxamate. It has been reported that oxamate has unusual high reactivity toward hydrated electron. The authors attributed the activity to intramolecular hydrogen bond and imino tautomer, where reactive electrophilic centers are formed. ${ }^{29,30}$ This explanation may also work for the fluorescence quenching here. The quenching by pyruvate also shows no difference for tryptophan and NATA fluorescence with a $K_{\\mathrm{sv}}$ of about $20 \\mathrm{M}^{-1}$ for both fluorophores (Table 1). A similar conclusion can then be drawn as for oxamate. That is, the functional groups of tryptophan play no role in the fluorescence quenching by pyruvate.\n\n\\section{LUMO Energies Lowered by Conjugation}\nIn this section, we look into the structural information and the frontier orbitals from theoretical computations for some quenchers normally employed in fluorescence quenching by electron-transfer mechanism and some nonquenchers. The relation between LUMO energies (in Table 1) and the fluorescence quenching ability is discussed.\n\nSince the functional groups do not affect the quenching of NATA, tryptophan, or 1-methyltryptophan fluorescence by oxamate, the theoretical calculations on fluorophores were then performed on tryptophan and its core indole structures. As can be seen in Figure 4, the frontier orbitals of indole, 1-methylindole, and tryptophan are barely affected by the substitutions. Along with the experimental results, one may then conclude that the quenching mechanism will be same. Regarding the quenchers, it can be seen that the HOMO energies of molecules studied here are all below that of the fluorophores. The possibility of electron transfer from the quenchers to the fluorophores can thus be ruled out. In fact, acrylamide and trifluoroacetamide are known electron acceptors in the quenching of NATA or tryptophan fluorescence. Accordingly, their LUMO energies are below their fluorophore counterparts. LUMO energy for the quencher, $N, N$-dimethyl-oxamide, is also well below that of NATA. So, the electron transfer from excited NATA to the diamide compound is possible. In contrast, nonquenchers or very weak quenchers, like acetamide, malonamide, malonamate, succinamate, and trifluoroacetate, have LUMO energies higher than those of fluorophores so that they cannot accept the electron transfer from excited fluorophores or the process is less likely to take place. As a result, they tend to have small $K_{\\mathrm{sv}}$ 's. In general, as Table 1 shows, the energies of these molecules are well correlated with Stern-Volmer constants $\\left(K_{\\mathrm{sv}}\\right)$.\n\nFor oxamate and pyruvate, their LUMO energies, using PCM modeling, are just above the LUMO energy of tryptophan or indoles. At first glance, it seems that the relationship between LUMO energies and $K_{\\mathrm{sv}}$ is broken if PET is the mechanism accounting for the quenching since their $K_{\\text {sv }}$ 's are unusually high considering their relative LUMO energies. But without a better explanation for the quenching, we further examine the problem. Unlike other quenchers, oxamate or pyruvate has a high electron density. The repulsive interaction between keto and carboxylate groups is strong. In point of fact, nonplanar structures were reported for both molecules in solid state. The plane of the carboxylate group in pyruvate is twisted away from the acetyl plane just below $30^{\\circ} .31,32$ Furthermore, the bond connecting\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_8df0b56e310badc55de3g-05_2082_2130_514_1807}\\\\\nbond length $(1.578 \\AA)$ was found in sodium pyruvate. ${ }^{32}$ These findings led to the conclusion of weak conjugation between keto and carboxylate groups. In oxamate crystals, the rotation is about $10^{\\circ}$ and the bond length is $1.567 \\AA$ in sodium salt and $1.552 \\AA$ in potassium salt. 33,34 By comparison, oxamate in the ternary LDH complexes normally has a much shorter C1-C2 bond than a standard single bond but a larger twist angle (for example, $1.489 \\AA$ and $22.7^{\\circ}$ for the distance and the angle, respectively, in the structure with PDB code: $1 \\mathrm{I} 103^{35}$ $1.472 \\AA$ and $19.7^{\\circ}$ for $1 \\mathrm{I} 0 \\mathrm{Z} ;^{35} 1.388 \\AA$ and $25.9^{\\circ}$ for $1 \\mathrm{LDN} ;^{36} 1.448 \\AA$ and $17.4^{\\circ}$ for $1 \\mathrm{LDG}^{37}$ ). These structural features are crucial in determining their frontier orbitals as can be seen in theoretical calculations.\n\nPrevious calculations revealed a nearly perpendicular conformation for pyruvate and around $10^{\\circ}$ twist for oxamate in vacuum at the B3LYP/6-311++G(d,p) level. ${ }^{38,39}$ These results were reproduced in our calculations by using GAMESS. Although the results are somewhat consistent with the reported solid-state structures, their LUMOs are C-H or $\\mathrm{N}-\\mathrm{H} \\sigma^{*}$ orbital, instead of $\\pi^{*}$ orbitals, which are not satisfactory electron acceptors. However, by applying PCM to model the effect of water in the computations, the LUMOs become $\\pi^{*}$ orbitals. In fact, as shown in Table 1 , nonquenchers tend to have a $\\sigma^{*}$ orbital as their LUMO. Moreover, the PCM computations also find that the twist angle for the global minimum of pyruvate is about $90^{\\circ}$, and the co-planar structure is just a local minimum with $5.5 \\mathrm{~kJ} / \\mathrm{mol}$ higher in energy. The C1-C2 bond in the planar conformation is $1.580 \\AA$, much longer than the length of $1.539 \\AA$ in the conformation with a perpendicular twist angle, whereas a longer keto bond $(1.223 \\AA)$ in the later case was observed (see Figure 5), indicating strong electronic repulsion between the keto and $>$ CO moieties in the carboxylate group. In oxamate, on the other hand, the amide and the carboxylate groups are nearly co-planar. Methyl substitutions lead to a much higher LUMO energy in $N, N$-dimethyl-oxamate as the twist angle is almost $90^{\\circ}$, which obviously is a result of a steric effect. Not surprisingly, the bond lengths show similar effects of twisting in oxamates. The energy variations from parallel to perpendicular conformations in pyruvate and oxamate thus support the conjugation between the keto (or amide) group and the carboxylate group despite that the C1-C2 bond is longer than a normal single bond. The mixing between $\\pi^{*}$ orbitals from the two groups generates one lower orbital, which is the LUMO in oxamate and pyruvate, and a higher orbital (refer to Figure 6). Since the mixing is strongly affected by the twist, so is the LUMO. Moreover, when the conjugation is not possible in malonamate or succinamte, for example, the LUMO energy is much higher.\n\nThe structures of those amides shown in Figure 5 may be a compromise of conjugation and repulsion between the amide group and another functional group: carboxylate, methyl, trifluoromethyl, alkenyl. For example, the short C1-C2 bond in acrylamide indicates unquestionably that conjugation exists there. The trifluoromethyl group $\\left(-\\mathrm{CF}_{3}\\right)$, having strong inductive effect (-I), induces a different result upon the amide structure in comparison to the methyl group (in acetamide) or the carboxylate group (in oxamate). As a consequence, the amide $\\mathrm{C}-\\mathrm{N}$ and $\\mathrm{C}=\\mathrm{O}$ bonds are much shorter and show more double bond character.\n\nFrom the structures, one may argue that the proposed intramolecular hydrogen bonding between - NH (of amide) and -CO (of carboxylate) may not be significant in fluorescence quenching. The distance ( $\\mathrm{H}-\\mathrm{O})$ of $2.237 \\AA$ and angle ( $\\mathrm{N}-\\mathrm{H}-\\mathrm{O})$ of $103.8^{\\circ}$ may only support a weak hydrogen bond. In fact, malonamate, in spite of a stronger hydrogen bond with the distance of $1.881 \\AA$ and the angle of $136.5^{\\circ}$ (not shown here), has weak fluorescence quenching. The imino tautomer (not shown here) can also be excluded since its energy is $70.9 \\mathrm{~kJ} / \\mathrm{mol}$ higher than that of the amide. So, there must be other factors dictating the unusual high activity toward hydrated electrons and strong fluorescence quenching.\n\n\\section{LUMO Energies Lowered by Hydrogen Bonding with Waters}\nIn the PCM results, the global minimum structures have LUMO energies for both molecules that are too high to yield consequential $K_{\\text {sv }}$ 's. Calculations using the SMD solvent model were then performed to examine a role for solvent. The SMD calculations hardly affect the LUMO energies for neutral species but lower the energies of oxamate and pyruvate albeit the structures look same in PCM and SMD calculations (see Figure 4). The SMD results still cannot account for high $K_{\\text {sv }}$ 's. Since pyruvate and oxamate form hydrogen bonds with water molecules, implicit solvent models are not sufficient to account for interactions with water. Hydrogen bonds between solvent and the amide groups were indeed found to be the major factor for the low quantum yield in NATA. ${ }^{9}$ Thus, explicit waters were added in our modeling in several ways to account for the effect of hydrogen bonds including side, head, and multiple waters (Figure 7). The intention is not to find the exact conformation in water but for possible effects on the frontier orbitals. As can be seen in Figure 7, the LUMO energies get clearly lowered with hydrogen-bonded waters. The side-bonded water, which may interact with keto and carboxylate oxygen atoms, has stronger effect than the headbonded water for both molecules. The hydrogen bonds obviously reduce the repulsion between the keto and the carboxylate groups, resulting in structures better balanced between C1- $\\mathrm{C} 2$ bond length and $\\mathrm{O}=\\mathrm{C} 1-\\mathrm{C} 2=\\mathrm{O}$ twist angle, and thus an improved conjugation (refer to Table 2 and Figure 5). For instance, the twist angle in the pyruvate-water cluster (Figure 7d) is about $35^{\\circ}$, much smaller than that in vacuum or PCM water, although the C1-C2 bond length is shorter in latter cases. The LUMO energy of pyruvate is lowered to $1.47 \\mathrm{eV}$, whereas the twist angle of $2.7^{\\circ}$ in the oxamate-water cluster (Figure $7 \\mathrm{~h}$ ) does not see big changes, the C1-C2 bond is notably shorter. As a result, the LUMO energy is $-1.10 \\mathrm{eV}$, well below that of tryptophan or indoles. These structural specifications show the conjugation between the amide (or keto) group and the carboxylate group, although they may not mirror those in solid state since the interactions induced by water or cations in solution and by cations and intermolecular hydrogen bonding in the crystal structures are different.\n\nOn the basis of these findings, it is reasonable to assume that oxamate and pyruvate quench tryptophan fluorescence through photoinduced electron transfer, in which the two molecules are electron acceptors. Our results are also consistent with the finding that the Stern-Volmer constants $\\left(K_{\\mathrm{sv}}\\right)$ of quenchers are fairly correlated to their LUMO energies when explicit waters are included using a simplified equation based on Marcus theory\n\n\\[\nK_{\\mathrm{SV}}=A \\exp \\left(-\\frac{\\left(E_{\\mathrm{LUMO}}+E_{0}\\right)^{2}}{B}\\right)\n\\]\n\nWhere $A, B$, and $E_{0}$ are constants related to the electronic coupling and the reorganization energy in the Marcus equation. $E_{\\mathrm{LUMO}}$ is the LUMO energy of quenchers. The plot is shown in Figure 8. In parallel to oxamate-water and pyruvate-water clusters, explicit water was added to form hydrogen bonds with each amide group in the amide only molecules as well. We assume that those molecules should have less hydrogen-bonded waters than pyruvate and oxamate. Nevertheless, considering that the actual water-solute interactions are unknown, the simulation here is satisfactory.\n\n\\section{CONCLUSIONS}\nThe pyruvate ion has previously been suggested to be a negatively charged fluorescence quencher in an enzyme study. ${ }^{40}$ Oxamate may also be considered in the same way. Their fluorescence quenching can be attributed to photoinduced electron transfer although the amide (or keto) and carboxylate groups by themselves are weak electron acceptor. The conjugation between these groups lowers the LUMO energy and makes possible the electron transfer from the excited tryptophan (or the indole group) to the LUMO. The conjugation is normally a topic in modulating the energies of frontier orbitals including LUMO and HOMO of long chain molecules with unsaturated units. It is overlooked in small molecules, especially with a carboxylate group. We believe the conjugation between the alkenyl group and the amide group in acrylamide, and between two amides in oxamide, may also have such role in fluorescence quenching. On the other hand, the inductive effect by $-\\mathrm{CF}_{3}$ is a dominating factor for trifluoroacetamide.\n\nThe hydrogen bonding between these molecules and waters in the aqueous solution is also critical and has to be included in the theoretical calculations. Our results indicate that the LUMO energies of oxamate and pyruvate are significantly lowered by hydration. Several closely related studies also demonstrated that hydrogen bonding with waters strongly affects the electron affinities of uracil, thymine, cytosine, and especially their anions. ${ }^{41-43}$ Here, the electron affinity, the reduction potential, and the LUMO energy are well-correlated properties relating to electron transfer, and the last one may be the easiest to obtain. We recommend explicit water models be considered at the minimum in dealing with such molecules. Moreover, for a better description of aqueous substrates, it may be required that the model account for some physical and chemical properties simultaneously. For example, for oxamate or pyruvate, the $\\mathrm{p} K_{\\mathrm{a}}$ value, asymmetric and symmetric vibrations of the carboxylate group, the fluorescence quenching efficiency, and other properties are to be satisfied.\n\n\\section{Acknowledgments}\nThis work supported in part by the Institute of General Medicine of the National Institutes of Health, program project grant number 5P01GM068036.\n\n\\section{References}\n\\begin{enumerate}\n  \\item Lakowicz, JR. Principles of Fluorescence Spectroscopy3. Springer; Boston, MA: 2006\n\n  \\item Mátyus L, Szöllősi J, Jenei A. Steady-State Fluorescence Quenching Applications for Studying Protein Structure and Dynamics. J Photochem Photobiol, B. 2006; 83:223-236. [PubMed: 16488620]\n\n  \\item Strambini GB, Gonnelli M. Fluorescence Quenching of Buried Trp Residues by Acrylamide Does Not Require Penetration of the Protein Fold. J Phys Chem B. 2010; 114:1089-1093. [PubMed: 19924836] 4. Eftink MR, Selva TJ, Wasylewski Z. Studies of the Efficiency and Mechanism of Fluorescence Quenching Reactions Using Acrylamide and Succinimide as Quenchers. Photochem Photobiol. $1987 ; 46: 23-30$.\n\n  \\item Somogyi B, Damjanovich S, Rosenberg A. Protein Dynamics and Fluorescence Quenching. J Mol Catal. 1988; 47:165-177.\n\n  \\item Tallmadge DH, Huebner JS, Borkman RF. Acrylamide Quenching of Tryptophan Photochemistry and Photophysics. Photochem Photobiol. 1989; 49:381-386. [PubMed: 2727078]\n\n  \\item Eftink MR, Ghiron CA. Fluorescence Quenching Studies with Proteins. Anal Biochem. 1981; 114:199–227. [PubMed: 7030122]\n\n  \\item Möller M, Denicola A. Protein Tryptophan Accessibility Studied by Fluorescence Quenching. Biochem Mol Biol Educ. 2002; 30:175-178.\n\n  \\item Muiño PL, Callis PR. Solvent Effects on the Fluorescence Quenching of Tryptophan by Amides Via Electron Transfer. Experimental and Computational Studies. J Phys Chem B. 2009; 113:2572–2577. [PubMed: 18672928]\n\n  \\item Callis PR, Liu TQ. Quantitative Prediction of Fluorescence Quantum Yields for Tryptophan in Proteins. J Phys Chem B. 2004; 108:4248-4259.\n\n  \\item Callis PR, Vivian JT. Understanding the Variable Fluorescence Quantum Yield of Tryptophan in Proteins Using Qm-Mm Simulations. Quenching by Charge Transfer to the Peptide Backbone. Chem Phys Lett. 2003; 369:409-414.\n\n  \\item Chen Y, Barkley MD. Toward Understanding Tryptophan Fluorescence in Proteins. Biochemistry. 1998; 37:9976-9982. [PubMed: 9665702]\n\n  \\item Adams PD, Chen Y, Ma K, Zagorski MG, Sonnichsen FD, McLaughlin ML, Barkley MD. Intramolecular Quenching of Tryptophan Fluorescence by the Peptide Bond in Cyclic Hexapeptides. J Am Chem Soc. 2002; 124:9278–9286. [PubMed: 12149035]\n\n  \\item Chen Y, Liu B, Yu HT, Barkley MD. The Peptide Bond Quenches Indole Fluorescence. J Am Chem Soc. 1996; 118:9271–9278.\n\n  \\item Midoux P, Wahl P, Auchet JC, Monsigny M. Fluorescence Quenching of Tryptophan by Trifluoroacetamide. Biochim Biophys Acta, Gen Subj. 1984; 801:16-25.\n\n  \\item Peng HL, Callender R. Mechanistic Analysis of Fluorescence Quenching of Reduced Nicotinamide Adenine Dinucleotide by Oxamate in Lactate Dehydrogenase Ternary Complexes. Photochem Photobiol. 2017; 93:1193-1203. [PubMed: 28391608]\n\n  \\item Gachko GA, Zubko IL, Zybel't VK, Kivach LN, Maskevich SA, Maskevich AA, Suchok OP. Fluorescence Quenching of Tryptophan in Aqueous Solutions by Pyruvate. J Appl Spectrosc. 1987; 47:1127-1131.\n\n  \\item Götz M, Hess S, Beste G, Skerra A, Michel-Beyerle ME. Ultrafast Electron Transfer in the Complex between Fluorescein and a Cognate Engineered Lipocalin Protein, a So-Called Anticalin. Biochemistry. 2002; 41:4156-4164. [PubMed: 11900559]\n\n  \\item Palazzotto MC, Sahyun MRV, Serpone N, Sharma DK. Electron Transfer Quenching of Rhodamine-6G in Polymer Films. J Chem Phys. 1989; 90:3373-3379.\n\n  \\item Jiang L, Liu W, Song Y, He X, Wang Y, Yang Y. Photoinduced Electron Transfer of Rhodamine 6G/N,N-Diethylaniline Revealed by Multiplex Transient Grating and Transient Absorption Spectroscopies. Appl Phys B. 2014; 116:271-277.\n\n  \\item Al-Ahmary K, Habeeb M, Al-Solmy E. Spectroscopic and Thermodynamic Studies on Charge Transfer Complex Formation between 2-Aminopyridine and 2,5-Dihydroxy-p-Benzoquinone. J Solution Chem. 2010; 39:1264-1277.\n\n  \\item Kortum, G., Vogel, W., Andrussow, K. Dissociation Constants of Organic Acids in Aqueous SolutionButterworths; London: 1961\n\n  \\item Wishart DS, Feunang YD, Guo AC, Lo EJ, Marcu A, Grant JR, Sajed T, Johnson D, Li C, Sayeeda Z, et al. Drugbank 5.0: A Major Update to the Drugbank Database for 2018. Nucleic Acids Res. 2018; 46:D1074-D1082. [PubMed: 29126136]\n\n  \\item Schmidt MW, Baldridge KK, Boatz JA, Elbert ST, Gordon MS, Jensen JH, Koseki S, Matsunaga N, Nguyen KA, Su S, et al. General Atomic and Molecular Electronic Structure System. J Comput Chem. 1993; 14:1347-1363. 25. Gordon, MS., Schmidt, MW. Advances in Electronic Structure Theory: GAMESS a Decade Later. In: Dykstra, CE.Frenking, G.Kim, KS., Scuseria, GE., editorsTheory and Applications of Computational Chemistry: The First Forty YearsElsevier; Amsterdam: 20051167-1189\n\n  \\item Marenich AV, Cramer CJ, Truhlar DG. Universal Solvation Model Based on Solute Electron Density and on a Continuum Model of the Solvent Defined by the Bulk Dielectric Constant and Atomic Surface Tensions. J Phys Chem B. 2009; 113:6378–6396. [PubMed: 19366259]\n\n  \\item Zelent B, Kusba J, Gryczynski I, Johnson ML, Lakowicz JR. Time-Resolved and Steady-State Fluorescence Quenching of N-Acetyl-L-Tryptophanamide by Acrylamide and Iodide. Biophys Chem. 1998; 73:53–75. [PubMed: 9697300]\n\n  \\item Evans RF, Kuntz RR, Volkert WA, Ghiron CA. Flash Photolysis of N-Acetyl-L-Tryptophanamide: The Relationship between Radical Yields and Fluorescence Quenching. Photochem Photobiol. 1978; 27:511-515.\n\n  \\item Hart EJ, Fielden EM, Anbar M. Reactions of Carbonylic Compounds with Hydrated Electrons. J Phys Chem. 1967; 71:3993-3998.\n\n  \\item Simic M, Hayon E. Interaction of Solvated Electrons with the Amide and Imide Groups. Acid-Base Properties of RC(OH)NH2 Radicals. J Phys Chem. 1973; 77:996-1001.\n\n  \\item Rach W, Kiel G, Gattow G. Über Chalkogenolate. 187. Untersuchungen Über Salze Der Pyruvinsäure 2. Kristallstruktur Von Kaliumpyruvat, Neubestimmung Der Struktur Von Natriumpyruvat. Z Anorg Allg Chem. 1988; 563:87-95.\n\n  \\item Tavale SS, Pant LM, Biswas AB. The Crystal Structure of Sodium Pyruvate. Acta Crystallogr. 1961; 14:1281-1286.\n\n  \\item Aakeröy CB, Hughes DP, Nieuwenhuyzen M. The Oxamate Anion: A Flexible Building Block of Hydrogen-Bonded Architectures for Crystal Engineering. J Am Chem Soc. 1996; 118:1013410140.\n\n  \\item Helmholdt RB, Sonneveld EJ, Chernyshev VV, Schenk H. The Crystal Structure of Sodium Oxamate NaC2O3NH2 from Powder Diffraction Data. Z Kristallogr - Cryst Mater. 2001; 216:295-297.\n\n  \\item Read JA, Winter VJ, Eszes CM, Sessions RB, Brady RL. Structural Basis for Altered Activity of M- and H-Isozyme Forms of Human Lactate Dehydrogenase. Proteins. 2001; 43:175-185. [PubMed: 11276087]\n\n  \\item Wigley DB, Gamblin SJ, Turkenburg JP, Dodson EJ, Piontek K, Muirhead H, Holbrook JJ. Structure of a Ternary Complex of an Allosteric Lactate-Dehydrogenase from BacillusStearothermophilus at $2.5 \\AA$ Resolution. J Mol Biol. 1992; 223:317-335. [PubMed: 1731077]\n\n  \\item Dunn CR, Banfield MJ, Barker JJ, Higham CW, Moreton KM, Turgut-Balik D, Brady RL, Holbrook JJ. The Structure of Lactate Dehydrogenase from Plasmodium Falciparum Reveals a New Target for Anti-Malarial Design. Nat Struct Biol. 1996; 3:912–915. [PubMed: 8901865]\n\n  \\item Duczmal K, Darowska M, Raczynska ED. Spectral (DFT-IR, FT-IR and UV) Similarities and Differences between Substrate (Pyruvate) and Inhibitor (Oxamate) of Lactic Dehydrogenase (LDH). Vib Spectrosc. 2005; 37:77-82.\n\n  \\item Duczmal K, Hallmann M, Raczynska ED, Gal JF, Maria PC. Comparison of the Proton (H+) and Alkali Metal Ion (Li+, Na+ and K+) Binding Affinities of Pyruvate and Oxamate Anions in the Gas Phase. Quantum-Chemical Studies. Pol J Chem. 2007; 81:1011-1020.\n\n  \\item Ando T, Miyata H. Pyruvate as a Fluorescence Quencher: A New Spectroscopic Assay for Pyruvate Reactions. Anal Biochem. 1983; 129:170–175. [PubMed: 6222667]\n\n  \\item Kim S, Schaefer HF. Effects of Microsolvation on Uracil and Its Radical Anion: Uracil•(H2O)n (n = 1-5). J Chem Phys. 2006; 125(144305)\n\n  \\item Kim S, Wheeler SE, Schaefer HF. Microsolvation Effects on the Electron Capturing Ability of Thymine: Thymine-Water Clusters. J Chem Phys. 2006; 124(204310)\n\n  \\item Kim S, Schaefer HF. Microhydration of Cytosine and Its Radical Anion: Cytosine.(H2O)n $(n=1-$ 5). J Chem Phys. 2007; 126(064301)\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_8df0b56e310badc55de3g-11_215_1153_640_1690}\n\n\\end{enumerate}\n\nFigure 1.\n\nChemical structures for fluorophores (tryptophans), quenchers (amides), and nonquenchers (amides) used in the fluorescence quenching.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-12_214_1185_537_1800}\n\\end{center}\n\nFigure 2.\n\nGeneral energetic relations of frontier orbitals (HOMO and LUMO) between fluorophore and quencher in photoinduced electron transfer (PET) quenching.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-13_218_1576_455_1865}\n\\end{center}\n\nFigure 3.\n\nStern-Volmer plots for the quenching of tryptophan, 1-methyltryptohan, and $N$-acetyltryptophanamide (NATA) fluorescence by oxamate and $N, N$-dimethyl-oxamate.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-14_210_1080_649_1671}\n\\end{center}\n\nFigure 4.\n\nEnergetic view of HOMO (black lines) and LUMO (red lines) for selected quencher, nonquencher, and fluorophores: indole, 1-methylindole, and tryptophan. Orbital energies were obtained from theoretical calculations at B3LYP/6-311++G(d,p) level with PCM water (thick lines) and with SMD water (thin lines). Electron transfer is only feasible from excited indoles to several quenchers whose HOMO energy is lower than that of indoles (shown as arrow). The dashed arrows with a red $\\mathrm{X}$ represent forbidden processes including electron transfer from LUMO of quenchers or nonquenchers to indoles and electron transfer from excited indoles to HOMO of some nonquenchers.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_8df0b56e310badc55de3g-15_218_1226_666_1668}\n\nFigure 5.\n\nSelected bond lengths for PCM-optimized molecules: (a) pyruvate in perpendicular conformation (b) oxamate, (c) acetamide, (d) trifluoroaetamide, (e) $N, N$-dimethyl-oxamate, (f) acrylamide, and (g) pyruvate in parallel conformation. Labels on atoms in (a) and (b) indicate atom numbers and the twist angle: $\\mathrm{O}=\\mathrm{C} 1-\\mathrm{C} 2=\\mathrm{O}$.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_8df0b56e310badc55de3g-16_214_1256_759_1567}\n\nFigure 6.\n\nFrontier orbitals of oxamate. HOMO is an $n$-orbital. Anti $\\pi$-orbitals from the amide group and the carboxylate group generate one lower anti $\\pi$-orbital: LUMO of oxamate and one higher anti $\\pi$-orbital.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-17_215_381_798_1045}\n\\end{center}\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-17_435_617_802_997}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-17_683_873_804_1148}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-17_938_1165_796_1145}\n\\end{center}\n\n(d)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-17_225_388_1164_1541}\n\\end{center}\n\n(e)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-17_412_629_1206_1537}\n\\end{center}\n\n(f)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-17_672_900_1172_1527}\n\\end{center}\n\n(g)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-17_938_1171_1184_1537}\n\\end{center}\n\n(h)\n\nFigure 7.\n\nStructures of pyruvate-water (a-d) and oxamate-water (e-h) clusters and their LUMO energies in $\\mathrm{eV}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-18_217_1176_585_1740}\n\\end{center}\n\nFigure 8.\n\nCorrelation between Stern-Volmer constants ( $K_{\\mathrm{sv}}$, NATA as fluorophore) and quencher LUMO energies (see Table 1 for reference). Quenchers: (1) dimethyl-oxamate, (2) acrylamide, (3) trifluoroacetamide, (4) malonamide, (5) malonamate. The energies without explicit waters are shown in diamonds. Effect of explicit waters on pyruvate and oxamate LUMO energies (refer to Figure 7) is shown in the dashed arrows. The red line is the fit using the simplified equation (see text).\n\n\\section{Table 1}\nStern-Volmer Constants and LUMO Energies for Selected Quenchers\n\n\\begin{center}\n\\begin{tabular}{llll}\n\\hline\nquencher & LUMO (ev) & K $_{\\text {sv }}\\left(\\mathbf{M}^{-1}\\right)^{*}$ & note (ref) \\\\\n\\hline\nacrylamide & $-1.47$ & $21^{\\mathrm{a}}$ & 6 \\\\\n &  & $16.8^{\\mathrm{b}}$ & 3 \\\\\npyruvate & $-0.64(-1.34)^{* *}$ & $20.5^{\\mathrm{a}}$ & 17 \\\\\n &  & $19.8^{\\mathrm{b}}$ & this work \\\\\n & $-1.32$ & $17.8^{\\mathrm{b}}$ & this work \\\\\n$N, N^{\\prime}$-dimethyl-oxamide & $-0.68$ & $16.0^{\\mathrm{a}}$ & this work \\\\\noxamate &  & $13.7^{\\mathrm{b}}$ & this work \\\\\n &  & $16.5^{\\mathrm{c}}$ & this work \\\\\n & $-1.02$ & $6.2^{\\mathrm{b}}$ & 15 \\\\\ntrifluoroacetamide &  & $6.6^{\\mathrm{b}}$ & this work \\\\\n & $-0.38$ & $2.7^{\\mathrm{d}}$ & 14 \\\\\nmalonamide & $-0.04$ & $1.49^{\\mathrm{b}}$ & this work \\\\\n$N, N$-dimethyl-oxamate & $-0.23(-0.13)^{* * *}$ & $0.54^{\\mathrm{d}}$ & 14 \\\\\nNAGA & $-0.24(0.01)^{* * *}$ & $0.48^{\\mathrm{d}}$ & 14 \\\\\n$N$ N-Me-NAGA & $-0.20(0.11)^{* * *}$ &  &  \\\\\nacetamide & $-0.04(0.34)^{* * *}$ & $\\mathrm{nq}(0.1 \\mathrm{M})^{\\mathrm{b}}$ & this work \\\\\nmalonamate & $-0.10(0.13)^{* * *}$ & $\\mathrm{nq}(1 \\mathrm{M})^{\\mathrm{a}}$ & this work \\\\\nsuccinamate & $\\mathrm{nq}(1 \\mathrm{M})^{\\mathrm{b}}$ & this work &  \\\\\ntrifluoroacetate & $0.30$ &  &  \\\\\n\\end{tabular}\n\\end{center}\n\n\\begin{itemize}\n  \\item The fluorophores are (a) L-tryptophan, (b) $N$-acetyl L-tryptophanamide (NATA), (c) 1-methyl-DL-tryptophan and (d) 3-emthylindole. NAGA = $N$-acetyl-glycinamide; $N$-Me-NAGA $=N$-acetyl- $N^{\\prime}$-methylglycinamide. nq means no convincing fluorescence quenching was observed at the given concentration.\n\\end{itemize}\n\n** The value in the parenthesis is for the coplanar conformation.\n\nThe values in the parentheses are for anti $\\pi$ orbital, which is LUMO $+1$ instead of LUMO (anti $\\sigma$ ). LUMO energies are from the PCM computations.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8df0b56e310badc55de3g-20_520_2369_188_831}\n\\end{center}\n\n\n\\end{document}", "record_id": "2023_09_22_8df0b56e310badc55de3g"}