{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{New Insights into Hydride Bonding, Dynamics and }\n\n\n\\author{Øystein S. Fjellvåg,,$^{\\dagger}$ Jeff Armstrong,,$^{\\ddagger^{*}}$ Ponniah Vajeeston,,$^{\\dagger}$ and Anja O. Sjåstad ${ }^{\\dagger}$\\\\\n$\\dagger$ Centre for Materials Science and Nanotechnology, Department of Chemistry, University of\\\\\nOslo, POBox 1033, N-0315 Oslo, Norway\\\\\n${ }^{\\ddagger}$ ISIS Facility, Rutherford Appleton Laboratory, Harwell Oxford, Didcot, Oxfordshire OX11\\\\\n0QX, U.K.}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\n\\section{Migration in $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ Oxyhydride}\n*E-mail: \\href{mailto:jeff.armstrong@stfc.ac.uk}{jeff.armstrong@stfc.ac.uk} Abstract: Hydride anion conducting oxyhydrides have recently emerged as a brand new class of ionic conductors. Here we shed a first light into their local vibrations, bonding mechanisms, and anion migration properties, using the powerful combination of high-resolution inelastic neutron scattering and a set of rigorously experimentally validated density functional theory calculations. By means of several different charge density analysis methods we establish the bonding to be strongly anisotropic with ionic bonding in the perovskite layer and covalent bonding permeating the rock salt layer. Climbing nudged elastic band calculations allow us to predict the hydride migration paths, which crucially we are able to link to the observed exotic ionic-covalent hybrid nature of the bonding of the system. In particular, hydride migration in the rock salt layer is seen to be greatly hindered by the presence of covalent bonding, forcing in-plane hydride migration in the perovskite layer to be the dominant transport mechanism. On the basis of this microscopic insight into the transport and bonding, we are able to propose future candidates for materials which are likely to show enhanced hydride conductivity.\n\n\\section{TOC GRAPHICS}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-02_1679_2186_234_758}\n\\end{center}\n\nOver the years, an array of ions such as $\\mathrm{O}^{2-}, \\mathrm{H}^{+}, \\mathrm{Li}^{+}$and $\\mathrm{Na}^{+}$have shown themselves to be excellent charge carriers in a variety of ionic conductors used within the field of energy materials (e.g. in fuel cells and batteries). However a new exotic class of potential ionic conductors has recently emerged from the discovery of oxyhydrides, where the anionic sub-lattice is formally composed of both $\\mathrm{O}^{2-}$ and $\\mathrm{H}^{-}$ions. ${ }^{1}$ Recently Kobayashi et al. ${ }^{2}$ demonstrated pure $\\mathrm{H}^{-}$conductivity in $\\mathrm{La}_{2-x-y} \\mathrm{Sr}_{\\mathrm{x}+\\mathrm{y}} \\mathrm{LiH}_{1-\\mathrm{x}+\\mathrm{y}} \\mathrm{O}_{3-y}$. The hydride conductivity was found to depend on composition (x, y), with the highest conductivity $\\left(3.2 \\times 10^{-5} \\mathrm{~S} \\mathrm{~cm}^{-1}\\right.$ at $\\left.300{ }^{\\circ} \\mathrm{C}\\right)$ observed for $\\mathrm{Sr}_{2} \\mathrm{LiH}_{3} \\mathrm{O}$. Excitingly, they further documented the $\\mathrm{H}^{-}$transport properties of $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ through a prototype solid state $\\mathrm{Ti}^{\\mathrm{La}} \\mathrm{La}_{2} \\mathrm{LiHO}_{3} / \\mathrm{TiH}_{2}$ battery, demonstrating the potential applications of such a class of materials. ${ }^{2}$ To progress these rapid developments, and to arrive at more viable devices it is essential that we develop a general understanding of the structure, bonding and diffusion mechanism of this new class of materials.\n\nThe existence of $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ was first reported in 1991 by Schwarz. ${ }^{3}$ The compound was synthesized by reacting $\\mathrm{La}_{2} \\mathrm{O}_{3}$ and $\\mathrm{LiH}$ in a $\\mathrm{LiCl}$ salt melt under inert atmosphere at $750{ }^{\\circ} \\mathrm{C}$. $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ has a $\\mathrm{K}_{2} \\mathrm{NiF}_{4}$ type structure (Ruddlesden-Popper type, $\\mathrm{RP} ; \\mathrm{n}=1$ ) which is composed of perovskite layers separated by a half rock salt layer, which crystallizes in the orthorhombic space group Immm with an ordered distribution of the $\\mathrm{O}^{2-}$ and $\\mathrm{H}^{-}$anions. ${ }^{3}$ Kobayashi et al. synthesized $\\mathrm{La}_{2-\\mathrm{x}-\\mathrm{y}} \\mathrm{Sr}_{\\mathrm{x}+\\mathrm{y}} \\mathrm{LiH}_{1-\\mathrm{x}+\\mathrm{y}} \\mathrm{O}_{3-y}$ by direct solid state reaction between $\\mathrm{La}_{2} \\mathrm{O}_{3}, \\mathrm{SrO}$ and $\\mathrm{LiH}$ at high pressures (1-2 GPa) and intermediate temperatures $\\left(650-750{ }^{\\circ} \\mathrm{C}\\right) .{ }^{2}$ Depending on the reaction conditions, they concluded that $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ can appear in either of two variants of the RP type, $n=$ 1; orthorhombic (Immm) and tetragonal (I4/mmm). In the tetragonal variant reported by Kobayashi et al., the distribution of the equatorial $\\mathrm{O}^{2-}$ and $\\mathrm{H}^{-}$are disordered. In addition, it is non- stoichiometric and partially contains anion vacancies with a nominal formula of $\\mathrm{La}_{2} \\mathrm{Li}\\left(\\mathrm{H}_{0.53} \\mathrm{O}_{1.21} \\mathrm{~V}_{0.26}\\right) \\mathrm{O}_{2 .}{ }^{2}$\n\nWhen considering potential applications of this new class of materials, knowledge of the thermal stability becomes crucial. By means of combined thermogravimetric-differential scanning calorimetry-mass spectroscopy, quasi-elastic neutron scattering (QENS) and in-situ synchrotron powder X-ray diffraction (XRD) Fjellvåg et al. found the orthorhombic $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ phase to be remarkably stable and to first decompose at $\\sim 450{ }^{\\circ} \\mathrm{C}$ to $\\mathrm{La}_{2} \\mathrm{LiO}_{3.5}$ in an oxygen atmosphere without any signs of the tetragonal polymorph. ${ }^{4}$ Further, QENS revealed that hydride ion diffusion was the driving force behind the decomposition.\n\nThere have been many insightful density functional theory (DFT) studies of ion vibration/migration, with in particular $\\mathrm{BaTiO}_{3-\\mathrm{x}} \\mathrm{H}_{\\mathrm{x}}$ being a widely studied compound. Zhang et al. calculated that the activation energy for migration between two interstitial sites is $0.18 \\mathrm{eV}$, comparable to the activation energies for proton conductors. ${ }^{5}$ The activation energy for hydride migration from a hydride anion on an oxygen position to an oxygen vacancy in $\\mathrm{BaTiO}_{3-\\mathrm{x}} \\mathrm{H}_{\\mathrm{x}}$ was calculated to be $0.28 \\mathrm{eV}^{6}$\n\nTo the best to our knowledge no mechanistic insight into $\\mathrm{H}^{-}$migration pathway for $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ or in fact any other oxyhydride is yet at hand. In this work we report the hydride dynamics in the hydride conducting oxyhydride $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ via inelastic neutron scattering (INS) and DFT calculations. We verify our DFT model by comparing the in-silico spectra with INS phonon and Raman spectra. From the accepted model we then perform a comprehensive charge distribution analysis to understand the bonding, before performing a migration pathway analysis by climbing nudged elastic band (cNEB) calculations to shed light on the hydride transport mechanism.\n\n\\section{Structural and vibrational properties}\n$\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ has hydrogen as its most dominant source of incoherent scattering, thus INS is a very well suited technique to study the local environment and bonding of its hydride anions. The INS spectra of $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ (Figure 1, top) shows three distinctive high-energy peaks. To uncover the atomic nature of these vibrations, DFT phonon calculations were performed. We developed a DFT model starting from the reported structure of $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}(\\mathrm{Immm})$, and find the relaxed structure to be in excellent agreement with these experimental reports (Table S1). ${ }^{3}$ The structure is visualized in Figure S1. The phonon dispersion were calculated from DFT (Figure 1, bottom) and the neutron weighted projected density of states (Figure 1, middle) was then calculated and compared with the experimental INS spectra (Figure 1, top). The in-silico spectra (Figure 1, middle) show good agreement with the INS spectra, with the specific shape of each peak being very well reproduced. A systematic shift in the position of each peak is however seen, which is commonly observed when calculating vibrational spectra by DFT. D-9 $^{\\text {After considering several different functionals we }}$ concluded that PBE reproduced all the essential features required for our study. For this reason PBE functional was therefore used for further calculations.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-06_240_1462_252_1884}\n\\end{center}\n\nFigure 1: Top: INS spectra (black) of $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ collected on TOSCA at $10 \\mathrm{~K}$ and Raman spectra (dark red) with a laser wavelength of $532 \\mathrm{~nm}$. The ball-stick models $\\left[\\mathrm{Li}(\\mathrm{O} / \\mathrm{H})_{6}\\right.$, lithium (purple), oxygen (red) and hydrogen (white)] illustrate the direction of the hydride vibration. Middle: Calculated Raman spectra (dark red) from DFT with the PBE functional. The peaks are assigned to the corresponding labelled modes. Total scattering contribution calculated from DFT, weighted with the neutron cross section (black line). The incoherent scattering contribution from hydrogen is represented by the shaded gray region. Bottom: Calculated phonon dispersion from DFT.\n\nDecomposition of the DFT phonon spectra into incoherent and coherent contributions showed that the three vibrational modes at high-energy transfers originate from the incoherent scattering of the hydride anions (Figure 1, middle). The coherent contribution is negligibly small for these three modes. The DFT additionally reveals that the vibrations originate from the hydride vibrations along the $\\mathrm{x}-\\left(1665 \\mathrm{~cm}^{-1}\\right), \\mathrm{y}-\\left(1191 \\mathrm{~cm}^{-1}\\right)$ and z-axis $\\left(986 \\mathrm{~cm}^{-1}\\right)$, with the relation $v_{\\mathrm{z}}<v_{\\mathrm{y}}<v_{\\mathrm{x}}$ (Figure 1, middle). Closer examination of the highest energy vibration reveals that it corresponds to the vibration of the hydride anion towards the lithium cation to which it is bonded. The resultant bonding along this direction therefore forms the most tightly bound local potential. The second highest hydride vibration can similarly be shown to correspond to the hydride anion vibrating in the y-direction, which is in the direction of the neighboring hydride anion. In this direction there are no bonds. This is consistent with a looser local potential and lower vibrational frequency than that along the x-direction. The lowest of the three high-energy peaks originates from vibration in the z-direction (i.e. the direction of the rock salt layer). This direction has no direct neighbors. Thus one could anticipate the local potential to be the lowest of the three spatial dimensions, which is indeed consistent with the observation of it being the lowest frequency incoherent hydride mode. Neutron diffraction has previously been used to determine the crystal structure of $\\mathrm{La}_{2} \\mathrm{LiHO}_{3},{ }^{2-4}$ giving information on the average positions of the constituents of the compound. Since $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ is reported to be a hydride conductor, the hydride anions display mobility. In such cases, INS provides a more convincing confirmation of the local environment of the hydride anions, including validating the dynamics of the structure. Firstly, the general good agreement between INS and our DFT model (based on the average structure from diffraction experiments) validate the hydride position from diffraction experiments. Additionally, as discussed above, the peak positions of the incoherent hydride modes are perfectly consistent with the local structure/potential, which provides greater assurance that the reported hydride positions from previous diffraction studies are indeed correct. ${ }^{2-4}$ The hydride anion vibrations are well separated from the vibrational modes of the other elements, as one would expect from the mass disparities present. At these lower energy transfers Raman spectroscopy is a well suited technique, capable of giving better contrast towards the heavier elements than INS. The features in the experimental Raman spectra are well accounted for in the in-silico Raman spectra (Figure 1, top and middle). This gives extra confidence in our DFT model since the modes from Raman and INS span a great range of frequencies and result from both coherent and incoherent motions. All modes are identified to originate at low energies from lanthanum and at higher energies from the axial oxide anion vibrations in $\\mathrm{x}-\\mathrm{y}$ - and z-direction (Table S2). The in-silico spectra shows that the $B_{2 g}$ and $A_{g}$ modes have merged to form one peak from the lanthanum vibrations in the z-directions and axial oxide anion in x-direction respectively, in contrast to the experimental spectra where the peaks are separated.\n\nPrevious experimental literature has reported two polymorphs of $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$, an orthorhombic and a tetragonal variant. ${ }^{2-3}$ To our knowledge the stability of the two phases has not been investigated by DFT. We have therefore calculated the total energy versus unit cell volume for both phases (Figure 2, Table S1). The calculations show that the orthorhombic polymorph is the lower energy structure with a calculated cell volume of $88 \\AA^{3} \\mathrm{f} . u^{-1}{ }^{-1}$. Correspondingly, Rietveld refinements of the same phase give a cell volume of $87.06 \\AA^{3}$ f.u. $^{-1}$ (Figure S2 and Table S3).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-09_263_1103_239_1068}\n\\end{center}\n\nFigure 2: Calculated total energy versus unit cell volume for the two different polymorphs of $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ (orthorhombic (Immm) and tetragonal $(\\mathrm{I} 4 / \\mathrm{mmm}$ )). The arrow indicates the theoretical equilibrium at $88 \\AA^{3}$ f.u. $^{-1}$.\n\nInterestingly, at larger cell volumes the DFT model predicts that the tetragonal variant becomes energetically more favorable than the orthorhombic. Both orthorhombic and tetragonal polymorphs were synthesized by Kobayashi $e t$ al. ${ }^{2}$ at high pressures. The tetragonal sample was not stoichiometric with a reported composition of $\\mathrm{La} \\mathrm{a}_{2} \\mathrm{Li}\\left(\\mathrm{H}_{0.53} \\mathrm{O}_{1.21} \\mathrm{~V}_{0.26}\\right) \\mathrm{O}_{2}$. Similarly, Fjellvåg et al. ${ }^{4}$ observed by the means of in-situ synchrotron powder XRD no sign of the orthorhombic to tetragonal phase transition before the material decomposes at $450^{\\circ} \\mathrm{C}$. However, a trend towards a more tetragonal cell was observed. Anion vacancies are larger than the corresponding anion species in a structure. An increased vacancy concentration would therefore increase the cell volume. Consequently the tetragonal structure should become more favorable with increased vacancy concentration. This result is therefore in direct support of the idea that a vacancy filled $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ sample, such as the tetragonal sample synthesized by Kobayashi, should adopt the tetragonal structure.\n\n\\section{Bonding in $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$}\nWith confidence in the comprehensively validated DFT model, we may ask fundamental questions about the electronic structure through the use of Born-effective-charge (BEC) analysis. For an ideal ionic system, the ions have a spherically characterized charge distribution. We find for $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ that the BEC for all ions except the hydride anion and the axial oxygen anion (O2) deviates less than $15 \\%$ from a perfect spherical charge distribution (Table 1). Most prominently the hydride anion is strongly deformed to be undersized in $\\mathrm{Z}_{\\mathrm{zz}}\\left(44 \\%\\right.$ difference, $\\left.\\mathrm{Z}_{\\mathrm{zz}}<\\mathrm{Z}_{\\mathrm{yy}} \\approx \\mathrm{Z}_{\\mathrm{xx}}\\right)$ making the hydride anion disc-shaped, while the axial oxide anion has the relation $\\mathrm{Z}_{y y}<\\mathrm{Z}_{x x}<\\mathrm{Z}_{z z}$. Consequently, the BEC predicts that the bonding in $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ deviates from the ideal ionic picture with the presence of a sizeable covalent contribution.\n\nTable 1: Calculated BEC, Bader charges, Mulliken population analysis for $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ and the bond overlap population (BOP) between constituents of $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$. For the BEC $x x, y y$ and $z z$ corresponds to charge distribution along the $\\mathrm{x}-, \\mathrm{y}^{-}$, and $\\mathrm{z}$ - direction respectively.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-10_1706_2435_237_1888}\n\\end{center}\n\nIn an attempt to quantify the bonding and estimate the amount of electrons on and between the atomic sites, we have performed a Bader charge analysis and a Mulliken population analysis. Commonly, in near pure ionic compounds, the Bader charge analysis and the Mulliken effective charges (MEC) are close to their ideal ionic charges $\\left(\\mathrm{La}^{3+}, \\mathrm{Li}^{+}, \\mathrm{H}^{-}\\right.$and $\\left.\\mathrm{O}^{2-}\\right)$. Both the Bader charge analysis and the MEC show deviations from the expected charge values for an ideal ionically bonded system (Table 1). A covalent character to the bonding would account for the deviations in charge for the ions, hence the Bader analysis and MEC point towards some degree of covalent bonding.\n\nFajans' rules ${ }^{10-12}$ predict that a cation with high charge density will polarize a bond more than a cation with low charge density. On this basis one would expect $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ to have a strong ionic character as the cations have low polarizing power due to the small charge of lithium and the large size of lanthanum. The bond overlap population (BOP) suggests rather surprisingly the lanthanum - oxygen bonds to be covalent in character as BOP values larger than $0.4$ are consistent with significant covalent character. This effect is attributed to lithium pulling weakly on the electrons of oxygen and hydrogen, allowing lanthanum to form covalent bonding. Hence the BOP is closer to zero for the lithium - oxygen and lithium - hydrogen bonds. The negative value for the Li-H and Li-O2 bonds represents an ionic character of the bonds.\n\nTo gain more information about the bonding character in $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$, we turned our attention to charge-density and charge transfer analysis (Figure 3). The non-spherical charge distribution around La and O1 again clearly supports a noticeable covalent character for the bond. On the other hand the spherical charge distribution around $\\mathrm{Li}, \\mathrm{O} 2$ and $\\mathrm{H}$ indicates a more \"ideal\" form of ionic bonding. The charge transfer plot (the difference between the electron density of the compound and the electron density of the constituent atoms) provides a clear visualization of how the chemical bonding is formed in real space (Figure 3). It is clear that electrons are transferred from lithium and lanthanum to oxygen and hydrogen, hence there is considerable ionic bonding component present between lithium and oxygen/hydrogen. Due to the sizeable covalent bonding, the charge depletion at the lanthanum site is not spherically symmetric and finite electron density is present in between lanthanum and oxygen, hence the highest degree of covalent bonding is to be found in the rock salt layer. In conclusion, the bonding character in $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ is highly anisotropic. The rock salt layer and the perovskite layer have a covalent- and ionic character respectively, giving mixed polar-covalent bonding situation.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-12_1000_1710_234_698}\n\\end{center}\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-12_1020_1712_693_804}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-12_1015_1706_993_1218}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-12_1019_1708_1251_1519}\n\\end{center}\n\n(d)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-12_1015_1706_1518_1778}\n\\end{center}\n\n(e)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-12_1022_1704_1774_1900}\n\\end{center}\n\n$\\operatorname{ion}(b$\n\nFigure 3: Calculated valence electron volumetric charge density (a), charge density distribution (b and d) and charge transfer (c and e) plot for $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ (all units are in e).\n\n\\section{Hydride migration}\nOur DFT model was further used to perform cNEB calculations to study the migration pathways in $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$. Several migration pathways for hydride and oxide anion migration have been considered and the barrier heights are listed in Table 2 and illustrated in Figure 4, whereas the minimal energy paths are visualized in Figure 5 and Figure S3. The lowest barrier height for hydride migration was found to be between the $\\mathrm{O} 1$ and the $\\mathrm{H}$ position, i.e. in-plane migration, with a barrier height of $0.68 \\mathrm{eV}$. Migration directly between two $\\mathrm{H}$-positions has a higher barrier height of $8.10 \\mathrm{eV}$, largely due to the long distance between these positions. Hydride anions diffusing inplane will then not move directly between two hydride positions, but rather by the corner-sheared positions where the octahedrons are connected.\n\nTable 2: The considered migration pathways considered. Migration distances, involved sites and calculated migration barrier heights (in eV) for migration in the $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ lattice are listed. The path number corresponds to the paths illustrated in Figure 4. RS refers to the rock salt layer.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-13_1039_2202_259_1888}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-14_241_1011_236_1840}\n\\end{center}\n\nFigure 4: Sketch of the considered migration pathways in $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$. The attoms are lanthanum (green), lithium (purple), hydrogen (white) and oxygen (red). Distances and barrier heights are summarized in Table 2 and minimal energy pathways are illustrated in Figure 5 and Figure S3. The dashed circles are interstitial hydride anions in the rock salt layer (both interstitial positions in the figure are equivalent).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_01b9cdba467fd7882e42g-14_1557_2237_239_1068}\n\\end{center}\n\nFigure 5: Minimal energy path from cNEB calculation of selected migration paths, the other paths are illustrated in Figure S3. The paths are described in Table 2 and illustrated in Figure 4. The lowest energy pathway for hydride migration was seen to be between the $\\mathrm{O} 1$ and $\\mathrm{H}$ position in the perovskite layer. This is also consistent with the fact that Fjellvåg et al. found that all vacancies in the oxidized derivative of the oxyhydride, $\\mathrm{La}_{2} \\mathrm{LiO}_{3.5}$, were positioned at the equatorial oxygen position, with none being present on the axial oxygen position. ${ }^{4}$ This indicates that during oxidation, the hydride anions were transported through the material by this path, forming anion vacancies.\n\nThe rock salt layer in $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ has vacant tetrahedral sites, therefore hydride migration into and within the rock salt layer has been considered as a potential pathway. In particular, previous reports have suggested that interstitial oxide positions in the rock salt layer are the dominant transport mechanisms for oxide anions migration in the two $\\mathrm{RP} \\mathrm{n}=1$ oxides $\\mathrm{La}_{2} \\mathrm{CoO}_{4}$ and $\\mathrm{La}_{2} \\mathrm{NiO}_{4},{ }^{13-15}$ and in the $\\mathrm{RP} \\mathrm{n}=3 \\mathrm{La}_{4} \\mathrm{Co}_{3} \\mathrm{O}_{10} .{ }^{16}$ This migration pathway was anticipated to be favorable due to the open space in the structure and the similar atomic arrangement in the rock salt layer as in $\\mathrm{La}_{2} \\mathrm{CoO}_{4}, \\mathrm{La}_{2} \\mathrm{NiO}_{4}$ and $\\mathrm{La}_{4} \\mathrm{Co}_{3} \\mathrm{O}_{10}$. Remarkably however, this pathway was found to be less favorable with barrier heights of $2.9 \\mathrm{eV}$ for migration into the rock salt layer and $2.0 \\mathrm{eV}(\\mathrm{x}-$ direction) and $1.93 \\mathrm{eV}$ (y-direction) for migration within the rock salt layer. We believe that the unexpectedly high barrier heights for migration into and within the rock salt layer for the hydride anion can be explained by the covalent character of the lanthanum - oxygen bonds. The covalent character of these bonds creates channels of electron density in the structure preventing hydride anions from migrating into and within the rock salt layer. This hindrance for migration into the rock salt layer, results in the in-plane migration becoming the more favorable energy pathway for hydride migration.\n\nThis striking finding has led us to question what the main differences between $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ and the oxide conducting $\\mathrm{La}_{2} \\mathrm{NiO}_{4}, \\mathrm{La}_{2} \\mathrm{CoO}_{4}$ and $\\mathrm{La}_{4} \\mathrm{Co}_{3} \\mathrm{O}_{10}$ are, and what aspects promote a covalent character in the rock salt layer (thus hindering ion mobility). The first clear difference is in the charge and electronegativity of the octahedral coordinated B-site cation (lithium versus nickel and cobalt). The second is in the basal plane of the octahedron in $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ there are two hydride anions, partly binding to the lanthanum cations. The more ionic lithium - oxygen bonding may strengthen covalent lanthanum - oxygen interactions in the rock salt layer. Likewise the more ionic lanthanum - hydrogen interactions may have a similar impact on the lanthanum - oxygen bonding. These considerations are strong indications that the hydride/oxide anion conductivity in the rock salt layer may be tuned by adequate choices of A and B site cations to give lower degree of covalent bonding in the rock salt layer. This idea can act as guiding principle for synthesis of novel functional oxyhydrides. From these guidelines we thus propose $\\mathrm{Ba}_{2} \\mathrm{MgH}_{2} \\mathrm{O}_{2}$ and $\\mathrm{Sr}_{2} \\mathrm{MgH}_{2} \\mathrm{O}_{2}$ as promising oxyhydride candidates for improved hydride conductivity. We justify this statement on the basis that magnesium at the B-site provides similar bonding conditions as nickel and cobalt in $\\mathrm{La}_{2} \\mathrm{NiO}_{4}$ and $\\mathrm{La}_{2} \\mathrm{CoO}_{4}$. This action should tune the bonding in the rock salt layer to be more ionic due to higher charge density of magnesium compared to lithium, and ergo facilitate transport in the layer.\n\nFinally, the migration properties for the oxide anions have been considered. The lowest barrier height migration pathway for the oxide anions was found to be $1.20 \\mathrm{eV}$ for the in-plane migration between the $\\mathrm{H}$ and $\\mathrm{O} 1$ position, similar as the favorable hydride migration pathway $(0.68 \\mathrm{eV})$. The fact that all barrier heights for oxide migration are higher than that for hydride migration is compelling evidence that $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$ is indeed a hydride conductor, where migration of hydride anions is the dominant anionic transport mechanism.\n\nIn summary, we have discussed the microscopic underpinnings of the vibrations, bonding and migration, through the use of an experimentally validated DFT model. Further, these microscopic features provide a fully consistent story of the structure and dynamics, which gives us great confidence in the chosen model. Several different charge density analyses of the bonding have all shown the perovskite layer to be dominated by ionic bonding, while the rock salt layer is characterized by covalent bonding. Crucially, this covalent character of the bonding in the rock salt layer is seen to hinder hydride migration into and within the rock salt layer which in other similar structures has been shown to be the favorable anion migration path. The result of this revelation is that in-plane migration of hydride anions becomes the favorable migration pathway and the dominant anionic transport mechanism with a barrier height of $0.68 \\mathrm{eV}$. This insight into the precise bonding mechanisms and its resultant effects on the hydride migration provide us with an intelligent design principle which has allowed us to propose $\\mathrm{Ba}_{2} \\mathrm{MgH}_{2} \\mathrm{O}_{2}$ and $\\mathrm{Sr}_{2} \\mathrm{MgH}_{2} \\mathrm{O}_{2}$ as new materials which we anticipate to have drastically improved hydride transport properties.\n\n\\section{Associated content}\n\\section{Supporting Information}\nExperimental methods, including sample synthesis, structural and spectroscopic characterization, as well as computational methods. List of calculated Raman frequencies, crystallographic information from Rietveld refinement, calculated formation energies, calculated BEC, complete list of Bader analysis, structural parameters from DFT, comparison of calculated INS spectra with different functionals, Rietveld refinement of $\\mathrm{La}_{2} \\mathrm{LiHO}_{3}$, calculated total and site projected phonon density of states and electron density map.\n\n\\section{Author Information}\n*E-mail: \\href{mailto:jeff.armstrong@stfc.ac.uk}{jeff.armstrong@stfc.ac.uk}\n\n\\section{Acknowledgements}\nThis work is a part of the FOXHOUND project funded by The Faculty of Mathematics and Natural Sciences, University of Oslo via the Strategic Research Initiative program. The authors gratefully acknowledge the use of the Norwegian Center for X-ray Diffraction, Scattering and Imaging (RECX) and gratefully acknowledge ISIS neutron and muon source for beamtime (TOSCA instrument). PV and ØSF acknowledges the Research Council of Norway for providing the computer time (under the project number NN2875k) at the Norwegian supercomputer.\n\nNotes:\n\nThe authors declare no competing financial interest.\n\n\\section{References}\n\\begin{enumerate}\n  \\item Hayward, M. A.; Cussen, E. J.; Claridge, J. B.; Bieringer, M.; Rosseinsky, M. J.; Kiely, C.\n\\end{enumerate}\n\nJ.; Blundell, S. J.; Marshall, I. M.; Pratt, F. L., The Hydride Anion in an Extended Transition Metal Oxide Array: LaSrCoO3H0.7. Science 2002, 295, 1882-1884.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{1}\n  \\item Kobayashi, G.; Hinuma, Y.; Matsuoka, S.; Watanabe, A.; Iqbal, M.; Hirayama, M.; Yonemura, M.; Kamiyama, T.; Tanaka, I.; Kanno, R., Pure H-conduction in oxyhydrides. Science 2016, 351, 1314-1317.\n\n  \\item Schwarz, H., Neuartige Hydrid-Oxide der Seltenen Erden: Ln2LiHO3 mit Ln = La, Ce, Pr und Nd. Karlsruhe, 1991.\n\n  \\item Fjellvåg, Ø. S.; Armstrong, J.; Sławiński, W. A.; Sjåstad, A. O., Thermal and Structural Aspects of the Hydride-Conducting Oxyhydride La2LiHO3 Obtained via a Halide Flux Method. Inorg. Chem. 2017, 56, 11123-11128.\n\n  \\item Zhang, J.; Gou, G.; Pan, B., Study of Phase Stability and Hydride Diffusion Mechanism of BaTiO3 Oxyhydride from First-Principles. J. Phys. Chem. C 2014, 118, 17254-17259.\n\n  \\item Liu, X.; Bjorheim, T. S.; Haugsrud, R., Formation and migration of hydride ions in BaTiO3-xHx oxyhydride. J. Mater. Chem. A 2017, 5, 1050-1056.\n\n  \\item Ke, X.; Kuwabara, A.; Tanaka, I., Cubic and orthorhombic structures of aluminum hydride AlH3 predicted by a first-principles study. Phys. Rev. B 2005, 71, 184107.\n\n  \\item Vajeeston, P.; Ravindran, P.; Fjellvåg, H., Phonon, IR, and Raman Spectra, NMR Parameters, and Elastic Constant Calculations for AlH3 Polymorphs. J. Phys. Chem. A 2011, 115, $10708-10719$ 9. Wang, C.-Z.; Yu, R.; Krakauer, H., First-principles calculations of phonon dispersion and lattice dynamics in La2CuO4. Phys. Rev. B 1999, 59, 9278-9284.\n\n  \\item Fajans, K., II. Die Eigenschaften salzartiger Verbindungen und Atombau. In Zeitschrift für Kristallographie - Crystalline Materials, 1924; Vol. 61, p 18.\n\n  \\item Fajans, K., Struktur und Deformation der Elektronenhüllen in ihrer Bedeutung für die chemischen und optischen Eigenschaften anorganischer Verbindungen. Naturwissenschaften 1923, $11,165-172$.\n\n  \\item Fajans, K.; Joos, G., Molrefraktion von Ionen und Molekülen im Lichte der Atomstruktur. Zeitschrift für Physik 1924, 23, 1-46.\n\n  \\item Minervini, L.; Grimes, R. W.; Kilner, J. A.; Sickafus, K. E., Oxygen migration in LaNiO. J. Mater. Chem. 2000, 10, 2349-2354.\n\n  \\item Kushima, A.; Parfitt, D.; Chroneos, A.; Yildiz, B.; Kilner, J. A.; Grimes, R. W., Interstitialcy diffusion of oxygen in tetragonal La2CoO4+[small delta]. Phys. Chem. Chem. Phys. $2011,13,2242-2249$.\n\n  \\item Cleave, A. R.; Kilner, J. A.; Skinner, S. J.; Murphy, S. T.; Grimes, R. W., Atomistic computer simulation of oxygen ion conduction mechanisms in La2NiO4. Solid State Ionics 2008, $179,823-826$.\n\n  \\item Nagell, M. U.; Sławiński, W. A.; Vajeeston, P.; Fjellvåg, H.; Sjåstad, A. O., Temperature induced transitions in $\\operatorname{La} 4(\\mathrm{Co} 1-\\mathrm{xNix}) 3 \\mathrm{O} 10+\\delta$; oxygen stoichiometry and mobility. Solid State Ionics 2017, 305, 7-15.\n\n\\end{enumerate}\n\n\\end{document}", "record_id": "2023_09_22_01b9cdba467fd7882e42g"}