{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Original citation: }\n\n\\author{}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nGe, Aimin, Rudshteyn, Benjamin, Zhu, Jingyi, Maurer, Reinhard J., Batista, Victor S. and Lian, Tianquan. (2017) Electron-hole-pair-induced vibrational energy relaxation of rhenium catalysts on gold surfaces. Journal of Physical Chemistry Letters.\n\n\\section{Permanent WRAP URL:}\n\\href{http://wrap.warwick.ac.uk/96296}{http://wrap.warwick.ac.uk/96296}\n\n\\section{Copyright and reuse:}\nThe Warwick Research Archive Portal (WRAP) makes this work by researchers of the University of Warwick available open access under the following conditions. Copyright (C) and all moral rights to the version of the paper presented here belong to the individual author(s) and/or other copyright owners. To the extent reasonable and practicable the material made available in WRAP has been checked for eligibility before being made available.\n\nCopies of full items can be used for personal research or study, educational, or not-for profit purposes without prior permission or charge. Provided that the authors, title and full bibliographic details are credited, a hyperlink and/or URL is given for the original metadata page and the content is not changed in any way.\n\n\\section{Publisher's statement:}\n\"This document is the Accepted Manuscript version of a Published Work that appeared in final form in Journal of Physical Chemistry Letters copyright @ American Chemical Society after peer review and technical editing by the publisher.\n\nTo access the final edited and published work\n\n\\href{http://pubs.acs.org/page/policy/articlesonrequest/index.html}{http://pubs.acs.org/page/policy/articlesonrequest/index.html} .\"\n\n\\section{A note on versions:}\nThe version presented here may differ from the published version or, version of record, if you wish to cite this item you are advised to consult the publisher's version. Please see the 'permanent WRAP URL above for details on accessing the published version and note that access may require a subscription.\n\nFor more information, please contact the WRAP Team at: \\href{mailto:wrap@warwick.ac.uk}{wrap@warwick.ac.uk}\n\n\\section*{Electron-Hole-Pair-Induced Vibrational Energy }\n\\section{Relaxation of Rhenium Catalysts on Gold Surfaces}\n\\textbackslash author\\{\\\\\nAimin Ge, ${ }^{(1), \\dagger}$ Benjamin Rudshteyn, ${ }^{(2),(3),+}$ Jingyi Zhu, ${ }^{(1), \\#}$ Reinhard J. Maurer, ${ }^{(2),(4), *}$ Victor $S$. \\textbackslash  Batista, ${ }^{(2),(3),{ }^{*}}$ and Tianquan Lian ${ }^{(1), *}$ \\textbackslash  ${ }^{(1)}$ Department of Chemistry, Emory University, Atlanta, GA 30322, United States.\n\n\\includegraphics[max width=\\textwidth]{2023_09_22_e69f3d7ce6c4ff487115g-02_1152_1212_348_1777} \\textbackslash  ${ }^{(3)}$ Yale Energy Sciences Institute, Yale University, West Haven, CT 06516, United States. \\textbackslash  ${ }^{(4)}$ Department of Chemistry, University of Warwick, Gibbet Hill Road, Coventry CV4 7AL, \\textbackslash  United Kingdom\\\\\n\\}\n\n\\section{AUTHOR INFORMATION}\n\\section{Corresponding Author}\n*R.J.M.: \\href{mailto:r.maurer@warwick.ac.uk}{r.maurer@warwick.ac.uk} (+44 (024) 7652 3228); *V.S.B.: \\href{mailto:victor.batista@yale.edu}{victor.batista@yale.edu} (203-432-6672); *T.L.: \\href{mailto:tlian@emory.edu}{tlian@emory.edu} (404-727-6649);\n\n\\begin{abstract}\nA combination of time-resolved vibrational spectroscopy and density functional theory techniques have been applied to study the vibrational energy relaxation dynamics of the $\\operatorname{Re}(4,4$ '-dicyano-2,2'-bipyridine $)(\\mathrm{CO})_{3} \\mathrm{Cl}\\left(\\mathrm{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}\\right)$ catalyst for $\\mathrm{CO}_{2}$ to $\\mathrm{CO}$ conversion bound to gold surfaces. The kinetics of vibrational relaxation exhibits a biexponential decay including an ultrafast initial relaxation and complete recovery of the ground vibrational state. Ab initio molecular dynamics simulations and time-dependent perturbation theory reveal the former to be due to vibrational population exchange between CO stretching modes and the latter to be a combination of intramolecular vibrational relaxation (IVR) and electron-hole pair (EHP) induced energy transfer into the gold substrate. EHP-induced energy transfer from the $\\mathrm{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ adsorbate into the gold surface occurs at the same timescale as IVR of $\\mathrm{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ in aprotic solvents. Therefore, it is expected to be particularly relevant to understanding the reduced catalytic activity of the homogeneous catalyst when anchored on a metal surface.\n\\end{abstract}\n\n\\section*{TOC GRAPHIC }\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e69f3d7ce6c4ff487115g-03_1606_2086_858_1343}\n\\end{center}\n\nUnderstanding vibrational relaxation mechanisms of molecular catalysts on solid surfaces is important for optimizing the efficiency of heterogenized systems for a variety of applications including proton reduction, ${ }^{1}$ olefin metathesis, ${ }^{2} \\mathrm{CO}_{2}$ reduction, ${ }^{1,}{ }^{3-11}$ and water oxidation. ${ }^{12-16}$ Three pathways including intramolecular vibrational relaxation (IVR), intermolecular relaxation, and energy transfer to the solid surface, either via phonon or via electron-hole pair (EHP) coupling may contribute to the vibrational relaxation dynamics of adsorbed catalysts. ${ }^{17-20}$ In comparison with homogeneous catalysts, molecule-substrate interactions may significantly affect vibrational energy transfer pathways, reactivity, and the stability of intermediates. A detailed understanding of the effect of the surface on catalytic activity is urgently needed to understand the functionality of heterogenized vs. homogeneous catalysts. 2, 7, 12, 15-16, 21-24\n\nRhenium bipyridyl tricarbonyl complexes have been reported to be electro- and photocatalysts for $\\mathrm{CO}_{2}$ reduction in both homogenous and heterogeneous systems. ${ }^{25-30}$ In recent years, many efforts have been devoted to develop heterogeneous catalysts by immobilizing these catalysts on various solid surfaces, aiming for the potential benefits of reduced catalyst loading, convenient separation, and simplicity of scale-up in reactors. $1,4-5,8-10,31$ Due to its inherent surfacesensitivity, time-resolved vibrational sum frequency generation (TR-SFG) spectroscopy has been demonstrated to be an ideal tool to investigate vibrational dynamics of various interfaces. ${ }^{32-37}$ TR-SFG probes have been employed to study the vibrational dynamics of rhenium catalysts tethered to gold surfaces through an alkane thiol spacer. ${ }^{38}$ The negligible substrate effect was attributed to the spacer that hindered energy transfer from the catalyst to the gold surface. ${ }^{38}$ TRSFG studies of these catalysts adsorbed on $\\mathrm{TiO}_{2}$ single crystals revealed that the relaxation time is dependent on the crystallographic facets. ${ }^{39-40}$ 2D-SFG studies were reported to investigate couplings between $\\mathrm{CO}$ modes of rhenium catalyst and image dipoles of gold surface ${ }^{41}$ and structural heterogeneity of the catalyst monolayer on $\\mathrm{TiO}_{2}$ thin film surface. ${ }^{42}$ A 2D-IR study on silica on a related compound showed a significant decrease in the relaxation times relative to the equivalent in solution. ${ }^{6}$ In addition, surface sensitive 2D-IR techniques ${ }^{43}$ have been also used to study structural dynamics, ${ }^{6,44}$ molecular aggregation, ${ }^{45-46}$ and intermolecular energy transfer ${ }^{47}$ for rhenium catalysts covalently adsorbed onto solids. The results of these studies are summarized in Section 5 and Table S5 in the SI. ${ }^{6,38-41,44,48-49}$\n\nHerein, we have investigated the vibrational relaxation mechanism of $\\operatorname{Re}\\left(4,4^{\\prime}\\right.$-dicyano-2,2'bipyridine $)(\\mathrm{CO})_{3} \\mathrm{Cl}\\left(\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}\\right)$ in various environments by time-resolved vibrational spectroscopies and theoretical calculations. IR pump-SFG probe was employed to investigate the vibrational relaxation dynamics of the $\\mathrm{C} \\equiv \\mathrm{O}$ stretches of the catalyst molecules bound to a gold surface. For comparison, IR pump-IR probe was employed to explore solvent effects on the relaxation rates. By directly calculating the relaxation rates due to EHP using dispersioninclusive density functional theory (DFT), ${ }^{19-20}$ we find that direct adsorption on a gold surface induces vibrational relaxation of the same time scale as IVR. The energy dissipation occurs through a stretching of a CO not covalently attached to the surface, coexisting with IVR from the carbonyl modes, as confirmed by molecular dynamics (MD). To our knowledge, our study represents the first calculation of EHP-induced vibrational relaxation for a molecular catalyst. The reported calculations showcase that EHP-induced vibrational energy cooling can occur at time scales that are relevant to the catalytic function of the adsorbate molecule and may therefore open avenues to control catalytic activity.\n\nFigure 1 shows an IR absorption spectrum of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ in MeCN. The spectrum is dominated by three $\\mathrm{C} \\equiv \\mathrm{O}$ stretching modes at 2026, 1926, and $1909 \\mathrm{~cm}^{-1}$, the in-phase symmetric stretch (A'(1)), antisymmetric stretch (A\"), and out-of-phase symmetric stretch (A'(2)), respectively. ${ }^{7}$ Similar spectra are observed for the catalyst in acetone and DMF, also shown in Figure 1. For $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ adsorbed on gold, the SFG spectrum is dominated by one peak around $2025 \\mathrm{~cm}^{-1}$ and one broad band between 1850 and $1950 \\mathrm{~cm}^{-1}$ (Fig. 1). ${ }^{7}$ The opposite spectral shapes between the high- and low-frequency modes, which result from the interference with the nonresonant gold signal, are in accord with the heterodyne-SFG measurements for the rhenium catalyst on gold and $\\mathrm{TiO}_{2}{ }^{41-42,50}$ The binding structure of the catalyst is similar to that in our previous work. ${ }^{7}$\n\nFigure 1 (panels $b$ and c) show the resulting optimized geometry of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$, as obtained using DFT with the PBE+vdW surf functional. ${ }^{51-52}$ We find that $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ binds to the $\\mathrm{Au}$ surface with an adsorption energy of $1.56 \\mathrm{eV}$. The cyano group $\\mathrm{N}$ and axial carbonyl $\\mathrm{O}$ are $2.95$ $\\AA$ and $2.69 \\AA$ from the surface, respectively. The resulting three-carbonyl stretching modes are shown in Figure 2. The increased amplitude of the CO stretching displacement relative to those parallel to the bipyridine ring in mode $A^{\\prime}(2)$ has interesting consequences for vibrational relaxation rates (vide infra). The normal mode vectors are not significantly perturbed by the presence of the surface as shown in Table S2.\\\\\n\\includegraphics[max width=\\textwidth]{2023_09_22_e69f3d7ce6c4ff487115g-06_1889_2477_304_1914}Figure 1. (a) Representative ppp-polarized SFG spectrum of a monolayer of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ adsorbed on a Au thin-film surface, and IR spectra of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ solutions of MeCN, acetone, and DMF; (b) and (c) geometry of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ on $\\mathrm{Au}(111)$,. The blue line indicates the vertical Au layer-N distance, the red line indicates the vertical Au layer-O distance, and the black angle indicates the angle of the ring to the normal of the surface. Color code: blue $=\\mathrm{N}$, red $=\\mathrm{O}$, brown $=\\mathrm{Cl}$, purple $=\\mathrm{Re}$, black $=\\mathrm{C}$, white $=\\mathrm{H}$, brown $=\\mathrm{Au}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e69f3d7ce6c4ff487115g-07_932_1317_239_743}\n\\end{center}\n\n$a^{\\prime}(2): 1883 \\mathrm{~cm}^{-1}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e69f3d7ce6c4ff487115g-07_932_1317_801_1302}\n\\end{center}\n\n$a^{\\prime \\prime}: 1977 \\mathrm{~cm}^{-1}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e69f3d7ce6c4ff487115g-07_928_1316_1382_1886}\n\\end{center}\n\n$a^{\\prime}(1): 2028 \\mathrm{~cm}^{-1}$\n\nFigure 2. $\\mathrm{CO}$ stretching vibrational modes of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ on the surface with displacements shown in black for $\\mathrm{C}$ and in red for $\\mathrm{O}$ (set to be relative to the largest atomic displacement), a green square highlighting the axial $\\mathrm{CO}$, and the $a b$ initio frequencies given underneath.\n\nFigure 3a shows the TR-SFG spectra of the three CO stretches for the monolayer of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ on the Au/air interface. At early delay times, the TR-SFG spectra consist of instantaneous ground state bleach and stimulated emission (GSB/SE) of the A'(1) mode at 2028 $\\mathrm{cm}^{-1}$ and a corresponding excited state absorption (ESA) at $\\sim 2010 \\mathrm{~cm}^{-1}$ (Table S1). At longer delay times, both the recovery of the GSB/SE and the decay of the ESA were observed on similar time scales. The spectra at the lower frequency region are not well resolved due to the overlap between the $\\mathrm{A}^{\\prime \\prime}$ and $\\mathrm{A}^{\\prime}(2)$ modes. Spectral fitting results show the frequencies of GSB/SE for $A^{\\prime \\prime}$ and $A^{\\prime}(2)$ are around $1940 \\mathrm{~cm}^{-1}$, while those of ESA for these two modes are around $1895 \\mathrm{~cm}^{-1}$ (Table S1). The GSB/SE and ESA for the high-frequency and low-frequency modes have opposite signs due to the phase difference as mentioned above. The recovery of the GSB/SE and the decay of the ESA at low-frequency region show similar time scales as those at the high-frequency region, indicating relaxation of the catalyst molecules back to the ground vibrational state.\n\nDue to interference between the resonant and nonresonant signals, the present TR-SFG data show complicated spectral shape. ${ }^{41-42}$ The explicit expression of the TR-SFG spectra is given in Eq. S7. Based on this expression, the change of SFG intensity is found to be linearly dependent on the population change of the vibrational states, which simplifies the analysis (Eq. S10). Figure 3b shows the kinetics of the GSB/SE and ESA for the A'(1) mode as well as GSB/SE for lowfrequency modes, well described by an instantaneous rise and biexponential decay. The biexponential decay kinetics for the A'(1) mode consists of a fast component ( $\\left.\\tau_{v-\\nu}=\\sim 2 \\mathrm{ps}, \\sim 20 \\%\\right)$ and a slow component ( $\\left.\\mathrm{T}_{1}=25 \\pm 2 \\mathrm{ps}, \\sim 80 \\%\\right)$, which have been observed for similar rhenium catalysts attached to surfaces. ${ }^{38,} 40,47,53$ The fast component with smaller amplitude can be attributed to the rapid population equilibration between different carbonyl stretching modes, followed by slow recovery of the ground state in tens of picoseconds. ${ }^{38,40}$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_e69f3d7ce6c4ff487115g-09_286_1354_272_1798}\n\nFigure 3. (a) Normalized TR-SFG difference spectra of CO stretching modes for the $\\mathrm{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ monolayer on gold surface at the indicated averaged delay times; (b) kinetics at $2021 \\mathrm{~cm}^{-1}$ (GSB/SE for A'(1)), $1991 \\mathrm{~cm}^{-1}$ (ESA for $A^{\\prime}(1)$ ), and $1920 \\mathrm{~cm}^{-1}$ (GSB/SE for low-frequency modes); (c) TR-IR absorption spectra of CO stretching modes of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ in MeCN at indicated averaged delay times; and (d) kinetics at indicated frequencies. Symbols represent experimental data; solid curves represent fits.\n\nFor comparison, we carried out TR-IR measurements for $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ in three polar aprotic solvents and we analyzed the dependence of vibrational relaxation rates on the solvent. Figure 3c shows the transient IR absorption spectra of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ in acetonitrile (MeCN) under IR excitation at different delay times. The negative bands at $2029 \\mathrm{~cm}^{-1}$ and positive bands at 2009 $\\mathrm{cm}^{-1}$ are attributed to GSB/SE and ESA of the A'(1) mode, respectively. Similarly, the signals at lower frequency are attributed to GSB/SE and ESA of the A\" and A'(2) modes, respectively. For the different GSB/SE and ESA patterns between TR-IR and TR-SFG spectra, there are two causes. First, the IR spectra are contributed from the imaginary part of $\\chi^{(3)}$, while the SFG spectra contains both real and imaginary parts of $\\chi^{(4)}$. Second, SFG signal is influenced by the molecular orientation of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ on gold surface. Figure $3 \\mathrm{~d}$ shows the transient kinetics fitted by a biexponential decay. The $T_{1}$ lifetime of the $A^{\\prime}(1)$ mode, which is used for further analysis, is found to be $30 \\mathrm{ps}$. The $\\mathrm{T}_{1}$ lifetime of the $\\mathrm{A}^{\\prime}(1)$ mode is found to be $23 \\mathrm{ps}$ in acetone and $25 \\mathrm{ps}$ in dimethylformamide (DMF), respectively (Table 1, SI). The $T_{1}$ lifetimes of the A\"/A'(2) modes, which is close to that of $A^{\\prime}(1)$ mode, are also listed in the Table 1 . The present results also show that $\\tau_{v-v}$ for $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ in bulk solution is shorter than that of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl} / \\mathrm{Au}$. As shown in Figures S3 and S4, the transient IR absorption spectra have similar features as those in MeCN except the GSB/SE signals for the A\" and A'(2) modes that are more separated.\n\nTable 1. $\\tau_{v-v}$ and $T_{1}$ Lifetimes of the $A^{\\prime}(1)$ and $A^{\\prime \\prime} / A^{\\prime}(2)$ Modes for $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ in Different Environments.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e69f3d7ce6c4ff487115g-10_1638_2205_212_1913}\n\\end{center}\n\nTable S3 provides the frequencies of the molecule in each solvent. Since these frequencies are not in resonance with the carbonyl stretches in the molecule, direct energy transfer to solvent is unlikely. More likely is that IVR is sped up coupling to low frequency modes in the solvent to make up for frequency mismatch between modes in the molecule..$^{54-55}$\n\nTable 2. Computed Relaxation Lifetime for the Three CO Stretching Modes with the Frequencies for Both the Molecule attached to Gold and in Vacuum.\n\n\\begin{center}\n\\begin{tabular}{lllll}\n\\hline\nSystem & Mode & Method & Lifetime / ps Unsca &  \\\\\nGold & A'(2) & EHP & $12.6$ & 1883 \\\\\nFrequertd A', & EHP & 956 & 1977 &  \\\\\nGold & A &  & 2028 &  \\\\\nGold & A'(1) & EHP & 180 & 1943 \\\\\nVacuum A'(2) & IVR & $22.9 \\pm 6.3$ & 1966 &  \\\\\nVacuum A', & IVR & $35.4 \\pm 13.3$ & 196 &  \\\\\nVacuum A'(1) & IVR & $22.9 \\pm 10.1$ & 2026 &  \\\\\n\\end{tabular}\n\\end{center}\n\nThe most striking feature of Table 1 is the similarity of vibrational lifetime between $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl} / \\mathrm{Au}$ and $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ in solvents, unlike previous results for $\\operatorname{RePhen}(\\mathrm{CO})_{3} \\mathrm{Cl}$ and $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$, typically on semiconductor surfaces (Section 5 and Table S5 in the SI). There are three possible mechanisms for vibrational relaxation of the $\\mathrm{Re}(\\mathrm{CO})_{3} \\mathrm{Cl} / \\mathrm{Au}$ system (in the absence of solvent): intramolecular vibrational relaxation to non-carbonyl modes ( $T_{\\text {Intra }}$ ), coupling to phonons (T $\\left.T_{\\text {Phonon }}\\right)$, and direct energy transfer to the substrate via EHP (TEHP), as indicated in Eq. (1):\n\n\\[\n\\frac{1}{T_{1}}=\\frac{1}{T_{\\text {Intra }}}+\\frac{1}{T_{\\text {Phomon }}}+\\frac{1}{T_{E H P}}\n\\]\n\nThe equivalent mechanisms in the presence of solvent are indicated in Eq. (2), where $T_{\\text {inter }}$ indicates intermolecular vibrational relaxation of the carbonyl modes to the solvent.\n\n\\[\n\\frac{1}{T_{1}}=\\frac{1}{T_{\\text {Intra }}}+\\frac{1}{T_{\\text {Inter }}}\n\\]\n\nThe faster full recovery of the $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl} / \\mathrm{Au}$ ground state, compared to the recovery of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl} / \\mathrm{CH}_{3} \\mathrm{CN}$, suggests that the substrate likely contributes to vibrational relaxation. While $\\left[\\operatorname{Re}\\left(\\right.\\right.$ bipy- $\\left.\\left(\\mathrm{OCO}-\\left(\\mathrm{CH}_{2}\\right)_{11} \\mathrm{~S}\\right)_{2}(\\mathrm{CO})_{3}(\\mathrm{Cl})\\right] / \\mathrm{Au} \\quad$ and $\\quad\\left[\\operatorname{Re}(\\text { bipy-COOH })_{2}(\\mathrm{CO})_{3}(\\mathrm{Cl})\\right] / \\mathrm{DMF}$ exhibited nearly identical kinetics when bound to the Au surface by long alkyl chains $(\\sim 10 \\AA){ }^{38}$ the $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ is now much closer to the Au surface. Since covalently bonded alkyl chains should yield a stronger coupling to surface phonons than physisorbed molecules, it is unlikely that TPhonon yields a large contribution to the relaxation, since the kinetics of the chemisorbed and physisorbed systems were similar, which only leaves $T_{E H P}$ as a potentially important contribution besides $T_{I V R}$.\n\nTo study the effect of $T_{E H P}$ on $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl} / \\mathrm{Au}$, we calculated EHP-induced relaxation rates using time dependent perturbation theory (TDPT) on the basis of our DFT calculations, as described in the theoretical methods section. ${ }^{19-20}$ The corresponding relaxation lifetimes (rates) in Table 2 (Table S4) show that only the A'(2) mode has a lifetime comparable to the experimental value (25 ps), although our calculations seem to overestimate EHP. Therefore, we conclude that nonadiabatic vibrational relaxation occurs mostly through the A'(2) stretch. Figure 2 explains the overall trend: $A^{\\prime}(2)$ relaxes faster since the axial $C O$ is close to the surface during the displacement, enhancing the orbital overlap; A\" relaxes slowest since the axial CO is barely displaced at all; and $\\mathrm{A}^{\\prime}(2)$ relaxes somewhere in between. Our results suggest that EHP can contribute to vibrational relaxation on the same time scale as IVR. To compare EHP and IVR, we have performed MD simulations of IVR of $\\mathrm{Re}(\\mathrm{CO})_{3} \\mathrm{Cl}$ in the gas-phase. The results, shown in Table 2, suggest that both of these processes contribute significantly to the vibrational relaxation of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl} / \\mathrm{Au}$, and neither effect can be ruled out. Similarly in solution, while solvent induced effects could be estimated using force field MD simulations, ${ }^{56}$ typically direct energy transfer can occur on the same timescale of about $10 \\mathrm{ps},{ }^{57-60}$ so it is difficult to disentangle from solvent-mediated IVR, which can occur on the timescale of about 1 ps. $^{54,61-65}$\n\nThe reported results provide fundamental understanding of energy transfer that may limit the effectiveness of catalysts mounted on metals. Diminished vibrational lifetimes due to EHPs will negatively affect the ability to modify bonds. As EHP effects lead to mode-selective and localized energy transfer between adsorbates and the surface under ambient conditions, the reverse process could be observed upon excitation of the substrate, serving as a new pathway for plasmonic enhancement of catalytic activity. ${ }^{66-68}$ We have observed similar mode-selective energy transfer in the dissociative chemisorption of $\\mathrm{H}_{2}$ onto Ag(111) surfaces. ${ }^{69}$\n\nIn summary, we have applied time-resolved SFG spectroscopy and DFT to study vibrational relaxation dynamics of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl} / \\mathrm{Au}$. The kinetics of vibrational relaxation were found to exhibit biexponential decays including an ultrafast initial relaxation associated with fast population transfer between carbonyl stretches and a complete recovery of the ground vibrational state, dominated by a combination of nonadiabatic relaxation due to excitation of EHP in the metal and IVR. $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl} /$ Au system exhibits a similar $\\mathrm{T}_{1}$ to those of the catalyst in vacuo and in solvents, which indicates that coordination to gold induces EHP-mediated vibrational relaxation on the same scale as (solvent-mediated) IVR. EHP-mediated energy loss affects the CO stretching modes near the rhenium, particularly, the $\\mathrm{A}^{\\prime}(2)$. We find that contact with the surface is another feature that can be used to either modify vibrational energy transfer and catalysis. While EHP-induced vibrational relaxation could be one reason for the so often observed catalytic efficiency loss upon adsorption, it might also offer a viable way to selectively control catalysis via laser-driven EHP enhancement recently coined as \"hot-electron chemistry\", $66-67$\n\n\\section{Experimental Details}\nThe broadband vibrational SFG setup is based on a $1 \\mathrm{kHz}$ Spitfire Ti:Sapphire regenerative amplifier system (Spectra Physics) and TOPAS-C (Light Conversion) as described in the SI. ${ }^{38,40}$ The pump and unpumped SFG signals were separated using a galvanometric servocontrolled optical scanning mirror (Cambridge Technology) as described in the SI. ${ }^{70}$ The angle of incidence for the visible and probe IR pulses were $65^{\\circ}$ and $50^{\\circ}$ with respect to the surface normal, respectively. The SFG, visible, probe IR and pump IR beams were $p$-polarized. The SFG spectra of $\\operatorname{Re}(\\mathrm{CO})_{3} \\mathrm{Cl} / \\mathrm{Au}$ were normalized by the SFG spectra of a bare gold thin film measured under the same conditions.\n\n\\section{Theoretical Details}\nDFT calculations were performed with the electronic structure code FHI-aims (version: 161122) with \"light\" local orbital basis set and integration grid settings. ${ }^{71}$ The (111) gold surface was modeled with a $(5 \\times 4)$ primitive surface unit cell and 4 layers of Au substrate (bottom two frozen), built using the Atomic Simulation Environment (ASE). ${ }^{72}$ The functional was $\\mathrm{PBE}^{51,73}$ as corrected with the atomic zeroth order scalar relativistic approximation (ZORA). Long-range dispersion interactions have been accounted for with the $\\mathrm{vdW}^{\\text {surf }}$ method by Ruiz et al. ${ }^{52}$ Vibrational relaxation rates were calculated using first order TDPT based on ground Kohn-Sham eigenstates using the coolvib code. ${ }^{4-5,} 45$ Nonadiabatic matrix elements for the three carbonyl stretch modes have been calculated with FHI-aims using finite difference displacements and a 4 $\\times 4 \\times 1$ Monkhorst-Pack k-grid. ${ }^{74-75}$ The sum over electronic states in the relaxation rate expression was converged with a spectral Gaussian broadening of width $0.1 \\mathrm{eV}^{20}$ Electronic states up to $6 \\mathrm{eV}$ above the Fermi level were included and the electronic temperature was $300 \\mathrm{~K}$.\n\nGas phase IVR was calculated using ab initio MD performed with ASE coupled to FHI-aims ${ }^{71}$ using a Langevin (constant NVT) thermostat at $300 \\mathrm{~K}$ with a friction value of $0.1$ a.u. Thus, classical MD was evaluated along the DFT (PBE with \"light\" on Re, Cl, but with \"light\\_194\" (reduced integration grid) on all other elements) potential energy surface using a heat bath generating a fluctuating force and a friction term to maintain a constant temperature.\n\n\\section{ASSOCIATED CONTENT}\nSupporting Information. Experimental details, expression for IR pump-SFG probe spectra, IR pump-IR probe results of rhenium catalyst in acetone and DMF, additional theoretical details including dot products for comparing normal modes in vacuum and in the presence of the surface, computed solvent frequencies, additional theoretical details and brief overview of the coolvib code, data supporting the selection of broadening width for electron-hole coupling, additional details for and fitting of MD results, vibrational relaxation rates, listing and discussion of vibrational relaxation rates of similar Re catalysts reported in the literature, additional references, and theoretical coordinates.\n\n\\section{AUTHOR INFORMATION}\n\\section{Notes}\n${ }^{\\dagger}$ Equal contribution Present Address: ${ }^{\\#} \\mathbf{J}$. Z.: II. Physikalisches Institut, Universität zu Köln, Zülpicher Straße 77, D50937 Köln, Germany\n\nThe authors declare no competing financial interests.\n\n\\section{ACKNOWLEDGMENT}\nThis work was supported by Air Force Office of Scientific Research grant FA9550-17-0198. V.S.B. acknowledges high performance computing time from NERSC and from the high performance computing facilities at Yale. B.R. acknowledges support from the National Science Foundation Graduate Research Fellowship under Grant No. DGE-1122492. We thank Pablo Videla and John Tully (Yale) as well as Melissa Clark and Cliff Kubiak (UC San Diego) for helpful discussions.\n\n\\section{REFERENCES}\n(1) Blakemore, J. D.; Gupta, A.; Warren, J. J.; Brunschwig, B. S.; Gray, H. B. Noncovalent Immobilization of Electrocatalysts on Carbon Electrodes for Fuel Production. J. Am. Chem. Soc. 2013, 135, 18288-18291.\n\n(2) Copéret, C.; Basset, J. M. Strategies to Immobilize Well-Defined Olefin Metathesis Catalysts: Supported Homogeneous Catalysis vs. Surface Organometallic Chemistry. Adv. Synth. Catal. 2007, 349, 78-92.\n\n(3) Anfuso, C. L.; Snoeberger III, R. C.; Ricks, A. M.; Liu, W. M.; Xiao, D.; Batista, V. S.; Lian, T. Covalent Attachment of a Rhenium Bipyridyl $\\mathrm{CO}_{2}$ Reduction Catalyst to Rutile $\\mathrm{TiO}_{2} . \\mathrm{J}$. Am. Chem. Soc. 2011, 133, 6922-6925.\n\n(4) Oh, S.; Gallagher, J. R.; Miller, J. T.; Surendranath, Y. Graphite-Conjugated Rhenium Catalysts for Carbon Dioxide Reduction. J. Am. Chem. Soc. 2016, 138, 1820-1823.\n\n(5) Schreier, M.; Luo, J.; Gao, P.; Moehl, T.; Mayer, M. T.; Grätzel, M. Covalent Immobilization of a Molecular Catalyst on $\\mathrm{Cu}_{2} \\mathrm{O}$ Photocathodes for $\\mathrm{CO}_{2}$ Reduction. J. Am. Chem. Soc. 2016, 138, 1938-1946.\n\n(6) Rosenfeld, D. E.; Gengeliczki, Z.; Smith, B. J.; Stack, T. D. P.; Fayer, M. D. Structural Dynamics of a Catalytic Monolayer Probed by Ultrafast 2D IR Vibrational Echoes. Science 2011, 334, 634-639.\n\n(7) Clark, M. L.; Rudshteyn, B.; Ge, A.; Chabolla, S. A.; Machan, C. W.; Psciuk, B. T.; Song, J.; Canzi, G.; Lian, T.; Batista, V. S., et al. Orientation of Cyano-Substituted Bipyridine Re(I) fac-Tricarbonyl Electrocatalysts Bound to Conducting Au Surfaces. J. Phys. Chem. C 2016, $120,1657-1665$.\n\n(8) Liu, C.; Dubois, K. D.; Louis, M. E.; Vorushilov, A. S.; Li, G. Photocatalytic $\\mathrm{CO}_{2}$ Reduction and Surface Immobilization of a Tricarbonyl Re (I) Compound Modified with Amide Groups. ACS Catal. 2013, 3, 655-662.\n\n(9) Cecchet, F.; Alebbi, M.; Bignozzi, C. A.; Paolucci, F. Efficiency Enhancement of the Electrocatalytic Reduction of $\\mathrm{CO}_{2}$ : fac- $\\mathrm{Re}(\\mathrm{v}-\\mathrm{bpy})(\\mathrm{CO})_{3} \\mathrm{Cl}$ Electropolymerized onto Mesoporous $\\mathrm{TiO}_{2}$ Electrodes. Inorg. Chim. Acta 2006, 359, 3871-3874.\n\n(10) Dubois, K. D.; He, H.; Liu, C.; Vorushilov, A. S.; Li, G. Covalent Attachment of a Molecular $\\mathrm{CO}_{2}$-Reduction Photocatalyst to Mesoporous Silica. J. Mol. Catal. A: Chem. 2012, 363-364, 208-213.\n\n(11) Kumar, B.; Llorente, M.; Froehlich, J.; Dang, T.; Sathrum, A.; Kubiak, C. P.\n\nPhotochemical and Photoelectrochemical Reduction of $\\mathrm{CO}_{2}$. Annu. Rev. Phys. Chem. 2012, 63, 541-569.\n\n(12) Materna, K. L.; Rudshteyn, B.; Brennan, B. J.; Kane, M. H.; Bloomfield, A. J.; Huang, D. L.; Shopov, D. Y.; Batista, V. S.; Crabtree, R. H.; Brudvig, G. W. Heterogenized Iridium WaterOxidation Catalyst from a Silatrane Precursor. ACS Catal. 2016, 6, 5371-5377.\n\n(13) Materna, K. L.; Crabtree, R. H.; Brudvig, G. W. Anchoring Groups for Photocatalytic Water Oxidation on Metal Oxide Surfaces. Chem. Soc. Rev. 2017, 46, 6099-6110.\n\n(14) Berardi, S.; Drouet, S.; Francàs, L.; Gimbert-Suriñach, C.; Guttentag, M.; Richmond, C.; Stoll, T.; Llobet, A. Molecular Artificial Photosynthesis. Chem. Soc. Rev. 2014, 43, 7501-7519.\n\n(15) Garrido-Barros, P.; Gimbert-Suriñach, C.; Moonshiram, D.; Picón, A.; Monge, P.;\n\nBatista, V. S.; Llobet, A. Electronic $\\pi$-Delocalization Boosts Catalytic Water Oxidation by Cu(II) Molecular Catalysts Heterogenized on Graphene Sheets. J. Am. Chem. Soc. 2017.\n\n(16) Sheehan, S. W.; Thomsen, J. M.; Hintermair, U.; Crabtree, R. H.; Brudvig, G. W.; Schmuttenmaer, C. A. A Molecular Catalyst for Water Oxidation That Binds to Metal Oxide Surfaces. Nature Commun. 2015, 6.\n\n(17) Tully, J. C. Chemical Dynamics at Metal Surfaces. Annu. Rev. Phys. Chem. 2000, 51, 153-178.\n\n(18) Wodtke, A. M.; Tully, J. C.; Auerbach, D. J. Electronically Non-Adiabatic Interactions of Molecules at Metal Surfaces: Can We Trust the Born-Oppenheimer Approximation for Surface Chemistry? Int. Rev. Phys. Chem. 2004, 23, 513-539.\n\n(19) Askerka, M.; Maurer, R. J.; Batista, V. S.; Tully, J. C. Role of Tensorial Electronic Friction in Energy Transfer at Metal Surfaces. Phys. Rev. Lett. 2016, 116, 217601.\n\n(20) Maurer, R. J.; Askerka, M.; Batista, V. S.; Tully, J. C. Ab initio Tensorial Electronic Friction for Molecules on Metal Surfaces: Nonadiabatic Vibrational Relaxation. Phys. Rev. B 2016, 94, 115432.\n\n(21) Wang, J.-W.; Sahoo, P.; Lu, T.-B. Reinvestigation of Water Oxidation Catalyzed by a Dinuclear Cobalt Polypyridine Complex: Identification of $\\mathrm{CoO}_{\\mathrm{x}}$ as a Real Heterogeneous Catalyst. ACS Catal. 2016, 6, 5062-5068.\n\n(22) Earl, W. L.; Ott, K. C.; Hall, K. A.; de Rege, F. M.; Morita, D. K.; Tumas, W.; Brown, G. H.; Broene, R. D. Heterogenization of Homogeneous Catalysts: The Effect of the Support; Department of Energy Office of Scientific and Technical Information: United States, 1999-0629, 1999. (23) Trewyn, B. G.; Chen, H.-T.; Lin, V. S.-Y. Surface-Functionalized Nanoporous Catalysts for Renewable Chemistry. In Recoverable and Recyclable Catalysts, Benaglia, M., Ed. John Wiley \\& Sons: West Sussex, UK, 2009; pp 26-27.\n\n(24) Cho, S.-H.; Walther, N. D.; Nguyen, S. T.; Hupp, J. T. Anodic Aluminium Oxide Catalytic Membranes for Asymmetric Epoxidation. Chem. Commun. 2005, 5331-5333. (25) Hawecker, J.; Lehn, J. M.; Ziessel, R. Electrocatalytic Reduction of Carbon Dioxide Mediated by Re(bipy)(CO) ${ }_{3} \\mathrm{Cl}$ (bipy $=2,2^{\\prime}$-Bipyridine) J. Chem. Soc., Chem. Commun. 1984, 328-330.\n\n(26) Hawecker, J.; Lehn, J. M.; Ziessel, R. Photochemical and Electrochemical Reduction of Carbon Dioxide to Carbon Monoxide Mediated by (2,2'-Bipyridine)Tricarbonylchlororhenium(I) and Related Complexes as Homogeneous Catalysts. Helv. Chim. Acta 1986, 69, 1990-2012. (27) Smieja, J. M.; Kubiak, C. P. Re(bipy-tBu)(CO) $)_{3}$ Cl-improved Catalytic Activity for Reduction of Carbon Dioxide: IR-Spectroelectrochemical and Mechanistic Studies. Inorg. Chem. 2010, 49, 9283-9289.\n\n(28) Kumar, B.; Smieja, J. M.; Kubiak, C. P. Photoreduction of $\\mathrm{CO}_{2}$ on p-type Silicon Using Re(bipy-But)(CO) ${ }_{3} \\mathrm{Cl}$ : Photovoltages Exceeding $600 \\mathrm{mV}$ for the Selective Reduction of $\\mathrm{CO}_{2}$ to CO. J. Phys. Chem. C 2010, 114, 14220-14223.\n\n(29) Johnson, F. P.; George, M. W.; Hartl, F.; Turner, J. J. Electrocatalytic Reduction of $\\mathrm{CO}_{2}$ Using the Complexes $\\left[\\operatorname{Re}(\\mathrm{bpy})(\\mathrm{CO})_{3} \\mathrm{~L}\\right]^{\\mathrm{n}}\\left(\\mathrm{n}=+1\\right.$, $\\mathrm{L}=\\mathrm{P}(\\mathrm{OEt})_{3}, \\mathrm{CH} \\mathrm{H}_{3} \\mathrm{CN} ; \\mathrm{n}=0, \\mathrm{~L}=\\mathrm{Cl}^{-}$, OTf;; bpy= 2, 2 '-Bipyridine; $\\mathrm{OTf}^{\\prime}-=\\mathrm{CF}_{3} \\mathrm{SO}_{3}$ ) as Catalyst Precursors: Infrared Spectroelectrochemical Investigation. Organometallics 1996, 15, 3374-3387.\n\n(30) Sahara, G.; Ishitani, O. Efficient Photocatalysts for $\\mathrm{CO}_{2}$ Reduction. Inorg. Chem. 2015, 54, 5096-5104.\n\n(31) Zhou, X.; Micheroni, D.; Lin, Z.; Poon, C.; Li, Z.; Lin, W. Graphene-Immobilized fac-Re (bipy)(CO) 3 Cl for Syngas Generation from Carbon Dioxide. ACS Appl. Mater. Interfaces 2016, 8, 4192-4198.\n\n(32) Schmidt, M. E.; GuyotSionnest, P. Electrochemical Tuning of the Lifetime of the CO Stretching Vibration for CO/Pt(111). J. Chem. Phys. 1996, 104, 2438-2445.\n\n(33) McGuire, J. A.; Shen, Y. R. Ultrafast Vibrational Dynamics at Water Interfaces. Science 2006, 313, 1945-1948.\n\n(34) Smits, M.; Ghosh, A.; Sterrer, M.; Muller, M.; Bonn, M. Ultrafast Vibrational Energy Transfer Between Surface and Bulk Water at the Air-Water Interface. Phys. Rev. Lett. 2007, 98. (35) Eftekhari-Bafrooei, A.; Borguet, E. Effect of Surface Charge on the Vibrational Dynamics of Interfacial Water. J. Am. Chem. Soc. 2009, 131, 12034-12035.\n\n(36) Arnolds, H.; Bonn, M. Ultrafast Surface Vibrational Dynamics. Surf. Sci. Rep. 2010, 65, 45-66.\n\n(37) Nihonyanagi, S.; Mondal, J. A.; Yamaguchi, S.; Tahara, T. Structure and Dynamics of Interfacial Water Studied by Heterodyne-Detected Vibrational Sum-Frequency Generation. Annu. Rev. Phys. Chem. 2013, 579-603.\n\n(38) Anfuso, C. L.; Ricks, A. M.; Rodriguez-Cordoba, W.; Lian, T. Ultrafast Vibrational Relaxation Dynamics of a Rhenium Bipyridyl CO2-Reduction Catalyst at a Au Electrode Surface Probed by Time-Resolved Vibrational Sum Frequency Generation Spectroscopy. J. Phys. Chem. C 2012, 116, 26377-26384.\n\n(39) Calabrese, C.; Vanselous, H.; Petersen, P. B. Deconstructing the Heterogeneity of Surface-Bound Catalysts: Rutile Surface Structure Affects Molecular Properties. J. Phys. Chem. C 2016, 120, 1515-1522. (40) Ricks, A. M.; Anfuso, C. L.; Rodriguez-Cordoba, W.; Lian, T. Vibrational Relaxation Dynamics of Catalysts on $\\mathrm{TiO}_{2}$ Rutile (110) Single Crystal Surfaces and Anatase Nanoporous Thin Films. Chem. Phys. 2013, 422, 264-271.\n\n(41) Wang, J.; Clark, M. L.; Li, Y.; Kaslan, C. L.; Kubiak, C. P.; Xiong, W. Short-Range Catalyst-Surface Interactions Revealed by Heterodyne Two-Dimensional Sum Frequency Generation Spectroscopy. J. Phys. Chem. Lett. 2015, 6, 4204-4209.\n\n(42) Vanselous, H.; Stingel, A. M.; Petersen, P. B. Interferometric 2D Sum Frequency Generation Spectroscopy Reveals Structural Heterogeneity of Catalytic Monolayers on Transparent Materials. J. Phys. Chem. Lett. 2017, 8, 825-830.\n\n(43) Kraack, J. P.; Hamm, P. Surface-Sensitive and Surface-Specific Ultrafast TwoDimensional Vibrational Spectroscopy. Chem. Rev. 2017, 117, 10623-10664.\n\n(44) Nishida, J.; Yan, C.; Fayer, M. D. Dynamics of Molecular Monolayers with Different Chain Lengths in Air and Solvents Probed by Ultrafast 2D IR Spectroscopy. J. Phys. Chem. C 2014, 118, 523-532.\n\n(45) Laaser, J. E.; Christianson, J. R.; Oudenhoven, T. A.; Joo, Y.; Gopalan, P.; Schmidt, J. R.; Zanni, M. T. Dye Self-Association Identified by Intermolecular Couplings between Vibrational Modes as Revealed by Infrared Spectroscopy, and Implications for Electron Injection. J. Phys. Chem. C 2014, 118, 5854-5861.\n\n(46) Oudenhoven, T. A.; Joo, Y.; Laaser, J. E.; Gopalan, P.; Zanni, M. T. Dye Aggregation Identified by Vibrational Coupling Using 2D IR Spectroscopy. J. Chem. Phys. 2015, 142, 212449.\n\n(47) Kraack, J. P.; Frei, A.; Alberto, R.; Hamm, P. Ultrafast Vibrational Energy Transfer in Catalytic Monolayers at Solid-Liquid Interfaces. J. Phys. Chem. Lett. 2017, 8, 2489-2495.\n\n(48) Rosenfeld, D. E.; Nishida, J.; Yan, C.; Gengeliczki, Z.; Smith, B. J.; Fayer, M. D. Dynamics of Functionalized Surface Molecular Monolayers Studied with Ultrafast Infrared Vibrational Spectroscopy. J. Phys. Chem. C 2012, 116, 23428-23440.\n\n(49) Rosenfeld, D. E.; Nishida, J.; Yan, C.; Kumar, S. K. K.; Tamimi, A.; Fayer, M. D. Structural Dynamics at Monolayer-Liquid Interfaces Probed by 2D IR Spectroscopy. J. Phys. Chem. C 2013, 117, 1409-1420.\n\n(50) Anfuso, C. L.; Xiao, D.; Ricks, A. M.; Negre, C. F. A.; Batista, V. S.; Lian, T. Orientation of a Series of $\\mathrm{CO}_{2}$ Reduction Catalysts on Single Crystal $\\mathrm{TiO}_{2}$ Probed by PhaseSensitive Vibrational Sum Frequency Generation Spectroscopy (PS-VSFG). J. Phys. Chem. C 2012, 116, 24107-24114.\n\n(51) Perdew, J. P.; Burke, K.; Ernzerhof, M. Generalized Gradient Approximation Made Simple. Phys. Rev. Lett. 1996, 77, 3865-3868.\n\n(52) Ruiz, V. G.; Liu, W.; Zojer, E.; Scheffler, M.; Tkatchenko, A. Density-Functional Theory With Screened van der Waals Interactions for the Modeling of Hybrid Inorganic-Organic Systems. Phys. Rev. Lett. 2012, 108, 146103.\n\n(53) Nishida, J.; Yan, C.; Fayer, M. D. Enhanced Nonlinear Spectroscopy for Monolayers and Thin Films in near-Brewster's Angle Reflection Pump-Probe Geometry. J. Chem. Phys. 2017, $146,094201$.\n\n(54) Lenchenkov, V.; She, C.; Lian, T. Vibrational Relaxation of CN Stretch of Pseudo-Halide Anions (OCN ${ }^{-} \\mathrm{SCN}^{-}$, and SeCN ) in Polar Solvents. J. Phys. Chem. B 2006, 110, 19990-19997. (55) Rey, R.; Hynes, J. T. Vibrational Energy Relaxation of HOD in Liquid $\\mathrm{D}_{2} \\mathrm{O}$. J. Chem. Phys. 1996, 104, 2356-2368. (56) Dettori, R.; Ceriotti, M.; Hunger, J.; Melis, C.; Colombo, L.; Donadio, D. Simulating Energy Relaxation in Pump-Probe Vibrational Spectroscopy of Hydrogen-Bonded Liquids. J. Chem. Theory Comput. 2017, 13, 1284-1292.\n\n(57) Elsaesser, T.; Kaiser, W. Vibrational and Vibronic Relaxation of Large Polyatomic Molecules in Liquids. Annu. Rev. Phys. Chem. 1991, 42, 83-107.\n\n(58) Rosspeintner, A.; Lang, B.; Vauthey, E. Ultrafast Photochemistry in Liquids. Annu. Rev. Phys. Chem. 2013, 64, 247-271.\n\n(59) Schultz, S.; Qian, J.; Jean, J. Separability of Intra-And Intermolecular Vibrational Relaxation Processes in the $\\mathrm{S}_{1}$ State of Trans-Stilbene. J. Phys. Chem. A 1997, 101, 1000-1006. (60) Eom, H. S.; Jeoung, S. C.; Kim, D.; Ha, J.-H.; Kim, Y.-R. Ultrafast Vibrational Relaxation and Ligand Photodissociation/Photoassociation Processes of Nickel (II) Porphyrins in the Condensed Phase. J. Phys. Chem. A 1997, 101, 3661-3669.\n\n(61) Egorov, S. A.; Skinner, J. L. Vibrational Energy Relaxation of Polyatomic Solutes in Simple Liquids and Supercritical Fluids. J. Chem. Phys. 2000, 112, 275-281.\n\n(62) Berg, M.; Vanden Bout, D. A. Ultrafast Raman Echo Measurements of Vibrational Dephasing and the Nature of Solvent-Solute Interactions. Acc. Chem. Res. 1997, 30, 65-71.\n\n(63) Kiba, T.; Sato, S.-i.; Akimoto, S.; Kasajima, T.; Yamazaki, I. Solvent-Assisted Intramolecular Vibrational Energy Redistribution of $\\mathrm{S}_{1}$ Perylene in Ketone Solvents. $J$. Photochem. Photobiol., A 2006, 178, 201-207.\n\n(64) King, J. T.; Anna, J. M.; Kubarych, K. J. Solvent-Hindered Intramolecular Vibrational Redistribution. Phys. Chem. Chem. Phys. 2011, 13, 5579-5583.\n\n(65) Bonner, G.; Ridley, A.; Ibrahim, S.; Pickett, C.; Hunt, N. Probing the Effect of the Solution Environment on the Vibrational Dynamics of an Enzyme Model System with Ultrafast 2D-IR Spectroscopy. Faraday Discuss. 2010, 145, 429-442.\n\n(66) Christopher, P.; Xin, H.; Linic, S. Visible-Light-Enhanced Catalytic Oxidation Reactions on Plasmonic Silver Nanostructures. Nature Chem. 2011, 3, 467-472.\n\n(67) Park, J. Y.; Kim, S. M.; Lee, H.; Nedrygailov, I. I. Hot-Electron-Mediated Surface Chemistry: Toward Electronic Control of Catalytic Activity. Acc. Chem. Res. 2015, 48, $2475-$ 2483.\n\n(68) Wu, K.; Chen, J.; McBride, J. R.; Lian, T. Efficient Hot-Electron Transfer by a PlasmonInduced Interfacial Charge-Transfer Transition. Science 2015, 349, 632-635.\n\n(69) Maurer, R. J.; Jiang, B.; Guo, H.; Tully, J. C. Mode Specific Electronic Friction in Dissociative Chemisorption on Metal Surfaces: $\\mathrm{H}_{2}$ on Ag(111). Phys. Rev. Lett. 2017, 118, 256001.\n\n(70) Ghosh, A.; Smits, M.; Bredenbeck, J.; Dijkhuizen, N.; Bonn, M. Femtosecond TimeResolved and Two-Dimensional Vibrational Sum Frequency Spectroscopic Instrumentation to Study Structural Dynamics at Interfaces. Rev. Sci. Instrum. 2008, 79, 093907.\n\n(71) Blum, V.; Gehrke, R.; Hanke, F.; Havu, P.; Havu, V.; Ren, X.; Reuter, K.; Scheffler, M. Ab initio Molecular Simulations with Numeric Atom-Centered Orbitals. Comput. Phys. Commun. 2009, 180, 2175-2196.\n\n(72) Bahn, S. R.; Jacobsen, K. W. An Object-Oriented Scripting Interface to a Legacy Electronic Structure Code. Comput. Sci. Eng. 2002, 4, 56-66.\n\n(73) Perdew, J. P.; Burke, K.; Ernzerhof, M. Generalized Gradient Approximation Made Simple [Phys. Rev. Lett. 77, 3865 (1996)]. Phys. Rev. Lett. 1997, 78, 1396-1396.\n\n(74) Monkhorst, H. J.; Pack, J. D. Special Points for Brillouin-Zone Integrations. Phys. Rev. B 1976, 13, 5188. (75) Pack, J. D.; Monkhorst, H. J. \"Special Points for Brillouin-Zone Integrations\"-A Reply. Phys. Rev. B 1977, 16, 1748.\n\n\n\\end{document}", "record_id": "2023_09_22_e69f3d7ce6c4ff487115g"}