{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{PAPER }\n\n\n\\author{Guangfei Yu, ${ }^{\\text {ac }}$ Lai Lyu, ${ }^{*}{ }^{* \\text { bd }}$ Fagen Zhang, ${ }^{\\text {b }}$ Dengbiao Yan, ${ }^{e}$ Wenrui Cao $^{\\text {bd }}$\\\\\nand Chun Hu id abcd}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nView Article Online\n\nView Journal | View Issue\n\nCheck for updates\n\nCite this: RSC Adv., 2018, 8, 3312 Received 19th November 2017 Accepted 2nd January 2018\n\nDOI: $10.1039 / c 7 r a 12573 a$\n\n\\href{http://rsc.li/rsc-advances}{rsc.li/rsc-advances}\n\n\\section{Theoretical and experimental evidence for rGO-4- PP Nc as a metal-free Fenton-like catalyst by tuning the electron distribution}\nThe application of the classical Fenton reaction has long been limited by several problems, such as metallic sludge and narrow $\\mathrm{pH}$ range, which derived from the metal components in the catalyst. Developing a metal-free Fenton catalyst may efficiently address these problems. Here, we firstly perform a density functional theory (DFT) study to explore the possibility of developing the 4-phenoxyphenol moleculedoped reduced graphene oxide nanocomposite (rGO-4-PP Nc) as a metal-free Fenton-like catalyst by tuning the electron distribution. The theoretical calculation results reveal that $\\mathrm{rGO}-4$-PP $\\mathrm{Nc}$ can act as an efficient Fenton-like catalyst for $\\mathrm{H}_{2} \\mathrm{O}_{2}$ activation and pollutant degradation through formation of electron-rich $\\mathrm{O}$ and electron-deficient $\\mathrm{C}$ centers on the $\\mathrm{C}-\\mathrm{O}-\\mathrm{C}$ bridge. The actual rGO-4-PP Nc is also prepared via a surface complexation and copolymerization process. The experimental evidence, such as that gained from XRD, FIIR and EPR analysis, confirm the theoretical models and the dual-reactioncenter Fenton-like mechanism. This work provides a basis for theoretical calculation to guide the actual synthesis and prediction of catalytic activity of the Fenton-like catalysts, and also offers a creative perspective to develop new generation metal-free Fenton catalysts by tuning the electron distribution using organic polymers.\n\n\\section{Introduction}\nThe Fenton reaction, in which highly aggressive hydroxyl radicals $(\\cdot \\mathrm{OH})$ are generated from $\\mathrm{H}_{2} \\mathrm{O}_{2}$ by reduction with $\\mathrm{Fe}^{2+}$, is one of the powerful advanced oxidation processes (AOPs) that can be used for the degradation of organic pollutants. ${ }^{1}$ Its widespread applications have also been observed in materials synthesis, ${ }^{2}$ medicine ${ }^{3}$ and polishing. ${ }^{4}$ However, several drawbacks hinder the practical application of the classical homogeneous Fenton reaction, including the required strong acidic condition $(\\mathrm{pH}=2-3.5)$, the accumulation of Fe-containing sludge and the requirement for a neutralization step of the effluent and sludge disposal. ${ }^{5}$ To address these problems, the metal-containing heterogeneous Fenton catalysts, such as zerovalent metals, metallic oxides, supported metal composites and\n\n${ }^{a}$ Key Laboratory of Drinking Water Science and Technology, Research Center for Eco-Environmental Sciences, Chinese Academy of Sciences, Beijing 100085, China ${ }^{b}$ Key Laboratory for Water Quality and Conservation of the Pearl River Delta, Ministry of Education, School of Environmental Science and Engineering, Guangzhou University, Guangzhou, 510006, China.E-mail: \\href{mailto:lyulai@gzhu.edu.cn}{lyulai@gzhu.edu.cn}\n\n'University of Chinese Academy of Sciences, Beijing 100049, China\n\n${ }^{d}$ Research Institute of Environmental Studies at Greater Bay, Guangzhou University, Guangzhou, 510006, China\n\n${ }^{e}$ School of Environmental and Chemical Engineering, Tianjin Polytechnic University, Tianjin 300387, China metal-doped solids, have been developed as alternatives to the classical Fenton process.\n\nUnfortunately, the redox of the metal ions in the single metal site of the metal-containing Fenton catalyst inevitably results in a series of problems, including the narrow available $\\mathrm{pH}$ range, the rate-limiting step in the reduction of $\\mathrm{M}^{(n+m)+}$ to $\\mathrm{M}^{n+}$ by oxidizing $\\mathrm{H}_{2} \\mathrm{O}_{2},{ }^{6,7}$ the excess consumption of $\\mathrm{H}_{2} \\mathrm{O}_{2},{ }^{8,9}$ and the secondary pollution owing to the metal leaching. ${ }^{10,11}$ To avoid these problems caused by metal species thoroughly, development of metal-free Fenton-like catalysts is one of the most effective means of the settlements.\n\nRecently, our study ${ }^{12}$ shows an efficient Fenton-like degradation of refractory organic pollutants in mild conditions by constructing the electron-rich and electron-deficient areas (the dual reaction centers) on the hydroxylated C-doped g- $\\mathrm{C}_{3} \\mathrm{~N}_{4} /$ CuCo- $\\mathrm{Al}_{2} \\mathrm{O}_{3}$ nanocomposite (OH-CCN/CuCo- $\\left.\\mathrm{Al}_{2} \\mathrm{O}_{3}\\right)$. This gives us an inspiration to explore the possibility of developing efficient metal-free Fenton-like catalysts by tuning the electron distribution in theory.\n\nDensity functional theory (DFT) calculation, as an effective approach to study the electronic properties of the materials and the oxygen reduction reaction mechanisms, has been widely used during the past few years, ${ }^{13-15}$ which can be chosen as a credible theoretical research method for the electron distribution analysis and the interaction process analysis of the Fenton-like catalyst and $\\mathrm{H}_{2} \\mathrm{O}_{2}$. Graphene, a two-dimensional single layer of graphite consisting of $\\mathrm{sp}^{2}$-hybridized carbon atoms, can be adopted as the substrate material for its unique electrical and mechanical properties. ${ }^{16-18}$ 4-Phenoxyphenol (4PP) as a molecular material with two benzene rings, a $\\mathrm{C}-\\mathrm{O}-\\mathrm{C}$ bond and a hydroxyl group, shows an unusual flexibility in its moderately hydrogen bonded $\\mathrm{O}-\\mathrm{H}^{\\cdots} \\mathrm{OR}_{6}{ }^{6}(12)$ rings, which can breathe to accommodate different solvent molecules into the channels, ${ }^{19}$ which results in that 4-PP can be used as an excellent organic ligand.\n\nTherefore, for the first time, we perform a DFT calculation study to explore the possibility of developing the 4-phenoxyphenol molecule-doped reduced graphene oxide nanocomposite (rGO-4-PP Nc) as an efficient metal-free Fenton-like catalysts by tuning the electron distributions in this work. The theoretical geometric and electronic properties, HOMO/LUMO analysis, electrostatic potential distributions and the computation of the interaction process of active sites with $\\mathrm{H}_{2} \\mathrm{O}_{2}$ reveal that rGO-4-PP Nc can act as an efficient Fenton-like catalyst through formation of the electron-rich $\\mathrm{O}$ and electron-deficient $\\mathrm{C}$ centers on the $\\mathrm{C}-\\mathrm{O}-\\mathrm{C}$ bridge. The actual rGO-4-PP $\\mathrm{Nc}$ is prepared via a surface complexation and copolymerization process. The experimental characterizations and methods successfully verify the theoretical models and the dual-reactioncenter Fenton-like mechanism.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{1}\n  \\item Computational and experimental methods\n\\end{enumerate}\n\n\\subsection{Computational methods}\nDFT calculations were performed using Gaussian 09 software. $^{20}$ The structures were optimized at the B3LYP/6-31G (d,p) computational levels. The B3LYP method was chosen for its widely recognized high quality especially in this type of organic chemistry reaction. Subsequent frequency calculations were performed at the same level in order to verify that these structures were the local minimas on the potential energy surface. The SMD is chosen to simulate the effects of water. $^{21}$\n\nFor all the models we established and shown in our figures, the $\\mathrm{C}, \\mathrm{O}$ and $\\mathrm{H}$ atoms are represented by the grey, red and white circles, respectively. In addition, the Multiwfn program was used to investigate the valence-electron density. ${ }^{22}$\n\nTo find correct spin multiplicity (SM) values for the structures, single-point energy (SPE) and stable calculations were performed at the beginning of the study. Different SM values were adopted for SPE calculations, and the SM value that had the lowest SPE was chosen as the correct spin multiplicity to perform the subsequent calculations for the corresponding systems. After the SM values had been selected, stable calculations were carried out to verify the wavefunctions were stable.\n\n\\subsection{Chemicals and reagents}\nBisphenol A (BPA, $\\geq 99 \\%$ ) and phenytoin (PHT, 99\\%) were obtained from Acros (Geel, Belgium). Horseradish peroxidase (POD, $99 \\%$ ), 2-chlorophenol (2-CP, $\\geq 99 \\%$ ) and $N, N$-diethyl- $p$-phenylenediamine sulfate (DPD, 98\\%) were purchased from sigmaAldrich (St. Louis, USA). Hydrogen peroxide $\\left(\\mathrm{H}_{2} \\mathrm{O}_{2}, 30 \\%, \\mathrm{w} / \\mathrm{w}\\right)$ was obtained from Sinopharm Chemical Reagent Co. (Shanghai, China). Deionized water was used throughout the study.\n\n\\subsection{Catalyst preparation}\nGraphite oxide (GO) was synthesized from natural graphite powder by a modified Hummers method. ${ }^{23}$ The 4-PP-doped reduced graphene oxide nanocomposite (rGO-4-PP Nc) was synthesized through the following methods: $0.5 \\mathrm{~g}$ GO powder and $0.2 \\mathrm{~g}$ 4-phenoxyphenol (4-PP) were dissolved into $25 \\mathrm{~mL}$ ethanol, then it was stirred for $1 \\mathrm{~h}$ and got sonication treatment for 30 min to obtain an evenly dispersed solution. This solution was subsequently placed in a water bath and stirred for $4 \\mathrm{~h}$ at $70{ }^{\\circ} \\mathrm{C}$, then the temperature was maintained $90{ }^{\\circ} \\mathrm{C}$ before the solution dried out by evaporating to obtain the solid precursors. The precursors were carefully grounded, transferred to an alumina crucible and heated to $350^{\\circ} \\mathrm{C}$ (maintained $1 \\mathrm{~h}$ ) with the rate of $5^{\\circ} \\mathrm{C} \\min ^{-1}$ by a muffle furnace for the annealing copolymerization process. After it cooled naturally, the black powder we obtained was washed by turns with ethanol and deionized water for several times and then dried out by the oven. Finally the rGO-4-PP Nc sample was prepared.\n\n\\subsection{Characterization}\nFourier-transform infrared spectroscopy (FTIR) was obtained using a Nicolet 8700 FTIR spectrophotometer (Thermo Fisher Scientific Inc., USA). X-ray diffraction (XRD) patterns were measured by a Scintag-XDS-2000 diffractometer with $\\mathrm{Cu} \\mathrm{K} \\alpha$ radiation $(\\lambda=1.540598 \\AA)$ operating at $40 \\mathrm{kV}$ and $40 \\mathrm{~mA}$. The EPR spectra were recorded on a Bruker A300-10/12 electron paramagnetic resonance (EPR) spectrometer.\n\n\\subsection{Experiment methods}\nTypically, $50 \\mathrm{~mL}$ pollutant solution (such as $2-\\mathrm{CP}, 10 \\mathrm{mg} \\mathrm{L}^{-1}$ ) and $20 \\mathrm{mg}$ catalyst powder were put into a beaker ( $\\mathrm{pH}$ values were adjusted using $\\mathrm{HCl}$ and $\\mathrm{NaOH}$ solution) and mixed with magnetic stirring for $30 \\mathrm{~min}$ to reach the adsorption/desorption equilibrium. $12 \\mathrm{mM} \\mathrm{H}_{2} \\mathrm{O}_{2}$ was then added to the suspension under magnetic stirring, which was kept throughout the experiment. $1 \\mathrm{~mL}$ aliquots were obtained and filtered through a Millipore filter (pore size $0.22 \\mu \\mathrm{m}$ ) at the given time intervals, subsequently the pollutants were determined immediately by a 1200 series HPLC (Agilent, U.S.A.) equipped with a UV detector and a ZORBAX Eclipse XDB-C18 column. The mobile phase is composed of a mixture of methanol/water at a flow rate of $1 \\mathrm{~mL} \\mathrm{~min}^{-1}$. The $\\mathrm{H}_{2} \\mathrm{O}_{2}$ decomposition experiments were also carried out using the similar procedure. The concentration of $\\mathrm{H}_{2} \\mathrm{O}_{2}$ in filtrate was determined immediately by the DPD-POD method, as previously reported in the literature. ${ }^{24}$\n\n\\section{Results and discussion}\n\\subsection{Geometric and electronic properties of catalyst models}\nfinite-sized model may be different to an extent from that in the real system because of the size and edge effects. However, it is expected to be qualitatively reliable for using the results acquired from the current model to predict the local chemical properties. Spin multiplicity (SM) numbers were found to be 1 for the $\\mathrm{H}_{2} \\mathrm{O}_{2}$, 4-PP molecules and graphene sheet; 3 for catalyst model (rGO-4-PP Nc). These selected SM numbers were adopted throughout all calculations.\n\nFig. 1 shows the optimized geometric structures of graphene $\\left(\\mathrm{C}_{22} \\mathrm{H}_{12}\\right)$, catalyst model (rGO-4-PP Nc, $\\mathrm{C}_{34} \\mathrm{H}_{20} \\mathrm{O}_{2}$ ) and 4-PP molecule $\\left(\\mathrm{C}_{12} \\mathrm{H}_{10} \\mathrm{O}_{2}\\right)$. The optimized graphene has a planar structure with good symmetry, and the 4-PP molecule is connected with graphene by a $\\mathrm{C}-\\mathrm{O}-\\mathrm{C}$ bond in rGO-4-PP Nc. In addition, the $\\mathrm{C}-\\mathrm{O}$ bond lengths of $\\mathrm{C} 35-\\mathrm{O} 34$ and $\\mathrm{C} 13-\\mathrm{O} 34$ were calculated to be $1.392$ and $1.386 \\AA$, respectively, and the $\\mathrm{C} 13-$ O34-C35 bond angle was $119.93^{\\circ}$ in rGO-4-PP Nc. In contrast, in the 4-PP molecule, the C6-O23 bond length and C6-O-32-H24 bond angle in the corresponding position were calculated to be $1.375 \\AA$ and $109.03^{\\circ}$, respectively.\n\nAs the electronic properties of the models are of great importance for their chemical activity, here we start to discuss them by two different approaches. Charge distribution of\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_980121c407cbdaa46afdg-3_1154_2402_226_930}\n\nFig. 1 Optimized structures of graphene (a), rGO-4-PP Nc (b), and 4PP molecule (c) with labeling of all the atoms. Grey, red and white circles represent C, O and $\\mathrm{H}$ atoms, respectively.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_980121c407cbdaa46afdg-3_168_994_1134_1836}\n\nFig. 2 Charge distribution of (a) graphene and (b) rGO-4-PPNc. The numbers on the circles are Mulliken charge values for the atoms. Grey, red and white circles represent $\\mathrm{C}, \\mathrm{O}$ and $\\mathrm{H}$ atoms, respectively.\n\ngraphene (a) and rGO-4-PP Nc (b) is shown in Fig. 2 with Mulliken charges displaying on the atoms. It is obvious that the atomic charge values in graphene are bilateral symmetry, so either side of this structure can be selected for subsequent analysis. In rGO-4-PP Nc, the oxygen atom $\\mathrm{O} 1$ has a considerably low atomic charge value $-0.605$, which is approximately equal to $-0.606$ of the other oxygen atom. The carbon atoms adjacent to the O1 (C1 and C2) have the positive atomic charge value $0.247$ and $0.319$, respectively. It is noted that the corresponding carbon atom C3 in graphene has the negative atomic charge $-0.163$, which is $0.410$ lower than the $\\mathrm{C} 1$ in rGO-4-PP Nc. The reason for this significant change is the larger electronegativity of $\\mathrm{O}$ compared to the $\\mathrm{C}$ atom, which makes the charge transfers from neighboring $\\mathrm{C} 1$ atom to the $\\mathrm{O} 1$ atom and the carbon atom itself positive in rGO-4-PP Nc.\n\nFig. 3 shows the two-dimensional valence-electron density color-filled maps of rGO-4-PP Nc in the C1-O1-C2 plane. Obviously, the largest electron distribution area appears around the $\\mathrm{O}$ atom, and the narrow electron distribution area appears around the $\\mathrm{C}$ atoms. In addition, the maximum valenceelectron density around the $\\mathrm{O}$ atom is as high as $\\sim 1.15$ a.u. compared with the $\\mathrm{C}$ atoms ( $\\mathrm{C} 1$ and $\\mathrm{C} 2$ ) in the $\\mathrm{C}-\\mathrm{O}-\\mathrm{C}$ linker, which suggests that there is an electron-rich area around the $\\mathrm{O}$ atom and there are electron-deficient areas around the adjacent C atoms.\n\n\\subsection{HOMO/LUMO analysis for reactivity}\nSince we have known that there are significant differences of electronic properties between the rGO-4-PP Nc and graphene, it is very necessary to compare their chemical reactivity, which could be used to predict the catalytic performance to a certain extent. The HOMO (highest occupied molecular orbital)-LUMO\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_980121c407cbdaa46afdg-4_167_701_247_911}\n\\end{center}\n\nFig. 3 The two-dimensional valence-electron density color-filled map of rGO-4-PP $\\mathrm{Nc}$ in the $\\mathrm{C} 1-\\mathrm{O} 1-\\mathrm{C} 2$ plane. The length unit is Angstrom.\n\nTable 1 HOMO, LUMO, and HOMO-LUMO energy gap of $\\alpha$ electrons and $\\beta$ electrons for graphene, rGO-4-PP Nc and 4-PP (unit per eV) ${ }^{a}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_980121c407cbdaa46afdg-4_990_1347_136_1016}\n\\end{center}\n\n(lowest unoccupied molecular orbital) gap has been widely used as an indicator of kinetic stability, and it is generally recognized that the smaller the gap is, the lower the kinetic stability and the higher the chemical reactivity are within a certain range, because it indicates energetically favorable for the LUMO to obtain electrons or for the HOMO to lose electrons. The results of graphene, rGO-4-PP Nc and 4-PP that we have calculated for comparison are listed in Table 1. From Table 1, it is clear that the $\\alpha, \\beta$-HOMO-LUMO gap of $2.23$ and $1.88 \\mathrm{eV}$ of rGO-4-PP Nc are considerably smaller than the values $3.55$ and $5.60 \\mathrm{eV}$ of the graphene and 4-PP, respectively. Hence it could be considered that the chemical reactivity of the rGO-4-PP Nc has been significantly improved. We also obtain the HOMO and LUMO spatial distributions of $\\alpha$ and $\\beta$ electron for the graphene and rGO-4-PP Nc structures, as shown in Fig. 4. For the graphene, both HOMO and LUMO have the same spatial distribution for $\\alpha$ electron and $\\beta$ electron, and the spatial distribution of them are delocalized. For the rGO-4-PP Nc, however, it is obvious that part of the HOMO and LUMO of $\\alpha$ electron as well as the LUMO of $\\beta$ electron are localized in the oxygen atom next to the graphene.\n\n3.3. DFT calculations for interaction process of active centers and $\\mathrm{H}_{2} \\mathrm{O}_{2}$\n\nAs we have known that the $\\mathrm{O} 1$ atom in the catalyst has a considerably low atomic charge (Fig. 2b) and there is\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_980121c407cbdaa46afdg-4_167_648_1073_1903}\n\\end{center}\n\nFig. $4 \\mathrm{HOMO}$ and LUMO spatial distributions of $\\alpha$ electron and $\\beta$ electron for graphene and rGO-4-PP Nc.\n\na significant electron-rich area around it besides part of the HOMO and LUMO localized there, it is reasonable to regards that area as the potential active site. Electrostatic potential (ESP) distribution on the van der Waals surface has long been used to predict the reaction sites. ${ }^{25,26}$ The negative and positive regions of ESP are usually expected to be the active sites for the reduction and oxidation reaction, respectively. A common method of investigating the distribution of ESP is to project that onto the molecular surface with different colors according to its values. This type of graphical analysis is very intuitive, as shown in Fig. 5.\n\nThe red and blue colours represent the most negative potential (electron-rich) and positive potential (electrondeficient) parts of the graphene and rGO-4-PP Nc. Analysis of this result clearly indicate that the ESP distribution of graphene is very uniform for the identical elements, which is significantly different from the situations of rGO-4-PP Nc. In rGO-4-PP Nc,\n\n(a)\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_980121c407cbdaa46afdg-4_1634_2436_1142_1824}\n\nFig. 5 Electrostatic potential (ESP) distribution of (a) graphene and (b) rGO-4-PP Nc. the most electronegative parts are the regions around the two oxygen atoms that are the electron rich areas (red) as well, hence we name these oxygen atoms, especially the O1, as the electronrich oxygen centers. In addition, it is noted that the negative potential among the graphene carbocyclic rings in Fig. 5b is obviously lower than that in Fig. $5 \\mathrm{a}$, which indicates that the $\\pi$ electron has transferred from the neighboring carbocyclic rings to the surrounding of the $\\mathrm{O} 1$ atom. The most electropositive and electron deficient regions (blue) of rGO-4-PP Nc are mainly located around the hydrogen atoms that are surrounding the carbocyclic rings near the side of O1. However, it is not appropriate to regard these $\\mathrm{H}$ atoms as active sites because they are added deliberately for the stability of the fragment whereas the real graphene has an infinite plane-extended structure. Besides, the carbon atoms near O1 also have the relatively positive potential.\n\nAccording to all the results we have discussed above, the O1 atom as the electron-rich oxygen center is exactly the active site we expected, and the carbon atoms near it (especially C1 and C2) could be regarded as the electron-deficient carbon center of active site for their relatively significant positive charge and low electron density (Fig. 2b and 3).\n\nTo clarify the interaction process of $\\mathrm{H}_{2} \\mathrm{O}_{2}$ and the catalyst, the $\\mathrm{H}_{2} \\mathrm{O}_{2}$ adsorption on the dual reaction centers of rGO-4-PP $\\mathrm{Nc}$ was theoretically modeled through DFT calculations. Generally, the $\\mathrm{H}_{2} \\mathrm{O}_{2}$ can both obtain and lose electrons to realize the reduction and oxidation reaction, respectively. The reduction process results in the formation of ${ }^{\\circ} \\mathrm{OH}$ that is the traditional reactive oxygen species (ROS) in Fenton reaction while the oxidation process results in the formation of $\\mathrm{HO}_{2}^{*} / \\mathrm{O}_{2}^{\\cdot}$ which would easily transform to $\\mathrm{O}_{2}$ and causes the invalid decomposition of $\\mathrm{H}_{2} \\mathrm{O}_{2}$. As for heterogeneous Fenton process, the subsequent reactions can be hardly carried out unless the $\\mathrm{H}_{2} \\mathrm{O}_{2}$ absorbs to the active sites of catalyst. Fig. 6a and b shows the results of our optimum calculations, which we placed the $\\mathrm{H}_{2} \\mathrm{O}_{2}$ around the active sites initially.\n\nIn the electron-rich oxygen center (Fig. 6a), $\\mathrm{H}_{2} \\mathrm{O}_{2}$ is connected to the $\\mathrm{O}$ atom directly by a hydrogen bond $(\\mathrm{H}-\\mathrm{O}-\\mathrm{O}-\\mathrm{H} \\cdots \\mathrm{O})$ whose bond length is $1.907 \\AA$ A. However, on the electron-deficient center (Fig. 6b), $\\mathrm{H}_{2} \\mathrm{O}_{2}$ does not directly adsorb on the $\\mathrm{C}$ atom, but connects the $\\mathrm{O}$ of $\\mathrm{H}_{2} \\mathrm{O}$, which adsorb to $\\mathrm{C}$ atom by a $\\mathrm{C} \\cdots \\mathrm{O}$ bond (3.333 $\\AA$ ), with the $\\mathrm{H}$ atom of $\\mathrm{H}_{2} \\mathrm{O}_{2}$ through a hydrogen bond $(1.741 \\AA$ A). These optimum structures which are relatively energetically stable confirm that the $\\mathrm{H}_{2} \\mathrm{O}_{2}$ can indeed absorb to the active sites as we expected and the dual reaction centers mechanism was reasonable.\n\nIn the presence of pollutants, the results are completely different. As shown in Fig. 6c, the 2-CP molecule can directly absorb onto the $\\mathrm{C}$ atom by its $\\mathrm{O}$ atom of phenolic hydroxyl, and the $\\mathrm{C} \\cdots \\mathrm{O}$ bond length is $3.436 \\AA$. The connection length between 2-CP and the electron-deficient center is much closer than that of the $\\mathrm{H}_{2} \\mathrm{O}_{2}$ adsorption mode on the electron-deficient centers $(3.333+1.741 \\AA)$, which suggests that the electron transfer from the electron-rich pollutants to the electrondeficient centers of rGO-4-PP Nc are more quickly and easily than that from $\\mathrm{H}_{2} \\mathrm{O}_{2}$ to the electron-deficient centers of rGO-4PP Nc. This results indicate that the electron-rich pollutants can\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_980121c407cbdaa46afdg-5_166_1422_1120_1840}\n\nFig. 6 Optimized structures of $\\mathrm{H}_{2} \\mathrm{O}_{2}$ absorbing to (a) the electron-rich oxygen center and (b) the electron-deficient carbon center on rGO-4PP Nc. (c) Optimum structures of 2-CP absorbing to the electrondeficient carbon center on rGO-4-PP Nc.\n\nbe used as electron-donors to prevent $\\mathrm{H}_{2} \\mathrm{O}_{2}$ from being ineffective oxidized and decomposed in the formed dual-reactioncenter Fenton-like system.\n\n\\subsection{Experimental evidence for creation of dual reaction centers and its Fenton-like reaction mechanisms}\nThe physical rGO-4-PP Nc sample was prepared by combining molecular doping and copolymerization process. As a reference, GO was synthesized by a modified Hummers method.\n\nX-ray diffraction (XRD) was employed to investigate the structures of the GO and rGO-4-PP Nc, as shown in Fig. 7a. The sharp diffraction peak at $10.4^{\\circ}$ for $\\mathrm{GO}$ is a typical characteristic (001) XRD peak, which corresponds to a slice gap of $9.0 \\AA$ between the individual GO sheets. ${ }^{27}$ In addition, no diffraction peak corresponding to graphite was observed, indicating that the graphite was entirely oxidized to GO sheets. ${ }^{28}$ Very differently, this peak disappeared on rGO-4-PP Nc, and two obvious diffraction peaks at $26.0^{\\circ}$ and $42.9^{\\circ}$ were observed, implying that GO substrate was fully reduced to rGO state. However, the positions of these peaks were inconsistent with the standard (a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_980121c407cbdaa46afdg-6_172_648_284_868}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_980121c407cbdaa46afdg-6_679_1155_287_887}\n\\end{center}\n\nFig. 7 Characterization of catalysts. (a) XRD patterns of the GO and rGO-4-PP Nc. (b) FTIR spectra of rGO-4-PP Nc.\n\nXRD peaks of $\\mathrm{rGO},{ }^{29}$ indicating that the obtained rGO-4-PP Nc possessed a completely new structure compared to GO and rGO. Fig. 7b shows the FTIR spectra of the catalyst rGO-4-PP Nc. Three marked peaks were observed at about $1211.2 \\mathrm{~cm}^{-1}$, $1571.9 \\mathrm{~cm}^{-1}$ and $1732.0 \\mathrm{~cm}^{-1}$ that are attributed to the $\\mathrm{C}-\\mathrm{O}-\\mathrm{C}$, $\\mathrm{C}=\\mathrm{C}$ and $\\mathrm{C}=\\mathrm{O}$ groups respectively. This result suggested that the three kinds of chemical bonds exist in the rGO-4-PP Nc structure, implying the successful synthesis of the Fenton-like catalyst by forming the $\\mathrm{C}-\\mathrm{O}-\\mathrm{C}$ bridges in the specific configuration.\n\nThe presence of single electrons in the rGO-4-PP Nc sample was investigated by EPR spectroscopy. As shown in Fig. 8, a Lorentzian line centering at $g=2.0037$ was observed for rGO4-PP Nc, indicating the generation of unpaired electrons on the catalyst $^{30}$ which was mainly due to the bonding of the negatively-charged $\\mathrm{O}$ and edge $\\mathrm{C}$ atoms carrying $\\pi$-electronic spins. ${ }^{31}$ This result revealed that the formed $\\mathrm{C}-\\mathrm{O}-\\mathrm{C}$ bonding bridges in rGO-4-PP Nc gathered many free electrons around the doping $\\mathrm{O}$, forming electron-rich centers in rGO-4-PP Nc. This is the evidence of the successful construction of the dual reaction centers.\n\nFig. 9 showed the results of the BMPO-trapped EPR spectra that could further verify the dual-reaction-center mechanism. In the absence of $\\mathrm{H}_{2} \\mathrm{O}_{2}$, four distinct signals of $\\mathrm{BMPO}-\\mathrm{HO}_{2} \\cdot / \\mathrm{O}_{2}^{\\cdot}$ were observed in the methanol dispersions of rGO-4-PP Nc (Fig. 9a), indicating that the large amounts of free electrons around the doping $\\mathrm{O}$ in $\\mathrm{C}-\\mathrm{O}-\\mathrm{C}$ of $\\mathrm{rGO}-4-\\mathrm{PP} \\mathrm{Nc}$ could efficiently reduce the dissolved $\\mathrm{O}_{2}$ to $\\mathrm{HO}_{2}^{\\cdot} / \\mathrm{O}_{2}^{\\cdot-}$. However, no signals of BMPO- ${ }^{\\circ} \\mathrm{OH}$ appeared in the rGO-4-PP Nc aqueous suspensions\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_980121c407cbdaa46afdg-6_169_650_1137_1840}\n\\end{center}\n\nFig. 8 EPR spectra of the rGO-4-PP Nc solid sample.\n\nwithout $\\mathrm{H}_{2} \\mathrm{O}_{2}$ (Fig. 9b), indicating that the $\\mathrm{H}_{2} \\mathrm{O}$ could not be oxidized to generate ${ }^{\\cdot} \\mathrm{OH}$ at the electron-deficient centers. With the addition of $\\mathrm{H}_{2} \\mathrm{O}_{2}$, four evident BMPO-'OH signals appeared in the rGO-4-PP Nc aqueous suspension (Fig. 9c), which confirmed that $\\mathrm{H}_{2} \\mathrm{O}_{2}$ could be rapidly and efficiently reduced to 'OH by the single electrons on the electron-rich sites of rGO-4PP Nc. In addition, four distinct characteristic signals of BMPO- $\\mathrm{HO}_{2} \\cdot \\mathrm{O}_{2}^{\\cdot}{ }^{\\cdot-}$ were also observed in the system of rGO-4-PP $\\mathrm{Nc} / \\mathrm{H}_{2} \\mathrm{O}_{2}$ (Fig. 9d), indicating that $\\mathrm{H}_{2} \\mathrm{O}_{2}$ could also be activated at the electron-deficient centers. These results verified the successful creation of the dual reaction centers and revealed the Fenton-like reaction mechanisms.\n\nTo further investigate the conversion paths of $\\mathrm{H}_{2} \\mathrm{O}_{2}$ on the dual reaction centers in the presence of pollutants, BPA (with phenolic-OH groups) and PHT (without phenolic -OH groups) were selected as the target compounds. The pure water suspension with catalyst was adopted as control. As shown in Fig. 10, in the pure water suspension, $\\sim 8.3 \\%$ of $\\mathrm{H}_{2} \\mathrm{O}_{2}$ was decomposed within $210 \\mathrm{~min}$ accompanied by a high reaction rate. However, in $\\mathrm{PHT}$ suspension, the $\\mathrm{H}_{2} \\mathrm{O}_{2}$ decomposition was very slow and only $\\sim 1.0 \\%$ of $\\mathrm{H}_{2} \\mathrm{O}_{2}$ was decomposed in the same time interval. This decomposition degree increased to $4.0 \\%$ in the BPA suspension, and the reaction rate was significantly faster than that in the PHT suspension. For all the three kinds of suspensions, $\\mathrm{H}_{2} \\mathrm{O}_{2}$ could be absorbed on the electron-rich oxygen centers and be reduced to ${ }^{\\circ} \\mathrm{OH}$ rapidly. However, the reaction processes were apparently different in the electrondeficient carbon centers. As shown in Fig. $6 \\mathrm{~b}, \\mathrm{H}_{2} \\mathrm{O}$ could be absorbed on the electron-deficient carbon center when there is no pollutant in the system, which is prone to be converted to $-\\mathrm{OH}$ on the catalyst; hence the $\\mathrm{H}_{2} \\mathrm{O}_{2}$ can either absorb to the carbon center directly or be connected by a $-\\mathrm{OH} / \\mathrm{H}_{2} \\mathrm{O}$. Whichever process is carried out, $\\mathrm{H}_{2} \\mathrm{O}_{2}$ is the only electron donor in the systems without the pollutants. Thus, the decomposition reactions of $\\mathrm{H}_{2} \\mathrm{O}_{2}$ were carried out simultaneously at both the electron-rich and -deficient centers, which caused its reaction rate to be the highest of the three. After adding pollutants (BPA or $\\mathrm{PHT}$ ) in the systems, the electron-rich organic compounds occupied the electron-deficient reaction centers and might act as electron donors, which prevented $\\mathrm{H}_{2} \\mathrm{O}_{2}$ from contacting with the electron-deficient centers and avoided the useless decomposition of $\\mathrm{H}_{2} \\mathrm{O}_{2}$. Thus, the BPA and PHT systems exhibited\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_980121c407cbdaa46afdg-7_167_2125_231_929}\n\nFig. 9 BMPO spin-trapping EPR spectra for (a) $\\mathrm{HO}_{2} \\cdot \\mathrm{O}_{2}^{\\cdot-}$ and (b) $\\cdot \\mathrm{OH}$ in the rGO-4-PP Nc suspensions without $\\mathrm{H}_{2} \\mathrm{O}_{2}$, and (c) $\\cdot \\mathrm{OH}$ and (d) $\\mathrm{HO}_{2} \\cdot \\mathrm{O}_{2} \\cdot-$ in the rGO-4-PP Nc suspensions with $\\mathrm{H}_{2} \\mathrm{O}_{2}$.\n\na lower rate for $\\mathrm{H}_{2} \\mathrm{O}_{2}$ decomposition. However, the apparent difference for $\\mathrm{H}_{2} \\mathrm{O}_{2}$ decomposition in the BPA and PTH systems was caused by the structural properties of the two pollutants. During the reactions, BPA (with phenolic - $\\mathrm{OH}$ groups) could absorb on the electron-deficient centers and complex with the C\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_980121c407cbdaa46afdg-7_168_646_1163_1803}\n\\end{center}\n\nFig. $10 \\mathrm{H}_{2} \\mathrm{O}_{2}$ decomposition curve of pure water, BPA and PHT suspensions with catalyst (initial BPA/PHT concentration $10 \\mathrm{mg} \\mathrm{L}^{-1}$, initial $\\mathrm{H}_{2} \\mathrm{O}_{2}$ concentration $10 \\mathrm{mM}$, catalyst concentration $1.0 \\mathrm{~g} \\mathrm{~L}^{-1}$, temperature $35^{\\circ} \\mathrm{C}$, natural $\\mathrm{pH}$ ).\n\nsites through its phenolic - OH groups which was able to transfer the electron more quickly, while the PHT without the phenolic - OH groups could only absorb on the center but not form the complexation with the C sites, which could not rapidly transfer the electrons to the electron-deficient centers. Thus, the activity for $\\mathrm{H}_{2} \\mathrm{O}_{2}$ decomposition in the presence of PHT was lower than that in the presence of BPA, resulting in the higher decomposition rate in the BPA suspension being observed.\n\nAbove results confirmed the formation of the dual reaction centers in the rGO-4-PP Nc and clarified the interaction mechanism of the catalyst with $\\mathrm{H}_{2} \\mathrm{O}_{2}$ and pollutants, which indicated that we can rationally predict the property, performance and the Fenton-like reaction process of the metal-free catalyst through theoretical approaches.\n\n\\subsection{Fenton-catalytic performance of rGO-4-PP Nc}\nTo investigate the performance of the physical rGO-4-PP Nc catalyst, the typical aromatic compound 2-CP (10 ppm) with phenolic - OH group was chosen as the degradation target under the natural $\\mathrm{pH}$ conditions $(\\mathrm{pH}=\\sim 6.8)$. At the adsorption equilibrium point, $\\sim 29.3 \\%$ of 2-CP was adsorbed on the surface of rGO-4-PP Nc. After adding $\\mathrm{H}_{2} \\mathrm{O}_{2}$ (Fig. 11a), the degradation rate of 2-CP in the rGO-4-PP Nc suspension could reach $86.4 \\%$ within $120 \\mathrm{~min}$, which was considerably higher than that in the suspensions of graphite, GO and rGO..$^{32}$ We also carried out the activity evaluation experiments using BPA (10 $\\mathrm{ppm})$ as target pollutant. In the neutral mild conditions, the degradation rate of BPA within $120 \\mathrm{~min}$ could reach $\\sim 75 \\%$. The effect of the initial $\\mathrm{pH}$ value on 2-CP degradation in rGO-4-PP $\\mathrm{Nc}$ suspension was also determined as presented in Fig. 11a. At pH 3.7, the catalyst shows the highest activity that the degradation rate of 2CP could reach $91.8 \\%$ within $120 \\mathrm{~min}$. The degradation rate slightly decreased with the increase of the initial $\\mathrm{pH}$, but it still could reach $\\sim 78 \\%$ within $120 \\mathrm{~min}$ at $\\mathrm{pH} 9.2$, indicating that the rGO-4-PP Nc had a wide $\\mathrm{pH}$ application range. The reusability of rGO-4-PP Nc was examined after getting filtered, washed and dried. As shown in Fig. 11b, the activity of rGO-4-PP Nc for 2-CP degradation did not evidently decrease after 8 continuous cycles of the degradation experiments, which suggested that rGO-4-PP Nc was a stable and efficient catalyst.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_980121c407cbdaa46afdg-8_168_1202_254_908}\n\nFig. 11 (a) Degradation of 2-CP in rGO-4-PPNc Fenton-like systems under different $\\mathrm{pH}$ conditions. (b) Reusability of $\\mathrm{rGO}-4-\\mathrm{PP} \\mathrm{Nc}$ for 2-CP degradation at neutral conditions.\n\nIn addition, we also carried out the XRD and FTIR measurement of $\\mathrm{rGO}-4-\\mathrm{PP} \\mathrm{Nc}$ after Fenton-like reaction. As shown in Fig. 12a, two obvious XRD diffraction peaks at $26.0^{\\circ}$ and $43.2^{\\circ}$ are observed for rGO-4-PP Nc after Fenton-like reaction, which are almost the same with the fresh rGO-4-PP Nc sample (Fig. 7a). Fig. 12b shows the results of FTIR spectra of rGO-4-PP Nc before and after the Fenton-like reaction. Three marked peaks of $\\mathrm{C}-\\mathrm{O}-\\mathrm{C}, \\mathrm{C}=\\mathrm{C}$ and $\\mathrm{C}=\\mathrm{O}$ groups, which are the typical characteristics of the fresh sample, are also observed after the Fenton-like reaction. These results suggest that the structure of rGO-4-PP Nc is not changed after the Fenton-like reaction, further revealing the excellent stability and reusability of rGO-4-PP Nc.\n\n\\section{Conclusions}\nThe electronic properties and active sites of the 4-PP-modified graphene material were studied using the DFT method by different approaches. The results of the atom charge, electron density, HOMO/LUMO analysis and ESP distribution confirmed the nonuniform distribution of the electrons and the formation of the dual reaction centers for our catalyst models. The actual catalyst, named rGO-4-PP Nc, was also prepared via a surface complexation process and characterized by XRD, FTIR and EPR. The adsorption models and the $\\mathrm{H}_{2} \\mathrm{O}_{2}$ decomposition experiments verified the dual-reaction-center mechanism that the $\\mathrm{H}_{2} \\mathrm{O}_{2}$ could absorb to the electron-rich oxygen center easily while the\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_980121c407cbdaa46afdg-8_166_1198_1157_1815}\n\nFig. 12 (a) XRD patterns and (b) FTIR spectra of $\\mathrm{rGO}$-4-PP Nc after the Fenton-catalytic reaction.\n\npollutants compete with the $\\mathrm{H}_{2} \\mathrm{O}_{2}$ to complex with the electrondeficient carbon center, avoiding the useless decomposition of $\\mathrm{H}_{2} \\mathrm{O}_{2}$. Thus, rGO-4-PP Nc shows an excellent performance for pollutant removal. This study offers a new perspective to investigate the potential activity of catalyst theoretically, which is meaningful for finding new metal-free catalyst not only for the Fenton reaction, but also for the other AOPs.\n\n\\section{Conflicts of interest}\nThere are no conflicts to declare.\n\n\\section{Acknowledgements}\nThis work was supported by the National Key Research and Development Plan (2016YFA0203200), the National Natural Science Foundation of China (51538013) and the Science Starting Foundation of Guangzhou University (2700050302).\n\n\\section{References}\n1 S. Navalon, M. de Miguel, R. Martin, M. Alvaro and H. Garcia, J. Am. Chem. Soc., 2011, 133, 2218-2226.\n\n2 R. Martín, M. Álvaro, J. R. Herance and H. García, ACS Nano, $2010,4,65-74$.\n\n3 W. P. Li, C. H. Su, Y. C. Chang, Y. J. Lin and C. S. Yeh, ACS Nano, 2016, 10, 2017-2027. 4 A. M. Nowicka, U. Hasse, M. Hermes and F. Scholz, Angew. Chem., Int. Ed. Engl., 2010, 49, 1061-1063.\n\n5 P. V. Nidheesh, RSC Adv., 2015, 5, 40552-40577.\n\n6 L. Lyu, L. L. Zhang and C. Hu, Chem. Eng. J., 2015, 274, 298306.\n\n7 W. J. Song, M. M. Cheng, J. H. Ma, W. H. Ma, C. C. Chen and J. C. Zhao, Environ. Sci. Technol., 2006, 40, 4782-4787.\n\n8 S. Navalon, R. Martin, M. Alvaro and H. Garcia, Angew. Chem., Int. Ed., 2010, 49, 8403-8407.\n\n9 L. Lyu, L. L. Zhang, Q. Y. Wang, Y. L. Nie and C. Hu, Environ. Sci. Technol., 2015, 49, 8639-8647.\n\n10 L. Lyu, L. L. Zhang, C. Hu and M. Yang, J. Mater. Chem. A, 2016, 4, 8610-8619.\n\n11 L. Lyu, L. L. Zhang and C. Hu, Environ. Sci.: Nano, 2016, 3, 1483-1492.\n\n12 L. Lyu, L. Zhang, G. He, H. He and C. Hu, J. Mater. Chem. A, $2017,5,7153-7164$.\n\n13 M. D. Bhatt, G. Lee and J. S. Lee, J. Phys. Chem. C, 2016, 120, 26435-26441.\n\n14 E. Vayner and A. B. Anderson, J. Phys. Chem. $C, 2007,111$, 9330-9336.\n\n15 L. Yu, X. Pan, X. Cao, P. Hu and X. Bao, J. Catal., 2011, 282, 183-190.\n\n16 M. D. Esrafili, R. Mohammad-Valipour, S. M. MousaviKhoshdel and P. Nematollahi, ChemphysChem, 2015, 16, 3719-3727.\n\n17 M. D. Esrafili and L. Dinparast, Chem. Phys. Lett., 2017, 682, 49-54. 18 D. Düzenli, J. Phys. Chem. C, 2016, 120, 20149-20157.\n\n19 L. H. Thomas, E. Cheung, A. O. F. Jones, A. A. Kallay, M. H. Lemee-Cailleau, G. J. McIntyre and C. C. Wilson, Cryst. Growth Des., 2012, 12, 1746-1751.\n\n20 Gaussian, Inc., Wallingford CT, 2016.\n\n21 A. V. Marenich, C. J. Cramer and D. G. Truhlar, J. Phys. Chem. $B, 2009,113,6378-6396$.\n\n22 T. Lu and F. Chen, J. Comput. Chem., 2012, 33, 580-592.\n\n23 Y. Xu, H. Bai, G. Lu, C. Li and G. Shi, J. Am. Chem. Soc., 2008, 130, $5856-5857$.\n\n24 H. Bader, V. Sturzenegger and J. Hoigné, Water Res., 1988, 22, 1109-1115.\n\n25 P. Politzer, P. R. Laurence and K. Jayasuriya, Environ. Health Perspect., 1985, 61, 191-202.\n\n26 P. Sjoberg and P. Politzer, J. Phys. Chem., 1990, 94, 39593961.\n\n27 J. M. Wan, M. Wei, Z. W. Hu, Z. Q. Peng, B. Wang, D. Y. Feng and Y. W. Shen, Int. J. Hydrogen Energy, 2016, 41, 1469214703.\n\n28 U. Alam, M. Fleisch, I. Kretschmer, D. Bahnemann and M. Muneer, Appl. Catal., B, 2017, 218, 758-769.\n\n29 Z. Guo, Z. Y. Wang, H. H. Wang, G. Q. Huang and M. M. Li, Mater. Sci. Eng., C, 2015, 57, 197-204.\n\n30 X. Pan and Y.-J. Xu, J. Phys. Chem. C, 2013, 117, 17996-18005.\n\n31 D. W. Boukhvalov, V. Y. Osipov, A. I. Shames, K. Takai, T. Hayashi and T. Enoki, Carbon, 2016, 107, 800-810.\n\n32 L. Lyu, G. F. Yu, L. L. Zhang, C. Hu and Y. Sun, Environ. Sci. Technol., DOI: 10.1021/acs.est.7b04865.\n\n\n\\end{document}", "record_id": "2023_09_22_980121c407cbdaa46afdg"}