{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Stability and Carrier Transport Properties of Phosphorene }\n\n\n\\author{Sumandeep Kaur K 2 $^{1,2}$, Ashok Kumar ${ }^{2 *}$, Sunita Srivastava ${ }^{1}$, Ravindra Pandey ${ }^{3}$\\\\\nand K. Tankeshwar ${ }^{1,4^{*}}$\\\\\n${ }^{1}$ Department of Physics, Panjab University, Chandigarh 160014 , India\\\\\n${ }^{2}$ Department of Physical Sciences, School of Basic and Applied Sciences, Central\\\\\nUniversity of Punjab, Bathinda, 151001, India\\\\\n${ }^{3}$ Department of Physics, Michigan Technological University, Houghton, MI, 49931,\\\\\nUSA\\\\\n${ }^{4}$ Department of Physics, Guru Jambheshwar University of Science and Technology,\\\\\nHisar, 125001, Haryana, India}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\n\\section{Based Polymorphic Nanoribbons}\n(January 27, 2018)\n\n*Emails:\n\nAshok Kumar (\\href{mailto:ashokphy@cup.edu.in}{ashokphy@cup.edu.in})\n\nK. Tankeshwar (\\href{mailto:tkumar@gjust.org}{tkumar@gjust.org})\n\n\\begin{abstract}\nA few-layer black phosphorene has recently gained significant interest in the scientific community. In this paper, we consider several polymorphs of phosphorene nanoribbons (PNRs) and employ deformation potential theory within the effective mass approximation together with density functional theory to investigate their structural, mechanical and electronic properties. The results show that stability of PNRs strongly depends on the direction along which they can be cut from 2D counterpart. PNRs also exhibit a wide range of line stiffness ranging from $6 \\times 10^{10} \\mathrm{eV} / \\mathrm{m}$ to $18 \\times 10^{11} \\mathrm{eV} / \\mathrm{m}$ which has little dependence on the edge passivation. Likewise, the calculated electronic properties of PNRs display them to be either narrow-gap semiconductor $\\left(E_{g}<1 \\mathrm{eV}\\right)$ or wide-gap semiconductor $\\left(E_{g}>\\right.$ $1 \\mathrm{eV})$. The carrier mobility of PNRs is found to be comparable to that of the black phosphorene. Some of the PNRs show n-type (p-type) semiconducting character owing to their higher electron (hole) mobility. Passivation of the edges leads to n-type $\\leftrightarrow$ p-type transition in many of the PNRs considered. The predicted novel characteristics of PNRs with a wide range of mechanical and electronic properties make PNRs to be potentially suitable for the use in nanoscale devices.\n\\end{abstract}\n\n\\section{Introduction}\nSince its successful exfoliation in 2014, a few-layer black phosphorene has gained significant interest in the scientific community [1]. Monolayer black phosphorene ( $\\alpha-\\mathrm{P})$ with its unique anisotropic puckered structure is a direct band gap semiconductor with a bandgap of $\\sim 1.0 \\mathrm{eV}$ [2]. It is found to withstand mechanical strains as high as $40 \\%$ with a large lateral flexibility [3]. Another equally stable two-dimensional (2D) allotrope of phosphorus is blue phosphorene $(\\beta$-P) which is recently realized experimentally $[4,5]$. Blue phosphorene possess graphene-like structure with the out-of-plane buckling of $2.2 \\AA$ and an indirect band gap of 2.0 eV [6]. Both black and blue phosphorene have intrinsic carrier mobility as high as $10^{3}$ $\\mathrm{cm}^{2} \\mathrm{~V}^{-1} \\mathrm{~s}^{-1}[7,8]$. The high carrier mobility and semiconducting character of $\\alpha$ - and $\\beta$-P makes them promising material for the potential application in the optical and electronic devices [9].\n\nBulk phosphorus can form various allotropes such as violet, red, white and black due to the inequivalent $s p^{3}$ hybridization of orbitals in the lattice [3]. Likewise, several structurally different 2D polymorphs of phosphorous namely, $\\alpha-\\mathrm{P}, \\beta-\\mathrm{P}, \\gamma-\\mathrm{P}, \\delta-\\mathrm{P}, \\varepsilon-\\mathrm{P}, \\tau-\\mathrm{P}, \\eta-\\mathrm{P}, \\theta-\\mathrm{P}, \\phi-\\mathrm{P}$, tricycle-type red phosphorene (R-P), square-octagon phosphorene (O-P) and hexagonal-star phosphorene (H-P) have been investigated using first principles method [10-17]. $\\alpha-\\mathrm{P}, \\beta-\\mathrm{P}, \\gamma-\\mathrm{P}$, $\\delta$-P and R-P exhibit buckled honeycomb structure consisting of a six membered ring similar to graphene, while $\\varepsilon-\\mathrm{P}, \\tau-\\mathrm{P}, \\eta-\\mathrm{P}, \\theta-\\mathrm{P}, \\phi$-P, O-P, H-P crystallize into non-honeycomb structural arrangements. Red phosphorene is constructed by the in-plane connections of the segments of $\\alpha-\\mathrm{P}$ and $\\beta-\\mathrm{P}[14] . \\varepsilon-\\mathrm{P}$ and $\\tau-\\mathrm{P}$ consist of squared units of phosphorus atoms while $\\eta-\\mathrm{P}$ and $\\theta-\\mathrm{P}$ have phosphorus atoms in the pentagon structural arrangement [12]. $\\phi$-P consists of 4, 6 and 10 membered rings [13], and O-P allotrope contains a unique atomic octagonal tiling (OT) pattern consisting of 4 and 8 membered rings [15]. The phosphorus atoms in H-P forms a hexagonal lattice with a Magen-David-like top view [16]. The honeycomb structures of phosphorene exhibit two type of edges i.e., armchair and zigzag, whereas most of the nonhoneycomb structures are found to possess more than two distinctly different edges. All these 2D polymorphs are found to be semiconducting in nature with band gap ranging from $0.4 \\mathrm{eV}$ to $2.1 \\mathrm{eV}[10-17]$. Note that $\\alpha-\\mathrm{P}$ and $\\beta$-P are experimentally realized, whereas the other allotropes are yet to be synthesized.\n\nSimilar to one-dimensional (1D) graphene nanoribbons (GNRs), the phosphorene 1D nanoribbons can be constructed from their 2D counterpart by cutting along various edge direction. Several 1D structures of black and blue phosphorene have been investigated previously [9]. The $\\alpha$ - and $\\beta$-phosphorene nanoribbons possess two types of edges i.e. armchair (AC) and zigzag (ZZ), which strongly influence their band gaps [18, 19]. External electric field has been shown to modify electronic band gap of both AC and ZZ $\\alpha$-PNRs due to giant starkeffect [20, 21]. Also, the electron/hole effective masses and carrier mobility of both $\\alpha$ - and $\\beta$ PNRs are found to depend on the edge configurations [22]. On the other hand, in the nonhoneycomb PNR structures, various types of edges exist and it will be interesting to investigate their properties.\n\nIn the present work, we consider 5 honeycomb and 8 non-honeycomb phosphorene polymorphs, and report the results of density functional theory calculations to determine energetics, mechanical stability and carrier mobility. In the following, Sec 2 briefly describes the computational model. Results are discussed in Sec 3, and summary is given in Sec 4.\n\n\\section{Computational Method}\nDensity functional theory calculations were performed using the SIESTA program package [23]. The norm-conserving Troullier Martin pseudopotential was used to treat the electron-ion interactions [24], whereas the exchange and correlation energies were described using the GGA functional form [25]. Double zeta basis set with polarization functions (DZP) were used to expand the Kohn Sham orbitals with the mesh cuttoff energy of $450 \\mathrm{Ry}$. The minimization of energy was carried out using the conjugate-gradient (CG) technique with the forces less than $0.01 \\mathrm{eV} / \\AA$ on each atoms. Monkhorst-Pack scheme was used to sample Brillouin zone with a $(30 \\times 30 \\times 1)$ mesh for 2 D sheets. A $(30 \\times 1 \\times 1)$ and $(1 \\times 30 \\times 1)$ mesh was used for PNRs with length along $x$ and $y$ direction, respectively. A vacuum region greater than $20 \\AA$ along the two direction has been used in calculations to avoid the superficial interactions due to replicas.\n\nThe carrier transport in PNRs was calculated by the deformation potential (DP) theory [26] and effective mass approximation. The lowest energy PNR structures were considered for calculations. For one-dimensional (1D) systems, an analytical expression [27] for the mobility $(\\mu)$ was employed as follows:\n\n\\[\n\\mu_{1 D}=\\frac{e \\hbar^{2} C_{1 D}}{\\left(2 \\pi k_{B} T\\right)^{1 / 2}\\left|m^{*}\\right|^{3 / 2} E_{1}^{2}},\n\\]\n\nwhere $T=300 \\mathrm{~K}$ and $m^{*}$ is the effective mass of the charge carriers, defined as $m^{*}=$ $\\hbar^{2}\\left(\\partial^{2} E(k) / \\partial k^{2}\\right)^{-1}$. $C$ is the stretching modulus caused by the uniaxial-strain $(\\varepsilon)$, which has been calculated using the expression $C_{1 D}=\\frac{1}{L_{0}} \\frac{d^{2} E_{S}}{d e^{2}}$, in which $E_{S}$ is the strain energy of a unit cell and $L_{0}$ is the equilibrium lattice constant. $E_{1}$ in Eqn. (1) is the deformation-potential (DP) constant, that denote the shift of the band-edge energy induced by strain, and has been obtained as $E_{1}=\\frac{d E_{\\text {edge }}}{d e}$, where $E_{\\text {edge }}$ is the energy of the conduction band minimum (for electrons) or the valence band maximum (for holes). Note that Eqn. (1) has been successfully applied previously to study the intrinsic mobility of GNRs [28], graphyne nanoribbons [29] and PNRs [9].\n\n\\section{Results and Discussions}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_3ae1fab1e33569c30b8dg-06_236_1832_336_1743}\n\\end{center}\n\nFIGURE 1: Phosphorene allotropes indicating different type of edge (with different colors) in different direction $(x$ and $y$ ). Since $\\eta$-P and $\\theta$-P possess large number of edge structures, a few representative cases are presented here, others are given in in Figure S1 of ESI.\n\nDepending upon the ways to connect tetrahedrally coordinated P-atoms in a 2D lattice, different structural allotropes can be formed. We have considered several allotropes of phosphorene, including $\\beta$-P, $\\gamma-\\mathrm{P}, \\delta-\\mathrm{P}, \\varepsilon-\\mathrm{P}, \\tau-\\mathrm{P}, \\eta-\\mathrm{P}, \\theta-\\mathrm{P}, \\phi-\\mathrm{P}, \\kappa_{4}-\\mathrm{P}, \\mathrm{R}-\\mathrm{P}, \\mathrm{O}-\\mathrm{P}$ and $\\mathrm{H}-\\mathrm{P}$. All these allotropes are found to be semiconducting with calculated band gap varying from $0.48 \\mathrm{eV}$ to $2.09$ eV (Table S1 of ESI). The magnitude of the relative formation energies (ERFmono) of all these $2 \\mathrm{D}$ allotropes are found to be of the order of $10-10^{2} \\mathrm{meV}$ /atom, indicating their ease of formation. This suggests that not only the $\\alpha$ - and $\\beta$-P, but the other allotropes can also be experimentally realized. Hence, it is worth to explore the properties of other allotropes. Note that $\\mathrm{E}_{\\mathrm{RFm}}$.no can be obtained as: $E_{R F m o n o}=\\frac{E_{A}-N E_{\\alpha}}{N}$, where $E_{A}$ is the total energy of the considered phosphorene allotrope and $E_{\\alpha}$ is the energy per atom of the most stable phosphorene allotrope i.e. $\\alpha$-P and $N$ is the number of atoms per unit cell of the allotrope. Similarly, the cohesive energies are in the range of $-5.50$ to $-5.66$ eV/atom and are comparable to that of $\\alpha-\\mathrm{P}$ ( $-5.68$ eV/atom) (Table $\\mathrm{S} 1$ of ESI).\n\nFigure 1 shows the different types of possible edges of allotropes of phosphorene considered. Each allotrope cut along the distinct edges gives rise to a distinct phosphorene nanoribbon. The honeycomb structures ( $\\alpha-\\mathrm{P}, \\beta-\\mathrm{P}, \\gamma-\\mathrm{P}, \\delta$-P and R-P) possess two edge structures one along $\\mathrm{x}$-direction and the other along $\\mathrm{y}$-direction. Unlike these honeycomb structures which possess only one type of edge along each direction, the non-honeycomb structures possess more than one different types of edges along different directions. Due to perfect square symmetry in the unit cell of $\\varepsilon-\\mathrm{P}$ and $\\mathrm{O}-\\mathrm{P}$, they possess two different edge structures $\\left(\\varepsilon_{\\mathrm{x} 1}, \\varepsilon_{\\mathrm{x} 2}\\right.$ and $\\mathrm{O}_{\\mathrm{x} 1}, \\mathrm{O}_{\\mathrm{x} 2}$ ) along one direction which are also similar in other direction (Figure 1). The $\\mathrm{H}-\\mathrm{P}$ allotrope also exhibit two types of edge structures $\\left(\\mathrm{H}_{\\mathrm{x} 1}\\right.$ and $\\left.\\mathrm{H}_{\\mathrm{x} 2}\\right)$ along one direction which are also similar in other direction due to the hexagonal symmetry in its structure. $\\tau$-P forms four PNR structures corresponding to the two different type of edges along each direction shown in Figure 1. $\\eta-P$ possesses 11 PNR structures, 5 along $\\mathrm{x}$ axis $\\left(\\eta_{\\mathrm{x} 1}, \\eta_{\\mathrm{x} 2}, \\eta_{\\mathrm{x} 3}, \\eta_{\\mathrm{x} 4}\\right.$ and $\\left.\\eta_{\\mathrm{x} 5}\\right)$ and 6 along $\\mathrm{y}$ axis $\\left(\\eta_{\\mathrm{y} 1}, \\eta_{\\mathrm{y} 2}, \\eta_{\\mathrm{y} 3}, \\eta_{\\mathrm{y} 4}, \\eta_{\\mathrm{y} 5}\\right.$ and $\\left.\\eta_{\\mathrm{y} 6}\\right)$ (Figure 1 \\& Figure $\\mathrm{S} 1$ of ESI). $\\theta$-P possesses 7 PNRs structures, 4 along $\\mathrm{x}$ axis $\\left(\\theta_{\\mathrm{x} 1}, \\theta_{\\mathrm{x} 2}, \\theta_{\\mathrm{x} 3}\\right.$ and $\\left.\\theta_{\\mathrm{x} 4}\\right)$ and 3 along $\\mathrm{y}$ axis $\\left(\\theta_{\\mathrm{y} 1}, \\theta_{\\mathrm{y} 2}\\right.$ and $\\left.\\theta_{\\mathrm{y} 3}\\right)$. $\\phi$-P form 6 PNR structures, 3 along $\\mathrm{x}$ axis $\\left(\\phi_{\\mathrm{x} 1}, \\phi_{\\mathrm{x} 2}\\right.$, and $\\left.\\phi_{\\mathrm{x} 3}\\right)$ and 3 along $\\mathrm{y}$ axis $\\left(\\phi_{\\mathrm{y} 1}, \\phi_{\\mathrm{y} 2}\\right.$ and $\\left.\\phi_{\\mathrm{y} 3}\\right) \\cdot \\kappa_{4}-\\mathrm{P}$ possesses two different structures one along each direction $\\left(\\kappa_{4 \\times 1}\\right.$ and $\\left.\\kappa_{4 y 1}\\right)$. The width of considered PNRs lies in the range $17 \\AA$ to $46 \\AA$ [Table 1].\n\nTherefore, depending on the edge configuration in $\\mathrm{x}$ - and y-direction, total 46 structures\n\n[Figures 1, S1 and S2 of ESI] were considered. Note that, in the equilibrium configurations,\n\nTABLE 1. Calculated deformation potential $\\left(E_{1}\\right)$, energy bandgap of bare and passivated PNRs. (a) is length and (w) is width along the periodic direction of the bare PNRs.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_3ae1fab1e33569c30b8dg-08_879_2644_287_1780}\n\\end{center}\n\nthe edge atoms in the bare PNRs show reconstruction due to the presence of the dangling bonds [Figure S2 of ESI]. The dangling bonds on the edges of a given PNR are then terminated by hydrogen atoms [Figure S3].\n\n\\subsection{Structural Stability}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_3ae1fab1e33569c30b8dg-09_824_1523_263_1005}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_3ae1fab1e33569c30b8dg-09_882_1522_1004_1690}\n\\end{center}\n\n(c) Systems\n\n(d)\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_3ae1fab1e33569c30b8dg-09_1586_2248_248_1672}\n\nSystems\n\nFIGURE 2: Formation energy per atom and binding energy per atom of the PNRs considered.\n\nThe bars in (a) and (b) shows the data for the 2D sheet. In order to study the energetic stability of the considered PNRs, we have calculated their formation energy ( $E_{F P N R}$ ) which is defined as the energy required to form these\n\nnanoribbons from their $2 \\mathrm{D}$ counterpart. The formula is given as: $E_{F P N R}=\\frac{E_{R}-N E_{2 D}}{N}$, where $E_{R}$ is the total energy of the ribbons, $E_{2 D}$ is the energy per atom of the 2D sheet and $N$ is the number of atoms per unit cell of the ribbons. $E_{F P N R}$ of ribbons (except $\\beta$-PNRs) are found to be lower than that of the black phosphorene nanoribbons ( $\\alpha$-PNRs), thereby indicating these PNRs to be energetically more favourable than the PNRs of most stable black phosphorus.\n\nThe energetic stability of PNRs are found to be strongly dependent on the direction along which they can be cut from their 2D counterpart. It is found that four of the 2D monolayer structures (i.e. $\\beta$-P, $\\eta$-P, $\\theta$-P and R-P), have formation energy comparable (the energy difference being less than $40 \\mathrm{meV} / \\mathrm{atom})$ with the most stable monolayer structure ( $\\alpha$-P) [Figures 2 (a \\& b)], indicating these monolayers to be equally stable. Other 2D structures are energetically not favourable, however, their 1D counterparts show energetically favourable structures which is evident from their low value of formation energies. Note that $\\beta-\\mathrm{P}, \\eta-\\mathrm{P}, \\theta-\\mathrm{P}$, R-P and H-P possesses least tension in their structures due to the presence of either 5 or 6 membered rings whereas the increased tension in $\\varepsilon-\\mathrm{P}, \\tau-\\mathrm{P}, \\phi-\\mathrm{P}, \\kappa_{4}-\\mathrm{P}$ and $\\mathrm{O}-\\mathrm{P}$ due to the presence of 4 membered rings in their structures makes them less favourable. However, the energy difference of the order of a few meV indicates their ease of formation.\n\nIn order to get further insight into energetics of given PNRs structures, the binding energy was calculated using the formula: $E_{B}=\\frac{E_{R}-N E_{S}}{N}$, where $E_{R}$ is the total energy of the ribbon, $E_{S}$ is the energy of the isolated single phosphorene atom and $N$ is the number of atoms in ribbons. The binding energies of the PNRs lies within the range $-5.65$ to $-5.45$ eV/atom [Figures 2 (c \\& d)] which are comparable with the binding energy ( $-5.68 \\mathrm{eV} /$ atom) of most stable black phosphorene monolayer.\n\n\\subsection{Mechanical Property}\nThe representative structures in each edge direction based on the minimum total energy criterion were considered to determine their mechanical property which led to total of 34 semiconducting (17 bare and 17 passivated) PNRs. Stiffness of a material is an important parameter to describe its mechanical stability. The stiffer an object is, the less flexible it is. In\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_3ae1fab1e33569c30b8dg-11_859_1528_250_1029}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_3ae1fab1e33569c30b8dg-11_859_1528_1041_1826}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_3ae1fab1e33569c30b8dg-11_1622_2250_364_1692}\n\\end{center}\n\nFIGURE 3: (TOP) Bare PNRs: strain energy vs. strain applied along (a) x-axis, and (b) y-axis.\n\n(BOTTOM) (c) The line stiffness of bare (WP) and passivated (P) PNRs considered. $1 \\mathrm{D}$ ribbons one can calculate line stiffness using the formula: $C_{1 D}=\\frac{1}{L_{0}} \\frac{d^{2} E_{S}}{d e^{2}}$, where $E_{S}$ is the difference in the total energy of the equilibrium and the strained PNRs, $e$ is the applied strain and $L_{0}$ is length of the ribbon. For each ribbon, a strain varying from $-1 \\%$ to $+1 \\%$ in the steps of $0.5 \\%$ is applied along the length of the ribbon. The line stiffness is then calculated by fitting the strained energy $\\left(E_{S}\\right)$ versus strain ( $e$ ) curve with the formula $E_{S}=a_{0} e^{2}+a_{1} e+$ $a_{2}$ [Figure $3(\\mathrm{a} \\& \\mathrm{~b})$ and Figure S4].\n\nIt is found that the line stiffness of PNRs varies from $6 \\times 10^{10} \\mathrm{eV} / \\mathrm{m}$ (for $\\mathrm{R}_{\\mathrm{y} 1}-\\mathrm{PNR}$ ) to $18.6 \\times 10^{11} \\mathrm{eV} / \\mathrm{m}$ (for $\\phi_{\\mathrm{x} 1}$-PNR) [Figure 3] indicating R-PNR cut along y-direction to be most flexible while $\\phi$-P cut along $\\mathrm{x}$ direction to be the least flexible. Note that the calculated value of $\\alpha$-PNR is $16.6 \\times 10^{10} \\mathrm{eV} / \\mathrm{m}$. Line stiffness depends upon the inverse of the length of the nanoribbon, which does not get effected on passivation. Also, the strain is applied in the small region i.e. $\\pm 1 \\%$ where hooks law is applicable. The rate of change of energy with strain for the passivated and unpassivated PNRs remain nearly identical that leads to nearly same line stiffness for both types of nanoribbons [Figures 3] and their mechanical flexibility does not change much with the passivation of edges.\n\n\\subsection{Electronic and Carrier Transport Properties}\nNext, we calculate the electronic structure of the PNRs considered. The semiconducting behavior of given PNRs varies from narrow-gap semiconductor $\\left(\\mathrm{E}_{\\mathrm{g}}<1 \\mathrm{eV}\\right)$ to wide-gap semiconductor $\\left(\\mathrm{E}_{\\mathrm{g}}>1 \\mathrm{eV}\\right)$. Passivation of edges with hydrogen increases the band gap of PNRs which lies in the range 0.3-2.2 $\\mathrm{eV}$ [Table 1 and Figures 4]. The increase in bandgap on the edge-passivation is attributed to the pairing of electrons due to hydrogen atoms which\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_3ae1fab1e33569c30b8dg-13_237_1373_227_1829}\n\\end{center}\n\nFIGURE 4: Calculated band structures of phosphorene nanoribbons. Red color indicates bands of the bare PNRs while passivated PNRs are shown by blue color.\n\neliminates the dangling bonds. On passivation, direct $\\leftrightarrow$ indirect band gap transition has been found to occur in these PNRs. For example, in $\\alpha_{x 1}-P N R$, CBM shifts from a point between $\\Gamma \\& X$ to $\\Gamma$ while VBM remains at $\\Gamma$; in $\\gamma_{x 1}-P N R, C B M$ shifts from $X$ to $\\Gamma$ while VBM remains at $\\Gamma$; in $\\phi_{x 1}-\\mathrm{PNR}, \\mathrm{CBM}$ remains at $\\Gamma$ while VBM shifts from $\\mathrm{X}$ to $\\Gamma$ leading to an (indirect $\\rightarrow$ direct transition) in these PNRs.\n\nOn the other hand, direct $\\rightarrow$ indirect bandgap transition occurs in $\\beta_{\\mathrm{x} 1}$-PNR due to a shift of CBM from $\\Gamma$ to a point between $\\Gamma \\& \\mathrm{X}$ and VBM from $\\Gamma$ to $X$, while in $\\theta_{\\mathrm{x} 1^{-}} \\mathrm{PNR}$ and $\\phi_{\\mathrm{y} 3}-$ PNR this transition occurs only due to a shift of CBM from $\\Gamma$ to $\\mathrm{X}$ and from $\\Gamma$ to a point between $\\Gamma \\& Y$, respectively. The magnitude of band gap is found to be highly anisotropic, i.e., it is less for a PNR along the $\\mathrm{x}$ direction compared to a PNR along y direction of same allotrope, for example, the bandgap of $\\tau_{\\mathrm{x} 1}\\left(\\mathrm{E}_{\\mathrm{g}}=0.73 \\mathrm{eV}\\right)$ and $\\phi_{\\mathrm{x} 1}\\left(\\mathrm{E}_{\\mathrm{g}}=0.32 \\mathrm{eV}\\right)$ is respectively less than the bandgap of $\\tau_{\\mathrm{y} 2}\\left(\\mathrm{E}_{\\mathrm{g}}=1.14\\right)$ and $\\phi_{\\mathrm{y} 3}\\left(\\mathrm{E}_{\\mathrm{g}}=0.90\\right)$. (Table 1$)$.\n\nTo calculate the carrier mobility, the effective masses of electron or holes need to be determined [Eqn (1)]. The electron (hole) effective mass is inversely proportional to the curvature of the CBM (VBM) of a given band structure. Therefore, the effective mass of an electron (holes) can be calculated by fitting a small section of the $\\mathrm{E}$ vs. $k$ surface (Figure 4) in the vicinity of the CBM (VBM) at zero strain. The calculated results find a large value (2.26 $m_{e}$ ) of the electron effective mass in the bare $\\kappa_{4 \\times 1}-\\mathrm{PNR}$ which can be attributed to the presence of a flat conduction band (band in red colour at X-point in Figure 4) arising due to the dangling electron of the edge atoms. On passivation with hydrogen atoms, the band due to the dangling electrons disappear, and CBM possess larger curvature that gives rise to a small effective mass $\\left(0.04 m_{e}\\right)$. The free charge carriers at the edges of unpassivated PNRs, gets bonded to hydrogen atoms, which effects their effective masses and hence their mobilities.\n\nThe calculated carrier effective masses are found to be anisotropic in nature [Figures 5]. Carrier effective masses of $\\alpha$-PNR $\\left(m_{e}{ }^{*}=0.12 m_{e}\\right.$ and $\\left.m_{h}{ }^{*}=0.08 m_{e}\\right)$ and R-PNR $\\left(m_{e}{ }^{*}=\\right.$ $0.23 m_{e}$ and $m_{h}{ }^{*}=0.08 m_{e}$ ) are calculated to be lowest (close to zero line). The effective masses of most of the PNRs are comparable with $\\alpha$-PNR and R-PNR [Figures 5]. On passivation, the effective mass of most of the PNRs is found to be less than $0.3 m_{e}$. Note that the carrier mobility is inversely proportional to 3/2 power of the effective mass, hence lower effective mass leads to an increase in the mobility.\n\nAnother factor which also determine the carrier mobility is the deformation potential (DP) [Eqn 1]. DP is calculated by the linear fitting of the valence band edge (VBE)/conduction band edge (CBE) vs. strain surface. The magnitude of DP describes the change in energy of\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_3ae1fab1e33569c30b8dg-15_253_1049_293_1078}\n\\end{center}\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_3ae1fab1e33569c30b8dg-15_1106_1715_274_1057}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_3ae1fab1e33569c30b8dg-15_363_1048_1094_1808}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_3ae1fab1e33569c30b8dg-15_1095_1709_1067_1800}\n\\end{center}\n\n(d)\n\nFIGURE 5: The effective masse and mobility of electrons and holes for bare and passivated PNRs at $\\mathrm{T}=300 \\mathrm{~K}$.\n\nthe electronic band with the elastic deformation and, therefore, describes the degree to which the charge carriers interact with phonons. A lower value of DP indicates a weaker electronphonon coupling in the conduction (valence) band, thereby contributing to an increase in the mobility of electrons (holes) [30]. The values of DP are listed in Table1. Note that the negative DP indicates the deformation in band edge to be in the opposite direction on the application of a strain. We now calculate the carrier mobility using Eqn 1. Our results find carrier's mobility of given PNRs to be highly anisotropic, e.g, $\\mu_{e}\\left(\\mu_{h}\\right)$ of $\\theta_{\\mathrm{y} 3}$ is 253 (11) times that of $\\mu_{\\mathrm{e}}\\left(\\mu_{h}\\right)$ of $\\theta_{\\mathrm{x} 1}$ and, $\\mu_{e}\\left(\\mu_{h}\\right)$ of $\\phi_{\\mathrm{y} 3}$ is $20(7)$ time that of $\\mu_{e}\\left(\\mu_{h}\\right)$ of $\\phi_{\\mathrm{x} 1}$. Note that an anisotropy in the carrier mobility is also reported for black $(\\alpha)$ and blue $(\\beta)$ PNRs [7, 19, 31]. It is important to mention here that we have considered fixed width of PNRs, though the mobility also depends on the width of given ribbons [18, 32]. Although, line stiffness remains almost unaffected by the passivation of the edges but the effective masses and deformation potentials show significant modulation that leads to enhancement in the carrier mobility on edge-passivation, e.g., hole mobility in $\\beta$-PNR increases 130 times and electron mobility in $\\kappa_{4}$-PNR increases by 3000 times on passivation [Figure 5 and Table S2].\n\nThe carrier mobility of most of the PNRs considered are found to be comparable with the monolayer black phosphorene (i.e. $10^{3} \\mathrm{~cm}^{2} \\mathrm{~V}^{-1} \\mathrm{~s}^{-1}$ ) with the exception of $\\beta$-PNR, $\\tau$-PNR, RPNR, and H-PNR. Particularly, the electron mobility of $\\theta$-PNR and the hole mobility of $\\varepsilon$-PNR is found to be one order higher than $\\alpha$-PNR [Figure 5 and Table S1of ESI]. The electron mobility of the passivated PNRs including $\\alpha_{\\mathrm{x} 1}, \\varepsilon_{\\mathrm{x} 1}, \\eta_{\\mathrm{y} 2}, \\theta_{\\mathrm{y} 3}, \\phi_{\\mathrm{x} 1}, \\phi_{\\mathrm{y} 3}, \\kappa_{4 \\mathrm{x} 1}, \\mathrm{R}_{\\mathrm{y} 1}, \\mathrm{O}_{\\mathrm{x} 2}, \\mathrm{H}_{\\mathrm{x} 1}$ is higher than their hole mobility indicating their n-type semiconducting characteristic whereas $\\beta_{\\mathrm{x} 1}, \\gamma_{\\mathrm{x} 1}$, $\\delta_{\\mathrm{x} 1}, \\tau_{\\mathrm{x} 1}, \\tau_{\\mathrm{y} 2}, \\eta_{\\mathrm{x} 3}, \\theta_{\\mathrm{x} 1}$ behaves like p-type semiconductors owing to their higher hole mobility. Among the PNRs considered, $\\alpha_{\\mathrm{x} 1}, \\delta_{\\mathrm{x} 1}, \\varepsilon_{\\mathrm{x} 1}, \\tau_{\\mathrm{x} 1}, \\tau_{\\mathrm{y} 2}, \\eta_{\\mathrm{x} 3}, \\theta_{\\mathrm{x} 1}, \\phi_{\\mathrm{x} 1}, \\phi_{\\mathrm{y} 3}, \\kappa_{4 \\mathrm{x} 1}$ and $\\mathrm{O}_{\\mathrm{x} 2}$ PNR changes their carrier mobility, thereby, the semiconducting character (n-type $\\leftrightarrow$ p-type) after the passivation of the edges with $\\mathrm{H}$-atoms. Our results indicate that the intrinsic band gap and high carrier mobility possessed by these PNRs may find various applications in nano- and optoelectronics.\n\n\\section{Summary}\nIn summary, stability, electronic and mechanical properties of nanoribbons of 13 phosphorene allotropes namely $\\alpha-\\mathrm{P}, \\beta-\\mathrm{P}, \\gamma-\\mathrm{P}, \\delta-\\mathrm{P}, \\varepsilon-\\mathrm{P}, \\tau-\\mathrm{P}, \\eta-\\mathrm{P}, \\theta-\\mathrm{P}, \\phi-\\mathrm{P}, \\kappa_{4}-\\mathrm{P}, \\mathrm{R}-\\mathrm{P}, \\mathrm{O}-\\mathrm{P}, \\mathrm{H}-\\mathrm{P}$ have been investigated. The magnitude of formation energies of PNRs considered is found to be comparable to their monolayer counterparts indicating their ease of formation. Deformation potential theory within the effective mass approximation have been employed to the most stable semiconducting bare and passivated PNRs to analyse their carrier transport properties. On passivation of edges, band gap increases along with direct $\\leftrightarrow$ indirect transition in some cases. The effective mass of most of the PNRs is less than $0.3 \\mathrm{~m}_{\\mathrm{e}}$. The carrier mobility of most of the PNRs is found to be comparable to that of the monolayer $\\alpha$-P. The unique features of the PNRs considered render them as favourable $1 \\mathrm{D}$ materials to be used in applications relating to phosphorene based devices.\n\n\\section{Acknowledgements}\nSK is grateful to UGC-BSR for financial assistance in the form of senior research fellowship. The computational facility at Central University of Punjab, Bathinda and RAMA High Performance Computing Cluster at Michigan Technological University Houghton, USA, are used to obtaining the results presented in this paper.\n\n\\section{References}\n\\begin{enumerate}\n  \\item Brent J R, Savjani N, Lewis E A, Haigh S J, Lewis D J, O'Brien P 2014 Production of few-layered phosphorene by liquid exfoliation of black phosphorous Chem. Comm. 50 13338.\n\n  \\item Das S, Zhang W, Demateau M, Hoffmann A, Dubey M and Roelofs A 2014 Tunable Transport Gap in Phosphorene Nano Lett. 145733. 3. Gusmao R, Sofer Z, Pumera M 2017 Black Phosphorus Rediscovered: From Bulk to Monolayer Angew. Chem. Int. Ed. 568052.\n\n  \\item Zhang J L, Zhao S, Han C, Wang Z, Zhong S, Sun S, Guo R, Zhou X, Gu C D, Yuan K D, Li Z and Chen W 2016 Epitaxial Growth of Single Layer Blue Phosphorus: A New Phase of Two-Dimensional Phosphorus Nano Lett. 164903.\n\n  \\item Zeng J, Cui P and Zhang Z 2017 Half Layer By Half Layer Growth of a Blue Phosphorene Monolayer on a GaN(001) Substrate Phys. Rev. Lett. 118046101.\n\n  \\item Zhu Z and Toma 'nek D 2014 Semiconducting Layered Blue Phosphorus: A Computational Study Phys. Rev. Lett. 112176802.\n\n  \\item Liu H, Neal A T, Zhu Z, Luo Z, Xu X, Tománek D and Ye P D 2014 Phosphorene: An Unexplored 2D Semiconductor with a High Hole Mobility ACS Nano 84033.\n\n  \\item Xiao J, Long M, Zhang X, Ouyang J, Xu H \\& Gao Y 2015 Theoretical predictions on the electronic structure and charge carrier mobility in 2D Phosphorus sheets Sci. Rep. 5 9961.\n\n  \\item Sorkin V, Cai Y, Ong Z, Zhang G \\& Zhang Y W 2016 Recent advances in the study of phosphorene and its nanostructures Critical Reviews in Solid State and Materials Sciences 421.\n\n  \\item Kaur S, Kumar A, Srivastava S and Kumar T 2016 Electronic structure engineering of various structural phases of phosphorene Phys. Chem. Chem. Phys. 1818312.\n\n  \\item Guan J, Zhu Z and Toma 'nek D 2014 Phase coexistence and metal insulator transition in few-layer phosphorene: A computational study Phys. Rev. Lett. 113046804.\n\n  \\item Wu M, Fu H, Zhou L, Yao K and Zeng X C 2015 Nine New Phosphorene Polymorphs with Non-Honeycomb Structures: A Much Extended Family Nano Lett. 15, 3557.\n\n  \\item Wang H, Li X, Liua Z and Yanga J $2017 \\psi$-phosphorene: a new allotrope of phosphorene Phys. Chem. Chem. Phys. 192402. 14. Zhao T, He C Y, Ma S Y, Zhang K W, Peng X Y, Xie G F and Zhong J X 2015 A new phase of phosphorus: the missed tricycle type red phosphorene J. Phys.: Condens. Matter 27265301.\n\n  \\item Li P and Luo W 2016 A new structure of two-dimensional allotropes of group V elements Sci. Rep. 625423.\n\n  \\item Xu M, He C, Zhang C, Tang C and Zhong J 2016 First-principles prediction of a novel hexagonal phosphorene allotrope Phys. Status Solidi RRL 10563.\n\n  \\item Liu J, Zhang S, Guo Y and Wang Q 2016 Phosphorus K4 Crystal: A New Stable Allotrope, Sci. Rep. 637528.\n\n  \\item Xiao J, Long M, Zhang X, Zhang D, Xu H and Chan K S 2015 First-Principles Prediction of the Charge Mobility in Black Phosphorus Semiconductor Nanoribbons J. Phys. Chem. Lett. 64141.\n\n  \\item Xiao J, Long M, Deng C -S, He J, Cui L -L and Xu H 2016 Electronic Structures and Carrier Mobilities of Blue Phosphorus Nanoribbons and Nanotubes: A First-Principles Study J. Phys. Chem. C 1204638.\n\n  \\item Zhou B, Zhou B, Liu P and Zhou G 2018 The Giant Stark Effect in Armchair-Edge Phosphorene Nanoribbons Under a Transverse Electric Field Phys. Lett. A 382193.\n\n  \\item Zhou B, Zhou B, Zhou X and Zhou G 2017 Even-Odd Effect On the Edge States for Zigzag Phosphorene Nanoribbons Under a Perpendicular Electric Field J. Phys. D: Appl. Phys. 50 045106.\n\n  \\item Zhang X, Li Q, Xu B, Wan B, Yin J and Wan X G 2016 Tuning Carrier Mobility of Phosphorene Nanoribbons by Edge Passivation and Strain Phys. Lett. A 380614.\n\n  \\item Soler J M, Artacho E, Gale J D, Garcia A, Junquera J, Ordejon P and Portal D S 2002 The SIESTA method for ab initio order-N Materials Simulation J. Phys.: Condens. Matter 14 2745. 24. Troullier N and Martins J L 1991 Efficient Pseudopotentials for Plane-Wave Calculations Phys. Rev. B 431993.\n\n  \\item Dion M, Rydberg H, Schröder E, Langreth D C and Lundqvist B I 2004 Van der Waals Density Functional for General Geometries Phys. Rev. Lett. 92246401.\n\n  \\item Bardeen J and Shockley W 1950 Deformation Potentials and Mobilities in Non-Polar Crystals Phys. Rev. $\\mathbf{8 0} 72$.\n\n  \\item Beleznay F B, Bogár F and Ladik J 2003 Charge carrier mobility in quasi-one-dimensional systems: Application to a guanine stack J. Chem. Phys. 1195690.\n\n  \\item Long M Q, Tang L, Wang D, Li Y L and Shuai Z G 2011 Electronic Structure and Carrier Mobility in Graphdiyne Sheet and Nanoribbons: Theoretical Predictions ACS Nano 5 2593.\n\n  \\item Long M Q, Tang L, Wang D, Wang L J and Shuai Z G 2009 Theoretical Predictions of Size-Dependent Carrier Mobility and Polarity in Graphene J. Am. Chem. Soc. 13117728.\n\n  \\item Wang H, Pei Y, LaLonde A D and Snyder G J 2012 Weak electron-phonon coupling contributing to high thermoelectric performance in n-type PbSe PANS 109, 9705.\n\n  \\item Zhang X, Li Q, Wan B, Yin J and Wan X G 2016 Tuning the Carrier Mobility of Phosphorene Nanoribbons by Edge Passivation and Strain Physics Letters A 380614.\n\n  \\item Swaroop R, Ahluwalia P K, Tankeshwar K and Kumar A 2017 Ultra-narrow blue phosphorene nanoribbons for tunable optoelectronics RSC Advances 72992.\n\n\\end{enumerate}\n\n\\end{document}", "record_id": "2023_09_22_3ae1fab1e33569c30b8dg"}