{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{HHS Public Access }\n\n\\author{}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nAuthor manuscript\n\nACS Nano. Author manuscript; available in PMC 2019 January 29.\n\nPublished in final edited form as:\n\nACS Nano. 2018 March 27; 12(3): 2211–2221. doi:10.1021/acsnano.7b09011.\n\n\\section{Acid-Base Control of Valency within Carboranedithiol Self- Assembled Monolayers: Molecules Do the Can-Can}\n\\textbackslash author\\{\\\\\nJohn C. Thomas ${ }^{1,2}$, Dominic P. Goronzy ${ }^{1,2}$, Andrew C. Serino ${ }^{2,3}$, Harsharn S. Auluck H $^{1,2}$, \\textbackslash  Olivia R. Irving ${ }^{1}$, Elisa Jimenez-Izal ${ }^{1,4}$, Jacqueline M. Deirmenjian ${ }^{1,2}$, Jan Macháček J $^{5}$, \\textbackslash  Philippe Sautet $^{6}$, Anastassia N. Alexandrova ${ }^{*}, 1,2$, Tomáš Baše ${ }^{*}, 5$, and Paul S. Weiss ${ }^{*}, 1,2,3$ \\textbackslash  ${ }^{1}$ Department of Chemistry and Biochemistry, University of California, Los Angeles, Los Angeles, \\textbackslash  CA 90095, United States \\textbackslash  ${ }^{2}$ California NanoSystems Institute, University of California, Los Angeles, Los Angeles, CA 90095, \\textbackslash  United States \\textbackslash  ${ }^{3}$ Department of Materials Science and Engineering, University of California, Los Angeles, Los \\textbackslash  Angeles, CA 90095, United States \\textbackslash  `Kimika fakultatea, Euskal Herriko Unibertsitatea (UPV/EHU), and Donostia International Physics \\textbackslash  Center (DIPC), P. K. 1072, 20080 Donostia, Euskadi, Spain \\textbackslash  ${ }^{5}$ Institute of Inorganic Chemistry, Academy of Sciences of the Czech Republic, v.v.i. 25068 \\textbackslash  Husinec-Řež, č.p. 1001, Czech Republic \\textbackslash  ${ }^{6}$ Department of Chemical and Biomolecular Engineering, University of California, Los Angeles, \\textbackslash  Los Angeles, CA 90095, United States\\\\\n\\}\n\n\\begin{abstract}\nWe use simple acid-base chemistry to control the valency in self-assembled monolayers of two different carboranedithiol isomers on $\\mathrm{Au}\\{111\\}$. Monolayer formation proceeds via $\\mathrm{Au}-\\mathrm{S}$ bonding, where manipulation of $\\mathrm{pH}$ prior to or during deposition enables the assembly of dithiolate species, monothiol/monothiolate species, or combination. Scanning tunneling microscopy (STM) images identify two distinct binding modes in each unmodified monolayer, where simultaneous spectroscopic imaging confirms different dipole offsets for each binding mode. Density functional theory calculations and STM image simulations yield detailed understanding of molecular chemisorption modes and their relation with the STM images, including inverted contrast with respect to the geometric differences found for one isomer. Deposition conditions are modified with controlled equivalents of either acid or base, where the coordination of the molecules in the monolayers is controlled by protonating or deprotonating the second thiol/thiolate on each molecule. This control can be exercised during deposition to change the valency of the molecules in the monolayers, a process that we affectionately refer to as the \"can-can.\" This control enables\n\\end{abstract}\n\n*Address correspondence to: \\href{mailto:psw@cnsi.ucla.edu}{psw@cnsi.ucla.edu} (P.S.W.), \\href{mailto:tbase@iic.cas.cz}{tbase@iic.cas.cz} (T.B.), \\href{mailto:ana@chem.ucla.edu}{ana@chem.ucla.edu} (A.A.).\n\nSupporting Information. Figures that depict image binaries used for coverage calculations, X-ray photoelectron spectroscopy, Fourier transform infrared spectroscopy, image correlation, and tabulated frequency calculation results. This material is available free of charge via the Internet at \\href{http://pubs.acs.org}{http://pubs.acs.org}. us to vary the density of molecule-substrate bonds by a factor of two without changing the molecular density of the monolayer.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-02_340_1422_296_1602}\n\\end{center}\n\n\\section{Keywords}\nnanoscience; self-assembly; carborane; self-assembled monolayer; dipoles; scanning tunneling microscopy; two dimensional; molecular switch\n\nSelf-assembled monolayer (SAM) formation is driven by a combination of substratemolecule interactions, molecule-molecule interactions, and molecule-environment interactions. ${ }^{1-3}$ The most commonly studied SAMs, $n$-alkanethiolates on $\\mathrm{Au}\\{111\\}$ contain a single thiol group available for substrate binding, have linear backbones, resulting in numerous defects that originate from gauche defects in the alkyl chains, different alkyl tilt orientations, translational and rotational lattice registry offsets, and reconstruction of the underlying substrate. ${ }^{1,4-9}$ Monolayers formed from dialkyl disulfides on Au $\\{111\\}$ result in identical assemblies as the Au surface cleaves the S-S bond. ${ }^{10-12}$ In contrast, in unfunctionalized carboranethiol SAMs, the molecules do not tilt nor can they change their conformation; thus, there are fewer and simpler defects in comparison to SAMs composed of $n$-alkanethiols. ${ }^{2-17}$ Interactions between carboranethiol molecules at both exposed and buried interfaces have been observed. Carboranethiol isomers with nonzero components of their dipoles parallel to the surface exhibit long-range attractive interactions due to dipole alignment. ${ }^{18}$ This phenomena was previously inferred from the results of competitive adsorption experiments, where carboranethiol isomers with larger in-plane dipole components outcompeted those with greater out-of-plane components. ${ }^{19}$ Mixed assemblies of carboranethiol isomers can be used to tailor the effective metal work function of noble metal surfaces while not changing the wetting properties of the overlying polymers and thus not changing their morphologies. ${ }^{15,20}$ These interactions have been observed with submolecular resolution, where correlations between simultaneously acquired scanning tunneling microscopy (STM) topographic and local barrier height (LBH) images enabled the observation of single-molecule orientations within SAM matrices and demonstrated defecttolerant dipole alignment. ${ }^{16}$ The surfactants 9,12-carboranedithiol (9012) and 1,2carboranedithiol (102) have been shown to be stable isomers, to functionalize noble metal surfaces, and to modify effective metal work functions due to oppositely oriented dipoles originating from the carborane backbone. ${ }^{21-26}$ Carboranethiol SAMs can also be used to align overlying liquid crystal orientations. ${ }^{27}$ Here, both isomers of carboranedithiol studied (102 and 9012) promote formations with higher sulfur-surface coverage and fewer defects due to rigid, nearly spherical backbones.\n\nTypical SAM formation from thiols is governed by simple acid-base reactions, where an acidic thiol group (SH) is deprotonated to a thiolate $\\left(\\mathrm{S}^{-}\\right)$on reactive surfaces. ${ }^{4,28}$ As noted above, disulfides can form SAMs by cleaving the disulfide bonds, again leading to adsorbed thiolates. ${ }^{10-12}$ Adsorbed thiolates form stable bonds to Au surfaces ( 45 kcal/mol), stronger than typical Au-Au bonds. ${ }^{3,29-31}$ The S-Au bond is partially ionic and partially covalent; the effective charge transfer depends on the backbone attached to the $\\mathrm{S} .{ }^{32}$ Adsorbed, but relatively labile, thiols (i.e., with protons still in place) have also been observed within SAMs, such as $p$-carboranethiol, on $\\mathrm{Au}\\{111\\}$ at low conentrations. ${ }^{17}$ The ease of formation coupled with tunable defect formations contribute towards thin films with controllable intermolecular interactions and modifiable surface-mediated effects that can be used to advantage to place and to direct single molecules and supramolecular assemblies into controlled environments. $2,3,12,13,33$ Acid-base chemistry, at the exposed interface, has shown broad importance in surface wettability, colloid and emulsion stability, biological signal transduction and membrane assembly, and catalysis. ${ }^{34-37}$ We sought to manipulate and to control the valency, the molecule-substrate bond density, and subsequent monolayer formation using different isomers of carboranedithiol on Au surfaces, both of which have the potential for one or two bonds to the substrate per molecule. Both 102 and 9012 are stable in their respective dithiol and dianion states, where 102 is a stronger acid compared to 9012. ${ }^{26}$ The acid-base properties intrinsic to homogenous monolayers composed of either 102 or 9012 can be used as a means of control.\n\nKitagawa and coworkers assembled adamantanetrithiol on $\\mathrm{Au}\\{111\\}$ and found trivalent interactions that resulted in small chiral cluster structures on the surface. ${ }^{38}$ In earlier unpublished work, we found that it is important to take into account both bond angles and substrate access in forming multivalent molecule-substrate interactions. ${ }^{39,40}$ The lessons learned from those studies resulted in the inclusion of flexible linkers in attaching caltrops and other molecules to surfaces. ${ }^{41-44}$\n\nControl of thin-film properties of both exposed and buried interfaces has broad implications, e.g., for molecular devices and lithographic patterning. $3,29,33,35,45,46$ These isomers of $o$ - carboranedithiols serve as ideal test candidates for binding, valency, and surface bond density, where singly bound (monovalent) modes produce monolayers with lower thiolateAu bond densities in comparison to doubly bound (divalent) modes. We demonstrate, with a variety of surface-sensitive techniques and with density functional theory (DFT) calculations, that homogenous monolayers composed of either 102 or 9012 show two distinct binding states, which are susceptible to manipulation by controlling $\\mathrm{pH}$, in solution, prior to deposition, as well as during deposition via exposure to acidic or basic solution; identical nearest-neighbor spacings and lattices are maintained throughout processing, independent of valency. We also show that the difference between the monovalent and divalent modes of these carboranes is not a simple geometric effect, but also critically depends on electronic effects.\n\nScanning tunneling microscopy is able to probe the topographic landscape of surfaces with sub-Ångström precision. 7,47-50 We have previously used spectroscopic imaging modalities of STM to probe buried interfaces and layers in molecular monolayers of other systems. 7,32,51-55\n\n\\section{Results and Discussion}\nWe assembled and measured monolayers composed of either 102 or 9012 carboranedithiols on $\\operatorname{Au}\\{111\\} /$ mica, where, upon imaging, two distinct binding states that differ in apparent height in each homogenous SAM are recorded (Figure 1). Both isomers form hexagonally close-packed monolayers with nearest-neighbor spacings of $7.6 \\pm 0.5 \\AA$. This formation is best explained by a $(\\sqrt{ } 7 \\times \\sqrt{ } 7) R 19.12^{\\circ}$ superstructure that is found for several carboranethiols on $\\operatorname{Au}\\{111\\} .^{19,56}$ We measured a bimodal distribution, with tunable coverages, which we attribute to both singly bound (monovalent) and doubly bound (divalent) states. Selfassembled monolayers formed of 102 from a neutral solution show $21 \\pm 8 \\%$ coverage of the singly bound (greater apparent height in STM images) binding structure and, correspondingly, $79 \\pm 8 \\%$ coverage of the doubly bound (lower apparent height) structure. These modes are differentiated as described below. Measurements over monolayers composed of $\\mathbf{9 0 1 2}$ show a strong preference (98 $\\pm 1 \\%$ ) for monovalent binding (less protruding, counter-intuitively, as explained below) in comparison to divalent $(2 \\pm 1 \\%$, more protruding). Images can be segmented by apparent height in topographic images by applying a gray scale threshold value that is used to compute binding concentrations in image binaries (Figure S1). Monovalent structures in 102 monolayers have greater apparent heights (1.5 $\\pm 0.3 \\AA$ with the tunneling conditions and tip used to record the data in Figure 1) than the divalent structures under the conditions measured; the monovalent structures in 9012 SAMs have lower apparent heights $(0.4 \\pm 0.2 \\AA$ with the tunneling conditions and probe tip used to record the data in Figure 1) than the divalent structures. The DFT calculations help explain this apparent inverted contrast for monovalent/divalent modes for $\\mathbf{9 0 1 2}$.\n\nWe performed DFT calculations to gain detailed understanding of molecular chemisorption modes and their related appearances in STM images, and to help identify the adsorbed species. With this aim, we explored all the possible binding sites of singly and doubly dehydrogenated (i.e., monovalent and divalent, respectively) carboranedithiols on the Au $\\{111\\}$ : face-centered cubic (fcc), hexagonally close-packed (hcp), over a bridge, and over a single atom (atop). The most stable species that are most closely correlated with the experimental results are shown in Figure 2. The geometric features of 102 and 9012 are almost identical. The preferred binding site for the monovalent molecules is a fcc hollow site, which allows them to maximize the number of Au-S bonds. Divalent species adsorb preferentially on one fcc and one hcp hollow site, although somewhat off center with respect to the bridge site. Overall, S-Au bond-lengths are calculated to be between $2.37$ and $3.06 \\AA$. The natural bond order analysis shows that these are predominantly covalent bonds. For the most stable monovalent chemisorption mode, the S-C or S-B bond is simply normal to the surface. If one defines the molecular axis as connecting the center of the cage and the point halfway from one $\\mathrm{S}$ atom to another, this line then is $28-30^{\\circ}$ from the surface normal in the monovalent binding mode. The $\\mathrm{z}$ (surface normal) coordinates of the uppermost atoms (excluding $\\mathrm{H}$ ), also shown in Figure 2, reveal that the monovalent structures in both 102 and 9012 extend further from the surface than their corresponding divalent species, each with a physical height difference of $c a .0 .4 \\AA$.\n\nThe simulated STM images for these four structures are shown in Figure 3. In agreement with experiments and in line with the geometry, monovalent 102 appears more protruding in STM images than divalent 102. The calculated apparent height difference in the simulated STM images is $0.6$ Å. For STM images of $\\mathbf{9 0 1 2}$, however, the situation is different; the monovalent mode appears less protruding, while the divalent structure appears more protruding. The height difference in the simulated images is $0.3 \\AA$. As mentioned above, the $\\mathrm{z}$ coordinates of the topmost atoms are higher in the monovalent than in the divalent $\\mathbf{9 0 1 2}$. These results indicate that electronic effects play important roles in these systems and are critical to explain the differences between images of monovalent and divalent 102 and 9012 on $\\mathrm{Au}\\{111\\}$.\n\nIn order to understand this \"inverted contrast\" in the STM images for 9012 , we additionally plot the charge densities within the same energy window captured by the STM (from the Fermi energy $\\left(E_{f}\\right)$ to $\\left(E_{f}-0.1 \\mathrm{eV}\\right)$. From the images in Figure 4, we observe that the contributions of $\\mathrm{C}$ and $\\mathrm{B}$ in these states are quite similar for monovalent and divalent 102 structures. Indeed, the relative apparent heights and the relative geometrical heights correlate well. For $\\mathbf{9 0 1 2}$, the charge density plots for monovalent and divalent modes are significantly different. In the case of the monovalent structure, the contributions of the carborane cage atoms in the proximity of the Fermi level are significantly smaller, which gives rise to the calculated \"inverted contrast\". The density plots in Figure 4 reflect the collective contributions of all electronic states that fall within the experimentally measured energy window $\\left(\\mathrm{E}_{\\mathrm{F}}-0.1 \\mathrm{eV}\\right)$. Examination of the electronic states and their energies across the entire Brillouin zone reveal that there are only a few (1-3) of these states for each species. Furthermore, for the monovalent $\\mathbf{9 0 1 2}$, there is essentially only a single experimentally accessible state, the least among all considered adsorbed molecules. The projected density of states (PDOS) plots (reported in the Supplemental Information) are consistent with this finding. Since carboranes, in general, have similar delocalized chemical bonding, described by Lipscomb via three-center, two-electron bonds, and obey Wade's electron-counting rules, ${ }^{57}$ it is expected that the molecular orbitals on all the studied species are similar in structure, and only shift in energy from one species to another. Thus, we suggest that the small number of electronic states detected by STM for the monovalent $\\mathbf{9 0 1 2}$ simply has to do with the energies of those states relative to the experimentally probed energy window of $\\left(E_{F}-0.1\\right.$ $\\mathrm{eV})$\n\nThe aggregation of domains in SAMs composed of 102 suggests intermolecular interactions between monovalent molecules, which possess larger in-plane dipole components due to binding geometry. The reported dipoles for $\\mathbf{1 0 2}$ and $\\mathbf{9 0 1 2}$ are $3.7 \\mathrm{D}$ and $5.5 \\mathrm{D}$, respectively, ${ }^{24}$ where this component is close the surface normal ( $\\left.8^{\\circ}\\right)$ if both $\\mathrm{S}$ are bound (as thiolates), however, the singly bound state is tilted $-30^{\\circ}$ ( vide supra), yielding a parallel component ( $1.8 \\mathrm{D}$ for 102 and $-2.8 \\mathrm{D}$ for 9012). This dipole component results in increased intermolecular interactions between neighboring singly bound adsorbates ${ }^{16}$ and apparently leads to phase separation. This result is confirmed in samples of each monolayer and further enables binding assignments; SAMs composed of 102 demonstrate aggregation between higher protrusions, and, in SAMs composed of $\\mathbf{9 0 1 2}$, higher intensity protrusions are localized and not phase aggregated. Both isomers form hexagonally close-packed monolayers with nearest-neighbor spacings of $7.6 \\pm 0.5 \\AA$. This formation is best explained by a $(\\sqrt{ } 7 \\times \\sqrt{ } 7) R 19.12^{\\circ}$ superstructure that is found for several carboranethiols on $\\mathrm{Au}\\{111\\} . .^{56}$ One of the advantages of working with carboranethiol SAMs is the conservation of surface structure among isomers so that the effects of different interactions can be tested independently of structural variations. ${ }^{13,19}$ Both isomers form monolayers with the same spacings and surface structures; however, each contains different concentrations of monovalent and divalent modes. Next, we tested each binding state by coupling STM with scanning tunneling spectroscopy (STS) to monitor both the exposed and buried interfaces. $7,16,54$\n\nMultimodal STM, which can simultaneously record the topographic landscape and the dipolar interface, can be used to extract molecular orientations within monolayers.\n\n7,16,32,54,58-60 Topographic and local barrier height extrema are computed within a defined radial vector (the size of one molecule) and correlations are computed via block-matching, 61,62 to associate symmetric molecular apexes with dipolar extrema. ${ }^{7,16}$ Here, local maxima (inverted minima) within SAMs composed of $\\mathbf{9 0 1 2}$ can be locally attributed to carbons at the 1- and 2-positions within the cage. Conversely, local maxima within SAMs composed of 102 can be attributed to the local dipolar offsets within the boron cage. Correlated topographic maxima to LBH extrema values, shown in Rose plots (Figure 5), indicate that greater apparent protrusions in SAMs composed of $\\mathbf{1 0 2}$ have larger offsets ( $3.8 \\pm 1.0 \\AA$ ) than lesser protrusions ( $2.2 \\pm 0.6 \\AA$ ). In SAMs composed of $\\mathbf{9 0 1 2}$, greater protrusions show slightly smaller offsets $(1.9 \\pm 0.3 \\AA)$ in comparison to lesser protrusions ( $2.6 \\pm 0.6 \\AA)$. For the small areas in the data shown, orientations in each homogenous monolayer ( $283 \\pm 39^{\\circ}$ in 102 SAMs, $150 \\pm 33^{\\circ}$ in $\\mathbf{9 0 1 2}$ SAMs with respect to the fast-scan direction, shown as horizontal, left to right, in these displayed images) suggest charge-separation stabilization and relative dipolar alignment across each two-dimensional landscape. Other orientations are found in other areas of the surfaces. These observations are consistent with our binding model (monovalent and divalent modes) in each homogenous monolayer. Since each binding state maintains the same nearest-neighbor spacing, the fraction of sulfur bound to the $\\mathrm{Au}$ substrate can be tailored by up to a factor of two if binding can be manipulated. Motivated by the fact that each isomer is stable in both their dithiol and dithiolate states, ${ }^{24}$ we modify the $\\mathrm{pH}$ to deposit either the dithiol or the dithiolate selectively. In chemical lift-off lithography, ${ }^{29-31}$ the amount of sulfur bound to Au may affect the amount and structure of lifted-off Au from the surface. Controlling the sulfur-surface density would enable tunable amounts of surface-bound Au available for patterning. ${ }^{63}$\n\nWe tested the resulting assemblies of each carboranedithiol in both basic ( $2: 1$\n\n$\\mathrm{NaOH}$ :carboranedithiol) and acidic conditions (1:1 HCl:carboranedithiol) with STM. Upon deposition under basic conditions, majority divalent binding is achieved that is attributed to deposition of the molecular dianion (dithiolate) state. Scanning tunneling microscope images depict a concentration change of each phase, and show predominance of the divalent mode in monolayers fabricated under basic conditions (Figure 6). Images are segmented by apparent height to compute percent coverage (Figure S2). The divalent mode is dominant in each single-component monolayer (98 $\\pm 2 \\%$ for 102, $99 \\pm 1 \\%$ for $\\mathbf{9 0 1 2}$ ) under basic conditions. The small fractions of the monovalent mode should appear more protruding for 102 but less protruding for $\\mathbf{9 0 1 2}$. The possible small fractions of monovalent species after deposition from basic solution may be difficult to distinguish from defects and the monolayers, in any case, are within experimental error of being completely divalent.\n\nWe also performed deposition experiments in acidic conditions and measured the resulting monolayers. Saturating carboranedithiol solutions with excess protons, prior to deposition, enables somewhat higher concentrations of monovalent (thiol/thiolate) molecules, in comparison to their counterparts deposited from neutral solutions. Figure 7 depicts the topographic environment after acidic deposition, where an increase in (greater apparent protrusions) in SAMs composed of 102 indicate higher concentrations (31 $\\pm 3 \\%$ ) of monovalent (thiol/thiolate) species; SAMs composed of $\\mathbf{9 0 1 2}$ already show an almost total monovalent mode (lesser protrusions) at neutral $\\mathrm{pH}$ and hence do not show any change for a proton-rich deposition environment (98 $\\pm 1 \\%)$. In summary, SAMs composed of divalent 102 or 9012 (basic conditions) enable high dithiolate surface attachment, where SAMs composed of monovalent 9012 (neutral or acidic conditions) permit low sulfur-surface attachment simply due to the controllable binding within structurally equivalent isomeric monolayers.\n\nIn order to monitor the results of SAM formation in each environment at the ensemble scale and to complement the STM measurements, we used both X-ray photoelectron spectroscopy (XPS) and Fourier transform infrared (FTIR) spectroscopy. All measured XPS and FTIR results, and modeled values are detailed in Table 1 and Table S1, using the sulfur and similar B-H vibrational spectra under all conditions also measured with STM. Characteristic orbital energy peaks of each atomic species within the monolayer can be measured with XPS. Our results are consistent with prior XPS measurements in both monolayers deposited at neutral $\\mathrm{pH}$, where $\\mathrm{S} 2 \\mathrm{p}$ orbital peaks show shifts similar to previously reported values. ${ }^{21}$ To test monolayer integrity, we also measured each monolayer after $\\mathrm{pH}$ manipulation (Figures $\\mathrm{S} 4$ and S5). Values reported for XPS not only show the retention of S 2p shifts, but also confirm the lack of any measured $\\mathrm{Cl}^{-}$or $\\mathrm{Na}^{+}$within each monolayer after acid or base treatment. Using FTIR, we specifically tracked the B-H vibrational stretch, at $\\sim 2600 \\mathrm{~cm}^{-1}$, which is characteristic for carboranes. ${ }^{19,64}$ Measured SAMs composed of 102 show similar vibrational features under all conditions; however, SAMs composed of $\\mathbf{9 0 1 2}$ reveal significant intensity decreases of the peak centered at $2593 \\mathrm{~cm}^{-1}$ and loss of the peak at $2559 \\mathrm{~cm}^{-1}$ (Figures S6 and S7), which are attributed to a change from majority monovalent to majority divalent binding in SAMs composed of $\\mathbf{9 0 1 2}$ after deposition in base. Each experiment is repeated $(n>3)$ to track functional control at both the local and ensemble scales. Vibrational peaks were also modeled in the gas phase using density functional theory. We attribute measured peaks in SAMs composed of 102 to complicated collective modes of B-H stretching vibrations that involve significant contributions from all the boron vertices. In the observed doublet, the peak at higher frequency is composed of modes dominated by stretches of B-H vertices 3,6 , and $4,5,7$, and 11 , while the modes of the lower frequency peak include predominantly the stretches of BH 8, 9, 10, and 12. In SAMs composed of 9012, a triplet is measured with FTIR that is also modeled (Table S1), with the calculated collective B-H stretching modes differentiated by much stronger dominance of individual vertices or their small groups. The peaks centered at $\\sim 2559 \\mathrm{~cm}^{-1}$ belong to the stretching modes with major contribution from vertices 8 and 10, peaks at $2595 \\mathrm{~cm}^{-1}$ are dominated by stretches at vertices $4,5,7$, and 11 , and peaks at $2633 \\mathrm{~cm}^{-1}$ are formed by the modes involving predominantly vertices 3 and 6 . Frequency calculations for the gold salts of both 102 and 9012 show relative attenuation of the infrared absorption features connected with the B-H stretching modes with the major contribution from the vertices close to the $\\mathrm{S}$ atoms upon binding the sulfur atom to gold. Especially in the $\\mathbf{9 0 1 2}$ layer, the intensity decrease at $\\sim 2595 \\mathrm{~cm}^{-1}$ and peak loss at $2595 \\mathrm{~cm}^{-1}$ under basic conditions are consistent with our assignments and computational results. The loss of infrared absorption intensity of the stretching modes dominated by the groups of $4,5,7,11$ and 8, $10 \\mathrm{~B}-\\mathrm{H}$ vertices is attributed to the effect of lateral intermolecular interactions.\n\nBinding configurations are further modeled on Au surfaces with all possible high-symmetry binding sites on the $\\mathrm{Au}\\{111\\}$ surface: face-centered cubic three-fold hollow sites, hexagonally close-packed three-fold hollow sites, bridge sites, and atop sites. The most favorable binding modalities are presented in Table 2, where the most stable 102 and 9012 species are presented schematically in Figures S8 and S9. Both monovalent and bivalent binding modes, for $\\mathbf{1 0 2}$ and $\\mathbf{9 0 1 2}$, are energetically favorable.\n\nWe use both STM and STS to test the local valency within monolayers of carboranedithiols on $\\mathrm{Au}\\{111\\}$ after control via $\\mathrm{pH}$. This control is monitored by apparent height in STM, dipole offsets in simultaneous STM topography and LBH measurements, infrared spectroscopy, and X-ray photoelectron spectroscopy, and is supported and understood with complementary density functional calculations.\n\n\\section{Conclusions and Prospects}\nWe have controlled the valency of binding within SAMs composed of different carboranedithiol isomers. These monolayers retain their two-dimensional lattice structures, independent of their binding configuration. With this level of control, we are able to dictate surface-atom-molecule stoichiometry with simple acid-base chemistry. We anticipate using these and related systems to explore the effects of valency on surface patterning ${ }^{29-31,35,36,63}$ and dynamics. ${ }^{65,66}$ Creating monolayers with switchable substrate-molecule valency and bond strengths while preserving lattice constants enables exploration of this important interface and adds to the repertoire of controllable interactions at surface-molecule, molecule-molecule, and molecule-environment interfaces. By simply varying the head group, molecular backbone, and/or the tail group, extraordinary control is attainable. ${ }^{1-3,6,8,13}$ Rigid cage molecules, especially carboranethiols, exhibit advantageous properties and provide test beds for independently exploring aspects of self-assembly, such as dipole interactions, molecular orientation, electron transfer, surface polarity, and now valency. 3,13,15-17,31,67 Here, bifunctional carboranedithiols assemble into well-ordered monolayers on Au surfaces with two distinct binding modes that are confirmed by STM, STS, FTIR, XPS, and DFT. This control is also expected to be of specific use in chemical patterning, where the binding of molecules to substrates and stoichiometry of molecule-to-surface bonds are both critical. ${ }^{31}$\n\n\\section{Materials and Methods}\n\\section{Monolayer Preparation}\nThe chemicals 102 and $\\mathbf{9 0 1 2}$ were synthesized and characterized in accordance with previously published methods. ${ }^{21,24}$ Ethanol was used as received (Sigma-Aldrich, St. Louis, MO). The Au\\{111 $\\} /$ mica substrates (Agilent Technology, Tempe, AZ) were hydrogen-flame annealed prior to SAM formation with 10 passes at a rate of $0.4 \\mathrm{~Hz}$. Both unmodified SAMs were prepared by immersion into $1 \\mathrm{mM}$ ethanolic solutions and held at room temperature for approximately $24 \\mathrm{~h}$. Short deposition times (10 min), in acidic or basic solutions, were employed to decrease the possibility of molecular degradation. After deposition, each sample was rinsed thoroughly with neat ethanol and dried under a stream of ultrahigh purity argon for at least three cycles.\n\nSince carboranes have been reported to be reactive and to degrade upon exposure to concentrated base or acid ${ }^{68}$ we use dilute concentrations of acid and base to prevent side reactions. Hydochloric acid (12 M) and $\\mathrm{NaOH}$ pellets were used as received (SigmaAldrich, St. Louis, MO). Acidic solutions were prepared by mixing $0.5 \\mathrm{~mL}$ of $2 \\mathrm{mM} \\mathrm{HCl}$ in EtOH and $0.5 \\mathrm{~mL}$ of $2 \\mathrm{mM} 102$ or $\\mathbf{9 O 1 2}$ in EtOH in a gasketed v-vial. Basic solutions were prepared by mixing $0.5 \\mathrm{~mL}$ of $4 \\mathrm{mM} \\mathrm{NaOH}$ in EtOH and $0.5 \\mathrm{~mL}$ of $2 \\mathrm{mM} 102$ or 9012 in EtOH. Monolayers were prepared by immersing flame-annealed $\\mathrm{Au}\\{111\\} /$ mica substrates into modified solutions for $1 \\mathrm{~h}$. Larger ratios of both acid (2:1) and base (4:1) were tested, however, no differences were found.\n\n\\section{Scanning Tunneling Microscopy}\nAll STM measurements were performed with either a custom-built Besoke-style scanning tunneling microscope under ambient conditions or a custom-built Besoke-style scanning tunneling microscope held at cryogenic ( $4 \\mathrm{~K})$ and extreme high vacuum ( $<10^{-12}$ torr) conditions. ${ }^{69,70}$ Samples were held at a fixed bias $\\left(\\mathrm{V}_{\\text {sample }}=-0.5 \\mathrm{~V}\\right)$ and both topographic and LBH modalities were measured in a constant current fashion $\\left(\\mathrm{I}_{\\mathrm{t}}=15 \\mathrm{pA}\\right)$. The tunneling gap distance was modulated above the microscope feedback loop $(\\sim 3 \\mathrm{kHz})$ with a sinusoidal amplitude $(\\mathrm{dz} \\sim 0.1 \\AA$ ) and $\\mathrm{dI} / \\mathrm{dz}$ was measured with a lock-in technique (Stanford Research Systems SR850 DSP, Sunnyvale, CA $)^{7,57}$ The well-known lattice of atomic Au $\\{111\\}$, held at $4 \\mathrm{~K}$, was measured and used to calibrate all low temperature images, and the known lattice within SAMs of 1-dodecanethiolate were used to calibrate all images obtained at room temperature.\n\n\\section{Image Analyses}\nAll STM images were processed with automated routines developed in MATLAB (Mathworks, Natick, MA) to remove high-frequency noise and intensity spikes that may impair reliable interpretation. ${ }^{7}$ Local maxima (minima) for both topography and local barrier height images were chosen as the highest (lowest) intensity pixel within a defined radial vector (the size of one molecule). Dipole offsets were computed using a block-matching approach, ${ }^{16,61,62}$ where topographic image patches (size of one molecule) were correlated against larger local barrier height image patches (size of the nearest-neighbor spacing) to obtain a set of points ( $p$ and $q$ ) that were referenced and plotted. Correlated values (shown in Figure 5) were compared against connecting all points within a defined pixel radius, as a function of size, where correlation yielded the least artifacts (Figures S10 and S11). Gray scale threshold values were chosen based on apparent height differences to produce binary image highlights, which were further used to obtain percent coverages.\n\n\\section{Infrared Spectroscopy}\nAll infrared spectra were collected with a Nicolet 6700 FTIR spectrometer (Thermo Electron Corp., Waltam, MA) that was equipped with a mercury-cadmium-telluride detector, held at liquid nitrogen temperatures, and a Seagull variable-angle reflection accessory (Harrick Scientific, Inc., Ossinging, NY). Water and carbon dioxide were removed from the spectrometer by an FTIR purge gas generator (Parker-Balston, Cleveland, OH). A grazing incidence reflection angle ( $82^{\\circ}$ with respect to the surface normal) with $p$-polarized light, a mirror speed of $1.27 \\mathrm{~cm} / \\mathrm{s}$, and a resolution of $2 \\mathrm{~cm}^{-1}$. Spectra were averaged over 5120 scans and normalized against spectra of perdeuterated $n$-dodecanethiolate monolayers on $\\mathrm{Au}\\{111\\}$.\n\n\\section{X-Ray Photoelectron Spectroscopy}\nAll XPS spectra were collected with an AXIS Ultra DLD instrument (Kratos Analytical Inc., Chestnut Ridge, NY). A monochromatic Al $\\mathrm{K}_{\\mathrm{a}}$ X-ray source ( $20 \\mathrm{~mA}, 15 \\mathrm{kV}$ ) with a $200 \\mu \\mathrm{m}$ circular spot size that was held at ultrahigh vacuum $\\left(10^{-9}\\right.$ torr) were used for all measurements. Spectra were acquired at a pass energy of $160 \\mathrm{eV}$ for survey spectra and 20 $\\mathrm{eV}$ for high resolution spectra of S 2p, C 1s, B 1s, and Au 4 fregions that used a $200 \\mathrm{~ms}$ dwell time. Different numbers of scans were carried out depending on the amount required for high-resolution spectra, which ranged from 20 scans for $\\mathrm{C} 1$ s to 75 scans for $\\mathrm{S} 2 \\mathrm{p}$. Binding energies were calibrated to the $\\mathrm{Au} 4 \\mathrm{f}$ peak at $83.98 \\mathrm{eV} .^{71}$ Spectra were fit using CasaXPS software with Gaussian-Lorentzian lineshapes after Shirley background subtraction. Sulfur regions were fitted by a doublet structure with a $1.18 \\mathrm{eV}$ spin-orbit splitting and a defined intensity ratio $\\left(2 \\mathrm{p}_{3 / 2}: 2 \\mathrm{p}_{1 / 2}, 2: 1\\right)$.\n\n\\section{Computational Modeling}\nDensity functional theory calculations were performed to understand the molecular chemisorption modes and their relation with the STM imaging. Geometry optimizations were performed with the plane-wave periodic DFT VASP program. ${ }^{72-75}$ Exchange and correlation effects were described within the generalized gradient approximation (GGA), using the Perdew-Burke-Ernzerhof (PBE) functional ${ }^{76}$ and electron-ion interactions are treated with the projector augmented wave approach. ${ }^{77}$ In order to describe the dispersion interactions, the empirically constructed DFT-D3 method was used. ${ }^{78}$ The calculations were done in a spin-unrestricted fashion when applicable. The gold slab was modeled as a $(\\sqrt{7} \\times \\sqrt{ } 7) R 19.12^{\\circ}$ supercell, with four layers along z. The bottom two layers were fixed during the optimization. The calculated lattice constant for Au was $2.95 \\AA$, in good agreement with the experiment.\n\nTo avoid spurious interactions between images in the z-direction, a vacuum gap of $10 \\AA$ was inserted between the highest atom of the carboranedithiolate molecules, and the repeated image of the slab's bottom layer. The cutoff energy for the plane-wave basis set was chosen to be $400 \\mathrm{eV}$. A $5 \\times 5 \\times 1$ Monkhorst-Pack k-point grid allowed for the numerical solution of Hamiltonian and overlap matrix elements. For the STM images and the charge density plots a denser k point grid $(11 \\times 11 \\times 1)$ was used.\n\nThe STM images were simulated using the Tersoff-Hamann method ${ }^{47}$ using VASP.\n\nNatural bond order (NBO1.1 ${ }^{79}$ analyses of the molecules on the support were performed. The periodic version of NBO also requires the wave function to be represented in an atomcentered basis, therefore we projected the plane-wave solution onto the Def2-TZVP ${ }^{80,81}$ Gaussian-type orbital basis set.\n\n\\section{Supplementary Material}\nRefer to Web version on PubMed Central for supplementary material.\n\n\\section{ACKNOWLEDGMENTS}\nWe thank the DoE (grant \\#DE-SC-0005025) for support of the instrumentation and methods developed and applied here and the W. M. Keck Foundation for support of the development of the image analysis methods used. ANA thanks NSF CAREER Award CHE1351968. ORI thanks ... Fellowship. EJI thanks the Basque Government for the POS\\_2015\\_1\\_0008 postdoctoral fellowship. We gratefully thank Dr. Andrew I. Guttentag, Dr. James N. Hohman, Prof. Alex Spokoyny, and Logan Stewart for their support and helpful discussions, and Baz Luhrmann and Henri de Toulouse-Lautrec for inspiration.\n\n\\section{REFERENCES}\n\\begin{enumerate}\n  \\item Love JC; Estroff LA; Kriebel JK; Nuzzo RG; Whitesides GM. Self-Assembled Monolayers of Thiolates on Metals as a Form of Nanotechnology. Chem. Rev 2005, 105, 1103-1170. [PubMed: $15826011]$\n\n  \\item Weiss PS Functional Molecules and Assemblies in Controlled Environments: Formation and Measurements. Acc. Chem. Res 2008, 41, 1772–1781. [PubMed: 18847229]\n\n  \\item Claridge SA; Liao WS; Thomas JC; Zhao Y; Cao HH; Cheunkar S; Serino AC; Andrews AM; Weiss PS From the Bottom Up: Dimensional Control and Characterization in Molecular Monolayers. Chem. Soc. Rev 2013, 42, 2725–2745. [PubMed: 23258565] 4. Ulman A Formation and Structure of Self-Assembled Monolayers. Chem. Rev 1996, 96, 15331554. [PubMed: 11848802]\n\n  \\item Poirier GE Characterization of Organosulfur Molecular Monolayers on Au(111) using Scanning Tunneling Microscopy. Chem. Rev 1997, 97, 1117–1128. [PubMed: 11851444]\n\n  \\item Smith RK; Lewis PA; Weiss PS Patterning Self-Assembled Monolayers. Prog. Surf. Sci 2004, 75, 168.\n\n  \\item Han P; Kurland AR; Giordano AN; Nanayakkara SU; Blake MM; Pochas CM; Weiss PS Heads and Tails: Simultaneous Exposed and Buried Interface Imaging of Monolayers. ACS Nano 2009, 3, 3115-3121. [PubMed: 19772297]\n\n  \\item Hohman JN; Thomas JC; Zhao Y; Auluck H; Kim M; Vijselaar W; Kommeren S; Terfort A; Weiss PS Exchange Reactions between Alkanethiolates and Alkaneselenols on Au\\{111\\}. J. Am. Chem. Soc 2014, 136, 8110-8121. [PubMed: 24803177]\n\n  \\item Salmeron M; Neubauer G; Folch A; Tomitori M; Ogletree DF; Sautet P Viscoelastic and Electrical Properties of Alkylthiol Monolayers on Gold(111) Films. Langmuir 1993, 9, 3600-3611.\n\n  \\item Nuzzo RG; Allara DL Adsorption of Bifunctional Organic Disulfides on Gold Surfaces. J. Am. Chem. Soc 1983, 105, 4481-4483.\n\n  \\item Takami T; Delamarche E; Michel B; Gerber Ch.; Wolf H; Ringsdorf H. Recognition of Individual Tail Groups in Self-Assembled Monolayers. Langmuir 1995, 11, 3876-3881.\n\n  \\item Kim M; Hohman JN; Cao Y; Houk KN; Ma H; Jen AK; Weiss PS Creating Favorable Geometries for Directing Organic Photoreactions in Alkanethiolate Monolayers. Science 2011, 331, 13121315. [PubMed: 21393542]\n\n  \\item Hohman JN; Claridge SA; Kim M; Weiss PS Cage Molecules for Self-Assembly. Mater. Sci. Eng. R 2010, 70, 188-208.\n\n  \\item Spokoyny AM; Machan CW; Clingerman DJ; Rosen MS; Wiester MJ; Kennedy RD; Stern CL; Sarjeant AA; Mirkin CA A Coordination Chemistry Dichotomy for Icosahedral Carborane-Based Ligands. Nat. Chem 2011, 3, 590–596. [PubMed: 21778977]\n\n  \\item Kim J; Rim YS; Liu Y; Serino AC; Thomas JC; Chen H; Yang Y; Weiss PS Interface Control in Organic Electronics Using Mixed Monolayers of Carboranethiol Isomers. Nano Lett. 2014, 14, 2946–2951. [PubMed: 24773449]\n\n  \\item Thomas JC; Schwartz JJ; Hohman JN; Claridge SA; Auluck HS; Serino AC; Spokoyny AM; Tran G; Kelly KF; Mirkin CA; Gilles J; Osher SJ; Weiss PS Defect-Tolerant Aligned Dipoles within Two-Dimensional Plastic Lattices. ACS Nano 2015, 9, 4734–4742. [PubMed: 25867638]\n\n  \\item Thomas JC; Boldog I; Auluck HS; Bereciartua P; Dušek M; Macháček J; Bastl Z; Weiss PS; Baše T Self-Assembled $p$-Carborane Analog of $p$-Mercaptobenzoic Acid on Au\\{111\\}. Chem. Mater 2015, 27, 5425-5435.\n\n  \\item Kristiansen K; Stock P; Baimpos T; Raman S; Harada JK; Israelachvili JN; Valtiner M Influence of Molecular Dipole Orientations on Long-Range Exponential Interaction Forces at Hydrophobic Contacts in Aqueous Solutions. ACS Nano 2014, 8, 10870–10877. [PubMed: 25289697]\n\n  \\item Hohman JN; Zhang P; Morin EI; Han P; Kim M; Kurland AR; McClanahan PD; Balema VP; Weiss PS Self-Assembly of Carboranethiol Isomers on Au $\\{111\\}$ : Intermolecular Interactions Determined by Molecular Dipole Orientations. ACS Nano 2009, 3, 527-536. [PubMed: 19243128]\n\n  \\item Serino AC; Anderson ME; Saleh LMA; Dziedzic RM; Mills H; Heidenreich LK; Spokoyny AM; Weiss PS Work Function Control of Germanium through Carborane-Carboxylic Acid Surface Passivation. ACS Appl. Mater. Interfaces 2017, 9, 34592–34596. [PubMed: 28920673]\n\n  \\item Baše T; Bastl Z; Plzák Z; Grygar T; Plešek J; Carr M; Malina V; Šubrt J; Boháček J; Večerníková E; Kříž O Carboranethiol-Modified Gold Surfaces. A Study and Comparison of Modified Cluster and Flat Surfaces. Langmuir 2005, 21, 7776-7785. [PubMed: 16089383]\n\n  \\item Baše T; Bastl Z; Šlouf M; Klementová M; Šubrt J; Vetushka A; Ledinský M; Fejfar A; Macháček J; Carr MJ; Londesborough MGS Gold Micrometer Crystals Modified with Carboranethiol Derivatives. J. Phys. Chem. C 2008, 112, 14446-14455.\n\n  \\item Baše T; Bastl Z; Havránek V; Lang K; Bould J; Londesborough MGS; Macháček J; Plešek J Carborane-Thiol-Silver Interactions. A Comparative Study of the Molecular Protection of Silver Surfaces. Surf. Coat. Tech 2010, 204, 2639-2646. 24. Lübben JF; Baše T; Rupper P; Künniger T; Macháček J; Guimond S Tuning the Surface Potential of Ag Surfaces by Chemisorption of Oppositely-Oriented Thiolated Carborane Dipoles. J. Colloid Interface Sci 2011, 354, 168-174. [PubMed: 21129750]\n\n  \\item Langecker J; Fejfarová K; Dušek M; Rentsch D; Baše T Carbon-Substituted 9,12-Dimercapto-1,2Dicarba-closo-Dodecaboranes via a 9,12-Bis(Methoxy-Methylthio)-1,2-Dicarba-closoDodecaborane Precursor. Polyhedron 2012, 45, 144-151.\n\n  \\item Baše T; Bastl Z; Havránek V; Macháček J; Langecker J; Malina V Carboranedithiols: Building Blocks for Self-Assembled Monolayers on Copper Surfaces. Langmuir 2012, 28, 12518-12526. [PubMed: 22860761]\n\n  \\item Schwartz JJ; Mendoza AM; Wattanatorn N; Zhao Y; Nguyen VT; Spokoyny AM; Mirkin CA; Base T; Weiss PS Surface Dipole Control of Liquid Crystal Alignment. J. Am. Chem. Soc 2016, 49, 5957-5967.\n\n  \\item Nuzzo RG; Dubois LH; Allara DL Fundamental Studies of Microscopic Wetting on OrganicSurfaces. 1. Formation and Structural Characterization of a Self-Consistent Series of Polyfunctional Organic Monolayers. J. Am. Chem. Soc 1990, 112, 558-569.\n\n  \\item Liao WS; Cheunkar S; Cao HH; Bednar HR; Weiss PS; Andrews AM Subractive Patterning via Chemical Lift-off Lithography. Science 2012, 337, 1517–1521. [PubMed: 22997333]\n\n  \\item Kim J; Rim YS; Chen H; Cao HH; Nakatsuka N; Hinton HL; Zhao C; Andrews AM; Yang Y; Weiss PS. Fabrication of High-Performance Ultrathin $\\mathrm{In}_{2} \\mathrm{O}_{3}$ Film Field-Effect Transistors and Biosensors Using Chemical Lift-Off Lithography. ACS Nano 2015, 9, 4572–4582. [PubMed: 25798751]\n\n  \\item Andrews AM; Liao W-S; Weiss PS Double-Sided Opportunities Using Chemical Lift-Off Lithography, Асс. Chem. Res 2016, 49, 1449–1457. [PubMed: 27064348]\n\n  \\item Monnell JD; Stapleton JJ; Dirk SM; Reinerth WA; Tour JM; Allara DL; Weiss PS Relative Conductances of Alkaneselenolate and Alkanethiolate Monolayers on Au\\{111\\}. J. Phys. Chem. B 2005, 109, 20343-20349. [PubMed: 16853632]\n\n  \\item Zheng YB; Pathem BK; Hohman JN; Thomas JC; Kim M; Weiss PS Photoresponsive Molecules in Well-Defined Nanoscale Environments. Adv. Mater 2013, 25, 302–312. [PubMed: 22933316]\n\n  \\item He H-X; Huang W; Zhang H; Li QG; Li SFY; Liu ZF Demonstration of High-Resolution Capability of Chemical Force Titration via Study of Acid/Base Properties of a Patterned SelfAssembled Monolayer. Langmuir 2000, 16, 517-521.\n\n  \\item Saavedra HM; Thompson CM; Hohman JN; Crespi VH; Weiss PS. Reversible Lability by in Situ Reaction of Self-Assembled Monolayers. J. Am. Chem. Soc 2009, 131, 2252–2259. [PubMed: 19170497]\n\n  \\item Saavedra HM; Mullen TJ; Zhang P; Dewey DC; Claridge SA; Weiss PS Hybrid Strategies in Nanolithography. Rep. Prog. Phys 2010, 73, 036501-036600.\n\n  \\item Saadi FH; Carim AI; Verlage E; Hemminger JC; Lewis NS; Soriaga MP CoP as an Acid-Stable Active Electrocatalyst for the Hydrogen-Evolution Reaction: Electrochemical Synthesis, Interfacial Characterization and Performance Evaluation. J. Phys. Chem. C 2014, 118, 29294 29300.\n\n  \\item Katano S; Kim Y; Matsubara H; Kitagawa T; Kawai M Hierarchical Chiral Framework Based on a Rigid Adamantane Tripod on Au(111). J. Am. Chem. Soc 2007, 129, 2511-2515. [PubMed: 17279745]\n\n  \\item Hatzor A; McCarty GS; D'Onofrio TG; Fuchs DJ; Allara DL; Tour JM; Weiss PS Scanning Tunneling Microscopy and Spectroscopy of Caltrops on Au $\\{111\\}$. Unpublished.\n\n  \\item Moore AM; Dameron AA; Mantooth BA; Smith RK; Fuchs DJ; Ciszek JW; Maya F; Yao Y; Tour JM; Weiss PS Molecular Engineering and Measurements to Test Hypothesized Mechanisms in Single Molecule Conductance Switching. J. Am. Chem. Soc 2006, 128, 1959-1967. [PubMed: 16464097]\n\n  \\item Yao Y; Tour JM Facile Convergent Route to Molecular Caltrops. J. Org. Chem 1999, 64, 19681971. [PubMed: 11674290]\n\n  \\item Jian H; Tour JM En Route to Surface-Bound Electric Field-Driven Molecular Motors. J. Org. Chem 2003, 68, 5091-5103. [PubMed: 12816462] 43. van Delden RA; ter Wiel MKJ; Pollard MM; Vicario J; Koumura N; Feringa BL Unidirectional Molecular Motor on a Gold Surface. Nature 2005, 437, 1337-1340. [PubMed: 16251960]\n\n  \\item Ye T; Kumar AS; Saha S; Takami T; Huang TJ; Stoddart JF; Weiss PS Changing Stations in Single Bistable Rotaxane Molecules under Electrochemical Control. ACS Nano 2010, 4, 3697–3701. [PubMed: 20540555]\n\n  \\item Donhauser ZJ; Mantooth BA; Kelly KF; Bumm LA; Monnell JD; Stapleton JJ; Price DW, Jr.; Rawlett AM; Allara DL; Tour JM; Weiss PS Conductance Switching in Single Molecules through Conformational Changes. Science 2001, 292, 2303–2307. [PubMed: 11423655]\n\n  \\item Lewis PA; Inman CE; Maya F; Tour JM; Hutchison JE; Weiss PS Molecular Engineering of the Polarity and Interactions of Molecular Electronics Switches. J. Am. Chem. Soc 2005, 127, 1742117426. [PubMed: 16332092]\n\n  \\item Tersoff J; Hamann DR Theory and Application for the Scanning Tunneling Microscope. Phys. Rev. Lett 1998, 50, 1998-2001.\n\n  \\item McCarty GS; Weiss PS Scanning Probe Studies of Single Nanostructures. Chem. Rev 1999, 99, 1983-1990. [PubMed: 11849017]\n\n  \\item Claridge SA; Schwartz JJ; Weiss PS Electrons, Photons, and Force: Quantitative Single-Molecule Measurements from Physics to Biology. ACS Nano 2011, 5, 693–729. [PubMed: 21338175]\n\n  \\item Bonnell DA; Basov DN; Bode M; Diebold U; Kalinin SV; Madhavan V; Novotny L; Salmeron M; Schwarz UD; Weiss PS Imaging Physical Phenomena with Local Probes: From Electrons to Photons. Rev. Mod. Phys 2012, 84, 1343-1381.\n\n  \\item Bumm LA; Arnold JJ; Cygan MT; Dunbar TD; Burgin TP; Jones L, II; Allara DL; Tour JM; Weiss PS Are Single Molecular Wires Conducting? Science 1996, 271, 1705-1707.\n\n  \\item Claridge SA; Thomas JC; Silverman MA; Schwartz JJ; Yang Y; Wang C; Weiss PS Differentiating Amino Acid Residues and Side Chain Orientations in Peptides Using Scanning Tunneling Microscopy. J. Am. Chem. Soc 2013, 135, 18528-18535. [PubMed: 24219245]\n\n  \\item Thomas JC; Schwartz JJ; Hohman JN; Claridge SA; Auluck HS; Serino AC; Spokoyny AM; Tran G; Kelly KF; Mirkin CA; Gilles J; Osher SJ; Weiss PS Defect-Tolerant Aligned Dipoles within Two-Dimensional Plastic Lattices. ACS Nano 2015, 9, 4734–4742. [PubMed: 25867638]\n\n  \\item Thomas JC; Goronzy DP; Dragomeritskiy K; Zosso D; Gilles J; Osher SJ; Bertozzi A; Weiss PS Mapping Buried Hydrogen-Bonding Networks, ACS Nano 2016, 10, 5446-5451. [PubMed: 27096290]\n\n  \\item Yugay D; Goronzy DP; Kawakami LM; Claridge SA; Song T-B; Yan Z; Xie Y-H; Gilles J; Yang Y; Weiss PS Copper Ion Binding Site in $\\beta$-Amyloid Peptide. Nano Lett. 2016, 16, 6282-6289.\n\n\\end{enumerate}\n\n[PubMed: 27616333]\n\n\\begin{enumerate}\n  \\setcounter{enumi}{55}\n  \\item Fujii S; Akiba U; Fujihira M Geometry for Self-Assembling of Spherical Hydrocarbon Cages with Methane Thiolates on Au(111). J. Am. Chem. Soc 2002, 124, 13629-13635. [PubMed: 12418918]\n\n  \\item Wade K The Structural Significance of the Number of Skeletal Bonding Electron-Pairs in Carboranes, the Higher Boranes and Borane Anions, and Various Transition-Metal Carbonyl Cluster Compounds. J. Chem. Soc. D 1971, 792-793.\n\n  \\item Wiesendanger R; Eng L; Hidber HR; Oelhafen P; Rosenthaler L; Staufer U; Guntherodt HJ Local Tunneling Barrier Height Images Obtained with the Scanning Tunneling Microscope. Surf Sci. 1987, 189-190, 24-28.\n\n  \\item Olesen L; Brandbyge M; S0rensen MR; Jacobsen KW; Laegsgaard E; Stensgaard I; Besenbacher F. Apparent Barrier Height in Scanning Tunneling Microscopy Revisited. Phys. Rev. Lett 1996, 76, 1485-1488. [PubMed: 10061735]\n\n  \\item Lang ND Apparent Barrier Height in Scanning Tunneling Microscopy. Phys. Rev. B 1988, 37, $10395-10398$.\n\n  \\item Jain J; Jain A Displacement Measurement and Its Application in Interframe Image Coding. IEEE Trans. Comm 1981, 29, 1799-1808.\n\n  \\item Love NS; Kamath C An Empirical Study of Block Matching Techniques for the Detection of Moving Objects. CASC, LLNL. Livermore 2006, 1-36.\n\n  \\item Slaughter LS; Cheung KM; Kaappa S; Cao HH; Yang Q; Young TD; Serino AC; Malola S; Olson JM; Link S; Hakkinen H; Andrews AM; Weiss PS Patterning Supported Gold Monolayers via Chemical Lift-Off Lithography. Beilstein J. Nanotechnol 2017, 8, in press. 64. Leites LA Vibrational Spectroscopy of Carboranes and Parent Boranes and its Capabilities in Carborane Chemistry. Chem. Rev 1992, 92, 279-323.\n\n  \\item Stranick SJ; Parikh AN; Allara DL; Weiss PS A New Mechanism for Surface Diffusion: Motion of a Substrate-Adsorbate Complex. J. Phys. Chem 1994, 98, 11136-11142.\n\n  \\item Poirier GE; Tarlov MJ Molecular Ordering and Gold Migration Observed in Butanethiol SelfAssembled Monolayers using Scanning Tunneling Micrscopy. J. Phys. Chem 1995, 99, 1096610970.\n\n  \\item Shimizu TK; Jung J; Otani T; Han Y-K; Kawai M; Kim Y Two-Dimensional Superstructure Formation of Fluorinated Fullerene on Au(111): A Scanning Tunneling Microscopy Study. ACS Nano 2012, 6, 2679–2685. [PubMed: 22329735]\n\n  \\item Wiesboeck RA; Hawthorne MF Dicarbaundecaborane(13) and Derivatives. J. Am. Chem. Soc $1964,86,1642-1643$.\n\n  \\item Bumm LA; Arnold JJ; Charles LF; Dunbar TD; Allara DL; Weiss PS Directed Self-Assembly to Create Molecular Terraces with Molecularly Sharp Boundaries in Organic Monolayers. J. Am. Chem. Soc 1999, 121, 8017-8021.\n\n  \\item Ferris JH; Kushmerick JG; Johnson JA; Yoshikawa Youngquist MG; Kessinger RB; Kingsbury HF; Weiss PS Design, Operation, and Housing of an Ultrastable, Low Temperature, Ultrahigh Vacuum Scanning Tunneling Microscope. Rev. Sci. Instrum 1998, 69, 2691-2695.\n\n  \\item Moulder JF Handbook of X-ray Photoelectron Spectroscopy: A Reference Book of Standard Spectra for Idenfication and Interpretation of XPS Data; Perkin-Elmer Corporation, Physical Electronics Division: Eden Prairie, MN, 1992.\n\n  \\item Kresse G; Hafner J Ab Initio Molecular Dynamics for Liquid Metals. Phys. Rev. B 1993, 47, 558561.\n\n  \\item Kresse G; Hafner J Ab Initio Molecular-Dynamics Simulation of the Liquid-Metal-AmorphousSemiconductor Transition in Germanium. Phys. Rev. B 1994, 49,14251-14269.\n\n  \\item Kresse G; Furthmüller J Efficiency of $A b$-Initio Total Energy Calculations for Metals and Semiconductors Using a Plane-Wave Basis Set. Comput. Mat. Sci 1996, 6, 15-50.\n\n  \\item Kresse G; Furthmüller J Efficient Iterative Schemes for $A b$ Initio Total-Energy Calculations Using a Plane-Wave Basis Set. Phys. Rev. B 1996, 54, 11169-11186.\n\n  \\item Perdew JP; Burke K; Ernzerhof M Generalized Gradient Approximation Made Simple Phys. Rev. Lett 1997, 78, 1396-3868.\n\n  \\item Kresse G; Joubert D From Ultrasoft Pseudopotentials to the Projector Augmented-Wave Method. Phys. Rev. B 1999, 59, 1758-1775.\n\n  \\item Grimme S; Antony J; Ehrlich S; Krieg S A consistent and Accurate Ab Initio Parametrization of Density Functional Dispersion Correction (DFT-D) for the 94 elements H-Pu. J. Chem. Phys 2010 , 132, 154104-154122. [PubMed: 20423165]\n\n  \\item Dunnington BD; \\& Schmidt JR Generalization of Natural Bond Orbital Analysis to Periodic Systems: Applications to Solids and Surfaces via Plane-Wave Density Functional Theory. J. Chem. Theory Comput 2012, 8, 1902-1911. [PubMed: 26593824]\n\n  \\item Weigend F Accurate Coulomb-Fitting Basis Sets for $\\mathrm{H}$ to Rn, Phys. Chem. Chem. Phys 2006, 8, 1057-1065. [PubMed: 16633586]\n\n  \\item Weigend F; Ahlrichs R Balanced Basis Sets of Split Valence, Triple Zeta Valence and Quadruple Zeta Valence Quality for $\\mathrm{H}$ to Rn: Design and Assessment of Accuracy, Phys. Chem. Chem. Phys 2005, 7, 3297-3305. [PubMed: 16240044] A\n\n\\end{enumerate}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-16_219_713_335_917}\n\\end{center}\n\nD\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-16_739_1224_342_808}\n\\end{center}\n\n$0.7$\n\n$0.7 \\mathrm{E}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-16_829_1209_819_888}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-16_222_710_977_1451}\n\\end{center}\n\n$3.5$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_67e874a3c664208e2d2fg-16_270_1222_976_1538}\n\n$0.7$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-16_768_1226_1446_1546}\n\\end{center}\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_67e874a3c664208e2d2fg-16_249_683_1583_1805}\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_67e874a3c664208e2d2fg-16_247_1203_1582_2018}\n\nFigure 1.\n\nScanning tunneling microscope images of (A,B) 1,2-(HS) $2-1,2-\\mathrm{C}_{2} \\mathrm{~B}_{10} \\mathrm{H}_{10}(\\mathbf{1 0 2})$ on $\\operatorname{Au}\\{111\\} /$ mica at two different resolutions $\\left(\\mathrm{V}_{\\text {sample }}=-0.1 \\mathrm{~V}, \\mathrm{I}_{\\text {tunneling }}=100 \\mathrm{pA}, \\mathrm{T}=298\\right.$ K). Insets depict fast Fourier transforms (FFTs) that indicate hexagonally close-packed arrangements with nearest-neighbor spacings of $7.6 \\pm 0.5 \\AA$. Two distinct binding states are highlighted in red and black. (C) Binding modes are shown schematically, where $\\mathbf{1 O 2}$ assembles into both monovalent (black box) and divalent (red box) modes. (D,E) Scanning tunneling microscope images $\\left(\\mathrm{V}_{\\text {sample }}=-0.1 \\mathrm{~V}, \\mathrm{I}_{\\text {tunneling }}=100 \\mathrm{pA}, \\mathrm{T}=298 \\mathrm{~K}\\right)$ of 9,12(HS) ${ }_{2}-1,2-\\mathrm{C}_{2} \\mathrm{~B}_{10} \\mathrm{H}_{10}(\\mathbf{9 0 1 2})$ on $\\mathrm{Au}\\{111\\} /$ mica at different resolutions. The inset depicts a FFT showing a hexagonally close-packed arrangement with the same spacing as $\\mathbf{1 0 2}$. The two binding states are highlighted schematically in red and black boxes. (F) Binding modes for $\\mathbf{9 0 1 2}$ are depicted schematically, where both monovalent (black box) and divalent (red box) modes are present.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_67e874a3c664208e2d2fg-17_225_1689_300_2020}\n\nFigure 2.\n\nPreferred structures/binding sites for 102 and $\\mathbf{9 0 1 2}$ in their respective monovalent and divalent binding modes. The $\\mathrm{z}$ coordinate of the uppermost atom (without considering $\\mathrm{H}$ atoms) and the tilt angles of the molecules with respect to the surface normal $(a)$ are shown for each case.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-18_214_1000_321_1213}\n\\end{center}\n\n102 (monovalent mode)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-18_1106_1908_323_485}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-18_1107_1885_477_1214}\n\\end{center}\n\n9012 (monovalent mode)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-18_215_999_1275_1999}\n\\end{center}\n\n102 (divalent mode)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-18_1109_1895_1273_2013}\n\\end{center}\n\n9012 (divalent mode)\n\nFigure 3.\n\nSimulated scanning tunneling microscope images for 102 and 9012 in their respective monovalent and divalent binding modes, with the maximum height shown in the insets (in A). The $10^{-4}$ isovalue for the charge density was used.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-19_217_916_392_1083}\n\\end{center}\n\n102 (monovalent mode) Min: 14.72, Max: $17.17$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-19_1083_1817_401_1106}\n\\end{center}\n\n9012 (monovalent mode) Min: 15.80, Max: $17.15$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-19_234_915_1256_1931}\n\\end{center}\n\n102 (divalent mode) Min: 14.03, Max: $16.53$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-19_1126_1812_1256_1904}\n\\end{center}\n\n9012 (divalent mode) Min: 16.39; Max: $17.47$\n\nFigure 4.\n\nCharge density plots from the Fermi energy to $\\mathrm{E}_{\\mathrm{f}}-0.1 \\mathrm{eV}$ for (top) $\\mathbf{1 0 2}$ and (bottom) $\\mathbf{9 0 1 2}$ in their respective (left) monovalent and (right) divalent binding modes. The images are plotted with an isodensity value of $0.00002$, because most of the charge density is located on the gold surface. \"Min\" and \"Max\" stand for the minimum and maximum topographic ranges (in $\\AA$ ), taken from the simulated STM images.\n\n\\section{A}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-20_228_660_322_1306}\n\\end{center}\n\nD\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-20_728_1142_336_743}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-20_735_1147_760_877}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-20_729_1141_878_1371}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-20_236_664_1317_1393}\n\\end{center}\n\n90\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_67e874a3c664208e2d2fg-20_215_1147_1336_2036}\n\nFigure 5.\n\n(A) Scanning tunneling microscope images, recorded at low temperature $\\left(\\mathrm{V}_{\\text {sample }}=-0.5 \\mathrm{~V}\\right.$, $\\left.\\mathrm{I}_{\\text {tunneling }}=15 \\mathrm{pA}, \\mathrm{T}=4 \\mathrm{~K}\\right)$ of 1,2-(HS) $)_{2}-1,2-\\mathrm{C}_{2} \\mathrm{~B}_{10} \\mathrm{H}_{10}(\\mathbf{1 0 2})$ on $\\mathrm{Au}\\{111\\}$ with local maxima (blue) highlighted. (B) Simultaneously acquired local barrier height (LBH) image, with LBH maxima (red) highlighted. (C) Rose plot (depicting correlated dipole offsets) that is binned by both magnitude ( $0.5 \\AA$ bins) and orientation ( $4^{\\circ}$ bins), and a ball-and-stick model of 102 showing thiol positions. (D) Scanning tunneling microscope image, recorded at low temperature ( $\\left.\\mathrm{V}_{\\text {sample }}=-0.5 \\mathrm{~V}, \\mathrm{I}_{\\text {tunneling }}=15 \\mathrm{pA}, \\mathrm{T}=4 \\mathrm{~K}\\right)$ of 9,12-(HS) $)_{2}-1,2-$ $\\mathrm{C}_{2} \\mathrm{~B}_{10} \\mathrm{H}_{10}$ (9012) on $\\mathrm{Au}\\{111\\}$ with local maxima (blue) highlighted. (E) Simultaneously acquired LBH map, with inverted LBH maxima (red) highlighted. (F) Rose plot (depicting correlated dipole offsets) that is binned by both magnitude ( $0.5 \\AA$ bins) and orientation ( $4^{\\circ}$ bins), and a ball-and-stick model of $\\mathbf{9 0 1 2}$. A\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-21_222_775_346_1020}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-21_221_777_1079_1756}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-21_249_754_1754_2036}\n\\end{center}\n\nD\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-21_817_1362_347_889}\n\\end{center}\n\n$2.4 \\mathrm{E}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-21_821_1358_1076_1743}\n\\end{center}\n\n$\\mathbf{F}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-21_847_1332_1804_2023}\n\\end{center}\n\nFigure 6.\n\n(A,B) Scanning tunneling microscope images $\\left(\\mathrm{V}_{\\text {sample }}=-0.1 \\mathrm{~V}, \\mathrm{I}_{\\text {tunneling }}=100 \\mathrm{pA}, \\mathrm{T}=298\\right.$ K) of 1,2-(HS) $)_{2}-1,2-\\mathrm{C}_{2} \\mathrm{~B}_{10} \\mathrm{H}_{10}(\\mathbf{1 0 2})$ on $\\mathrm{Au}\\{111\\} /$ mica at two different resolutions after basic deposition conditions (2:1, $\\mathrm{NaOH}: 102)$. Insets depict fast Fourier transforms (FFTs) that show hexagonally close-packed arrangements with the same nearest-neighbor spacings as in Figure 1. (C) A majority of the $\\mathbf{1 0 2}$ molecules have divalent surface attachment, depicted schematically. (D,E) Scanning tunneling topographs $\\left(\\mathrm{V}_{\\text {sample }}=-0.1 \\mathrm{~V}, \\mathrm{I}_{\\text {tunneling }}=\\right.$ $100 \\mathrm{pA}, \\mathrm{T}=298 \\mathrm{~K})$ of 9,12-(HS) $)_{2}-1,2-\\mathrm{C}_{2} \\mathrm{~B}_{10} \\mathrm{H}_{10}$ (9012) on Au $\\{111\\} /$ mica at different resolutions after basic deposition (2:1, $\\mathrm{NaOH}$ :9012). Inset depicts a FFT showing the same arrangement and spacing as 102. (F) A divalently bound $\\mathbf{9 0 1 2}$ molecule is shown schematically. Basic Conditions: Neutral Conditions: Acidic Conditions:\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-22_217_970_840_2038}\n\\end{center}\n\n\\section{$\\sim 0.4$ A Apparent}\nHeight Difference\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-22_1050_1508_947_1221}\n\\end{center}\n\nSH,S (monovalent state)\n\nNeutral/Acidic Conditions: $\\quad 98 \\%$\n\nBasic Conditions:\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-22_1062_1512_1214_1973}\n\\end{center}\n\nS,S (divalent state)\n\n$2 \\%$\n\n$99 \\%$\n\nFigure 7.\n\nBinding assignments measured by scanning tunneling microscopy and scanning tunneling spectroscopy (STS). (Top) Self-assembled monolayers composed of 1,2-(HS) $)_{2}-1,2-$ $\\mathrm{C}_{2} \\mathrm{~B}_{10} \\mathrm{H}_{10}$ (102) form into (left) a thiol/thiolate state (monovalent form) and (right) a dithiolate state (divalent form) that differ in apparent height in scanning tunneling microscope images. (Bottom) Monolayers composed of 9,12-(HS) $)_{2}-1,2-\\mathrm{C}_{2} \\mathrm{~B}_{10} \\mathrm{H}_{10}(\\mathbf{9 0 1 2})$ form into (left) an adsorbed monothiol/monothiolate (monovalent) state, under acidic and neutral conditions and (right) a dithiolate (divalent) state that differ in measured apparent height, as shown for the conditions shown in figure 1 . Upon deposition under basic conditions, majority dithiolate binding is observed for both isomers, as determined by STM imaging. A\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-23_220_772_358_1019}\n\\end{center}\n\nD\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_67e874a3c664208e2d2fg-23_810_1352_362_1014}\n\n$\\mathbf{B}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-23_224_774_1062_1740}\n\\end{center}\n\n$\\mathrm{E}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-23_810_1353_1075_1712}\n\\end{center}\n\nC\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-23_255_743_1812_2015}\n\\end{center}\n\n$\\mathbf{F}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-23_835_1328_1817_2021}\n\\end{center}\n\nFigure 8.\n\n(A,B) Scanning tunneling microscope images $\\left(\\mathrm{V}_{\\text {sample }}=-0.1 \\mathrm{~V}, \\mathrm{I}_{\\text {tunneling }}=100 \\mathrm{pA}, \\mathrm{T}=298\\right.$ K) of 1,2-(HS) ${ }_{2}-1,2-\\mathrm{C}_{2} \\mathrm{~B}_{10} \\mathrm{H}_{10}(\\mathbf{1 0 2})$ on $\\mathrm{Au}\\{111\\} /$ mica at two different resolutions under acidic deposition conditions (1:1, HCl:102). Inset depicts a fast Fourier transform (FFT) that shows a hexagonally close-packed arrangement with the same nearest-neighbor spacings measured in both basic and neutral conditions. (C) A minority push to the monovalent binding is achieved and depicted schematically. (D,E) Scanning tunneling topographs $\\left(\\mathrm{V}_{\\text {sample }}=-0.1 \\mathrm{~V}\\right.$, $\\left.\\mathrm{I}_{\\text {tunneling }}=100 \\mathrm{pA}, \\mathrm{T}=298 \\mathrm{~K}\\right)$ of 9,12-(HS $)_{2}-1,2-\\mathrm{C}_{2} \\mathrm{~B}_{10} \\mathrm{H}_{10}$ (9012) on Au $\\{111\\} /$ mica at different resolutions after acidic deposition (1:1, $\\mathrm{HCl}$ :9012). Inset depicts a FFT showing the same arrangement and spacing as in neutral conditions. (F) As monolayers composed of $\\mathbf{9 0 1 2}$ are already predominately monovalent, no change is measured, in comparison to neutral deposition conditions, for this system that is depicted schematically. Table 1.\n\nX-ray photoelectron spectroscopy energy shifts and Fourier transform spectroscopy frequency values in the B$\\mathrm{H}$ region (row). Columns are titled with 1,2-(HS) $)_{2}-1,2-\\mathrm{C}_{2} \\mathrm{~B}_{10} \\mathrm{H}_{10}(\\mathbf{1 0 2})$ or 9,12-(HS) ${ }_{2}-1,2-\\mathrm{C}_{2} \\mathrm{~B}_{10} \\mathrm{H}_{10}(\\mathbf{9 O 1 2})$ and labeled with neutral (n), basic (b), or acidic (a) deposition conditions.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_67e874a3c664208e2d2fg-24_506_1012_257_1309}\n\\end{center}\n\n\n\\end{document}", "record_id": "2023_09_22_67e874a3c664208e2d2fg"}