{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{On the Nature of Trapped-Hole States in CdS Nanocrystals and the Mechanism of their }\n\n\n\\author{R. Peyton Cline, James K. Utterback, Steven E. Strong, Gordana Dukovic, and\\\\\nJoel D. Eaves*\\\\\nDepartment of Chemistry and Biochemistry, University of Colorado Boulder, Boulder,\\\\\nColorado 80309-0215, USA\\\\\nE-mail: Joel.Eaves@colorado.edu}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\n\n\n\\begin{abstract}\nRecent transient absorption experiments on CdS nanorods suggest that photoexcited holes rapidly trap to the surface of these particles and then undergo diffusion along the rod surface. In this paper, we present a semiperiodic DFT model for the CdS nanocrystal surface, analyze it, and comment on the nature of both the hole-trap states and the mechanism by which the holes diffuse. Hole states near the top of the valence band form an energetic near continuum with the bulk, and localize to the non-bonding $\\mathrm{sp}^{3}$ orbitals on surface sulfur atoms. After localization, the holes form nonadiabatic small polarons that move between the sulfur orbitals on the surface of the particle in a series of uncorrelated, incoherent, thermally-activated hops at room temperature. The surface-trapped holes are deeply in the weak-electronic coupling limit and, as a result, undergo slow diffusion.\n\\end{abstract}\n\nIn semiconductor colloidal nanocrystals, surface traps play a pivotal role in deciding the fates of photoexcited carriers. Despite their importance, the microscopic nature and character of the trapped states remains elusive. In cadmium-chalcogenide systems like CdS and CdSe, electron and hole traps form on the surface.111 In most syntheses, capping ligands form bonds with the cadmium atoms at the surface and turn electron trapping into a minor decay pathway. $\\frac{[10 \\mid 12]}{15}$ In contrast, chalcogen atoms at the surface often remain undercoordinated and participate in hole trapping. [19[1116 18 The valence band holes in these materials exhibit sub-picosecond lifetimes, the quantum yield for band gap photoluminescence is low, and there is a relatively strong emission from recombination between trapped holes and conduction band electrons. $\\frac{[5[6] 16|17| 19[24]}{}$ The energies of the hole states relative to the bulk valence band and the extent of wavefunction localization within the trapped states of nanocrystals have been inferred from experimental spectra, though calculations for small clusters do exist. 91125 Recent work by Utterback et al. 26 makes the picture richer, showing that trapped holes are not static, but are mobile at room temperature. That work showed that a one-dimensional diffusion-annihilation model could explain the long-lived power law decays in transient absorption spectra, and hypothesized that hole diffusion occurs through hopping, where hops are on the order of individual bond lengths. Deducing the mechanism for this hole motion and testing the hypothesis put forward in Ref. 26 is a principal goal of this manuscript.\n\nIn this work, we use density functional theory (DFT) to describe the atomic structure of the nanocrystal surface and bulk states of $\\mathrm{CdS}$ and the electronic structure of the trapped holes in the material. We analyze the electronic structure of bulk and surface states within the system, and by parameterizing a tight-binding Hamiltonian from the DFT data, put forward a mechanism for the motion of trapped holes on the surface by computing hole hopping rates using Holstein small polaron/nonadiabatic Marcus theory. We show that the rates are related to an anisotropic diffusion coefficient, and from the rate theory, propose a lower bound on the reorganization energy for hole hopping that is consistent with the experimental data reported in Ref. 26.\n\nAs Fig. 11A illustrates, CdS nanorods exhibit 6 identical faces, with all facets characterized by the (10,10) Miller-Bravais index. ${ }^{[1227288}$ On this surface, both cadmium and sulfur atoms\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_182e0132c513bc81a414g-03_655_1546_642_1472}\n\\end{center}\n\nFigure 1: (A) Illustration and cross section of a CdS nanorod. The cross section shows the\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_182e0132c513bc81a414g-03_1615_1670_239_1881}\\\\\nMiller-Bravais index. The crystal c-axis runs parallel to the long axis of the nanorod. (B) The surface atoms forming the top layer of the computationally relaxed supercell, showing 8 cadmium (grey) and 8 sulfur (yellow) from the top-down and side views. Pseudo-atoms, used as a surrogate for passivating ligands, appear in blue. Orange circles outline the surface sulfur atoms. The remaining atoms forming the supercell are not shown (see SI, Fig. S2, for the full structure). The two small axes in black denote the orthorhombic coordinates mentioned in the text.\n\nmake three bonds to the crystal lattice, leaving one orbital on the atoms exposed to the surface to be either passivated by a ligand or left as a dangling bond.\n\nTo construct a computational model for the CdS bulk and surface where ligands passivate cadmium but not sulfur on the surface, ${ }^{[26}$ we begin by optimizing the nuclear positions of a $2 \\times 2 \\times 2$ wurtzite supercell in the bulk phase by minimizing the energy, changing both atomic positions and cell dimensions, at constant stress. To build the surface \"slab\" supercell\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_182e0132c513bc81a414g-03_2452_2514_240_1885}\n\\end{center}\n\ndirection has an orthorhombic symmetry, ${ }^{2729} 29$ with the sulfur atoms forming a rectangular lattice along in the orthorhombic $x-y$ plane for CdS (Fig. 1B). We choose coordinates so that the orthorhombic $\\mathrm{x}-\\mathrm{y}$ plane coincides exactly with the wurtzite crystal b-c plane. From the $2 \\times 2 \\times 2$ bulk supercell, we form the surface slab by replicating the $2 \\times 2 \\times 2$ bulk cell along the orthorhombic z-axis. It is convenient to define a layer as comprising 8 atoms of cadmium and 8 atoms of sulfur (Fig. 1B) lying approximately in the orthorhombic $x-y$ plane. The results reported here use an 8-layer slab supercell, $2 \\times 2 \\times 8$ unit cells in size, though the SI provides extensive convergence tests as a function of supercell dimensions. This supercell generates two equivalent, but independent, (10 10$)$ surfaces separated by a bulk phase of CdS sandwiched between the surfaces in a \"middle-out\" geometry. Finally, placing a vacuum layer $30 \\AA$ thick normal to the $(10 \\overline{1} 0)$ surface allows plane-wave basis functions and periodic boundary conditions to be applied in all directions, but ensures that periodic images in the z-direction do not interact with one another.\n\nWe use pseudo-hydrogen potentials ${ }^{3031}$ bonded to all surface cadmium sites to saturate the dangling bonds on cadmium atoms and mimic the effect of ligand passivation. To model the appropriate experimental systems, we leave surface sulfur atoms unpassivated. We then find the equilibrium nuclear positions for the slab by minimizing the energy, changing atomic positions at fixed supercell dimensions. The positions of the atoms in the middle 2 layers of the slab remain fixed during surface relaxation to simulate a rigid bulk region, though after relaxation the constraint forces on these atoms are zero to within accepted tolerance $(23$ $\\mathrm{meV} / \\AA$ ). This implies that the middle 2 layers appear approximately as bulk to the other atoms, whose positions we allow to change until their atomic forces have magnitudes less than $10 \\mathrm{meV} / \\AA$.\n\nFig. 2 A shows the total density of states (DOS) of the slab around the Fermi energy, $E_{F}$. In these calculations, $E_{F}$ identifies the energy at which the bands become half filled, similar to $E_{F}$ in a metal at finite temperatures. At energies below $E_{F}$, the electron population dominates, while at energies above $E_{F}$, the hole population dominates. The inset to the DOS in Fig. 2/A shows the region above $E_{F}$ but below the band gap, representing the lowest-energy hole states. Fig. $2 \\mathrm{~B}$ shows the orbital density corresponding to the lowest energy hole states, which are clearly localized to the surface. This density looks like it could be formed from a linear combination of $\\mathrm{sp}^{3}$ hybridized orbitals, centered at the sulfur atoms located on the surface. Indeed, as we will show below, this observation provides the basis for a quantitative tight-binding model for the surface hole states. Constraining the energy window to lie within $k_{B} T=25 \\mathrm{meV}$ above or below $E_{F}$, to focus on the thermally accessible hole states, does not change the picture for the orbitals in Fig. $2 \\mathrm{~B}$ qualitatively.\n\nOther electronic structure calculations of small $\\mathrm{CdS}$ and CdSe clusters have reported\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_182e0132c513bc81a414g-05_244_1854_649_1454}\n\\end{center}\n\nFigure 2: (A) Total density of states (DOS) for the $2 \\times 2 \\times 8$ slab supercell, showing states within the range $E_{F} \\pm 4 \\mathrm{eV}$, where $E_{F}$ is the Fermi energy. The inset focuses on the states above $E_{F}$ that are unoccupied at zero Kelvin and are therefore hole states. (B) The holestate density (red) corresponding to the energy range in the red part of the inset above shows holes are localized to the sulfur atoms on the surface. Only the top $2.5$ layers of the supercell are shown. Focusing on the thermally accessible hole states within the energy range within $k_{B} T=25$ meV above or below $E_{F}$ exhibits a similar density.\n\nthat hole states are localized to the sulfur atoms on the surface, in agreement with this work. 911125 Unlike those calculations, however, our hole states are not well separated from the bulk DOS, but rather form a continuum with the highest fully-occupied (by electrons) states. This result is consistent with the experimental work of Mooney et al., 22 which finds that bulk and surface states can be separated by merely tens of meV.\n\nThe continuous density of states in the vicinity of the highest occupied valence bands, shown as the inset in Fig. 2 A, implies that holes prepared in the bulk rapidly move to the surface, lowering their energy by accessing a tier of intermediate states that are separated by infinitesimally small amounts of energy. This result supports experimental reports on CdS nanocrystals, which find that hole trapping to the surface occurs on the timescale of picoseconds. $16[17 \\mid 19[21 \\mid 26]$\n\nAt first blush, the data in Fig. 2 seem to imply that the hole states are delocalized across sulfur atoms on the surface. But one must keep in mind the limitations of adiabatic electronic structure theory, which gives the solutions to the electronic structure problem in the Born-Oppenheimer approximation at zero absolute temperature. Similar to constructing molecular orbitals from linear combinations of atomic orbitals, if two orbitals are coupled, even weakly, DFT will yield adiabatic states that are delocalized superpositions. ${ }^{32} \\mathrm{~ B u t ~ i f ~}$ the electronic coupling is weak relative to the coupling between the electrons and the environment, this delocalization will not survive decoherence from thermal fluctuations at finite\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_182e0132c513bc81a414g-06_1239_1304_240_1885}\\\\\nthat, while not eigenstates of the electronic Hamiltonian, more closely resemble the eigenstates of the system plus the environment.\n\nThe calculations presented here do not explicitly include solvent, ligand, or electronphonon coupling. While it is computationally infeasible to include them directly into the electronic structure calculations, we can include their effects by constructing a model Hamiltonian. We begin by quantizing the electron density in terms of the sp $^{3}$ orbitals on all sulfur atoms. This leads to a tight-binding Hamiltonian, $\\mathcal{H}_{T B}$, whose diagonal elements are the on the on-site energies, $\\left\\{\\epsilon_{\\alpha}\\right\\}$, and the off-diagonal elements are the tunneling matrix elements, $\\left\\{t_{\\alpha, \\beta}\\right\\}$, where the subscripts denote the $\\mathrm{sp}^{3}$ orbitals of the sulfur atoms. We use Wannier localization to generate the orbitals and compute the matrix elements. Fig. 3 shows that, indeed, diagonalizing $\\mathcal{H}_{T B}$ and forming the two-dimensional band structure for the directions conjugate to the $\\mathrm{x}-\\mathrm{y}$ orthorhombic axes yields a band structure that is indistinguishable from the adiabatic solution to the electronic structure near the valence band maximum, where the surface hole states dominate.\n\nAt zero temperature and in the absence of electron-phonon coupling, the adiabatic solution corresponding to the eigenvalues and eigenstates of $\\mathcal{H}_{T B}$ would be an accurate solution to the electronic problem. But the energies of the relevant tunneling matrix elements for hole transport, described in more detail below and reported in detail in the SI (Tables S1-S2), are on the order of or are smaller than $k_{B} T$ at room temperature, implying that thermal\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_182e0132c513bc81a414g-07_264_907_672_1453}\n\\end{center}\n\nFigure 3: Band structure of the surface slab near the Fermi energy, $E_{F}$. The original bands generated directly from DFT (blue lines) and the band structure from the eigenvalues of $\\mathcal{H}_{T B}$ (orange circles) are overlaid to emphasize the accuracy of the Wannier localization procedure and the choice of sulfur $\\mathrm{sp}^{3}$ orbitals as the basis set for $\\mathcal{H}_{T B}$. Symmetry points match the reciprocal directions of the $\\mathrm{x}-\\mathrm{y}$ plane in the orthorhombic cell. The chosen energies include the energy range specified in the inset to the DOS in Fig. 22A, which is dominated by surface sulfur states.\n\nfluctuations of the nuclei do indeed destroy coherence between orbitals and collapse the band structure in Fig. $33^{33135}$\n\nTo construct a model Hamiltonian that captures these effects at the level of a linear response theory, we project out the surface sulfur atoms from $\\mathcal{H}_{T B}$, giving an effective twodimensional tight-binding Hamiltonian for the holes on the surface, $\\mathcal{H}_{S}$. The system-bath Hamiltonian, $\\mathcal{H}_{S-B}$, which couples the surface electronic degrees of freedom to the phonons, ligands, and solvent, is linear in the electron density, $\\mathcal{H}_{S-B}=-\\int d \\boldsymbol{r} \\rho(\\boldsymbol{r}) \\Phi(\\boldsymbol{r})$, where $\\Phi(\\boldsymbol{r})$ is the electrostatic potential of the nuclei. ${ }^{33335}$ The electron density, quantized in the mutuallyorthogonal Wannier $\\mathrm{sp}^{3}$ orbitals, $\\left\\{\\psi_{n}(\\boldsymbol{r})\\right\\}$, is $\\rho(\\boldsymbol{r})=\\sum_{n} c_{n}^{\\dagger} c_{n}\\left|\\psi_{n}(\\boldsymbol{r})\\right|^{2}$. Assuming that all nuclei undergo harmonic vibrations about their equilibrium positions and expanding $\\Phi(\\boldsymbol{r})$ to linear order in all bath modes leads to the Holstein small-polaron Hamiltonian, where the nuclear motions comprise a heat bath,\n\n\\[\n\\mathcal{H}=\\sum_{\\langle\\langle m, n\\rangle\\rangle} \\epsilon_{m} c_{m}^{\\dagger} c_{m}+t_{m, n} c_{m}^{\\dagger} c_{n}+t_{n, m} c_{n}^{\\dagger} c_{m}+\\sum_{n, \\nu} \\lambda_{\\nu}^{n}\\left(a_{\\nu}^{\\dagger}+a_{\\nu}\\right) c_{n}^{\\dagger} c_{n}+\\sum_{\\nu} \\hbar \\omega_{\\nu} a_{\\nu}^{\\dagger} a_{\\nu} .\n\\]\n\nHere, $c_{m}^{\\dagger}\\left(c_{m}\\right)$ is the fermionic creation (annihilation) operator that puts (removes) a hole in orbital $m, a_{\\nu}^{\\dagger}\\left(a_{\\nu}\\right)$ is the bosonic creation (annihilation) operator for bath mode $\\nu, \\lambda_{\\nu}^{n}$ is the coupling matrix element between mode $\\nu$ and electronic orbital $n$, and $\\hbar \\omega_{\\nu}$ is the energy of bath mode $\\nu$. The sum over $m$ and $n$ goes over non-bonding orbitals of nearest- and next-nearest-neighbors on the surface. Fig. 4A shows one of these orbitals.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_182e0132c513bc81a414g-08_404_1654_644_1438}\n\nFigure 4: The relevant states used to construct the effective tight-binding Hamiltonian for surface holes. (A) Side view of $\\mathrm{an} \\mathrm{sp}^{3}$ orbital centered on a surface sulfur atom of the slab supercell. (B) A top-down view of the surface layer. A hole that exists at the center position (red) can hop to any of the 8 labeled sites (yellow). The rates $k_{\\|}$(single solid lines) and $k^{\\prime}$ (dashed lines) contribute to the diffusion constant for hole hopping down the crystal c-axis.\n\nThe relevant tunneling matrix elements for hole transfer down the crystal c-axis are $t_{\\|}$ and $t^{\\prime}$, corresponding to the tunneling matrix elements between nearest- and next-nearestneighbors along the rod axis, respectively (Fig. $4 \\mathrm{~B}$ ). Our calculations for $t_{\\|}$and $t^{\\prime}$ yield $\\left|t_{\\|}\\right| \\approx\\left|t^{\\prime}\\right| \\approx 3 \\mathrm{meV}$. These small values for the tunneling matrix elements, compared to both room-temperature $k_{B} T$ and to characteristic values for $\\lambda_{\\nu}^{n}$,33135 place this system squarely in the weak electronic coupling limit, where bath fluctuations destroy the band structure and localize holes to orbitals on individual sulfur atoms. In this limit, the hole populations on the surface sites obey the quantum Master equation,\n\n\\[\n\\frac{d P_{m}(t)}{d t}=\\sum_{n} k_{n \\rightarrow m} P_{n}(t)-\\sum_{n} k_{m \\rightarrow n} P_{m}(t),\n\\]\n\nwith rates $k_{n \\rightarrow m}$ given by the Golden Rule, $k_{n \\rightarrow m} \\sim\\left|t_{m, n}\\right|^{2}$. In the high temperature limit, which is the simplest approximation, bath energies are much less than $k_{B} T$, and the detailed spectrum of the heat bath is irrelevant. One then recovers the Marcus expression ${ }^{36}$ for nonadiabatic hole transfer between degenerate states,\n\n\\[\nk_{n \\rightarrow m}=\\frac{\\left|t_{m, n}\\right|^{2}}{\\hbar} \\sqrt{\\frac{\\pi}{\\lambda k_{B} T}} \\exp \\left\\{-\\frac{\\lambda}{4 k_{B} T}\\right\\}\n\\]\n\nwhere $\\lambda=\\sum_{\\nu} \\frac{\\left(\\lambda_{\\nu}^{n}-\\lambda_{\\nu}^{m}\\right)^{2}}{\\hbar \\omega_{\\nu}}$ is the reorganization energy. As implied earlier by our notation, $t_{\\|}$and $t^{\\prime}$ correspond to the rates $k_{\\|}$and $k^{\\prime}$, respectively (Fig. $4 \\mathrm{~B}$ ). Finally, an asymptotic expansion of Eq. 2, presented in the SI (Sec. S.1), gives a Fokker-Planck approximation to the master equation, which is an anisotropic diffusion equation. The diffusion constant for hole hopping along the axis of the nanorod, $D_{\\|}$, is\n\n\\[\nD_{\\|}=c^{2}\\left(k_{\\|}+2 k^{\\prime}\\right),\n\\]\n\nwhere $c=6.8417 \\AA$ is the surface sulfur-to-sulfur distance parallel to the long axis of the nanorod. Note that $k^{\\prime}$, the hopping rate along the diagonal line connecting next-nearestneighbors (Fig. 4B), makes a significant contribution to $D_{\\|}$. The factor of two in Eq. 4 reflects the fact that there are two next-nearest-neighbors for each nearest-neighbor on the rectangular lattice, in the direction of the crystal c-axis.\n\nCalculating $\\lambda$ is not an objective of this manuscript, nor is it computationally feasible in a system of this size. Without a value for $\\lambda$, we cannot compute the diffusion constant $D_{\\|}$, but we can use our computed hopping matrix elements, $\\left|t_{\\|}\\right| \\approx\\left|t^{\\prime}\\right| \\approx 3 \\mathrm{meV}$, in conjunction with experimental data to bound the value of $\\lambda$. Utterback et al. ${ }^{[26}$ measured an upper bound for $D_{\\|}$to be $\\sim 10^{-7} \\mathrm{~cm}^{2} \\mathrm{~s}^{-1}$. From this bound on $D_{\\|}$and our calculated values of $t_{\\|}$and $t^{\\prime}$, we use Eq. 34 find a lower bound for $\\lambda$ of $1 \\mathrm{eV}$. This value of $\\lambda$ is large for electron transfer reactions in solution, but not uncommon for polaron hopping transport in polar semiconductors, where lattice phonons couple strongly to the electronic degrees of freedom. ${ }^{[2237]}$ Similarly, the hightemperature approximation to the system-bath coupling, while appropriate for a wide class of electron transfer reactions in solution, may need to be revised as more information about the specific coupling to lattice phonons and to nuclear distortions of the ligands, whose energies are not necessarily small relative to $k_{B} T,{ }^{221}$ becomes available. The tunneling matrix element for hopping perpendicular to the crystal c-axis, $\\left|t_{\\perp}\\right| \\approx 80 \\mathrm{meV}$ (Fig. $4 \\mathrm{~B}$ ), is about an order of magnitude larger than $t_{\\|}$. Because it is still much smaller than $\\lambda$, so the holes still remain small polarons localized to atomic sites, not delocalized around the waist of the rod.\n\nIn summary, we have presented an atomistic computational model to capture the electronic structure of the bulk and surface states of CdS nanorods. The adiabatic solution to the electronic structure of this surface slab clearly shows hole states, near the Fermi energy, that are localized to the undercoordinated sulfur atoms on the surface. Our results show that the hole states of a CdS surface slab form a near continuum with the bulk states of electrons, a result that differs from previous theoretical work on small quantum dots, 9 [11125\n\nbut is consistent with recent experimental work of Mooney et al. ${ }^{[2]}$ The continuous density of states between holes and electrons would also rationalize a wealth of experimental data that finds holes prepared in the bulk relax quickly to the surface. ${ }^{1611711921126}$ The densities of states for small clusters of $\\mathrm{CdS}$, which sometimes show trapped states that are well-separated from the valence band,,$[1125$ differ from the density of states for the nanocrystal model presented here.\n\nMotivated by the adiabatic electronic structure results, we parameterize a model tightbinding Hamiltonian from the $\\mathrm{sp}^{3}$ orbitals centered on sulfur atoms. The calculated tunneling matrix elements between relevant sulfur orbitals on the surface are small relative to the estimated reorganization energy, so that thermal fluctuations and nuclear motions localize holes into small polarons, trapped in non-bonding sulfur orbitals on the surface. While we cannot rule out hole hopping through a super-exchange mechanism, mediated through virtual bulk or ligand states, it is notable that this mechanism need not be invoked. Because CdS nanocrystals in conventional syntheses are so deep in the weak electronic coupling regime, hole transport in these particles is slow at room temperature. Our results give direct support for the picture presented by Utterback et al., $\\sqrt{26}$ who hypothesized that holes diffuse by hopping on length scales comparable to interatomic spacings.\n\n\\section{Computational Methods}\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_182e0132c513bc81a414g-10_2059_2126_240_1885}\\\\\nwave electronic structure code. We used the projector augmented wave method with the Perdew-Burke-Erzhenhoff generalized gradient approximation for the exchange-correlation functional, $\\underline{42143}$ which for $\\mathrm{CdS}$ strikes a reasonable balance between computational feasibility and accuracy. The cadmium $5 \\mathrm{~s}^{2} 4 \\mathrm{~d}^{10}$ and sulfur $3 \\mathrm{~s}^{2} 3 \\mathrm{p}^{4}$ electrons were treated explicitly in all calculations. To analyze the results of the electronic structure calculation in the framework of nonadiabatic polaron theory, we employed a localization procedure using Wannier90. $\\frac{44}{\\text { Wan- }}$ Wan nier90 encompasses a method for obtaining maximally-localized Wannier functions (MLWFs) from the adiabatic Bloch states, and it computes these MLWFs according to the method of\n\nMarzari and Vanderbilt. ${ }^{[45466}$ We used the XCrySDen ${ }^{[47}$ software to visualize all structures, wavefunction densities, and Wannier functions.\n\n\\section{Acknowledgement}\nThis material is based upon work supported by the National Science Foundation under Grant No. CHE-1455365. This work utilized the RMACC Summit supercomputer, which is supported by the National Science Foundation (awards ACI-1532235 and ACI-1532236), the University of Colorado Boulder, and Colorado State University. The Summit supercomputer is a joint effort of the University of Colorado Boulder and Colorado State University. J.K.U. and S.E.S. acknowledge support from National Science Foundation Graduate Research Fellowships under Grant No. DGE 1144083. G.D. acknowledges support from Air Force Office of Scientific Research under AFOSR award No. FA9550-12-1-0137.\n\n\\section{Supporting Information}\nDerivation of the diffusion constants from the hopping rates; crystal structure parameters; bulk and surface convergence details; surface construction details; Wannier localization procedure details; additional figures.\n\n\\section{References}\n(1) Brus, L. Electronic Wave Functions in Semiconductor Clusters: Experiment and Theory. J. Phys. Chem. 1986, 90, 2555-2560.\n\n(2) Wuister, S. F.; de Mello Donegá, C.; Meijerink, A. Influence of Thiol Capping on the Exciton Luminescence and Decay Kinetics of CdTe and CdSe Quantum Dots. J. Phys. Chem. B 2004, 108, 17393-17397.\n\n(3) Jasieniak, J.; Mulvaney, P. From Cd-Rich to Se-Rich - the Manipulation of CdSe Nanocrystal Surface Stoichiometry. J. Am. Chem. Soc. 2007, 129, 2841-2848.\n\n(4) Gómez-Campos, F. M.; Califano, M. Hole Surface Trapping in CdSe Nanocrystals: Dynamics, Rate Fluctuations, and Implications for Blinking. Nano Lett. 2012, 12, 4508-4517. (5) Peterson, M. D.; Cass, L. C.; Harris, R. D.; Edme, K.; Sung, K.; Weiss, E. A. The Role of Ligands in Determining the Exciton Relaxation Dynamics in Semiconductor Quantum Dots. Annu. Rev. Phys. Chem. 2014, 65, 317-339.\n\n(6) Krause, M. M.; Kambhampati, P. Linking surface chemistry to optical properties of semiconductor nanocrystals. Phys. Chem. Chem. Phys. 2015, 17, 18882-18894.\n\n(7) Busby, E.; Anderson, N. C.; Owen, J. S.; Sfeir, M. Y. Effect of Surface Stoichiometry on Blinking and Hole Trapping Dynamics in CdSe Nanocrystals. J. Phys. Chem. C 2015, 119, 27797-27803.\n\n(8) Gao, Y.; Peng, X. Photogenerated Excitons in Plain Core CdSe Nanocrystals with Unity Radiative Decay in Single Channel: The Effects of Surface and Ligands. J. Am. Chem. Soc. 2015, 137, 4230-4235.\n\n(9) Kilina, S. V.; Tamukong, P. K.; Kilin, D. S. Surface Chemistry of Semiconducting Quantum Dots: Theoretical Perspectives. Acc. Chem. Res. 2016, 49, 2127-2135.\n\n(10) Houtepen, A. J.; Hens, Z.; Owen, J. S.; Infante, I. On the Origin of Surface Traps in Colloidal II-VI Semiconductor Nanocrystals. Chem. Mater. 2017, 29, 752-761.\n\n(11) Wei, H. H.-Y.; Evans, C. M.; Swartz, B. D.; Neukirch, A. J.; Young, J.; Prezhdo, O. V.; Krauss, T. D. Colloidal Semiconductor Quantum Dots with Tunable Surface Composition. Nano Lett. 2012, 12, 4465-4471.\n\n(12) Rosenthal, S.; McBride, J.; Pennycook, S.; Feldman, L. Synthesis, surface studies, composition and structural characterization of CdSe, core/shell and biologically active nanocrystals. Surf. Sci. Rep. 2007, 62, 111-157.\n\n(13) Knowles, K. E.; Tice, D. B.; McArthur, E. A.; Solomon, G. C.; Weiss, E. A. Chemical Control of the Photoluminescence of CdSe Quantum Dot-Organic Complexes with a Series of Para-Substituted Aniline Ligands. J. Am. Chem. Soc. 2010, 132, 1041-1050.\n\n(14) Sadhu, S.; Patra, A. Relaxation Dynamics of Anisotropic Shaped CdS Nanoparticles. J. Phys. Chem. C 2011, 115, 16867-16872.\n\n(15) Utterback, J. K.; Wilker, M. B.; Brown, K. A.; King, P. W.; Eaves, J. D.; Dukovic, G. Competition between electron transfer, trapping, and recombination in CdS nanorodhydrogenase complexes. Phys. Chem. Chem. Phys. 2015, 17, 5538-5542. (16) Klimov, V. I.; Schwarz, C. J.; McBranch, D. W.; Leatherdale, C. A.; Bawendi, M. G. Ultrafast dynamics of inter- and intraband transitions in semiconductor nanocrystals: Implications for quantum-dot lasers. Phys. Rev. B 1999, 60, R2177-R2180.\n\n(17) Wu, K.; Du, Y.; Tang, H.; Chen, Z.; Lian, T. Efficient Extraction of Trapped Holes from Colloidal CdS Nanorods. J. Am. Chem. Soc. 2015, 137, 10224-10230.\n\n(18) Keene, J. D.; McBride, J. R.; Orfield, N. J.; Rosenthal, S. J. Elimination of HoleSurface Overlap in Graded $\\mathrm{CdS}_{x} \\mathrm{Se}_{1-x}$ Nanocrystals Revealed by Ultrafast Fluorescence Upconversion Spectroscopy. ACS Nano 2014, 8, 10665-10673.\n\n(19) Klimov, V.; Bolivar, P. H.; Kurz, H. Ultrafast carrier dynamics in semiconductor quantum dots. Phys. Rev. B 1996, 53, 1463-1467.\n\n(20) Knowles, K. E.; McArthur, E. A.; Weiss, E. A. A Multi-Timescale Map of Radiative and Nonradiative Decay Pathways for Excitons in CdSe Quantum Dots. ACS Nano 2011, 5, 2026-2035.\n\n(21) Wu, K.; Zhu, H.; Liu, Z.; Rodríguez-Córdoba, W.; Lian, T. Ultrafast Charge Separation and Long-Lived Charge Separated State in Photocatalytic CdS-Pt Nanorod Heterostructures. J. Am. Chem. Soc. 2012, 134, 10337-10340.\n\n(22) Mooney, J.; Krause, M. M.; Saari, J. I.; Kambhampati, P. Challenge to the deep-trap model of the surface in semiconductor nanocrystals. Phys. Rev. B 2013, 87, 081201.\n\n(23) Guyot-Sionnest, P.; Wehrenberg, B.; Yu, D. Intraband relaxation in CdSe nanocrystals and the strong influence of the surface ligands. J. Chem. Phys. 2005, 123, 074709.\n\n(24) Bullen, C.; Mulvaney, P. The Effects of Chemisorption on the Luminescence of CdSe Quantum Dots. Langmuir 2006, 22, 3007-3013.\n\n(25) Kilina, S. V.; Neukirch, A. J.; Habenicht, B. F.; Kilin, D. S.; Prezhdo, O. V. Quantum Zeno Effect Rationalizes the Phonon Bottleneck in Semiconductor Quantum Dots. Phys. Rev. Lett. 2013, 110, 180404.\n\n(26) Utterback, J. K.; Grennell, A. N.; Wilker, M. B.; Pearce, O. M.; Eaves, J. D.; Dukovic, G. Observation of trapped-hole diffusion on the surfaces of CdS nanorods. Nat. Chem 2016, 8, 1061-1066.\n\n(27) Rantala, T. T.; Rantala, T. S.; Lantto, V.; Vaara, J. Surface relaxation of the (1010) face of wurtzite CdS. Surf. Sci. 1996, 352, 77-82. (28) Widmer-Cooper, A.; Geissler, P. Orientational Ordering of Passivating Ligands on CdS Nanorods in Solution Generates Strong Rod-Rod Interactions. Nano Lett. 2014, 14, $57-65$.\n\n(29) Sun, W.; Ceder, G. Efficient creation and convergence of surface slabs. Surf. Sci. 2013, $617,53-59$.\n\n(30) Deng, H.-X.; Li, S.-S.; Li, J.; Wei, S.-H. Effect of hydrogen passivation on the electronic structure of ionic semiconductor nanostructures. Phys. Rev. B 2012, 85, 195328.\n\n(31) Zhang, Y.; Zhang, J.; Tse, K.; Wong, L.; Chan, C.; Deng, B.; Zhu, J. PseudoHydrogen Passivation: A Novel Way to Calculate Absolute Surface Energy of Zinc\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_182e0132c513bc81a414g-14_903_957_337_1262}\n\\end{center}\n\n(32) Sakurai, J. J.; Napolitano, J. Modern Quantum Mechanics, 2nd ed.; Pearson: San Francisco, CA, USA, 2011.\n\n(33) Mahan, G. D. Many-Particle Physics, 3rd ed.; Kluwer Academic: New York, NY, USA, 2000.\n\n(34) Weiss, U. Quantum Dissipative Systems, 3rd ed.; World Scientific: Singapore, 2008.\n\n(35) Alexandrov, A. S.; Mott, S. N. Polarons \\& Bipolarons; World Scientific: Singapore, 1995.\n\n(36) Tachiya, M. Generalization of the Marcus equation for the Electron-Transfer Rate. $J$. Phys. Chem. 1993, 97, 5911-5916.\n\n(37) Deskins, N. A.; Dupuis, M. Electron transport via polaron hopping in bulk $\\mathrm{TiO}_{2}$ : A density functional theory characterization. Phys. Rev. B 2007, 75, 195212.\n\n(38) Kresse, G.; Hafner, J. Ab initio molecular dynamics for liquid metals. Phys. Rev. B 1993, 47, 558-561.\n\n(39) Kresse, G.; Hafner, J. Ab initio molecular-dynamics simulation of the liquid-metalamorphous-semiconductor transition in germanium. Phys. Rev. B 1994, 49, 1425114269.\n\n(40) Kresse, G.; Furthmüller, J. Efficiency of ab-initio total energy calculations for metals and semiconductors using a plane-wave basis set. Comput. Mater. Sci. 1996, 6, 15-50.\n\n(41) Kresse, G.; Furthmüller, J. Efficient iterative schemes for ab initio total-energy calculations using a plane-wave basis set. Phys. Rev. B 1996, 54, 11169-11186. (42) Blöchl, P. E. Projector augmented-wave method. Phys. Rev. B 1994, 50, 17953-17979.\n\n(43) Kresse, G.; Joubert, D. From ultrasoft pseudopotentials to the projector augmentedwave method. Phys. Rev. B 1999, 59, 1758-1775.\n\n(44) Mostofi, A. A.; Yates, J. R.; Lee, Y.-S.; Souza, I.; Vanderbilt, D.; Marzari, N. Wannier90: A tool for obtaining maximally-localised Wannier functions. Comput. Phys. Commun. 2008, 178, 685-699.\n\n(45) Marzari, N.; Vanderbilt, D. Maximally localized generalized Wannier functions for composite energy bands. Phys. Rev. B 1997, 56, 12847-12865.\n\n(46) Souza, I.; Marzari, N.; Vanderbilt, D. Maximally localized Wannier functions for entangled energy bands. Phys. Rev. B 2001, 65, 035109.\n\n(47) Kokalj, A. Computer graphics and graphical user interfaces as tools in simulations of matter at the atomic scale. Comp. Mater. Sci. 2003, 28, 155.\n\n\n\\end{document}", "record_id": "2023_09_22_182e0132c513bc81a414g"}