{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{APS physics }\n\n\n\\author{G. E. Sterbinsky, ${ }^{1, *}$ R. Nanguneri, ${ }^{2}$ J. X. Ma, ${ }^{3}$ J. Shi, ${ }^{3}$ E.\\\\\nKarapetrova, ${ }^{1}$ J. C. Woicik, ${ }^{4}$ H. Park, ${ }^{2,5}{ }^{5}$ J.-W. Kim, ${ }^{1}$ and P. J. Ryan ${ }^{1,6}$\\\\\n${ }^{1}$ Advanced Photon Source, Argonne National Laboratory, Argonne, IL 60439, USA\\\\\n${ }^{2}$ Department of Physics, University of Illinois at Chicago, Chicago, IL 60607, USA\\\\\n${ }^{3}$ Department of Physics and Astronomy, University of California, Riverside, California 92521, USA\\\\\n${ }^{4}$ National Institute of Standards and Technology, Gaithersburg, MD 20899, USA\\\\\n${ }^{5}$ Materials Science Division, Argonne National Laboratory, Argonne, IL 60439, USA\\\\\n${ }^{6}$ School of Physical Sciences, Dublin City University, Dublin 9, Ireland}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nThis is the accepted manuscript made available via CHORUS. The article has been published as:\n\n\\section{Ferromagnetism and Charge Order from a Frozen Electron Configuration in Strained Epitaxial LaCoO_\\{3\\}}\n Kim, and P. J. RyanPhys. Rev. Lett. 120, 197201 - Published 8 May 2018\n\nDOI: 10.1103/PhysRevLett.120.197201\n\n\\section*{Ferromagnetism and Charge Order from a Frozen Electron Configuration in Strained Epitaxial $\\mathrm{LaCoO}_{3}$ }\n(Dated: March 14, 2018)\n\n\\begin{abstract}\nWe report order of the cobalt electron configuration in ferromagnetic strained epitaxial $\\mathrm{LaCoO}_{3}$. Specifically, the presence of charge order is demonstrated from distinct features of the resonant cobalt contribution to superstructure reflections. Density functional theory calculations show the observed order is consistent with the spin-state periodicity predicted to give rise to ferromagnetism in $\\mathrm{LaCoO}_{3}$. Through modification of symmetry by strain, concurrent frozen charge and spin-state order are stabilized, giving rise to long range magnetic order.\n\\end{abstract}\n\nCorrelated electron physics is heavily dependent upon interplay between physical parameters such as spin, charge, and lattice. Due to coupling between these parameters, subtle changes in one can lead to significant and unexpected changes in another $[1,2]$. For instance, lattice distortions can dramatically alter the properties of materials with correlated electrons, such as $\\mathrm{La}_{1-x} \\mathrm{Sr}_{x} \\mathrm{MnO}_{3}$, which can be driven from metal to insulator and ferromagnet to antiferromagnet via epitaxial strain [3]. Subtle lattice distortions can also give rise to ferromagnetism in a paramagnet, as found in $\\mathrm{LaCoO}_{3}$, which becomes ferromagnetic under tensile strain $[4,5]$. While recent studies have demonstrated that a straininduced increase in the average Co-O bond length, i.e. an increase in the oxygen octahedral volume, is critical to the appearance of ferromagnetism [6, 7], the exact nature of the microscopic mechanism by which lattice couples to spin is unclear, and several models of the atomic characteristics and magnetic exchange that give rise to ferromagnetism in $\\mathrm{LaCoO}_{3}$ have been proposed [8-14].\n\nBulk $\\mathrm{LaCoO}_{3}$ is rhombohedral with pseudocubiclattice parameters of $3.830 \\AA$ and $90.7^{\\circ}$ (Fig. 1(a)) [1517 ; ; it is a nonmagnetic insulator below $110 \\mathrm{~K}$, a paramagnetic semiconductor between 110 and $500 \\mathrm{~K}$, and a paramagnetic metal above $500 \\mathrm{~K}$. In the nonmagnetic phase, all $\\mathrm{Co}^{3+}$ ions are in the low spin (LS) $t_{2 g}^{6} e_{g}^{0}$ state, and higher-temperature phase transitions result from changes in the $\\mathrm{Co}^{3+}$ spin state to intermediate spin (IS) $t_{2 g}^{5} e_{g}^{1}$ and/or high spin (HS) $t_{2 g}^{4} e_{g}^{2}$ configurations (Fig. 1(b)) [18]. Though the details of the spin states present in the paramagnetic phases of $\\mathrm{LaCoO}_{3}$ are debated, one possible model supported by experiment $[18,19]$ and theory [20-23] implicates a mixture of LS and HS $\\mathrm{Co}^{3+}$ as responsible for the paramagnetic semiconducting phase up to $350 \\mathrm{~K}$. In this model, thermally-driven cooperative oxygen displacements cause formation of two Co sites ordered in a rocksalt-type ar-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_14ddd903c0b77b5e50c2g-2_972_1517_1100_1957}\n\\end{center}\n\nFIG. 1. (a) Schematic rhombohedral bulk $\\mathrm{LaCoO}_{3}$ unit cell showing $a_{0}$ and $\\alpha_{0}$. (b) Schematic energy-level diagrams of $\\mathrm{Co}^{3+} \\mathrm{LS}$, IS, and HS configurations. (c) Calculated DOS of strained $\\mathrm{LaCoO}_{3}$ with ordered $\\mathrm{HS}$ and $\\mathrm{LS}$ cobalt. (Inset) Schematic of the Co-O-Co bond showing charge transfer from oxygen to HS and LS cobalt.\n\nrangement. In one site, Hund exchange stabilizes cobalt in the HS state, and in the other, cobalt remains in the LS configuration. The order is both short range and dynamic thus giving rise to paramagnetism [19].\n\nWhile recent studies have explored the origin of ferromagnetism in $\\mathrm{LaCoO}_{3}$ thin films, multiple competing models have been proposed, including ferromagnetism resulting from defects $[8,9]$, orbital order [10], or spinstate order [11-14]. This latter model is supported by both experiment and computational calculations, yet the specific spin-state order present has not been resolved. Experiments have shown the presence of vertical lattice modulations that appear correlated with spin-state order $[13,14]$. However, lattice stripes are not universally observed in ferromagnetic $\\mathrm{LaCoO}_{3}$ films [7, 24, 25]; therefore they cannot generally account for ferromagnetism therein. On the other hand, density functional theory calculations indicate that the ground state of strained $\\mathrm{LaCoO}_{3}$ is ferromagnetic with the same rocksalt-type arrangement of HS and $\\mathrm{LS} \\mathrm{Co}^{3+}$ ions as hypothesized to exist in bulk $\\mathrm{LaCoO}_{3}[11,12]$.\n\nHere, we reveal details of $\\mathrm{LaCoO}_{3}$ 's atomic and electronic structure that bring key features of the microscopic mechanism responsible for stabilization of ferromagnetism to light. Specifically, the presence of charge order in a $\\mathrm{LaCoO}_{3}$ film grown on $\\mathrm{SrTiO}_{3}$, which imposes $2.0 \\%$ tensile strain and gives rise to ferromagnetism below $80 \\mathrm{~K}$ [26, 27], is demonstrated from distinct features of Co $K$-edge resonant x-ray scattering at particular superstructure reflections. Density functional theory plus $U(\\mathrm{DFT}+U)$ calculations show this order is characteristic of the spin-state periodicity predicted to bring about ferromagnetism in $\\mathrm{LaCoO}_{3}$. Charge and spin-state order arise through stabilization of an oxygen octahedral breathing distortion, which in turn precipitate the emergence of ferromagnetic order. These results indicate the tendency for ordering of the local structure under stress, or other distortive forces, is a significant factor in driving spin-state and thereby magnetic-phase transitions and potentially effects such phenomena in other correlated electron systems.\n\nIn order to probe the details of the electronic structure of $\\mathrm{LaCoO}_{3}$ in which cobalt electron-configuration order is present, we have applied DFT $+U$ for both 20 -atom and 40-atom supercells of tetragonal symmetry using the projector augmented wave method as implemented in the Vienna Ab-Initio Simulation Package [28-30]. Our choice of the Hubbard interaction parameters are $U=4.5 \\mathrm{eV}$ and $J=1.0 \\mathrm{eV}[31]$. For each unit cell, we fixed the lattice length along the $a$ and $b$-axes to the experimentally determined value of $3.905 \\AA$, which is equal to the lattice constant of $\\mathrm{SrTiO}_{3}$. The cell dimension along the $c$-axis and internal atomic positions of all atoms were relaxed. Spinstate order of 1:1 HS and LS was imposed on the cobalt atoms. The HS site has a magnetic moment of $\\sim 3 \\mu_{B}$, which corresponds to three unpaired $d$-electrons while the LS site has a negligible moment. After structural relaxation, the HS sites have a larger octahedral volume of $0.0107 \\mathrm{~nm}^{3}$ compared to $0.0098 \\mathrm{~nm}^{3}$ for the LS sites, thus establishing an octahedral breathing distortion. To confirm the stability of ferromagnetism in this arrangement, ferromagnetic order of the HS cobalt ions was imposed on the twenty-atom unit cell and antiferromagnetic order, with wavevector $(\\pi, \\pi, \\pi)$, on the forty-atom unit cell. The ferromagnetic configuration is $14.25 \\mathrm{meV} / \\mathrm{Co}$ lower in energy than the antiferromagnetic configuration. The calculated density of states (DOS) of the ferromagnetic $\\mathrm{LaCoO}_{3}$ film is shown in Fig. 1(c).\n\nIn concert with the spin-state ordering, charge disproportionation occurs between the cobalt HS and LS sites. The cobalt $d$-orbital charge difference, calculated by Bader's Method [32], is $0.17$ electrons. This origi- nates from the covalent nature of the Co-O bonds such that the $d^{6}$ configuration is closer to $d^{7}$ with more charge transferred from oxygen to LS cobalt due to the reduced octahedral volume as illustrated in Fig. 1(c)-inset. Thus, charge and spin-state order are interdependent.\n\nThe structure of epitaxial $\\mathrm{LaCoO}_{3}$ is revealed by xray scattering, carried out at beamlines 6-ID-B and 33BM-C of the Advanced Photon Source at room temperature. Incident x-ray energy was selected by a $\\mathrm{Si}$ (111) double-crystal monochromator, and the scattered intensity was collected with a solid-state point detector. Approximately $20 \\mathrm{~nm}$ thick $\\mathrm{LaCoO}_{3}$ films were deposited on $\\mathrm{SrTiO}_{3}$ (001) and $\\mathrm{LaAlO}_{3}$ (001) single-crystal substrates by pulsed-laser deposition in 1 mTorr of oxygen at $1023 \\mathrm{~K}$, capped with two unit cells of $\\mathrm{SrTiO}_{3}$, and annealed in 760 Torr of oxygen for two hours at $853 \\mathrm{~K}$. Previous studies have revealed the $\\mathrm{LaCoO}_{3}$ film on $\\mathrm{SrTiO}_{3}$ (LCO:STO) is ferromagnetic below $\\sim 80 \\mathrm{~K}$, while the $\\mathrm{LaCoO}_{3}$ film on $\\mathrm{LaAlO}_{3}$ (LCO:LAO) shows paramagnetic or spin-glass like behavior at low temperature. Both films are insulating [26, 27]. In LCO:STO, a large distortion of the oxygen octahedra occurs, with an increase in the average Co-O bond length relative to bulk $\\mathrm{LaCoO}_{3}$ and an average difference of $0.043 \\AA$ between in-plane and out-of-plane Co-O bond lengths; whereas a negligible difference between in-plane and out-of-plane Co-O bond lengths is found in LCO:LAO [6].\n\nThe reciprocal space map (RSM) of the $L=2.0455$ reciprocal-lattice unit (RLU) plane (Fig. 2(a)) indicates that LCO:STO is epitaxially coherent, i.e. lattice matched, with the substrate [33]. Further distortion of the film is revealed by $L$-scans taken through multiple $(0 k 3)$ and $(h \\overline{2} 3)$ reflections, (Figs. 2(b, c)). With constant $h$, the position of the film peak shifts to larger $L$ as $k$ increases. Conversely, the film peak position does not change for constant $k$. A schematic of the reciprocalspace lattices of the film and substrate discerned from the diffraction measurements is shown in Fig. 2(d). Transformation to real space reveals that the net effect is a shear distortion as illustrated in Fig. 2(e). From further refinement, the pseudocubic-lattice parameters are found to be $a=3.905 \\pm 0.003 \\AA, b=3.903 \\pm 0.004 \\AA, c=$ $3.781 \\pm 0.018 \\AA, \\alpha=90.46^{\\circ} \\pm 0.42^{\\circ}, \\beta=89.95^{\\circ} \\pm 0.81^{\\circ}$, and $\\gamma=89.95^{\\circ} \\pm 0.95^{\\circ}$ [16]. Having pseudocubic-lattice parameters where $a=b \\neq c$ and at least one angle not equal to $90^{\\circ}$ indicates a reduction in the symmetry from rhombohedral in bulk to monoclinic [34,35]. In this symmetry, the coexistence of two unique cobalt sites is possible. Additionally, a $\\left(\\frac{1}{2} \\frac{1}{2} \\frac{1}{2}\\right)$ film reflection is present (not shown). The $\\left(\\frac{1}{2} \\frac{1}{2} \\frac{1}{2}\\right)$ reflection is bulk structure-factor forbidden, and here it likely results from alternation of the oxygen octahedral volume between the two Co sites.\n\nIn addition to the reduction in symmetry, a lattice modulation develops in the pseudocubic [100] direction. This is evident from the satellite peaks with unvarying in-plane momentum transfer flanking the (002) and (003)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_14ddd903c0b77b5e50c2g-4_171_1521_191_1023}\n\\end{center}\n\nFIG. 2. (a) $L$-scan through the (2) 22$)$ reflection of LCO:STO. Inset: RSMs measured in the $L=2.0455 \\mathrm{RLU}$ plane [33]. The film peak is located at $H=2 \\mathrm{RLU}$ and $K=-2 \\mathrm{RLU}$ indicating the film is lattice matched to the substrate. $L$-scans through reflections with constant (b) $h=0$ and (c) $k=-2$. (d) Schematic reciprocal lattices of the film and substrate. (e) Schematic film reciprocal-space and real-space unit cells (dimensions are exaggerated for clarity). RSMs in $L=l$ planes intersecting the (f) (002), (g) (003), and (h) $\\left(\\frac{1}{2} \\frac{\\overline{3}}{2} \\frac{5}{2}\\right)$ film reflections. (i) $H$-scan through the film (002) reflection.\n\nfilm reflections (Figs. 2(f-g, i)). From the distance between satellites, the period of the modulation is determined to be $\\sim 28 \\mathrm{~nm}$. Scattering at the $(00 l)$ reflections is only sensitive to changes in the vertical separation between atoms, i.e. in the direction of the substrate $c$-axis $\\left(\\hat{\\mathbf{c}}_{\\mathbf{0}}\\right)$. Thus transverse atomic displacements give rise to the lattice modulation. This is consistent with other reports of lattice modulations in oxide thin films [36, 37]. Additionally, the half-order superstructure $\\left(\\frac{1}{2} \\frac{\\overline{3}}{2} \\frac{5}{2}\\right)$ film reflection exhibits satellites with in-plane momentum transfer identical to that of the (00l) film\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_14ddd903c0b77b5e50c2g-4_171_977_1084_1992}\n\nFIG. 3. Co $K$-edge resonant intensity of the $\\left(\\frac{1}{2} \\frac{1}{2} \\frac{7}{2}\\right)$ and $\\left(\\frac{1}{2} \\frac{1}{2} \\frac{7}{2}\\right)$ film reflections (a) from LCO:STO and (b) LCO:LAO. Total fluorescence yield from LCO:STO is also shown. [Inset to (a)] Schematic crystal structure of LCO:STO showing Co sites with different charge. Magnitudes of the octahedral rotations were chosen arbitrarily. (c) Calculated total energy as a function of $\\Delta r_{C o-O}$.\n\nreflections (Fig. 2(h)). In perovskites, half-order reflections typically result from doubling of the cubic unit cell that occurs when oxygen octahedral rotations are present $[7,38]$. Thus the observed satellites demonstrate that the oxygen ions are modulated in concert with the metal ions in the film. The modulations form along the pseudocubic $a$-axis, which is perpendicular to the $b$ and $c$-axes. On the other hand, the pseudocubic angle between the $b$ and $c$-axes deviates from $90^{\\circ}$, as in the bulk rhombohedral structure, indicating the lattice compensates for changes in the pseudocubic angle by forming uniaxial lattice modulations. Subsequently, the film is stabilized with a single structural domain type where the tilt of the pseudocubic $c$-axis is always in the same direction.\n\nThe presence of a single structural domain type preserves the uniqueness of the crystallographic directions within the film. Thus, specific half-order reflections will be sensitive to unique sets of crystallographic planes within the monoclinic structure, and charge order can be observed by employing resonant $\\mathrm{x}$-ray scattering. The scattered intensity of a given reflection is proportional to the square of its crystallographic structure factor. For a monoclinic pseudocubic perovskite, the structure factors at the transition-metal $K$-edge for the $\\left(\\frac{h}{2} \\frac{k}{2} \\frac{l}{2}\\right)$ and $\\left(\\frac{h}{2} \\frac{k}{2} \\frac{l}{2}\\right)$ reflections are given by $F_{\\frac{h}{2} \\frac{k}{2} \\frac{l}{2}}(\\mathbf{q}, E)=$ $A(\\mathbf{q})+\\sum_{j=1}^{4}(-1)^{j} f_{j}^{r}(E)$ and $F_{\\frac{h}{2} \\frac{k}{2} \\frac{l}{2}}(\\mathbf{q}, E)=B(\\mathbf{q})+$ $\\sum_{j=1}^{4}(-1)^{j+1} f_{j}^{r}(E)$, where $\\mathbf{q}$ and $E$ are the x-ray momentum vector and energy respectively, $A$ and $B$ are the contributions from atoms that do not resonate at the absorption edge under study, $f_{j}^{r}$ is the resonant scattering factor of the $j$ th transition-metal site in the monoclinic unit cell, and all sites represented by even (odd) $j$ have nearest neighbor transition-metal sites represented by odd (even) $j[39,40]$. These equations show that when the charges of each cobalt site in LCO:STO are different from those of their nearest neighbors, $f_{j}^{r}$ for even $j$ will be different from $f_{j}^{r}$ for odd $j$, and the cobalt ion contributions to these two reflections will be equal and opposite. This effect is observed in the resonant spectra shown in Fig. 3(a), where the peaks and valleys of the Co $K$-edge resonant intensity of the $\\left(\\frac{1}{2} \\frac{1}{2} \\frac{7}{2}\\right)$ become inverted with respect to those of the $\\left(\\frac{1}{2} \\frac{1}{2} \\frac{7}{2}\\right)$, indicating the presence of cobalt ions with two different charges ordered in a rocksalt-type arrangement, as illustrated in Fig. 3(a)inset [41]. In contrast, variation in the resonant intensity is not observed at the $\\left(\\frac{1}{2} \\frac{1}{2} \\frac{7}{2}\\right)$ and $\\left(\\frac{1}{2} \\frac{1}{2} \\frac{7}{2}\\right)$ reflections from LCO:LAO (Fig. 3(b)) [41]. Thus cobalt does not contribute to the structure factor at these reflections in this film.\n\nThe pattern of cobalt charge order identified in LCO:STO by x-ray scattering is precisely that of the spin-state order predicted to occur in $\\mathrm{LaCoO}_{3}$ films under tensile strain by computational calculations, which indicate the occupation of the Co $3 d$ derived $e_{g}$ and $t_{2 g}$ orbitals alternates such that HS and LS $\\mathrm{Co}^{3+}$ ions form a rocksalt-type arrangement [11, 12, 42]. Additionally, our calculations link charge and spin-state order in $\\mathrm{LaCoO}_{3}$, showing a difference of $0.173 d$ electrons between LS and HS cobalt ions. Thus, the experimentally observed charge order originates in concert with spin-state order. Furthermore, DFT $+U$ calculations confirm that this arrangement of cobalt spin states leads to ferromagnetism. Indeed, LCO:STO shows a ferromagnetic transition, and charge order is present therein; whereas both charge order and ferromagnetism are absent in LCO:LAO, consistent with the proposed relationship between charge order, spin-state order, and ferromagnetism.\n\nIn the paramagnetic phase of unstrained $\\mathrm{LaCoO}_{3}$, spin-state order results from cooperative oxygen displacements that modulate the volume of the cobalt-containing octahedra [19]. Thus the spin-state order is dynamic. In contrast, charge order and therefore spin-state order are static in strained $\\mathrm{LaCoO}_{3}$. In the case of a fluctuating electron configuration, charge would be, on average, equal at all Co sites on the timescale of the measurement, and the observed differences in resonant diffraction at different half-order reflections would be absent. In addition, both observation of the $\\left(\\frac{1}{2} \\frac{1}{2} \\frac{1}{2}\\right)$ film reflection and our $\\mathrm{DFT}+U$ calculations indicate variation in the octahedral volume between Co sites in strained $\\mathrm{LaCoO}_{3}$. In Fig. 3(c), calculated total energy is shown as a func- tion of the difference in in-plane Co-O bond length between different Co sites $\\left(\\Delta r_{C o-O}\\right)$ for both strained and bulk $\\mathrm{LaCoO}_{3}$ [43]. In both cases, a finite difference minimizes the energy. However, the minimum in the total energy curve of bulk $\\mathrm{LaCoO}_{3}$ is shallower and occurs at smaller $\\Delta r_{C o-O}$ than that of strained $\\mathrm{LaCoO}_{3}$, consistent with the dynamic nature of the spin-state order in bulk $\\mathrm{LaCoO}_{3}$. Under tensile strain, which induces a difference between in-plane and out-of-plane Co-O bond lengths and increases octahedral volume, the minimum deepens. Thus in addition to the anticipated induction of octahedral distortions, strain stabilizes the cooperative oxygen displacements found in bulk $\\mathrm{LaCoO}_{3}$ creating a static octahedral breathing distortion. The cobalt spin state couples to the octahedral volume, and in essence, tensile strain freezes-in the spin-state order found in the bulk paramagnetic phase.\n\nIn the ordered HS-LS $\\mathrm{Co}^{3+}$ rocksalt-type arrangement, superexchange both dependent upon and independent of electron configuration fluctuation have been proposed as possible microscopic mechanisms leading to ferromagnetism [11, 12, 44]. The results presented herein demonstrate the latter model underlies emergent ferromagnetic order. In the case of a static electron configuration, exchange reliant upon electron configuration fluctuation cannot take place. For the static spin-state arrangement, ferromagnetism results from $90^{\\circ}$ superexchange interactions between next nearest neighbor HS cobalt ions mediated by the LS cobalt ions that separate them [11].\n\nA ferromagnetic transition occurs at $\\sim 80 \\mathrm{~K}$ in $\\mathrm{LaCoO}_{3}$ in spite of a temperature-independent electronic structure [6] and a significantly reduced thermal expansion coefficient imposed by $\\mathrm{SrTiO}_{3}$ [45]. Furthermore, the spin-state concentration is constant in epitaxial $\\mathrm{LaCoO}_{3}$ between $50 \\mathrm{~K}$ and $450 \\mathrm{~K}$ [46]. The results presented herein lend clarity to this apparent contradiction. Strain locks-in the electron-configuration order needed for a ferromagnetic state to persist as the ground state of the system, allowing a transition from short to long range magnetic order as thermal energy is reduced. This is markedly different from the spin-state transitions found in bulk $\\mathrm{LaCoO}_{3}$.\n\nIn summary, we present evidence that strain induced structural distortions solidify the LS-HS ordered electron configuration precipitating the emergence of ferromagnetic order. In combination with a change in symmetry, expansion of the in-plane lattice alters the energy landscape such that an ordered arrangement of two unique Co local environments is favored. The dimensions of the oxygen octahedra couple directly with the local spin state, and charge order emerges concurrently. Through the coupling of lattice to charge and spin, epitaxial strain alters the delicate balance between these parameters, stabilizing a new magnetic ground state with long range order. Thus, the tendency for an ordered arrangement of two unique local environments about the ions on which correlated electrons reside is critical in bringing about a change in the magnetic phase. This phenomenon may play a role in spin-state and magnetic-phase transitions, regardless of stimulus, in many other correlated systems.\n\nWe acknowledge S. Zohar for helpful discussions. Use of the Advanced Photon Source, an Office of Science User Facility operated for the U.S. DOE Office of Science by Argonne National Laboratory (ANL), was supported by the U.S. DOE under Contract No. DE-AC0206CH11357. H. Park and R. Nanguneri acknowledge support of start-up funding from UIC and ANL (by the US DOE Office of Science program). We gratefully acknowledge the computing resources provided on Blues, a highperformance computing cluster operated by the Laboratory Computing Resource Center at ANL. Additional support from the National Institute of Standards and Technology (NIST) is also acknowledged. J. X. Ma and J. Shi are supported by DOE BES Award No. DEFG0207ER46351.\n\n\\begin{itemize}\n  \\item \\href{mailto:sterbinsky@anl.gov}{sterbinsky@anl.gov}\n\\end{itemize}\n\n[1] J. M. Rondinelli and N. A. Spaldin, Adv. Mater. 23, 3363 (2011).\n\n[2] J. B. Goodenough, Rep. Prog. Phys. 67, 1915 (2004).\n\n[3] Y. Konishi, Z. Fang, M. Izumi, T. Manako, M. Kasai, H. Kuwahara, M. Kawasaki, K. Terakura, and Y. Tokura, J. Phys. Soc. Jpn. 68, 3790 (1999).\n\n[4] D. Fuchs, C. Pinta, T. Schwarz, P. Schweiss, P. Nagel, S. Schuppler, R. Schneider, M. Merz, G. Roth, and H. v. Lhneysen, Phys. Rev. B 75, 144402 (2007).\n\n[5] H. W. Yang, H. R. Zhang, Y. Li, S. F. Wang, X. Shen, Q. Q. Lan, S. Meng, R. C. Yu, B. G. Shen, and J. R. Sun, Sci. Rep. 4, 6206 (2015).\n\n[6] G. E. Sterbinsky, P. J. Ryan, J.-W. Kim, E. Karapetrova, J. X. Ma, J. Shi, and J. C. Woicik, Phys. Rev. B 85, $020403(\\mathrm{R})(2012)$.\n\n[7] L. Qiao, J. H. Jang, D. J. Singh, Z. Gai, H. Xiao, A. Mehta, R. K. Vasudevan, A. Tselev, Z. Feng, H. Zhou, S. Li, W. Prellier, X. Zu, Z. Liu, A. Borisevich, A. P. Baddorf, and M. D. Biegalski, Nano Lett. 15, 4677 (2015).\n\n[8] V. Mehta and Y. Suzuki, J. Appl. Phys. 109, 07D717 (2011).\n\n[9] V. V. Mehta, N. Biskup, C. Jenkins, E. Arenholz, M. Varela, and Y. Suzuki, Phys. Rev. B 91, 144418 (2015).\n\n[10] J. Fujioka, Y. Yamasaki, H. Nakao, R. Kumai, Y. Murakami, M. Nakamura, M. Kawasaki, and Y. Tokura, Phys. Rev. Lett. 111, 027206 (2013).\n\n[11] H. Seo, A. Posadas, and A. A. Demkov, Phys. Rev. B $\\mathbf{8 6}, 014430(2012)$.\n\n[12] H. Hsu, P. Blaha, and R. M. Wentzcovitch, Phys. Rev. B 85, $140404(2012)$.\n\n[13] W. S. Choi, J.-H. Kwon, H. Jeen, J. E. Hamann-Borrero, A. Radi, S. Macke, R. Sutarto, F. He, G. A. Sawatzky, V. Hinkov, M. Kim, and H. N. Lee, Nano Lett. 12, 4966 (2012).\n\n[14] J.-H. Kwon, W. S. Choi, Y.-K. Kwon, R. Jung, J.-M. Zuo, H. N. Lee, and M. Kim, Chem. Mater. 26, 2496 $(2014)$\n\n[15] P. G. Radaelli and S.-W. Cheong, Phys. Rev. B 66, 094408 (2002).\n\n[16] Here $a, b$, and $c$ are the pseudocubic lattice parameters in the $[100],[010]$, and [001] directions. $\\alpha$ is the angle between the $[010]$ and the $[001] . \\beta$ is the angle between the [100] and the [001]. $\\gamma$ is the angle between the [100] and the [010].\n\n[17] For rhombohedral structures, $a=b=c$ and $\\alpha=\\beta=\\gamma$.\n\n[18] N. B. Ivanova, S. G. Ovchinnikov, M. M. Korshunov, I. M. Eremin, and N. V. Kazak, Physics-Uspekhi 52, 789 (2009).\n\n[19] M. A. Sears-Rodrguez and J. B. Goodenough, J. of Solid State Chem. 116, 224 (1995).\n\n[20] S. W. Biernacki, Phys. Rev. B 74, 184420 (2006).\n\n[21] K. Knek, Z. Jirk, J. Hejtmnek, and P. Novk, J. Phys.: Condens. Matter 18, 3285 (2006).\n\n[22] J. Kune and V. Kpek, Phys. Rev. Lett. 106, 10705 (2011).\n\n[23] M. Zhuang, W. Zhang, and N. Ming, Phys. Rev. B 57, 10705 (1998).\n\n[24] D. Fuchs, L. Dieterle, E. Arac, R. Eder, P. Adelmann, V. Eyert, T. Kopp, R. Schneider, D. Gerthsen, and H. v. Lhneysen, Phys. Rev. B 79, 024424 (2009).\n\n[25] F. Rivadulla, Z. Bi, E. Bauer, B. Rivas-Murias, J. M. Vila-Fungueirio, and Q. Jia, Chem. Mater. 25, 55 (2013).\n\n[26] J. W. Freeland, J. X. Ma, and J. Shi, Appl. Phys. Lett. 93, 212501 (2008).\n\n[27] S. Park, P. Ryan, E. Karapetrova, J. W. Kim, J. X. Ma, J. Shi, J. W. Freeland, and W. Wu, Appl. Phys. Lett. 95, 072508 (2009).\n\n[28] DFT $+U$ calculations were carried out using the PerdewBurke-Ernzerhof exchange-correlation functional, a $k$ point sampling of $6 \\times 6 \\times 4$ for the 20 -atom cell, and a $k$-point sampling of $4 \\times 4 \\times 4$ for the 40 -atom cell. The energy cutoff was $600 \\mathrm{eV}$, the self-consistent field energy convergence was $10^{-4} \\mathrm{eV}$, and the ionic force convergence was $10^{-2} \\mathrm{eV} / \\AA$ A.\n\n[29] G. Kresse and J. Furthmller, Phys. Rev. B 54, 11169 (1996).\n\n[30] G. Kresse and D. Joubert, Phys. Rev. B 59, 1758 (1999).\n\n[31] The Lichtenstein rotationally invariant formulation of the Hubbard interaction was used.\n\n[32] W. Tang, E. Sanville, and G. Henkelman, J. Phys.: Condens. Matter 21, 084204 (2009).\n\n[33] In this paper, reciprocal lattice units (RLU) are defined in terms of the $\\mathrm{SrTiO}_{3}$ substrate lattice parameter of $3.905 \\AA$ unless otherwise specified.\n\n[34] A. M. Glazer, Acta Crystallogr. Sect. B 28, 3384 (1972).\n\n[35] A. M. Glazer, Acta Crystallogr. Sect. A 31, 756 (1975).\n\n[36] A. Vailionis, H. Boschker, W. Siemons, E. P. Houwman, D. H. A. Blank, G. Rijnders, and G. Koster, Phys. Rev. B 83, 064101 (2011).\n\n[37] U. Gebhardt, N. Kasper, A. Vigliante, P. Wochner, H. Dosch, F. Razavi, and H.-U. Habermeier, Phys. Rev. Lett. 98, 096101 (2007).\n\n[38] S. J. May, J.-W. Kim, J. M. Rondinelli, E. Karapetrova, N. A. Spaldin, A. Bhattacharya, and P. J. Ryan, Phys. Rev. B 82, 014110 (2010).\n\n[39] Y. Lu, A. Frano, M. Bluschke, M. Hepting, S. Macke, J. Strempfer, P. Wochner, G. Cristiani, G. Logvenov, H.-U. Habermeier, M. W. Haverkort, B. Keimer, and E. Benckiser, Phys. Rev. B 93, 165121 (2016).\n\n[40] U. Staub, G. I. Meijer, F. Fauth, R. Allenspach, J. G. Bednorz, J. Karpinski, S. M. Kazakov, L. Paolasini, and F. d'Acapito, Phys. Rev. Lett. 88, 126402 (2002).\n\n[41] In order to obtain the elastic component of the resonant Co $K$-edge intensity at a given reflection, the background intensity was recorded with an $\\mathrm{x}$-ray momentum vector that did not satisfy a diffraction condition and subtracted from the intensity measured at the reflection. The background is dominated by Co $K_{\\alpha, \\beta}$ fluorescence.\n\n[42] Due to distortion of the oxygen octahedra, $e_{g}$ and $t_{2 g}$ only approximate the actual Co $3 d$ derived energy levels.\n\n[43] The minimum-energy bulk structure is obtained by performing structural relaxation under HS-LS spin symme- try giving a finite $\\mathrm{Co}-\\mathrm{O}$ bond-length difference. In any given octahedron, all Co-O bond lengths are equal. Structures with different $\\Delta r_{\\mathrm{Co}-\\mathrm{O}}$ are obtained by interpolation between the HS-LS solution and a purely LS solution with equal volume.\n\n[44] M. Merz, P. Nagel, C. Pinta, A. Samartsev, H. v. Lhneysen, M. Wissinger, S. Uebe, A. Assmann, D. Fuchs, and S. Schuppler, Phys. Rev. B 82, 174416 (2010).\n\n[45] D. Fuchs, E. Arac, C. Pinta, S. Schuppler, R. Schneider, and H. v. Lhneysen, Phys. Rev. B 77, 014434 (2008).\n\n[46] C. Pinta, D. Fuchs, M. Merz, M. Wissinger, E. Arac, H. v. Lhneysen, A. Samartsev, P. Nagel, and S. Schuppler, Phys. Rev. B 78, 174402 (2008).\n\n\n\\end{document}", "record_id": "2023_09_22_14ddd903c0b77b5e50c2g"}