{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\n\\title{Generation and reactivity of electron-rich carbenes on the surface of catalytic gold nanoparticles }\n\n\n\\author{Judit Oliver-Meseguer, $\\dagger$ Mercedes Boronat, $\\dagger$ Alejandro Vidal-Moya, $\\dagger$ Patricia Concepción, ${ }^{\\dagger}$ Miguel\\\\\nÁngel Rivero-Crespo, $\\dagger$ Antonio Leyva-Pérez, ${ }^{*}, \\dagger$ and Avelino Corma. ${ }^{*}, \\dagger$\\\\\n†Instituto de Tecnología Química (UPV-CSIC), Universitat Politècnica de València-Consejo Superior de Investigaciones\\\\\nCientíficas, Avda. de los Naranjos s/n, 46022 Valencia, Spain.}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\DeclareUnicodeCharacter{2020}{$\\dagger$}\n\n\\begin{document}\n\\maketitle\nDocument downloaded from:\n\n\\href{http://hdl.handle.net/10251/154389}{http://hdl.handle.net/10251/154389}\n\nThis paper must be cited as:\n\nOliver-Meseguer, J.; Boronat Zaragoza, M.; Vidal Moya, JA.; Concepción Heydorn, P.; Rivero-Crespo, MÁ.; Leyva Perez, A.; Corma Canós, A. (2018). Generation and Reactivity of Electron-Rich Carbenes on the Surface of Catalytic Gold Nanoparticles. Journal of the American Chemical Society. 140(9):3215-3218. \\href{https://doi.org/10.1021/jacs.7b13696}{https://doi.org/10.1021/jacs.7b13696}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_12cb692c6b82606615a6g-1_901_1995_503_1605}\n\\end{center}\n\nThe final publication is available at\n\n\\href{https://doi.org/10.1021/jacs.7b13696}{https://doi.org/10.1021/jacs.7b13696}\n\nCopyright American Chemical Society\n\nAdditional Information\n\n\n\n\\section{Supporting Information Placeholder}\n\\begin{abstract}\nThe reactive nature of carbenes can be modulated, and ultimately reversed, by receiving additional electron density from a metal. Here, it is shown that Au nanoparticles (NPs) generate an electron-rich carbene on surface after transferring electron density to the carbonyl group of an insitu activated diazoacetate, as assessed by Fourier transformed infrared (FT-IR) spectroscopy, magic angle spinning nuclear magnetic resonance (MAS NMR) and Raman spectroscopy. Density functional theory (DFT) calculations support the observed experimental values and unveil the participation of at least three different Au atoms during carbene stabilization. The surface stabilized carbene shows an extraordinary stability against nucleophiles, and rather react with electrophiles to give new products. These findings showcase the ability of catalytic Au NPs to inject electron density in energetically high but symmetrically allowed valence orbitals of sluggish molecules.\n\\end{abstract}\n\nCarbenes are divalent C-atoms, often generated in-situ with catalytic metals to program their reactivity towards nucleophiles. ${ }^{1}$ However, carbenes can reverse their reactivity if the catalytic metal transfers a significant amount of electron density to unoccupied bonding orbitals. This has been achieved so far by spontaneous one electron oxidation of soluble $\\mathrm{Co}^{2+}$ and $\\mathrm{Fe}^{2+/ 0}$ carbene complexes. ${ }^{2}$ The latter feature suitable quasiplanar ligands that not only furnish an appropriate chemical environment for the electron-rich carbene, but also provide the energetically and spatially suitable valence orbitals to engage the empty anti-bonding orbitals of the carbene, since a direct electron transfer from the metal to the carbene is severely restricted. It would be of interest to have metals able to do so on solid surfaces, thus enabling heterogeneous catalysis and avoiding ligands.\n\n$\\mathrm{Au}$ is able to bind carbenes as a metal complex in solution and also as NPs. $3-5$ The latter reacts in a classical way, probably on unsaturated $\\mathrm{Au}$ atoms present in the boundaries, corners and vertexes of the NP. ${ }^{5}$ It may occur that bulk Au atoms would inject electron density into the symmetrically matching unoccupied valence orbitals of a suitable carbene, if efficiently formed on the NP surface. This is not more what occurs during the activation on Au NPs of relatively inert molecules such as $\\mathrm{H}_{2},{ }^{6} \\mathrm{O}_{2},{ }^{7} \\mathrm{HCl}^{8}$ and benzenes and alkynes, ${ }^{9}$ which coordinate on unsaturated $\\mathrm{Au}$ atoms and then receive electron density from the NP bulk. The electron-rich intermediates are stable enough to be detected ${ }^{8}$ and used in productive catalytic processes. $6-9$\n\nFigure 1 shows the temperature programmed FT-IR spectrum of a sample of commercially-available, homogeneously dispersed $3 \\mathrm{~nm} \\mathrm{Au} \\mathrm{NPs} \\mathrm{on} \\mathrm{TiO}_{2}(1 \\mathrm{wt} \\%)$, degassed at $200{ }^{\\circ} \\mathrm{C}$ under vacuum, and treated with ethyl diazoacetate (EDA, 1) at 25 oC. According to blank experiments with 1 adsorbed on $\\mathrm{TiO}_{2}$ (Fig S1-3), the peaks at 2115 and $1640 \\mathrm{~cm}^{-1}$ corresponds to unreacted 1, and the peaks at 1736, 1679 and $1568 \\mathrm{~cm}^{-1}$ correspond to the hydration product ethyl glycolate 2 , as also assessed by the disappearance of hydroxyl groups of $\\mathrm{Au}-\\mathrm{TiO}_{2}$ after adsorption of 1 . However, new peaks at 1704 and 1549 $\\mathrm{cm}^{-1}$ rise in intensity after 1 dosing, remaining quite stable to evacuation. These peaks can be ascribed to the strongly blueshifted $\\mathrm{C}=0$ of an electron-rich carbene that receives electron density from $\\mathrm{Au}\\left(1549 \\mathrm{~cm}^{-1}, 3 \\mathrm{~A}\\right)^{10}$ and the free $\\mathrm{C}=0 \\mathrm{~ o f ~ a ~ c}$ sical Au carbene $\\left(1704 \\mathrm{~cm}^{-1}, 3 \\mathrm{~B}\\right) .^{11}$ Increasing temperature to $150{ }^{\\circ} \\mathrm{C}$ triggers formation of ethyl fumarate and ethyl maleate 4 , as assessed by the peaks at 1711,1667 and $1524 \\mathrm{~cm}^{-1}$ (see Fig S2). ${ }^{1 \\mathrm{~b}}$ Benzyl diazoacetate gives also blue-shifted $\\mathrm{C}=0$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_12cb692c6b82606615a6g-2_1743_1786_1068_1639}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_12cb692c6b82606615a6g-2_1782_2381_1062_1896}\n\\end{center}\n\nFigure 1 Temperature programmed FT-IR spectra of 1 adsorbed on $\\mathrm{Au}^{-\\mathrm{TiO}_{2}}$ at increasing dosing (black lines), after evacuation at $10^{-6}$ mbar (blue lines) at $25{ }^{\\circ} \\mathrm{C}$, and after increasing temperature to $150{ }^{\\circ} \\mathrm{C}$ (red line).\n\nFigure $2 \\mathrm{~A}$ shows the ${ }^{13} \\mathrm{C} \\mathrm{CP} / \\mathrm{MAS}$ NMR spectra of isotopically labelled EtOOC ${ }^{13} \\mathrm{CHN}_{2}\\left(1-{ }^{13} \\mathrm{C}\\right)$, $^{12 a}$ adsorbed on $\\mathrm{Au}^{-\\mathrm{TiO}_{2}}$ (sur- face Au atoms/1 =1), and sealed in an ampule (see Fig S4 for full spectra). The mixture at RT shows the original signal of 1${ }^{13} \\mathrm{C}$ centered at $46 \\mathrm{ppm}$ (Fig S4) together with three new signals centered at 41, 77 and $132 \\mathrm{ppm}$ (broad), the two latter corresponding to 2 and 4, respectively. Notice that, under these conditions, the dimerization reaction has been completed. After heating at $80{ }^{\\circ} \\mathrm{C}$ during $30 \\mathrm{~min}$, the signal of $1^{13} \\mathrm{C}$ completely disappears and the signal ranging from $\\sim 30$ to $\\sim 50 \\mathrm{ppm}$, with a maximum at $41 \\mathrm{ppm}$, persists, without further changes in the spectrum for longer heating times. Notice that surface heterogeneity broadens signals in the spectrum. A very recent work 4 reports a nucleophilic Au carbene complex resonating at $18.2 \\mathrm{ppm}$ in ${ }^{13} \\mathrm{C}$ liquid NMR, which strongly suggests that the signal at $41 \\mathrm{ppm}$ may correspond to an electron-rich $\\mathrm{C}$ carbene atom. Please note that a carbene can persist after heating since the experiment is made in the gas phase with very low covering level, thus bimolecular reactions are hampered. $1^{-15} \\mathrm{~N}$ was also prepared ${ }^{12 b}$ and co-adsorbed with $1-{ }^{13} \\mathrm{C}$, and the combined ${ }^{15} \\mathrm{~N}$ and ${ }^{13} \\mathrm{C} \\mathrm{CP} / \\mathrm{MAS}$ NMR spectra confirm that the peak at $41 \\mathrm{ppm}$ only forms after $\\mathrm{N}_{2}$ release (Fig S5). Please notice the difficulties associated in characterizing nucleophilic metal carbenes by NMR, since they usually feature paramagnetic metals. ${ }^{2,12 c}$ Figure $2 B$ shows the corresponding time-resolved Raman spectra, and two new peaks at $\\sim 290-320$ and $445 \\mathrm{~cm}^{-1}$ appear, which could be assigned to $\\mathrm{Au}-\\mathrm{C}$ and $\\mathrm{Au}-\\mathrm{O}$ vibrations of carbenes 3, respectively, beside the Raman bands at 197, 396, 514 and $639 \\mathrm{~cm}^{-1}$ corresponding to $\\mathrm{TiO}_{2}$.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_12cb692c6b82606615a6g-3_1246_1890_170_984}\n\nFigure $2 \\mathrm{~A})^{13} \\mathrm{C} \\mathrm{CP} / \\mathrm{MAS} \\mathrm{NMR}$ spectra of $\\mathrm{Au}-\\mathrm{TiO}_{2}$ loaded with 1 $(\\mathrm{Au} / 1=5)$ at $\\mathrm{RT}$ (top) and after heating at $80{ }^{\\circ} \\mathrm{C}$ for $30 \\mathrm{~min}$ (bottom). Spectrometer frequency is $100.6 \\mathrm{MHz}$ and spinning rate is $5 \\mathrm{kHz}$. B) Raman spectra of 1 adsorbed on $\\mathrm{Au}^{-\\mathrm{TiO}_{2}}$ at RT and evolution with time $(24,35,46,74$ and $86 \\mathrm{~min})$.\n\nFigure 3 shows the calculated interaction energies, net atomic charges, bond lengths, $v C O$ and RAMAN frequencies, and NMR values of carbene 3 adsorbed on a $A_{10}$ model, with either the oxygen atom of the carbonyl (A) or ester (B) groups attached to the surface Au atoms. Remarkably, the carbene atom bonds to two $\\mathrm{Au}$ atoms $(\\mathrm{Au}-\\mathrm{C}-\\mathrm{Au})$ in all configurations, regardless different coordination modes or Au $\\mathrm{NP}$ arrangements (see Table S1 for additional computed structures). A further stabilization occurs if an $\\mathrm{O}$ atom coordinates $\\mathrm{Au}$, in such a way that the highest interaction energy $\\left(-37 \\mathrm{kcal} \\mathrm{mol}^{-1}\\right)$ is achieved when the 0 atom of $C=0$ coordinates to the Au surface at the relatively small distance of $2.36 \\AA$ (structure A). The calculated $v \\mathrm{CO}$ and Raman frequencies, and NMR shifts for the car- bene $\\mathrm{C}$ atom in structure A, 1578, 407 and $305 \\mathrm{~cm}^{-1}$, and 21 ppm, respectively, are close to those observed experimentally (1537, 445, $302 \\mathrm{~cm}^{-1}$ and $41 \\mathrm{ppm}$ ), much closer than any other computed structure (see Table S1 and also Table S2 for related reported values). 4,10 The $\\mathrm{C}=0$ bond length changes from $1.22$ to $1.24 \\AA$ in structure $\\mathrm{A}$, with a ca. $20 \\%$ increase of neat negative charge at the 0 atom and a similar increase of neat positive charge at the $\\mathrm{C}$ atom, which unambiguously indicates the weakening of the $\\mathrm{C}=0$ bond. Finally, the net and total charges summarized in Fig. 3 and Fig. S5 show that there is a transfer of $\\sim 0.5 \\mathrm{e}^{-}$from Au to the adsorbed carbene, causing an increase in the net negative charge on the carbene atom of 0.7-0.8 e (see Table S3 for validation with B3PW91 and M06 methods). ${ }^{3 b, 4}$ These results, together, strongly support the electronic transfer from the Au surface to the antibonding orbitals of the $\\mathrm{C}=0$ bond to generate the electron-rich carbene $3 A$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_12cb692c6b82606615a6g-3_874_1296_1112_1835}\n\\end{center}\n\n$E_{\\text {int }}=-36.9 \\mathrm{kcal} \\mathrm{mol}^{-1} ; v C O=1578 \\mathrm{~cm}^{-1} \\quad E_{\\text {int }}=-31.7 \\mathrm{kcal} \\mathrm{mol}^{-1} ; v C O=1728 \\mathrm{~cm}^{-1}$ Raman shifts $\\left(\\mathrm{cm}^{-1}\\right)$ : Au-C= 305; Au-O= $=407 \\mid$ Raman shifts $\\left(\\mathrm{cm}^{-1}\\right)$ : Au-C= 297; Au-O=219\n\nFigure 3 DFT calculations of the most probable configurations of carbene 3 on Au NPs, including bond lengths (black) and net atomic charges (blue).\n\nThe $\\mathrm{Au}^{-\\mathrm{TiO}_{2}}(0.1 \\mathrm{~mol} \\%)$ catalyzed reaction of 1 , in toluene at $70 \\stackrel{\\circ}{\\circ} \\mathrm{C}$, gives an equimolecular mixture of dimers 4 , up to $90 \\%$ yield. ${ }^{13} \\mathrm{Au}-\\mathrm{ZnO}$ and $\\mathrm{Au}-\\mathrm{Al}_{2} \\mathrm{O}_{3}$ were also effective, and $\\mathrm{Au}-$ $\\mathrm{TiO}_{2}$ could be reused up to 10 times without depletion in the final yield of 4. For all Au NPs, the equation rate for the formation of 4 was $r_{0}=k_{\\exp }[1][\\mathrm{Au}]$, which is the expected equation rate for a classical Lewis-acid catalyzed activation and dimerization of 1 (Fig S6). ${ }^{14 a}$ The Lewis base $B_{3} \\mathrm{~N}(0.01$ mol\\%) severely stopped the formation of 4 , while a similar amount of NaI had no effect. Besides, the cross dimerization between ethyl (1) and tert-butyl diazoacetate, which possess a bulky group that impedes a good coordination on the bulk Au atoms and thus hampers metal catalysis on planar surfaces (Taft effect), ${ }^{14 b}$ proceeds very well (Fig S7), which supports that 1 transforms to $3 \\mathrm{~B}$ at unsaturated $\\mathrm{Au}$ atoms. This process may run in parallel and be co-operative with the formation of 3A on bulk Au atoms, with an electronic flow from the unsaturated to the bulk (Fig S8). ${ }^{14 c-e}$ Notice that products in solution differ from species observed by in-situ IR, NMR and Raman techniques, since the latter mainly correspond to species remaining adsorbed on surface (Fig S9).\n\nThe reactivity of $3 \\mathrm{~A}$ and other potential electron-rich $\\mathrm{Au}$ carbenes was then studied. Table 1 shows the results with $\\mathrm{Au}-\\mathrm{TiO}_{2}, \\mathrm{Au}^{+}$complexes and some representative catalysts. In general, the reactivity of 1 drastically decreases in the presence of $\\mathrm{Au}-\\mathrm{TiO}_{2}$. For instance, toluene, $n$-hexane and ethanol (entry 1) can be used as a reaction solvent since they do not react in the presence of $\\mathrm{Au}^{-} \\mathrm{TiO}_{2}$, in clear contrast with $\\mathrm{Au}^{+}$ complexes ${ }^{15,16}$ and classical metal species. ${ }^{17-23}$ The electron- Table 1 Reactivity of carbene-forming substrates in the presence of different catalysts.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_12cb692c6b82606615a6g-4_313_1195_160_1925}\n\\end{center}\n\na Reaction conditions for $\\mathrm{Au}-\\mathrm{TiO}_{2}$ catalyst, $\\mathrm{Au}-\\mathrm{ZnO}$ and $\\mathrm{Au}-\\mathrm{Al}_{2} \\mathrm{O}_{3}$ catalysts gave similar results in most cases. Blank experiments with Au-TiO ${ }_{2}$ show only marginal yields of the nucleophile carbene products 7 a-d, 9,13 and 14 . $^{\\text {b }}$ See detailed reaction conditions in references. IPr: 1 ,3bis(diisopropylphenyl)imidazole-2-ylidene], BAr ${ }^{\\prime}$ : tetrakis-(3,5-bis(trifluoromethyl)phenyl)borate, PyrPy: 2,2'-pyridylpyrrolide-ligand, Tp ${ }^{\\mathrm{Ms}}$ : hydrotris(3,5- (2,4,6-trimethylphenyl)pyrazolyl)borate, ba: benzylideneacetone. ${ }^{c} \\mathrm{R}^{1}=n$-But, $\\mathrm{R}^{2}=\\mathrm{H}^{6}$; $; \\mathrm{R}^{1}=\\mathrm{Ph}, \\mathrm{R}^{2}=\\mathrm{Me} 6 \\mathrm{~b} ; \\mathrm{R}^{1}=4$-R-Ph $\\left(\\mathrm{R}=\\mathrm{CF} \\mathrm{F}_{3}\\right.$, $\\mathrm{Br}, \\mathrm{H}, \\mathrm{Me}), \\mathrm{R}^{2}=\\mathrm{H} 6 \\mathrm{c}$-f. Mass balances account for $>95 \\%$ in entries $1-3$ and c.a. $80 \\%$ in entry 4\n\nrich nature of $3 \\mathrm{~A}$ is also seen during the cyclopropanation of alkenes (entry 2). In contrast to classical cyclopropanation reactions where electron-rich alkenes are much more reactive, ${ }^{16,23,24} 3 \\mathrm{~A}$ reacts worse with electron-rich 1-hexene $6 \\mathrm{a}$ than with electron-poor styrenes $6 \\mathbf{b}-\\mathbf{f}$, the similar reactivity trend found with $\\mathrm{Co}^{2+}$ porphyrin radical carbene catalysts. ${ }^{25} \\mathrm{~A}$ Hammett plot confirms this tendency (Fig S10). The higher reactivity of the $\\mathrm{Co}^{2+}$ complex respect $\\mathrm{Au}^{2} \\mathrm{TiO}_{2}$ catalyst correlates with the more electron density transferred by the former (ca. $1 e)$ than by the latter ( $0.2 e$ according to DFT). Different $\\mathrm{Au}-\\mathrm{TiO}_{2}$ samples with average sizes of $7,12,17$ and $21 \\mathrm{~nm}$, respectively, were prepared, characterized, ${ }^{26}$ and tested as catalysts for the cyclopropanation of $6 \\mathrm{~d}$ (Fig S11-15), and the results clearly showed that the cyclopropanation rate increases linearly with the amount of exposed bulk Au atoms in the NP, and not with the amount of unsaturated Au atoms.\n\nOther representative carbene-forming substrates were tested. Dimedone $8^{27}$ (entry 3) is a typical reagent for Wolff rearrangements or alcohol insertion reactions, which gives cyclopentane $10^{14 d, 28-29}$ and ether $11^{30}$ after intra- or intermolecular nucleophilic attack to the carbene of 8 in ethanol solvent, respectively, under metal or microwave catalyzed conditions. In clear contrast, coupled bis-dione 9 was the only product obtained with $\\mathrm{Au}-\\mathrm{TiO}_{2}$ catalyst, in up to $82 \\%$ yield, irrespective of the presence of light or not, and without any trace of Wolff rearrangement or alcohol insertion products. An electron-rich carbene of 8 on $\\mathrm{Au}_{-}-\\mathrm{TiO}_{2}$ can be invoked as intermediate of the reaction, $31 a, b$ since blank experiments showed that $\\mathrm{Au}-\\mathrm{TiO}_{2}$ does not oxidize ethanol to acetaldehyde in the absence of 8 under identical reaction conditions, and a very active aerobic oxidation catalyst of alcohols such as $\\mathrm{Au}-$ $\\mathrm{CeO}_{2}$ gives a similar yield of $9(57 \\%){ }^{31 c}$ Ortho-nitro phenylacetylene 12 (entry 4) generates oxocarbenes with metal catalysts, including products $15^{32 a}$ and 16. ${ }^{. b}$ When $\\mathrm{Au}-\\mathrm{TiO}_{2}$ was used as a catalyst, neither 15 nor 16 were formed, but just isatin 13 and indigo dye 14 . These products come from rearrangements and radical oxidation of carbene atoms, as previously observed with $\\mathrm{Cu}^{+}, 32 \\mathrm{c}$ which suggests the formation of electron-rich carbenes of $12 .{ }^{32 \\mathrm{~d}}$\n\nIn conclusion, combined experimental and theoretical evidences strongly support that Au NPs generate and stabilize electron-rich carbenes on surface, after electronic transfer to the anti-bonding valence orbitals of the $\\mathrm{C}=0$ group of $\\mathrm{RCOCHN}_{2}$ molecules. This carbene umpolung avoids participation in insertion reactions but rather enables the carbene to act as a nucleophile in addition reactions. ${ }^{33}$\n\n\\section{ASSOCIATED CONTENT}\n\\section{Supporting Information}\nExperimental section, compound characterization and additional Figures S1-15 and Table S1-3. This material is available free of charge via the Internet at \\href{http://pubs.acs.org}{http://pubs.acs.org}.\n\n\\section{AUTHOR INFORMATION}\nCorresponding Author\n\nE-mail: \\href{mailto:anleyva@itq.upv.es}{anleyva@itq.upv.es}, \\href{mailto:acorma@itq.upv.es}{acorma@itq.upv.es}; phone: +34963877800; fax: +34963877809.\n\n\\section{Notes}\nThe authors declare no competing financial interests.\n\n\\section{ACKNOWLEDGMENT}\nFinancial support by MINECO through the Severo Ochoa program, RETOS program (CTQ2014-55178-R) and Ramón y Cajal Program (A. L.-P.) is acknowledged. J. O.-M. thanks ITQ for the concession of a contract. We thank to the Electron Microscopy Service of the UPV.\n\n\\section{REFERENCES}\n(1) a) Werlé, C.; Goddard, R.; Philipps, P.; Farès, C.; Fürstner, A. J. Am. Chem. Soc. 2016, 138, 3797-3805; b) Fortea-Perez, F. R.; Mon, M.; Ferrando-Soria, J.; Boronat, M.; Leyva-Perez, A.; Corma, A.; Herrera, J. M.; Osadchii, D.; Gascon, J.; Armentano, D.; Pardo, E. Nat. Mater. 2017, 16, 760-766. For detailed computational studies on gold carbenes and their usual reactivity, see c) dos Santos Comprido, L. N.; Klein, J. E. M. N.: Knizia, G.; Kästner, J.; Hashmi, A. S. K. Angew. Chem. Int. Ed. 2015, 54, 10336-10340; Chem. Eur. J. 2016, 22, 2892-2895.\n\n(2) a) Wolf, J. R.; Hamaker, C. G.; Djukic, J.-P.; Kodadek, T.; Woo, L. K. J. Am. Chem. Soc. 1995, 117, 9194-9199; b) Dzik, W. I.; Xu, X.; Zhang, X. P.; Reek, J. N. H.; de Bruin, B. J. Am. Chem. Soc. 2010, 132, 10891-10902; c) Lu, H.; Dzik, W. I.; Xu, X.; Wojtas, L.; de Bruin, B.; Zhang, X. P. J. Am. Chem. Soc. 2011, 133, 8518-8521; d) Russell, S. K.; Hoyt, J. M.; Bart, S. C.; Milsmann, C.; Chantal, S.; Stieber, E.; Semproni, S. P.; DeBeer, S.; Chirik, P. J. Chem. Sci. 2014, 5, 1168-1174.\n\n(3) For the first gold-catalyzed reaction involving carbene intermediates and a full mechanistic discussion see a) Hashmi, A. S. K.; Frost, Tanja M.; Bats, J. W. J. Am. Chem. Soc. 2000, 122, 11553-11554 and b) Hashmi, A. S. K.; Rudolph, M.; Siehl, H.-U.; Tanaka, M.; Bats, J. W.; Frey; W. Chem. Eur. J. 2008, 14, 3703-3708; c) Benitez, D.; Shapiro, N. D.; Tkatchouk, E.; Wang, Y.; Goddard III, W. A.; Toste, F. D. Nat. Chem. 2009, 1, 482-486; d) Seidel, G.; Fürstner, A. Angew. Chem. Int. Ed. 2014, 53, 4807-4811; e) Wang, Y.; Muratore, M. E.; Echavarren, A. M. Chem. Eur. J. 2015, 21, 7332-7339.\n\n(4) Pujol, A.; Lafage, M.; Rekhroukh, F.; Saffon-Merceron, N.; Amgoune, A.; Bourissou, D.; Nebra, N.; Fustier-Boutignon, M.; Mézailles, N. Angew. Chem. Int. Ed. 2017, 56, 12264-12267.\n\n(5) Carrettin, S.; Blanco, M. C.; Corma, A.; Hashmi, A. S. K. Adv. Synth. Catal. 2006, 348, 1283-1288.\n\n(6) a) Corma, A.; Serna, P. Science 2006, 313, 332-334; b) Yang, X.; Kattel, S.; Senanayake, S. D.; Boscoboinik, J. A.; Nie, X.; Graciani, J.; Rodriguez, J. A.; Liu, P.; Stacchiola, D. J.; Chen, J. G. J. Am. Chem. Soc. 2015, 137, 10104-10107, c) Bond, G. C. Gold Bull. 2016, 49, 53-61.\n\n(7) a) Huang, J.; Akita, T.; Faye, J.; Fujitani, T.; Takei, T.; Haruta, M. Angew. Chem. Int. Ed. 2009, 48, 7862-7866; b) Boronat, M.; LeyvaPérez, A.; Corma, A. Acc. Chem. Res. 2014, 47, 834-844.\n\n(8) Oliver-Meseguer, J.; Doménech-Carbó, A.; Boronat, M.; LeyvaPérez, A.; Corma, A. Angew. Chem. Int. Ed. 2017, 56, 6435 -6439.\n\n(9) a) Corma, A.; Juarez, R.; Boronat, M.; Sánchez, F.; Iglesias, M.; Garcia, H. Chem. Commun. 2011, 47, 1446-1448; b) Leyva-Pérez, A.; Oliver-Meseguer, J.; Cabrero-Antonino, J. R.; Rubio-Marqués, P.; Serna, P.; Al-Resayes, S. I.; Corma, A. ACS Catal. 2013, 3, 1865–1873.\n\n(10) Iwakura, I.; Tanaka, H.; Ikeno, T.; Yamada, T. Chem. Lett. 2004, 33, 140-141.\n\n(11) Penoni, A.; Wanke, R.; Tollari, S.; Gallo, E.; Musella, D.; Ragaini, F.; Demartin, F.; Cenini, S. Eur. J. Inorg. Chem. 2003, 1452-1460.\n\n(12) a) Ranocchiari, M.; Mezzetti, A. Organometallics 2009, 28, 3611-3613; b) Albertin, G.; Antoniutti, S.; Botter, A.; Castro, J. Inorg. Chem. 2015, 54, 2091-2093; c) Cantat, T.; Jaroschik, F.; Nief, F.; Ricard, L.; Mézailles, N.; Le Floch, P. Chem. Commun. 2005, 51785180.\n\n(13) Zhou, Y.; Trewyn, B. G.; Angelici, R. J.; Woo, L. K. J. Am. Chem. Soc. 2009, 131, 11734-11743.\n\n(14) a) Hodgson, D. M.; Angrish, D. Chem. Eur. J. 2007, 13, 34703479; b) Fonseca, G. S.; Silveira, E. T.; Gelesky, M. A.; Dupont, J. Adv. Synth. Catal. 2005, 347, 847-853; c) Bai, D.; Jennings, G. K. J. Am. Chem. Soc. 2005, 127, 3048-3056; d) Gryparis, C.; Efe, C.; Raptis, C.; Lykakis, I. N.; Stratakis, M. Org. Lett. 2012, 14, 2956-2959; e) Neupane, P.; Xia, L.; Lee, Y. R. Adv. Synth. Catal. 2014, 356, 2566-2574.\n\n(15) Fructos, M. R.; Belderrain, T. R.; Frémont, P.; Scott, N. M.; Nolan, S. P.; Díaz-Requejo, M. M.; Pérez, P. J. Angew. Chem. Int. Ed. 2005, 44, 5284-5288.\n\n(16) Fructos, M. R.; De Fremont, P.; Nolan, S. P.; Diaz-Requejo, M. M.; Perez, P. J. Organometallics 2006, 25, 2237-2241. (17) Anciaux, A. J.; Demonceau, A.; Noels, A. F.; Hubert, A. J.; Warin, R.; Teyssié, P. J. Org. Chem. 1981, 46, 873-876.\n\n(18) Díaz-Requejo, M. M.; Pérez, P. J. Chem. Rev. 2008, 108, $3379-$ 3394.\n\n(19) Doyle, M. P.; Duffy, R.; Ratnikov, M.; Zhou, L. Chem. Rev. 2010, $110,704-724$\n\n(20) Flores, J. A.; Komine, N.; Pal, K.; Pinter, B.; Pink, M.; Chen, C.-H.; Caulton, K. G.; Mindiola, D. J. ACS Catal. 2012, 2, 2066-2078.\n\n(21) Paulissen, R.; Reimlinger, H.; Hayez, E.; Hubert, A. J.; Teyssié, P. Tetrahedron Lett. 1973, 24, 2233-2236.\n\n(22) Liu, L.; Zhang, J. Chem. Soc. Rev. 2016, 45, 506-516.\n\n(23) Fructos, M. R.; Belderrain, T. R.; Nicasio, M. C.; Nolan, S. P.; Kaur, H.; Díaz-Requejo, M. M.; Pérez, P. J. J. Am. Chem. Soc. 2004, 126, 10846-10847.\n\n(24) Díaz-Requejo, M. M.; Belderraín, T. R.; Trofimenko, S.; Pérez, P. J. J. Am. Chem. Soc. 2001, 123, 3167-3168.\n\n(25) a) Chen, Y.; Fields, K. B.; Zhang, X. P. J. Am. Chem. Soc. 2004, 126, 14718-14719; b) Chen, Y.; Ruppel, J. V.; Zhang, X. P. J. Am. Chem. Soc. 2007, 129, 12074-12075.\n\n(26) a) Corma, A.; Serna, P.; Concepción, P.; Calvino, J. J. J. Am. Chem. Soc. 2008, 130, 8748-8753. For calculations see Ref. 31c.\n\n(27) Wang, Z.; Bi, X.; Liao, P.; Zhang, R.; Liang, Y.; Dong, D., Chem. Commun. 2012, 48, 7076-7078.\n\n(28) Kirmse, W. Eur. J. Org. Chem. 2002, 2193-2256.\n\n(29) a) Diaf, I.; Lemière, G.; Duñach, E. Angew. Chem. Int. Ed. 2014, 53, 4177-4180; b) Presset, M.; Coquerel, Y.; Rodriguez, J. J. Org. Chem. 2009, 74, 415-418.\n\n(30) Shevchenko, V. V.; Shakhmin, A. A.; Nikolaev, V. A., Russian J. Org. Chem. 2006, 42, 1741-1744.\n\n(31) a) Veschambre, H.; Vocelle, D. Can. J. Chem. 1969, 47, 19811988; b) Leyva, E.; Barcus, R. L.; Platz, M. S. J. Am. Chem. Soc. 1986, 108, 7786-7788; c) Abad, A.; Corma, A.; García, H. Chem. Eur. J. 2008, $14,212-222$.\n\n(32) a) Jadhav, A. M.; Bhunia, S.; Liao, H.-Y.; Liu, R.-S. J. Am. Chem. Soc. 2011, 133, 1769-1771; b) Li, X.; Incarvito, C. D.; Vogel, T.; Crabtree, R. H. Organometallics 2005, 24, 3066-3073; c) Bond, C. C.; Hooper, M. J. Chem. Soc. C 1969, 2453-2460; d) Asao, N.; Sato, K.; Yamamoto, Y. Tetrahedron Lett. 2003, 44, 5675-5677.\n\n(33) Jin, H.; Tian, B.; Song, X.; Xie, J.; Rudolph, M.; Rominger, F.; Hashmi, A. S. K. Angew. Chem. Int. Ed. 2016, 55, 12688-12692.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_12cb692c6b82606615a6g-6_372_678_537_1511}\n\n\n\\end{document}", "record_id": "2023_09_22_12cb692c6b82606615a6g"}