{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{APS physics }\n\n\n\\author{Ding-Fu Shao, ${ }^{1,{ }^{*}}$ Gautam Gurung, ${ }^{1}$ Shu-Hui Zhang, ${ }^{2}$ and Evgeny Y. Tsymbal ${ }^{1, \\dagger}$\\\\\n${ }^{1}$ Department of Physics and Astronomy \\& Nebraska Center for Materials and Nanoscience,\\\\\nUniversity of Nebraska, Lincoln, Nebraska 68588-0299, USA\\\\\n${ }^{2}$ College of Science, Beijing University of Chemical Technology,\\\\\nBeijing 100029, People's Republic of China}\n\\date{}\n\n\n\\DeclareUnicodeCharacter{2020}{$\\dagger$}\n\n\\begin{document}\n\\maketitle\nThis is the accepted manuscript made available via CHORUS. The article has been published as:\n\n\\section{Dirac Nodal Line Metal for Topological Antiferromagnetic Spintronics}\nDing-Fu Shao, Gautam Gurung, Shu-Hui Zhang, and Evgeny Y. Tsymbal Phys. Rev. Lett. 122, 077203 - Published 20 February 2019 DOI: 10.1103/PhysRevLett.122.077203\n\n\\section*{Dirac nodal line metal for topological antiferromagnetic spintronics }\n\n\n\\begin{abstract}\nTopological antiferromagnetic (AFM) spintronics is an emerging field of research, which exploits the Néel vector to control the topological electronic states and the associated spin-dependent transport properties. A recently discovered Néel spin-orbit torque has been proposed to electrically manipulate Dirac band crossings in antiferromagnets; however, a reliable AFM material to realize these properties in practice is missing. In this letter, we predict that room temperature AFM metal $\\mathrm{MnPd}_{2}$ allows the electrical control of the Dirac nodal line by the Néel spin-orbit torque. Based on firstprinciples density functional theory calculations, we show that reorientation of the Néel vector leads to switching between the symmetry-protected degenerate state and the gapped state associated with the dispersive Dirac nodal line at the Fermi energy. The calculated spin Hall conductivity strongly depends on the Néel vector orientation and can be used to experimentally detect the predicted effect using a proposed spin-orbit torque device. Our results indicate that AFM Dirac nodal line metal $\\mathrm{MnPd}_{2}$ represents a promising material for topological AFM spintronics.\n\\end{abstract}\n\nThe discovery of novel quantum phenomena in solids, resulting from the interplay between the electron, spin, and orbital degrees of freedom, enriches a continuously evolving field of spintronics and opens opportunities to enhance the efficiency of electronic devices [1]. Recently, antiferromagnetic (AFM) spintronics has emerged as a subfield of spintronics, where an AFM order parameter also known as the Néel vector is exploited to control spin-dependent transport properties [2-4]. Due to being robust against magnetic perturbations, producing no stray fields, and exhibiting ultrafast dynamics, antiferromagnets can serve as promising functional materials for spintronic applications, which may expand to very diverse areas ranging from terahertz information technologies to artificial neural networks [5].\n\nThe interest to AFM spintronics has largely been stimulated by the recent discovery of electrical switching of a collinear antiferromagnet by spin-orbit torque [6]. It is known that spinorbit torques can originate from the inverse spin-galvanic effect [7], which occurs in magnetic materials with broken spaceinversion symmetry due to spin-orbit coupling (SOC) [8-11]. If an antiferromagnet is formed of two antiparallel-aligned spin sublattices, whose atomic structure has broken space-inversion symmetry but the sublattices form space-inversion partners, the inverse spin-galvanic effect produces a nonequilibrium local spin polarization of opposite sign on the two spin sublattices. The resulting staggered effective magnetic field generates an alternating in sign spin-orbit torque, known as the Néel spinorbit torque, on the sublattice magnetizations, thus acting with a torque on the Néel vector $[12,13]$. The control of the Néel vector by electric current has been realized using tetragonal $\\mathrm{CuMnAs}$ [6] and $\\operatorname{Mn}_{2} \\mathrm{Au}$ [14] antiferromagnets, thus demonstrating a viable approach to the AFM-based memories [15] and providing a route to ultra-fast spintronic devices $[4,5]$.\n\nIn parallel with these developments, there has been increasing interest in materials and structures where quantum effects are responsible for novel physical properties, revealing the important roles of symmetry, topology, and dimensionality [16 ]. Among such quantum materials are graphene [17], topological insulators [18], Dirac and Weyl semimetals [19], and beyond [20]. These materials are characterized by non-trivial fermionic excitations resulting from discrete band crossings as well as continuous degenerate states, such as the nodal lines $[21,22]$ and their exotic connections [23,24]. Using the unique properties of the novel fermionic states has been envisioned for spintronics applications $[25,26]$. A particular example is the demonstration of significantly enhanced spin-orbit torques in ferromagnet/topological insulator heterostructures $[27,28]$.\n\nThe discovery of the electrical control of the Néel vector [6,14] opens a new direction in spintronics, involving the interplay between the topological electronic states and antiferromagnetism $[29,30]$. A notable example is the proposed control of Dirac quasiparticles in an antiferromagnet by reorientation of the Néel vector [31]. ON and OFF switching of the symmetry protection of the Dirac band crossing has been predicted in an AFM Dirac semimetal, such as orthorhombic CuMnAs [32], resulting in the topological metal-insulator transition (Figs. 1(a-d)) and topological anisotropic magnetoresistance [31].\n\nTo realize these properties in practice, however, the Dirac quasiparticles are required to appear precisely at the Fermi energy $\\left(E_{F}\\right)$, demanding a strict control of the stoichiometry and structural quality of the sample, which is not easy to achieve in real experimental conditions. On the other hand, there exist a class of quantum materials exhibiting Dirac nodal lines within a broad energy window including those crossing the Fermi energy. In an AFM material with such a nodal line, the Néel spin-orbit torque control of the Dirac band crossings would be much easier to realize and detect in transport measurements (Figs. 1(e,f)). a\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_77a765fcab6029c666b4g-3_297_516_169_394}\n\\end{center}\n\n$g_{z}$\n\nb\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_77a765fcab6029c666b4g-3_591_873_169_394}\n\\end{center}\n\nC\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_77a765fcab6029c666b4g-3_265_538_444_716}\n\\end{center}\n\nd\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_77a765fcab6029c666b4g-3_569_835_455_716}\n\\end{center}\n\ne\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_77a765fcab6029c666b4g-3_276_537_759_1025}\n\\end{center}\n\n$\\mathbf{f}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_77a765fcab6029c666b4g-3_569_829_751_1016}\n\\end{center}\n\nFIG. 1. Controlling a Dirac point or a Dirac nodal line by the Néel vector. $(\\mathrm{a}, \\mathrm{b})$ Schematics of an antiferromagnet with two magnetic sublattices (denoted as $\\mathrm{Mn}_{\\mathrm{A}}$ and $\\mathrm{Mn}_{\\mathrm{B}}$ ) connected by the $P T$ symmetry for two orientations of the Néel vector, preserving (a) and breaking (b) glide symmetry $g_{z}$ (indicated by the dotted lines). Red arrows indicate the magnetic moments. (c-f) Schematics of the band structure around the Fermi energy $\\left(E_{F}\\right)$ for a Dirac point $(\\mathrm{c}, \\mathrm{d})$ or a dispersive Dirac nodal line (e, f) for preserved (c, e) or broken (d, f) glide symmetry $g_{z}$.\n\nIn this letter, we predict that AFM metal $\\mathrm{MnPd}_{2}$ has the desired properties: it has the required symmetry to support the Néel spin-orbit torque and holds a dispersive Dirac nodal line across the Fermi energy. The reorientation of the Néel vector leads to switching between the symmetry protected degenerate state and the gapped state associated with the Dirac nodal line. We show that the spin Hall conductivity of $\\mathrm{MnPd}_{2}$ strongly depends on the Néel vector orientation and can be used to detect the effect. $\\mathrm{MnPd}_{2}$ has been synthesized in the laboratory, has the Néel temperature $\\left(T_{N}\\right)$ well above the room temperature, and thus represents a new promising material for topological antiferromagnetic spintronics.\n\nFigure 2(a) shows the crystal structure of orthorhombic $\\mathrm{MnPd}_{2}$ which belongs to nonsymmorphic space group Pnma [33 ]. In the paramagnetic phase, $\\mathrm{MnPd}_{2}$ has time-reversal symmetry $T$, space-inversion symmetry $P$, three glide planes, and three screw axes. Neutron diffraction reveals a collinear AFM ordering up to $T_{N}=415 \\pm 10 \\mathrm{~K}$. In the ground state, the Néel vector lies along the [010] direction with the magnetic moments of the Mn atoms being parallel in the (010) planes but antiparallel between the successive (010) planes [33]. As seen from Fig. 2(a), the inversion-partner sites are occupied by the Mn atoms with oppositely oriented magnetic moments. Such an AFM ordering breaks both the $P$ and $T$ symmetries but the combined $P T$ symmetry is preserved. This condition is sufficient to produce the Néel spin-orbit torque on the Néel vector by passing an electric current [31]. Our calculation of the total\n\nenergy predicts the lower energy for the Néel vector $(\\vec{n})$ lying in the (100) plane with the magnetocrystalline anisotropy energy of $E_{[001]}-E_{[010]}=0.14 \\mathrm{meV} /$ f.u. This result is consistent with the experiment [33], showing that the easy axis lies along the [010] direction $(\\vec{n} \\|[010])$. The calculated magnetic moment of $3.89$ $\\mu_{\\text {в }}$ per Mn atom is also in agreement with that $\\left(4.0 \\mu_{\\text {B }}\\right)$ found by this experiment.\n\nThe AFM ordering determines the magnetic space group symmetry of $\\mathrm{MnPd}_{2}$, as shown in Table $\\mathrm{S} 1$ in the Supplemental Material [34]. It is evident that the nonsymmorphic symmetries can be turned on and off by rotating the Néel vector. As we will see below, this leads to the ability to close and open a gap at the Dirac nodal line and thus to control spin-dependent transport properties of $\\mathrm{MnPd}_{2}$.\n\nOur density functional theory (DFT) calculations [34] predict that around the Fermi energy, the electronic band structure of $\\mathrm{MnPd}_{2}$ is represented by the $\\mathrm{Mn}$ and $\\mathrm{Pd} d$-orbitals (Fig. S1). Due to the preserved $P T$ symmetry, every band is doubly degenerate. As seen from Fig. S2, there are three bands crossing $E_{F}$. Below we focus on the bands around $E_{F}$ lying in the $k_{z}=\\frac{\\pi}{c}$ plane, which form a Dirac nodal line.\n\nFigures $2(\\mathrm{c}, \\mathrm{d})$ show the calculated band structure along the high symmetry paths in the $k_{z}=\\frac{\\pi}{c}$ plane for $\\vec{n} \\|$ [001] and $\\vec{n} \\|$ [010], respectively. For $\\vec{n} \\|[001]$, there are three four-fold degenerate crossings points: at $E=-0.071 \\mathrm{eV}$ along the Z-U line, at $E=0.234 \\mathrm{eV}$ along the $\\mathrm{T}-\\mathrm{Z}$ line, and at $E=0.192 \\mathrm{eV}$ along the Z-R line (indicated by arrows in Fig. 2(c)). These crossings are protected by the glide symmetry $g_{z}=$ $\\left\\{M_{z} \\mid(1 / 2,0,1 / 2)\\right\\}[34]$, leading to a loop-like Dirac nodal line in the $k_{z}=\\frac{\\pi}{c}$ plane surrounding the Z point (Fig. 2(e)). This Dirac nodal line is dispersive covering a wide energy window ranging from $E \\approx-0.07 \\mathrm{eV}$ to $E \\approx 0.45 \\mathrm{eV}$.\n\nReorientation of the Néel vector breaks the $g_{z}$ symmetry (Table S1) and opens an energy gap along the Dirac nodal line, as seen from Figs. 2(d,f) for $\\vec{n} \\|[010]$. Although the gaps at the crossing points along the $\\mathrm{Z}-\\mathrm{U}$ and $\\mathrm{T}-\\mathrm{Z}$ directions are relatively small (a few meV), along the Z-R direction the gap exceeds 30 meV (Fig. 2(d)). We find that along the Dirac nodal line shown in Fig. 2(f), the gap varies from about $1 \\mathrm{meV}$ to $45 \\mathrm{meV}$ and is about $20 \\mathrm{meV}$ at the Fermi energy. Thus, we conclude that $\\mathrm{MnPd}_{2}$ exhibits the sought material properties: it has the required symmetry to support the Néel spin-orbit torque and holds a dispersive Dirac nodal line across the Fermi energy, which is gapped by the reorientation of the Néel vector.\n\nAlong with the electronic structure of $\\mathrm{MnPd}_{2}$, the Néel vector controls its spin-dependent transport properties, such as the spin Hall effect [35]. Below we calculate the spin Hall conductivity of $\\mathrm{MnPd}_{2}$, and show that it is strongly affected to the orientation of the Néel vector.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_77a765fcab6029c666b4g-4_246_958_164_786}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_77a765fcab6029c666b4g-4_252_588_776_1349}\n\\end{center}\n\nd\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_77a765fcab6029c666b4g-4_584_945_782_1365}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_77a765fcab6029c666b4g-4_257_583_1386_1931}\n\\end{center}\n\n$\\mathbf{f}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_77a765fcab6029c666b4g-4_568_928_1422_1928}\n\\end{center}\n\nFIG. 2. Néel vector controlled Dirac nodal line in $\\mathrm{MnPd}_{2}$. (a) Crystal structure of $\\mathrm{MnPd}_{2}$. Two magnetic sublattices $\\mathrm{Mn}_{\\mathrm{A}}$ and $\\mathrm{Mn}_{\\mathrm{B}}$ are connected by the $P T$ symmetry. Red arrows indicate the Mn magnetic moments. (b) Schematic of the glide $g_{z}$ symmetry for $\\vec{n} \\|$ [001], which connects two Mn atoms in the same sublattice via mirror reflection $M_{z}$ followed by translation $\\left(\\frac{1}{2}, 0,1 / 2\\right)$ (indicated by the black dashed lines). (c, d) Band structure of $\\mathrm{MnPd}_{2}$ in the $k_{z}=\\frac{\\pi}{c}$ plane for $\\vec{n} \\|$ [001] (c) and $\\vec{n} \\|$ [010] (d). The two bands forming the Dirac nodal line are indicated by dark red color. Arrows in (c) indicate the symmetry protected Dirac band crossings. (e, f) Energy dispersions of the two crossing bands in the $k_{z}=\\frac{\\pi}{c}$ plane for $\\vec{n} \\|$ [001] (e) and $\\vec{n} \\|$ [010] (f). The Dirac nodal line and its projection to the $k_{z}=\\frac{\\pi}{c}$ plane are shown by the purple and red lines, respectively.\n\nThe spin Hall conductivity is given by [35]\n\n\\[\n\\begin{gathered}\n\\sigma_{i j}^{k}=\\frac{e^{2}}{\\hbar} \\int \\frac{d^{3} \\vec{k}}{(2 \\pi)^{3}} \\sum_{n} f_{n \\vec{k}} \\Omega_{n, i j}^{k}(\\vec{k}), \\\\\n\\Omega_{n, i j}^{k}(\\vec{k})=-2 \\operatorname{Im} \\sum_{n^{\\prime} \\neq n} \\frac{\\left\\langle n \\vec{k}\\left|J_{i}^{k}\\right| n^{\\prime} \\vec{k}\\right\\rangle\\left\\langle n^{\\prime} \\vec{k}\\left|v_{j}\\right| n \\vec{k}\\right\\rangle}{\\left(E_{n \\vec{k}}-E_{n^{\\prime} \\vec{k}}\\right)^{2}},\n\\end{gathered}\n\\]\n\nwhere $f_{n \\vec{k}}$ is the Fermi-Dirac distribution function for band $n$ and wave vector $\\vec{k}, \\Omega_{n, i j}^{k}(\\vec{k})$ is the spin Berry curvature, $J_{i}^{k}=$ $\\frac{1}{2}\\left\\{v_{i}, s_{k}\\right\\}$ is the spin-current operator, $v_{i}$ and $s_{k}$ are velocity and spin operators, respectively, and $i, j, k=x, y, z$.\n\nThe calculated spin Hall conductivities of $\\operatorname{MnPd}_{2}$ for $\\vec{n} \\|$ [001] and $\\vec{n} \\|$ [010] are given in Table 1. Overall, we find that the predicted magnitude of the spin Hall conductivity in $\\mathrm{MnPd}_{2}$ is comparable to that in Ta [36,37], a widely used spin current source in spin-orbit torque devices [38], but somewhat smaller than that predicted for Pt [39]. Here, we focus on $\\sigma_{x y}^{z}$ as a representative component of the spin Hall conductivity. The other components are discussed in Supplemental Material [34].\n\nAs follows from Eqs. $(1,2)$, the spin Hall conductivity is strongly affected by band anticrossings, where the spin Berry curvature is significantly enhanced when the energy separations between bands $n$ and $n^{\\prime}$ at a given $\\vec{k}$ point are small. It is TABLE 1. Calculated spin Hall conductivities $\\sigma_{i j}^{k}$ (in units $\\Omega^{-1}$ $\\mathrm{cm}^{-1}$ ) for two different orientations of the Néel vector in orthorhombic $\\operatorname{MnPd}_{2}: \\vec{n} \\|$ [001] and $\\vec{n} \\|$ [010].\n\n\\begin{center}\n\\begin{tabular}{ccccccc}\n\\hline\n$\\vec{n}$ & $\\sigma_{x y}^{z}$ & $\\sigma_{y x}^{z}$ & $\\sigma_{x z}^{y}$ & $\\sigma_{z x}^{y}$ & $\\sigma_{y z}^{x}$ & $\\sigma_{z y}^{x}$ \\\\\n\\hline\n$[001]$ & $155.9$ & $-170.7$ & $-104.4$ & $175.2$ & $120.6$ & $-66.7$ \\\\\n$[010]$ & $232.0$ & $-176.0$ & $-134.9$ & $138.5$ & $112.7$ & $-66.0$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nexpected, therefore, that switching between the degenerate and gapped states of the Dirac band can lead to a notable change in the spin Hall conductivity, even if such a switchable Dirac point or a Dirac nodal line is buried behind trivial Fermi surfaces $[40,41]$\n\nIn Figs. 3(a,b), we compare the calculated spin Berry curvature $\\Omega_{x y}^{z}$ in the $k_{z}=\\frac{\\pi}{c}$ plane at $E=E_{F}$ for $\\vec{n} \\|[001]$ and $\\vec{n} \\|[010]$. We find that while $\\Omega_{x y}^{z}$ is small for $\\vec{n} \\|$ [001] in the whole $k_{z}=\\frac{\\pi}{c}$ plane (Fig. 3(a)), it exhibits a notable peak for $\\vec{n} \\|$ [010] (Fig. 3(b)). Such a sharp peak appears at different energies and is associated with the Dirac nodal line. As seen from Fig. 3 (c), at the points where the nodal line crosses an equi-energy plane the spin Berry curvature is strongly enhanced (as is indicated by the color contrast in Fig. 3(c)). Such a sizable change in the spin Berry curvature affects the spin Hall conductivity. As is evident from Fig. 3(d), within the energy\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_77a765fcab6029c666b4g-5_255_855_129_1039}\n\nFIG. 3. Néel vector control of the spin Hall effect. (a, b) Calculated spin Berry curvature $\\Omega_{x y}^{z}$ in the $k_{z}=\\frac{\\pi}{c}$ plane at $E=E_{\\mathrm{F}}$ for $\\vec{n} \\|$ [001] (a) and $\\vec{n} \\|$ [010] (b). (c) The color maps of $\\Omega_{x y}^{z}$ in the $k_{z}=\\frac{\\pi}{c}$ planes at two different energies $E=E_{\\mathrm{F}}$ and $E=E_{\\mathrm{F}}+0.2 \\mathrm{eV}$ for $\\vec{n} \\|$ [010]. Solid purple line represents the nodal line. (d) Spin Hall conductivity $\\sigma_{x y}^{Z}$ as a function of energy for $\\vec{n} \\|$ [001] (blue line) and $\\vec{n} \\|[010]$ (red line).\n\nwindow corresponding to the Dirac nodal line, $\\sigma_{x y}^{z}$ is much larger for $\\vec{n} \\|$ [001] than for $\\vec{n} \\|$ [010], which is due to the gap opening along the dispersive Dirac nodal line as the result of the Néel vector reorientation.\n\nRotation of the Néel vector in the (100) plane of $\\mathrm{MnPd}_{2}$ changes the spin Hall conductivity $\\sigma_{x y}^{z}$ in an oscillatory fashion (Figs. 4 $(\\mathrm{a}, \\mathrm{b})$ ). The predicted variation of $\\sigma_{x y}^{z}$, reaching the maximum value of about $50 \\%$, can be used to experimentally detect the effect of the Néel spin-orbit torque on the Néel vector in $\\mathrm{MnPd}_{2}$, as discussed below.\n\nWe note that using anisotropic magnetoresistance [6] to detect the effect is problematic due to the uniaxial magnetocrystalline anisotropy of $\\mathrm{MnPd}_{2}$ causing the $\\vec{n} \\|$ [010] state to have lower energy than the $\\vec{n} \\|$ [001] state. As a result, affecting the Néel vector can only be produced under conditions of a large steady charge current $\\left(\\sim 10^{8}-10^{9} \\mathrm{~A} / \\mathrm{cm}^{2}\\right)$ generating the Néel spin-orbit torque. Switching off the charge current leads to the relaxation of the Néel vector back to the equilibrium $\\vec{n} \\|$ [010] direction. This is different from tetragonal CuMnAs [12], which exhibits the bi-axial anisotropy, and thus the Néel vector remains stable after its $90^{\\circ}$ rotation by the Néel spin-orbit torque and then turning off the charge current.\n\nThe spin Hall conductivity under the influence of the Néel vector reorientation can be measured using a spin-orbit torque device shown in Fig. 4c. Here a ferromagnetic layer is deposited on top of the $\\mathrm{MnPd}_{2}$ (100) surface, forming a $\\mathrm{MnPd}_{2} /$ ferromagnet bilayer. Charge current $J_{c}$ along the [010] direction is driven by an external source to reorient the Néel vector from the easy [010] axis towards the [001] direction. At\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_77a765fcab6029c666b4g-5_272_628_1122_1960}\n\nc\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_77a765fcab6029c666b4g-5_618_971_1207_1872}\n\\end{center}\n\nFIG. 4. Angular dependent spin Hall effect and its detection. (a) Reorientation of the Néel vector with angle $\\phi$ in the (100) plane relative to its equilibrium [010] direction. (b) Spin Hall conductivity $\\sigma_{x y}^{z}$ as a function of angle $\\phi$. Solid line is guide for eye. (c) Schematic of the spin-orbit torque device representing a ferromagnetic layer deposited on $\\mathrm{MnPd}_{2}$. The Néel vector in $\\mathrm{MnPd}_{2}$ is controlled by charge current $J_{\\mathrm{c}}$ producing the Néel spin-orbit torque. Spin Hall current $J_{s}$ driven by $J_{c}$ generates torque $\\tau$ on magnetization $M$ of the ferromagnet which depends on the Néel vector orientation.\n\nthe same time, the charge current $J_{c}$ generates spin Hall current $J_{s}$ flowing in the [100] direction and carrying a spin polarization along the [001] direction. This spin current has conductivity $\\sigma_{x y}^{z}$ which depends of the orientation of the Néel vector, according to Fig. 4(b). The spin current $J_{s}$ enters the ferromagnetic layer and exerts spin-Hall torque $\\tau$ on magnetization $M$ of the ferromagnetic layer. When the charge current density is small, the spin Hall conductivity is constant corresponding to $\\phi=0$. When the current density becomes sufficiently large, the Néel spin-orbit torque reorients the Néel vector away from its equilibrium [010] direction and the spin Hall conductivity $\\sigma_{x y}^{z}$ decreases. Since the sizable change of $\\sigma_{x y}^{z}$ can be obtained even with a small tilting of the Néel vector (Fig. 4b), a moderate charge current is sufficient to confirm our prediction. This variation in the spin Hall conductivity can be detected by various standard techniques such as the spin-torque ferromagnetic resonance (ST-FMR) [42], the magneto-optical Kerr effect (MOKE) [43], and the second-harmonic Hall effect [44].\n\nIn a similar way, the Néel vector control of the other components of the spin Hall conductivity listed in Table 1 can be measured using the appropriate design of the spin-orbit torque device. The proposed approach represents a new way to electrically control the spin Hall conductivity in-situ. It is different from the recent approaches to tune the spin Hall effect by changing the scattering center density [ 45,46$]$, varying the chemical composition [47], or ionic gating [48].\n\nThe predicted strong dependence of the spin Hall conductivity on the Néel vector is expected to have non-trivial implications for the dynamics of topological textures, such as domain walls or skyrmions [49,50]. This dependence can also be reflected in the dynamics of AFM domain walls under moderate spin-orbit torques [51]. Reversible switching of the Néel vector may be realized using ferroelastic strain from a piezoelectric substrate [52].\n\nOverall, we have demonstrated that $\\mathrm{MnPd}_{2}$ is a promising material candidate for topological antiferromagnetic spintronics. On one hand, this material has the required magnetic group symmetry to support the Néel spin-orbit torque, which allows the reorientation of the Néel vector. On the other hand, $\\mathrm{MnPd}_{2}$ holds a dispersive Dirac nodal line across the Fermi energy. Gap opening and closing along the Dirac nodal line is controlled by\n\n[1] E. Y. Tsymbal and I. Žutić Eds., Spintronics Handbook: Spin Transport and Magnetism, $2^{\\text {nd }}$ edition (CRC press, 2019), in press.\n\n[2] A. H. MacDonald and M. Tsoi, Antiferromagnetic metal spintronics, Philos. Trans. R. Soc. A 369, 3098 (2011).\n\n[3] T. Jungwirth, X. Marti, P. Wadley, and J. Wunderlich, Antiferromagnetic spintronics, Nat. Nanotech. 11, 231 (2016).\n\n[4] V. Baltz, A. Manchon, M. Tsoi, T. Moriyama, T. Ono, and Y. Tserkovnyak, Antiferromagnetic spintronics, Rev. Mod. Phys. $\\mathbf{9 0}$, 015005 (2018).\n\n[5] T. Jungwirth, J. Sinova, A. Manchon, X. Marti, J. Wunderlich, and C. Felser, The multiple directions of antiferromagnetic spintronics, Nat. Phys. 14, 200 (2018).\n\n[6] P. Wadley, B. Howells, J. Železný, C. Andrews, V. Hills, R. P. Campion, V. Novák, K. Olejník, F. Maccherozzi, S. S. Dhesi, S. Y. Martin, T. Wagner, J. Wunderlich, F. Freimuth, Y. Mokrousov, J. Kuneš, J. S. Chauhan, M. J. Grzybowski, A. W. Rushforth, K. W. Edmonds, B. L. Gallagher, and T. Jungwirth, Electrical switching of an antiferromagnet, Science 351, 587(2016).\n\n[7] V. M. Edelstein, Spin polarization of conduction electrons induced by electric current in two-dimensional asymmetric electron systems, Solid State Commun. 73, 233 (1990).\n\n[8] A. Manchon and S. Zhang, Theory of nonequilibrium intrinsic spin torque in a single nanomagnet, Phys. Rev. B 78, 212405 (2008).\n\n[9] A. Chernyshov, M. Overby, X. Liu, J. K. Furdyna, Y. LyandaGeller, and L. P. Rokhinson, Evidence for reversible control of magnetization in a ferromagnetic material by means of spin-orbit magnetic field, Nat. Phys. 5, 656 (2009).\n\n[10] I. M. Miron, K. Garello, G. Gaudin, P.-J. Zermatten, M. V. Costache, S. Auffret, S. Bandiera, B. Rodmacq, A. Schuhl, and P. Gambardella, Perpendicular switching of a single ferromagnetic layer induced by in-plane current injection, Nature 476, 189 (2011).\n\n[11] P. Gambardella and I. M. Miron, Current-induced spin-orbit torques, Phil. Trans. R. Soc. A 369, 3175 (2011).\n\n[12] J. Železný, H. Gao, K. Výborný, J. Zemen, J. Mašek, A. Manchon, J. Wunderlich, J. Sinova, and T. Jungwirth, Relativistic Néelorder fields induced by electrical current in antiferromagnets, Phys. Rev. Lett. 113, 157201 (2014).\n\n[13] J. Železný, H. Gao, A. Manchon, F. Freimuth, Y. Mokrousov, J. Zemen, J. Mašek, J. Sinova, and T. Jungwirth, Spin-orbit torques the orientation of the Néel vector, which changes the spin Hall conductivity. The latter can be detected by standard techniques using the proposed spin-orbit torque device. We hope that our theoretical predictions will stimulate the experimentalists to explore the unique properties of $\\mathrm{MnPd}_{2}$.\n\nAcknowledgments We thank Tianxiang Nan and Mark Rzchowski for helpful discussions. This work was supported by the National Science Foundation (NSF) through the Nebraska MRSEC program (grant DMR-1420645) and the DMREF program (grant DMR-1629270). S.-H.Z thanks the support of National Science Foundation of China (NSFC Grants No. 11504018). Computations were performed at the University of Nebraska Holland Computing Center.\n\n\\begin{itemize}\n  \\item \\href{mailto:dfshao@unl.edu}{dfshao@unl.edu}\n\\end{itemize}\n\n† \\href{mailto:tsymbal@unl.edu}{tsymbal@unl.edu}\n\nin locally and globally noncentrosymmetric crystals: Antiferromagnets and ferromagnets, Phys. Rev. B 95, 014403 (2017).\n\n[14] S. Y. Bodnar, L. Šmejkal, I. Turek, T. Jungwirth, O. Gomonay, J. Sinova, A. A. Sapozhnik, H.-J. Elmers, M. Kläui, and M. Jourdan, Writing and reading antiferromagnetic $\\mathrm{Mn}_{2} \\mathrm{Au}$ by Néel spin-orbit torques and large anisotropic magnetoresistance, Nat. Commun. 9 , 348 (2018).\n\n[15] K. Olejník, V. Schuler, X. Marti, V. Novák, Z. Kašpar, P. Wadley, R. P. Campion, K. W. Edmonds, B. L. Gallagher, J. Garces, M. Baumgartner, P. Gambardella, and T. Jungwirth, Antiferromagnetic CuMnAs multi-level memory cell with microelectronic compatibility, Nat. Сотmиn. 8, 15434 (2017).\n\n[16] B. Keimer and J. E. Moore, The physics of quantum materials, Nat. Phys. 13, 1045 (2017).\n\n[17] A. C. Neto, F. Guinea, N. M. Peres, K. S. Novoselov, and A. K. Geim, The electronic properties of graphene, Rev. Mod. Phys. 81, 109 (2009).\n\n[18] M. Z. Hasan and C. Kane, Colloquium: Topological insulators, Rev. Mod. Phys. 82, 3045-3067 (2010).\n\n[19] N. P. Armitage, E. J. Mele, and A. Vishwanath, Weyl and Dirac semimetals in three-dimensional solids, Rev. Mod. Phys. 90, 015001 (2018).\n\n[20] B. Bradlyn, J. Cano, Z. Wang, M. G. Vergniory, C. Felser, R. J. Cava, and B. A. Bernevig, Beyond Dirac and Weyl fermions: Unconventional quasiparticles in conventional crystals, Science 353, aaf5037 (2016).\n\n[21] C. Fang, Y. Chen, H.-Y. Kee, and L. Fu, Topological nodal line semimetals with and without spin-orbital coupling, Phys. Rev. B 92, 081201 (2015).\n\n[22] S.-Y. Yang, H. Yang, E. Derunova, S. S. P. Parkin, B. Yan, and M. N. Ali, Symmetry demanded topological nodal-line materials, Adv. Phys. X 3,1414631 (2018).\n\n[23] T. Bzdušek, Q. Wu, A. Rüegg, M. Sigrist, and A. A. Soluyanov, Nodal-chain metals, Nature 538, 75 (2016).\n\n[24] D.-F. Shao, S.-H. Zhang, X. Dang, and E. Y. Tsymbal, Tunable two-dimensional Dirac nodal nets, Phys. Rev. B 98, 161104(R) (2018). [25] D. A. Pesin and A. H. MacDonald, Spintronics and pseudospintronics in graphene and topological insulators, Nat. Mater. 11, 409 (2012).\n\n[26] Y. Fan and K. L. Wang, Spintronics based on topological insulators, SPIN 06, 1640001 (2016).\n\n[27] Y. Fan, P. Upadhyaya, X. Kou, M. Lang, S. Takei, Z. Wang, J. Tang, L. He, L.-T. Chang, M. Montazeri, G. Yu, W. Jiang, T. Nie, R. N. Schwartz, Y. Tserkovnyak, and K. L. Wang, Magnetization switching through giant spin-orbit torque in a magnetically doped topological insulator heterostructure, Nat. Mater. 13, 699 (2014).\n\n[28] A. R. Mellnik, J. S. Lee, A. Richardella, J. L. Grab, P. J. Mintun, M. H. Fischer, A. Vaezi, A. Manchon, E.-A. Kim, N. Samarth, and D. C. Ralph, Spin-transfer torque generated by a topological insulator, Nature 511, 449 (2014).\n\n[29] L. Šmejkal, T. Jungwirth, and J. Sinova, Route towards Dirac and Weyl antiferromagnetic spintronics, Phys. Status Solidi Rapid Res. Lett. 11, 1700044 (2017).\n\n[30] L. Šmejkal, Y. Mokrousov, B. Yan, and A. H. MacDonald, Topological antiferromagnetic spintronics, Nat. Phys. 14, 242 (2018).\n\n[31] L. Šmejkal, J. Železný, J. Sinova, and T. Jungwirth, Electric control of Dirac quasiparticles by spin-orbit torque in an antiferromagnet, Phys. Rev. Lett. 118, 106402 (2017).\n\n[32] P. Tang, Q. Zhou, G. Xu, and S. -C. Zhang, Dirac fermions in antiferromagnetic semimetal, Nat. Phys. 12, 1100 (2016).\n\n[33] G. Kádár, E. Krén, and M. Márton, New antiferromagnetic intermetallic compound in the Mn-Pd system: $\\mathrm{MnPd}_{2}, J$. Phys. Chem. Solids. 33, 212 (1972). References [53-58] are included in the Supplemental Material.\n\n[34] See Supplemental Material for calculation methods, the other details of the electronic structure and spin-Hall conductivity of $\\mathrm{MnPd}_{2}$, the symmetry analysis of the Dirac nodal line, and the influence of strain on the Dirac nodal line. References [53-58] are included in the Supplemental Material.\n\n[35] J. Sinova, S. O. Valenzuela, J. Wunderlich, C. H. Back, and T. Jungwirth, Spin Hall effects. Rev. Mod. Phys. 87, 1213 (2015).\n\n[36] T. Tanaka, H. Kontani, M. Naito, T. Naito, D. S. Hirashima, K. Yamada, and J. Inoue, Intrinsic spin Hall effect and orbital Hall effect in $4 d$ and $5 d$ transition metals, Phys. Rev. B 77, 165117 (2008).\n\n[37] D. Qu, S. Y. Huang, G. Y. Guo, and C. L. Chien, Inverse spin Hall effect in $\\mathrm{Au}_{x} \\mathrm{Ta}_{1-x}$ alloy films, Phys. Rev. B 97, 024402 (2018).\n\n[38] L. Liu, C.-F. Pai, Y. Li, H. W. Tseng, D. C. Ralph, and R. A. Buhrman, Spin-torque switching with the giant spin Hall effect of Tantalum, Science 336, 555 (2012).\n\n[39] G. Y. Guo, S. Murakami, T.-W. Chen, and N. Nagaosa, Intrinsic spin Hall effect in platinum: First-principles calculations, Phys. Rev. Lett. 100, 096401 (2008).\n\n[40] Y. Sun, Y. Zhang, C.-X. Liu, C. Felser, and B. Yan. Dirac nodal lines and induced spin Hall effect in metallic rutile oxides, Phys. Rev. B 95, 235104 (2017).\n\n[41] T. Rauch, H. N. Minh, J. Henk, and I. Mertig, Model for ferromagnetic Weyl and nodal line semimetals: Topological invariants, surface states, anomalous and spin Hall effect, Phys. Rev. B 96, 235103 (2017).\n\n[42] L. Liu, T. Moriyama, D. C. Ralph, and R. A. Buhrman, Spintorque ferromagnetic resonance induced by the spin Hall effect, Phys. Rev. Lett. 106, 036601 (2011).\n\n[43] X. Fan, H. Celik, J. Wu, C. Ni, K. J. Lee, V. O. Lorenz, and J. Q. Xiao, Quantifying interface and bulk contributions to spinorbit torque in magnetic bilayers, Nat. Commun. 5, 3042 (2014). [44] J. Kim, J. Sinha, M. Hayashi, M. Yamanouchi, S. Fukami, T. Suzuki, S. Mitani, and H. Ohno, Layer thickness dependence of the current-induced effective field vector in Ta|CoFeB $\\mid \\mathrm{MgO}$, Nat. Mater. 12, 240 (2013).\n\n[45] M. H. Nguyen, D. C. Ralph, and R. A. Buhrman, Spin torque study of the spin Hall conductivity and spin diffusion length in platinum thin films with varying resistivity, Phys. Rev. Lett. 116, 126601 (2016).\n\n[46] E. Sagasta, Y. Omori, M. Isasa, M. Gradhand, L. E. Hueso, Y. Niimi, Y. Otani, and F. Casanova, Tuning the spin Hall effect of Pt from the moderately dirty to the superclean regime, Phys. Rev. B 94, 060412 (2016).\n\n[47] C. Şahin and M. E. Flatté, Tunable giant spin Hall conductivities in a strong spin-orbit semimetal: $\\mathrm{Bi}_{1-x} \\mathrm{Sb}_{x}$, Phys. Rev. Lett. 114, $107201(2015)$\n\n[48] S. Dushenko, M. Hokazono, K. Nakamura, Y. Ando, T. Shinjo, and M. Shiraishi, Tunable inverse spin Hall effect in nanometerthick platinum films by ionic gating, Nat. Commun. 9, 3118 (2018).\n\n[49] P. P. J. Haazen, E. Murè, J. H. Franken, R. Lavrijsen, H. J. M. Swagten, and B. Koopmans, Domain wall depinning governed by the spin Hall effect, Nature Mater. 12, 299 (2013).\n\n[50] W. Jiang, P. Upadhyaya, W. Zhang, G. Yu, M. B. Jungfleisch, F. Y. Fradin, J. E. Pearson, Y. Tserkovnyak, K. L. Wang, O. Heinonen, S. G. E. te Velthuis, A. Hoffmann, Blowing magnetic skyrmion bubbles, Science 349, 283 (2015).\n\n[51] O. Gomonay, T. Jungwirth, and J. Sinova, High antiferromagnetic domain wall velocity induced by Néel spin-orbit torques, Phys. Rev. Lett. 117, 017202 (2016).\n\n[52] X. Chen, X. Zhou, R. Cheng, C. Song, J. Zhang, Y. Wu, Y. Ba, H. Li, Y. Sun, Y. You, Y. Zhao, and F. Pan, Electric field switching of the uniaxial magnetic anisotropy of an antiferromagnet, arXiv:1812.11868 (2018).\n\n[53] D. Vanderbilt, Soft self-consistent pseudopotentials in a generalized eigenvalue formalism. Phys. Rev. B 41, 7892 (1990).\n\n[54] P. Giannozzi et al., QUANTUM ESPRESSO: a modular and open-source software project for quantum simulations of materials. J. Phys.: Condens. Matter 21, 395502 (2009).\n\n[55] J. P. Perdew, K. Burke, and M. Ernzerhof, Generalized gradient approximation made simple. Phys. Rev. Lett. 77, 3865 (1996).\n\n[56] M. B. Nardelli, F. T. Cerasoli, M. Costa, S. Curtarolo, R. De Gennaro, M. Fornari, L. Liyanage, A. Supka, and H. Wang, PAOFLOW: A utility to construct and operate on ab-initio Hamiltonians from the projections of electronic wavefunctions on atomic brbital bases, including characterization of topological materials. Comp. Mat. Sci. 143, 462 (2017).\n\n[57] L. A. Agapito, A. Ferretti, A. Calzolari, S. Curtarolo, and M. B. Nardelli, Effective and accurate representation of extended Bloch states on finite Hilbert spaces. Phys. Rev. B 88, 165127 (2013).\n\n[58] L. A. Agapito, S. Ismail-Beigi, S. Curtarolo, M. Fornari, and M. B. Nardelli, Accurate tight-binding Hamiltonian matrices from ab-initio calculations: Minimal basis sets. Phys. Rev. B 93, 035104 (2016).\n\n[59] K. Momma and F. Izumi, VESTA 3 for three-dimensional visualization of crystal, volumetric and morphology data. J. Appl. Crystallogr. 44, 1272 (2011).\n\n[60] M. A. Caprio, LevelScheme: A level scheme drawing and scientific figure preparation system for Mathematica. Comp. Phys. Commun. 171, 107 (2005).\n\n\n\\end{document}", "record_id": "2023_09_22_77a765fcab6029c666b4g"}