{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Edge states at nematic domain walls in FeSe films }\n\n\n\\author{Yonghao Yuan, $\\dagger$ Wei Li, ${ }^{*} \\ddagger$ Bin Liu, $\\S$ Peng Deng, ${ }^{\\dagger}$ Zhilin Xu, ${ }^{\\dagger}$ Xi Chen, ${ }^{\\ddagger}$ Canli Song, ${ }^{\\ddagger \\ddagger}$ Lili Wang,\\\\\n$\\ddagger \\ddagger$ Ke He, $\\star \\ddagger$ Gang Xu, ${ }^{\\star}$ Xucun Ma, ${ }^{\\star \\ddagger}$ and Qi-Kun Xue ${ }^{*} \\ddagger$\\\\\n${ }^{\\dagger}$ State Key Laboratory of Low-Dimensional Quantum Physics, Department of Physics, Tsinghua\\\\\nUniversity, Beijing 100084, China\\\\\n$\\ddagger$ Collaborative Innovation Center of Quantum Matter, Beijing 100084, China\\\\\n$\\S$ Wuhan National High Magnetic Field Center \\& School of Physics, Huazhong University of Science\\\\\nand Technology, Wuhan 430074, China}\n\\date{}\n\n\n\\begin{document}\n\\maketitle\n*Wei Li Email: weili83@,\\href{http://tsinghua.edu.cn}{tsinghua.edu.cn} Phone: $+8610-62795838$\n\n\\begin{itemize}\n  \\item Gang Xu Email: \\href{mailto:gangxu@hust.edu.cn}{gangxu@hust.edu.cn} Phone: +8627-87792334-8120\n\\end{itemize}\n\n*Qi-Kun Xue Email: \\href{mailto:qkxue@mail.tsinghua.edu.cn}{qkxue@mail.tsinghua.edu.cn} Phone: +8610-62795618\n\n\\begin{abstract}\n: Quantum spin Hall (QSH) effect is an intriguing phenomenon arising from the helical edge states in two-dimensional topological insulators. We use molecular beam epitaxy (MBE) to prepare FeSe films with atomically sharp nematic domain boundaries, where tensile strains, nematicity suppression and topological band inversion are simultaneously achieved. Using scanning tunneling microscopy (STM), we observe edge states at the Fermi level that spatially distribute as two distinct strips in the vicinity of the domain boundaries. At the endpoint of the boundaries, a bound state at the Fermi level is further observed. The topological origin of the edge states is supported by density functional theory calculations. Our findings not only demonstrate a candidate for QSH states, but also provide a new pathway to realize topological superconductivity in a single-component film.\n\\end{abstract}\n\nKEYWORDS: iron selenide, edge state, domain boundary, scanning tunneling microscopy, QSH FeSe is an intriguing material that can realize superconductivity enhancement, ${ }^{1-4}$ topological non-trivial edge states ${ }^{5,6}$ and topological superconductivity. ${ }^{7-12}$ Chemical potential and lattice strain are two main factors to manipulate the electronic properties and induce those emergent phenomena.\n\nNematicity ${ }^{13}$ defined as rotational symmetry breaking of electronic structures in ironbased superconductors, is an interesting phenomenon that emerges at low temperature. It manifests as electronic anisotropy observed in experiments. ${ }^{14-20}$ For most of the iron-based superconductors, superconductivity arises with the suppression of nematic phase via carrier doping. Nematicity is also suppressed at the boundaries of nematic domains (domain walls), where nematicity is broken due to the overlap of two orthogonal nematic domains. Therefore, domain boundaries provide a good platform to investigate the electronic properties of nematicity-absent states and the emergent phenomena associated with lattice strains, such as topological non-trivial states and superconductivity. ${ }^{5-12}$ However, due to the complexity on both sides of sample preparation and precision measurement, the nematicity suppression on domain boundaries has not yet been reported.\n\nIn single crystals of FeSe, superconductivity coexists with nematicity at low temperature $;^{21,22}$ while in multilayer FeSe film grown on strontium titanate ( $\\left.\\mathrm{FeSe} / \\mathrm{STO}\\right)$, the enhanced nematicity induces stripe-type charge ordering and destroys superconductivity. ${ }^{23}$ The nematic domain boundaries exist over large area of $\\mathrm{FeSe} / \\mathrm{STO},{ }^{23}$ which enables us to study their electronic properties. In our experiments, we grew $\\sim 20$ UC FeSe films on STO substrates by using MBE method and investigated the electronic structures in FeSe films by STM.\n\nThe nematicity of FeSe film can be directly observed in STM topographic image with atomic resolution. Figure 1a shows the Se-terminated surface within a nematic domain. The image of every single Se atom is elongated along the diagonal direction of the Se-Se lattice (that is the direction of underlying Fe-Fe lattice), reflecting the electronic anisotropy (nematicity) in the Fe-plane. The capability to capture the signals of nematicity is realized when one atom or molecule sensitive to orbital component of FeSe is picked up to the STM tip apex. The case is also shown in Figure $1 \\mathrm{~b}$ where two adjacent FeSe nematic domains are separated by a domain boundary. As expected, the orientations of the elongated Se atoms in the two domains are perpendicular to each other. The most striking phenomenon is the recovery of the round shape of Se atoms on the domain boundary (see the schematic orange patches in Figure 1b), thus supporting the absence of nematicity in this area. The STM topographic image here directly records the image shape change of the Se atoms from the nematic region to the nematicity-absent one. The shape evolution occurs within the distance of $2 a_{s e}$, indicating a rather sharp edge between the two regions. Therefore, FeSe film is composed of networks of nematicity-absent domain boundaries and the domains with strong nematicity.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_81b3dfeb3597db5200c5g-03_758_1140_642_1493}\n\\end{center}\n\nFigure 1. The absence of nematicity in the FeSe domain boundary. (a) The atomically resolved STM topographic image of a $20 \\mathrm{UC}$ FeSe film grown on STO substrate $(5 \\mathrm{~nm} \\times$ $5 \\mathrm{~nm}$, set point: $\\left.V_{s}=20 \\mathrm{mV}, I_{t}=0.2 \\mathrm{nA}\\right)$. Se atoms are apparently elongated along the diagonal direction of the Se-Se lattice due to the large strength of nematicity in FeSe film. (b) The elongated Se atoms within the twin domains and the recovered round Se atoms on the boundary $\\left(13 \\mathrm{~nm} \\times 13 \\mathrm{~nm}, V_{s}=20 \\mathrm{mV}, I_{t}=0.2 \\mathrm{nA}\\right)$. The orange patches indicate the apparent shapes of $\\mathrm{Se}$ atoms at the corresponding locations.\n\nThe nematic domain boundaries are shown in Figure $2 \\mathrm{a}$ and $\\mathrm{b}$. The boundaries acquired at $-50 \\mathrm{meV}$ (Figure 2a) and $70 \\mathrm{meV}$ (Figure 2b) are of opposite contrasts. Meanwhile, the crossing points of several domain boundaries (indicated by the orange arrows) is dark in contrast at $-50 \\mathrm{meV}$ and becomes bright at $70 \\mathrm{meV}$. The crossing point corresponds to a dislocation and is related to the defects in the STO substrate. After careful inspection of large amount of domain walls, we find that the number of domain walls terminated at the crossing point is always four (see Figure $2 c$ too), which is probably protected by the system symmetry. ${ }^{24-26}$ Figure $2 \\mathrm{c}$ shows a crossing point of four domain walls in detail, in which the traces of the boundaries are highlighted by the orange dashed lines. The stripes induced by impurities in each domain are visible ${ }^{23}$ (the orientations of the stripes are denoted by the white double-headed arrows). The existence of the stripes reveals the strong nematicity in FeSe domains, and this nematicity is greatly suppressed on those domain boundaries.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_81b3dfeb3597db5200c5g-04_434_900_318_1804}\n\nFigure 2. Nematic domain boundaries in $\\sim 20$ UC FeSe/STO. (a and b) Spatially resolved density-of states maps of the nematic domain boundaries. (a) and (b) exhibit the domain walls with opposite contrasts at $-50 \\mathrm{meV}$ and $70 \\mathrm{meV}$, respectively $\\left(100 \\mathrm{~nm} \\times 100 \\mathrm{~nm}, V_{s}\\right.$ $\\left.=250 \\mathrm{mV}, I_{t}=0.3 \\mathrm{nA}\\right)$. The orange arrows indicate the crossing points of several domain walls. (c) STM topographic image of a FeSe film $\\left(90 \\mathrm{~nm} \\times 90 \\mathrm{~nm}, V_{s}=100 \\mathrm{mV}, I_{t}=50\\right.$ pA). It shows a crossing point of four domain walls and the stripes within each domain. The traces of the domain walls in the vicinity of the crossing point are marked by the orange dashed lines. Note that the domain wall on the right side (marked with white dashed line) gets around rather than terminates at the crossing point, which is more clearly shown in Figure $4 a$ and $b$. The stripes, originating from the large strength of nematicity, are pinned by impurities within the domains. The orientations of those stripes are denoted by the white double-headed arrows.\n\nWe now focus on the electronic structures of the domain boundaries. Scanning tunneling spectroscopy (STS, or $\\mathrm{d} / / \\mathrm{d} V$ spectrum) measures the local quasiparticle density of states (DOS) of the sample surface. Spatially resolved $\\mathrm{d} J / \\mathrm{d} V$ spectra are taken along two traces, across and along the center of a domain boundary in Figure $3 \\mathrm{a}$ (see the dashed line Cut 1 and 2), respectively. Along the domain wall center (Cut 2), large-bias-range $\\mathrm{d} / / \\mathrm{d} V$ spectra (Figure 3c) exhibit high spatial homogeneity with a characteristic peak at $-150 \\mathrm{meV}$. Cut 1 crosses the two kinds of regions, the twin-domains and their boundary (domain wall), where the characteristic peak shifts downwards about $35 \\mathrm{meV}$ from $-150 \\mathrm{meV}$ on the domain wall to $-185 \\mathrm{meV}$ within the domain (Figure 3b). The energy shift of the peaks on the two regions may induce emergent states on the edge. Small-bias-range $\\mathrm{d} I / \\mathrm{d} V$ spectra along Cut 1 in Figure $3 \\mathrm{~d}$ exhibit two distinct peaks at $-10 \\mathrm{meV}$ and $0 \\mathrm{meV}$. Superconductivity is absent in both regions, since no gap feature is observed near the Fermi level $\\left(E_{\\mathrm{F}}\\right)$ in the spectra. The peak at $-10 \\mathrm{meV}$ corresponds to the characteristic energy of the domain wall (See the spectra taken along Cut 2 in Figure 3e), and the DOS map at $-10 \\mathrm{meV}$ (Figure 3f) sketches the contours of the domain wall. The DOS map at $0 \\mathrm{meV}\\left(E_{\\mathrm{F}}\\right.$, see in Figure $3 \\mathrm{~g}$ ) reveals two striped structures, corresponding to the two induced edge states arising from the discrepancy of electronic structures between the two regions (see the orange arrows as reference in Figure $3 \\mathrm{a}, \\mathrm{f}$ and $\\mathrm{g}$ ).\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_81b3dfeb3597db5200c5g-05_842_1866_317_759}\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_81b3dfeb3597db5200c5g-05_861_1362_1301_1821}\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_81b3dfeb3597db5200c5g-05_860_1874_759_1821}\n\nFigure 3. Edge state and electronic properties of the $\\sim 20 \\mathrm{UC} \\mathrm{FeSe} / \\mathrm{STO}$ domain boundaries. (a) Three-dimensional STM topographic image of a domain wall $\\left(10 \\mathrm{~nm} \\times 8 \\mathrm{~nm}, V_{s}=20\\right.$ $\\mathrm{mV}, I_{t}=0.2 \\mathrm{nA}$ ). (b and c) Spatially resolved large-bias-range $\\mathrm{d} / / \\mathrm{d} V$ spectra taken along the dashed lines (Cut 1 and Cut 2) in (a). Spectra are shifted vertically for clarity. Set point: $V_{s}=-300 \\mathrm{mV}, I_{t}=0.2 \\mathrm{nA}$. The characteristic peak shifts upwards $\\sim 35 \\mathrm{meV}$ on the domain wall. (d and e) Spatially resolved small-bias-range $\\mathrm{d} / / \\mathrm{d} V$ spectra taken along the dashed lines in (a), from which two peaks at $0 \\mathrm{meV}$ and $-10 \\mathrm{meV}$ are revealed. Set point: $V_{s}=-25$ $\\mathrm{mV}, I_{t}=0.3 \\mathrm{nA}$. (f and g) Spatially resolved DOS maps of (a) at $-10 \\mathrm{meV}$ and $0 \\mathrm{meV}$, respectively. Edge states are clearly shown in (g). Set point: $V_{s}=-25 \\mathrm{mV}, I_{t}=0.3 \\mathrm{nA}$. Interestingly, another bound state at $E_{\\mathrm{F}}$ is observed at the crossing point of the domain walls. Figure $4 \\mathrm{a}$ and $\\mathrm{b}$ show the DOS maps of a crossing point at $E_{\\mathrm{F}}$ and $-10 \\mathrm{meV}$, respectively. At $E_{\\mathrm{F}}$, an obviously higher DOS (denoted by the white arrow in Figure 4a) appears at the crossing point of four domain walls. The number four may be a topological invariant, as determined by the crystal symmetry of FeSe. The crossing point therefore is a possible topological defect. ${ }^{24,25} \\mathrm{STS}$ (Figure $4 \\mathrm{c}$ ) at the crossing point shows a pronounced peak near $E_{\\mathrm{F}}$, indicating a trapped bound state. The bound state may have different origin from that of the edge state.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_81b3dfeb3597db5200c5g-06_842_1292_320_1800}\n\nFigure 4. Bound state at the crossing point of the domain boundaries. (a and $b$ ) The DOS maps of the crossing point in Figure $1 \\mathrm{c}\\left(15 \\mathrm{~nm} \\times 15 \\mathrm{~nm}, V_{s}=100 \\mathrm{mV}, I_{t}=0.45 \\mathrm{nA}\\right) . \\mathrm{A}$ bound state around $E_{\\mathrm{F}}$ is trapped at the crossing point, marked by the white arrow. (c) $\\mathrm{d} I / \\mathrm{d} V$ spectrum of the crossing point. Set point: $V_{s}=-25 \\mathrm{mV}, I_{t}=0.3 \\mathrm{nA}$.\n\nWe now discuss possible topological origin of the edge state. The discrepancy of the electronic structures on and off the domain boundaries mainly manifests as an energy shift of $35 \\mathrm{meV}$ in STS (Figure 3b). The characteristic peak at $-185 \\mathrm{meV}$ originates from a rather flat band (corresponding to higher DOS) of FeSe around the $\\Gamma$ point below $E_{\\mathrm{F}}$, which is attributed to tunneling to Fe $3 d_{z}{ }^{2}$ orbital $\\left(d_{z}{ }^{2}\\right.$ band). ${ }^{3}$ The position of the $d_{z}{ }^{2}$ band is not sensitive to nematicity, thus local lattice information, such as strain and anionic height, can be determined from the $d_{z}{ }^{2}$ band energy. Bulk FeSe shows a peak at $-220 \\mathrm{meV},{ }^{27}$ corresponding to the original FeSe lattice without strain. Thickness dependent ARPES measurements on FeSe films indicate that the $d_{z}{ }^{2}$ band moves upward with increasing tensile strain. ${ }^{28}$ By comparison with ARPES results, the STS peak at $-185 \\mathrm{meV}$ in the domain region corresponds to FeSe film with a thickness of 20 unit cells (UCs), consistent with the estimated value from the film growth rate. The position of the $d_{z}{ }^{2}$ band at $-150$ $\\mathrm{meV}$ at the domain wall region (Figure $3 \\mathrm{~b}$ and c), even shallower than that in $4 \\mathrm{UC}$ $\\mathrm{FeSe} / \\mathrm{STO},{ }^{28}$ indicates that its in-plane lattice constant is comparable to that of the STO substrate $(0.39 \\mathrm{~nm})$. Such lattice expansion is confirmed by our density functional theory (DFT) calculations, in which the $d_{z}{ }^{2}$ band at $-150 \\mathrm{meV}$ corresponds to an in-plane lattice constant of $0.386 \\mathrm{~nm}$ (Supporting Information, Section 1 and Figure S1). Therefore, comparing with that in the nematic domain, the in-plane lattice of the domain boundary is strongly elongated.\n\nTopological non-trivial state is realized in such region with large lattice expansion through the band inversion at the $\\mathrm{M}$ point, which is predicted by an analytic approach combined with symmetry analysis of FeSe film. ${ }^{5}$ The mechanism relies on the intra- $d_{x y}$ and $d_{y z}$ bands crossing and the on-site spin-orbit coupling (SOC) between the electrons of $d_{x z}$ and $d_{y z}$ orbitals, leading to hybridized gap opening at the M point. ${ }^{5,9}$ The hopping between $d_{x y}$ and $d_{y z}$ orbitals is sensitive to the in-plane lattice distortion. The in-plane lattice expansion as well as the decreasing Se height with respect to Fe-plane gives rise to enlarged bandwidth of $d$ orbital bands and hence promotes the band inversion at the M point. Regarding the band structure topology, at the M point the $d_{x z}$ and $d_{y z}$ bands are degenerate due to the absence of nematicity on the domain boundaries, which resembles the suppression of nematicity in monolayer FeSe/STO via carrier doping. ${ }^{3,4}$ Therefore, the two key conditions for realizing topological phase, ${ }^{5}$ tensile strain and absence of nematicity, are both well satisfied at the domain boundaries, making the observed edge and bound states a promising candidate for the topological non-trivial states.\n\nThe topological state discussed above is based on the absence of antiferromagnetism (AFM) in FeSe. However, the checkerboard AFM might develop in the FeSe domain boundaries, since the electronic properties, such as the broken two-fold symmetry and the in-plane lattice expansion, are similar to that in $1 \\mathrm{UC} \\mathrm{FeSe} / \\mathrm{STO},{ }^{6}$ in which a recent study shows experimental evidence for AFM order. ${ }^{29}$\n\nDFT calculations are carried out to study the possible topological origin of the edge states with AFM. For a two-dimensional (2D) film, the topological invariance usually oscillates with the number of layers ${ }^{30,31}$. Surprisingly, the edge states in even and odd layers of FeSe films exhibit similar behaviors in our STM measurements (Supporting Information, Section 3). Our theoretical analysis and DFT calculations provide a possible explanation for such intriguing phenomena (Figure 5 and Supporting Information, Section 2). One new type of topological crystalline insulating phase is found to guarantee the presence and robustness of the edge states on the boundary of even layers FeSe film. The edge states (Figure 5c) in odd FeSe layers are protected by a $2 \\mathrm{D}$ antiferromagnetic $Z_{2}$ invariant, ${ }^{32}$ related to the combined symmetry of time-reversal and primitive-lattice-translation; While the edge states (Figure 5d) in even layers are protected by the time-reversal related glide mirror symmetry. The distinction here resembles the important difference between $2 \\mathrm{D} Z_{2}$ topological insulator ${ }^{33-37}$ and topological crystalline insulator. ${ }^{38,39}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_81b3dfeb3597db5200c5g-08_766_1825_474_1624}\n\\end{center}\n\nFigure 5. Band structures and topological edge states in odd and even FeSe layers. (a and b) The calculated band structures of monolayer and bilayer FeSe films, respectively. The red diamonds denote the projection of the $d_{y z} / d_{x z}$ orbitals of Fe atoms and the blue circles denote the $d_{z}{ }^{2}$ orbital. (c and d) The calculated edge states along (110) direction on the boundary of monolayer and bilayer FeSe films, respectively. The edge state crossing at the $\\bar{\\Gamma}$ point in (c) is protected by the combined symmetry of time-reversal and primitivelattice-translation, while the robustness of the edge state crossing in (d) is protected by the time-reversal related glide mirror symmetry. Although the origin for the two proposed types of topological edge states are different, it is hard to distinguish between them by STM results. The increased thickness of FeSe layers may induce band dispersion along $z$ direction, giving rise to deceased gap sizes. However, the topological edge states can still be protected by the symmetry discussed above. More discussions are in Supporting Information, Section 2.\n\nIn addition, the characteristic energies of the edge state and bound state are both at $E_{\\mathrm{F}}$, indicating that the chemical potential here is located in the center of the hybridized gap. Therefore, introducing domain boundaries in a superconducting FeSe film can be a good approach to realizing topological superconductivity, and its advantage is that the complexity to combine several compounds is avoided so that all the topological features could be achieved in a single-component material.\n\nSample Growth. FeSe films were grown on Nb-doped ( $0.05 \\%$ wt) $\\mathrm{SrTiO}_{3}(100)$. STO was degassed at $500{ }^{\\circ} \\mathrm{C}$ for several hours and subsequently annealed at $1200{ }^{\\circ} \\mathrm{C}$ for $20 \\mathrm{~min}$ to obtain the atomic flat $\\mathrm{TiO}_{2}$-terminated surface. To prepare the FeSe film, high purity $\\mathrm{Fe}$ ( $99.995 \\%)$ and Se ( $99.9999 \\%)$ were evaporated from two standard Knudsen cells and the substrates were kept at $380^{\\circ} \\mathrm{C}$. The growth was carried out under Se-rich condition with a nominal $\\mathrm{Se} / \\mathrm{Fe}$ flux ratio of $\\sim 15$. The as-grown FeSe films were annealed at $400{ }^{\\circ} \\mathrm{C}$ for several hours to remove the excess Se. The density of excess Se on the surface is checked by STM. Thickness of the films in this study are $\\sim 20$ UC.\n\nSTM. In-situ STM experiments were conducted in an ultra-high vacuum (UHV) low temperature ( $0.4 \\mathrm{~K})$ STM equipped with a MBE chamber for sample growth (Unisoku). A polycrystalline PtIr STM tip was used and characterized on Ag island before STM experiments.\n\nCalculations. The DFT calculations were carried out by using the full-potential linearizedaugmented plane-wave (FP-LAPW) method implemented in WIEN2K package. ${ }^{40}$ PerdewBurke-Ernzerhof $(\\mathrm{PBE})^{41}$ type of generalized gradient approximation $+$ Hubbard $\\mathrm{U}$ $(\\mathrm{GGA}+\\mathrm{U})$ approach $^{42}$ with $\\mathrm{U}=1.0 \\mathrm{eV}(\\mathrm{J}=0.2 \\mathrm{eV})$ on the $\\mathrm{Fe}$ 's $3 d$ orbitals was used to treat the exchange and correlation potential. Spin-orbit coupling (SOC) was included as a second variational step self-consistently. The radii of the muffin-tin spheres $\\left(R_{M T}\\right)$ were chosen as $2.27$ a.u. and $2.16$ a.u. for Fe and Se, respectively. The cutoff of the wave functions $K_{\\max } \\times$ $R_{M T}=7$, and $15 \\times 15 \\times 2$ k-point mesh was used in the self-consistent calculations. Maximally localized Wannier functions (MLWFs) ${ }^{43}$ for the $3 d$ orbitals of $\\mathrm{Fe}$ and the $4 p$ orbitals of $\\mathrm{Se}$ were generated to construct the tight-binding (TB) Hamiltonians of semi-infinite sample and calculate the edge states iteratively. ${ }^{44,45}$\n\nData Availability. Data will be available from the corresponding authors on request.\n\n\\section{ASSOCIATED CONTENT}\n\\section{Supporting Information}\n\\begin{enumerate}\n  \\item The evolution of the $d_{z}^{2}$ band with increasing in-plane lattice constant of FeSe.\n\n  \\item Topological edge states in odd and even FeSe layers.\n\n  \\item Experimental evidence of edge states in odd and even FeSe layers.\n\n\\end{enumerate}\n\n\\section{AUTHOR INFORMATION}\n\\section{Corresponding Authors}\n*Wei Li Email: weili83@,\\href{http://tsinghua.edu.cn}{tsinghua.edu.cn} Phone: +8610-62795838\n\n*GGang Xu Email: \\href{mailto:gangxu@hust.edu.cn}{gangxu@hust.edu.cn} Phone: +8627-87792334-8120\n\n*Qi-Kun Xue Email: \\href{mailto:qkxue@mail.tsinghua.edu.cn}{qkxue@mail.tsinghua.edu.cn} Phone: +8610-62795618\n\n\\section{Author Contributions}\nW.L. and Q-K.X. designed and coordinated the experiments; Y.Y., W.L., P.D. and Z.X. carried out the STM experiments; Y.Y., and W.L. grew the samples; B.L. and G.X. performed theoretical calculations. X.C., X.M., K.H., L.W. and C.S. provided discussion about the data. W.L. wrote the manuscript with comments from all authors.\n\n\\section{Notes}\nThe authors declare no competing financial interest.\n\n\\section{ACKNOWLEDGEMENTS}\nWe thank Y. Zhang, J. P. Hu, H. Yao and Z. Liu for helpful discussions. The experimental work was supported by the National Science Foundation (No. 11674191), Ministry of Science and Technology of China (No. 2016YFA0301002) and the Beijing Advanced Innovation Center for Future Chip (ICFC). W. Li was also supported by Tsinghua University Initiative Scientific Research Program, Beijing Young Talents Plan and the National Thousand-Young-Talents Program.\n\n\\section{REFERENCES}\n(1) Wang, Q.-Y.; Li, Z.; Zhang, W.-H.; Zhang, Z.-C.; Zhang, J.-S.; Li, W.; Ding, H.; Ou, Y.-B.; Deng, P.; Chang, K.; Wen, J.; Song, C.-L.; He, K.; Jia, J.-F.; Ji, S.-H.; Wang, Y.-Y.; Wang, L.-L.; Chen, X.; Ma, X.-C.; Xue, Q.-K. Interface-induced high-temperature superconductivity in single unit-cell FeSe films on $\\mathrm{SrTiO}_{3}$. Chin. Phys. Lett. 2012, 29, 037402.\n\n(2) Liu, D.; Zhang, W.; Mou, D.; He, J.; Ou, Y. B.; Wang, Q. Y.; Li, Z.; Wang, L.; Zhao, L.; He, S.; Peng, Y.; Liu, X.; Chen, C.; Yu, L.; Liu, G.; Dong, X.; Zhang, J.; Chen, C.; Xu, Z.; Hu, J.; Chen, X.; Ma, X.; Xue, Q.; Zhou, X. J. Electronic origin of high-temperature superconductivity in single-layer FeSe superconductor. Nat. Commun. 2012, 3, 931.\n\n(3) Tan, S.; Zhang, Y.; Xia, M.; Ye, Z.; Chen, F.; Xie, X.; Peng, R.; Xu, D.; Fan, Q.; Xu, H.; Jiang, J.; Zhang, T.; Lai, X.; Xiang, T.; Hu, J.; Xie, B.; Feng, D. Interface-induced superconductivity and strain-dependent spin density waves in $\\mathrm{FeSe}^{-} \\mathrm{SrTiO}_{3}$ thin films. Nat. Mater. 2013, 12, 634.\n\n(4) Lee, J. J.; Schmitt, F. T.; Moore, R. G.; Johnston, S.; Cui, Y. T.; Li, W.; Yi, M.; Liu, Z. K.; Hashimoto, M.; Zhang, Y.; Lu, D. H.; Devereaux, T. P.; Lee, D. H.; Shen, Z. X. Interfacial mode coupling as the origin of the enhancement of $T_{\\mathrm{C}}$ in $\\mathrm{FeSe}$ films on $\\mathrm{SrTiO}_{3}$. Nature 2014, 515, 245.\n\n(5) Hao, N.; Hu, J. Topological phases in the single-layer FeSe. Phys. Rev. X 2014, 4, 031053.\n\n(6) Wang, Z. F.; Zhang, H.; Liu, D.; Liu, C.; Tang, C.; Song, C.; Zhong, Y.; Peng, J.; Li, F.; Nie, C.; Wang, L.; Zhou, X. J.; Ma, X.; Xue, Q. K.; Liu, F. Topological edge states in a high-temperature superconductor $\\mathrm{FeSe} / \\mathrm{SrTiO}_{3}(001)$ film. Nat. Mater. 2016, 15, 968.\n\n(7) Wang, Z.; Zhang, P.; Xu, G.; Zeng, L. K.; Miao, H.; Xu, X.; Qian, T.; Weng, H.; Richard, P.; Fedorov, A. V.; Ding, H.; Dai, X.; Fang, Z. Topological nature of theFeSe ${ }_{0.5} \\mathrm{Te}_{0.5}$ superconductor. Phys. Rev. B 2015, $92,115119$.\n\n(8) Wu, X.; Qin, S.; Liang, Y.; Fan, H.; Hu, J. Topological characters in $\\mathrm{Fe}\\left(\\mathrm{Te}_{1-\\mathrm{x}} \\mathrm{Se}_{\\mathrm{x}}\\right)$ thin films. Phys. Rev. B 2016, 93, 115129.\n\n(9) Hao, N.; Shen, S.-Q. Topological superconducting states in monolayer $\\mathrm{FeSe} / \\mathrm{SrTiO}_{3}$. Phys. Rev. B 2015, 92, 165104.\n\n(10)Xu, G.; Lian, B.; Tang, P.; Qi, X. L.; Zhang, S. C. Topological superconductivity on the surface of Fe-based superconductors. Phys. Rev. Lett. 2016, 117, 047001.\n\n(11) Zhang, P.; Yaji, K.; Hashimoto, T.; Ota, Y.; Kondo, T.; Okazaki, K.; Wang, Z.; Wen, J.; Gu, G. D.; Ding, H.; Shin, S. Observation of topological superconductivity on the surface of an iron-based superconductor. Science 2018, 360, 182.\n\n(12) Wang, D.; Kong, L.; Fan, P.; Chen, H.; Zhu, S.; Liu, W.; Cao, L.; Sun, Y.; Du, S.; Schneeloch, J. Evidence for Majorana bound state in an iron-based superconductor. 2017, arXiv:1706.06074. (13)Kivelson, S. A.; Fradkin, E.; Emery, V. J. Electronic liquid-crystal phases of a doped Mott insulator. Nature 1998, 393, 550.\n\n(14)Zhao, J.; Adroja, D. T.; Yao, D.-X.; Bewley, R.; Li, S.; Wang, X. F.; Wu, G.; Chen, X. H.; Hu, J.; Dai, P. Spin waves and magnetic exchange interactions in $\\mathrm{CaFe}_{2} \\mathrm{As}_{2}$. Nat. Phys. $2009,5,555$.\n\n(15)Chu, J.-H.; Analytis, J. G.; De Greve, K.; McMahon, P. L.; Islam, Z.; Yamamoto, Y.; Fisher, I. R. In-plane resistivity anisotropy in an underdoped iron arsenide superconductor. Science $\\mathbf{2 0 1 0}, 329,824$.\n\n(16)Chuang, T.-M.; Allan, M. P.; Lee, J.; Xie, Y.; Ni, N.; Bud'ko, S. L.; Boebinger, G. S.; Canfield, P. C.; Davis, J. C. Nematic electronic structure in the \"parent\" state of the ironbased superconductor $\\mathrm{Ca}\\left(\\mathrm{Fe}_{1-\\mathrm{x}} \\mathrm{Co}_{\\mathrm{x}}\\right)_{2} \\mathrm{As}_{2}$. Science 2010, 327, 181 .\n\n(17)Kasahara, S.; Shi, H. J.; Hashimoto, K.; Tonegawa, S.; Mizukami, Y.; Shibauchi, T.; Sugimoto, K.; Fukuda, T.; Terashima, T.; Nevidomskyy, A. H.; Matsuda, Y. Electronic nematicity above the structural and superconducting transition in $\\mathrm{BaFe}_{2}\\left(\\mathrm{As}_{1-\\mathrm{x}} \\mathrm{P}_{\\mathrm{x}}\\right)_{2}$. Nature 2012, 486, 382.\n\n(18) Yi, M.; Lu, D.; Chu, J. H.; Analytis, J. G.; Sorini, A. P.; Kemper, A. F.; Moritz, B.; Mo, S. K.; Moore, R. G.; Hashimoto, M.; Lee, W. S.; Hussain, Z.; Devereaux, T. P.; Fisher, I. R.; Shen, Z. X. Symmetry-breaking orbital anisotropy observed for detwinned $\\mathrm{Ba}\\left(\\mathrm{Fe}_{1-}\\right.$ ${ }_{\\mathrm{x}}\\left(\\mathrm{Co}_{\\mathrm{x}}\\right)_{2} \\mathrm{As}_{2}$ above the spin density wave transition. Proc. Natl. Acad. Sci. U.S.A. 2011, 108, 6878.\n\n(19)Rosenthal, E. P.; Andrade, E. F.; Arguello, C. J.; Fernandes, R. M.; Xing, L. Y.; Wang, X. C.; Jin, C. Q.; Millis, A. J.; Pasupathy, A. N. Visualization of electron nematicity and unidirectional antiferroic fluctuations at high temperatures in NaFeAs. Nat. Phys. 2014, 10, 225.\n\n(20)Huang, D.; Webb, T. A.; Fang, S.; Song, C.-L.; Chang, C.-Z.; Moodera, J. S.; Kaxiras,\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_81b3dfeb3597db5200c5g-12_1666_1728_305_1820}\\\\\nB 2016, 93, 125129.\n\n(21)Hsu, F.-C.; Luo, J.-Y.; Yeh, K.-W.; Chen, T.-K.; Huang, T.-W.; Wu, P. M.; Lee, Y.-C.; Huang, Y.-L.; Chu, Y.-Y.; Yan, D.-C.; Wu, M.-K. Superconductivity in the PbO-type structure $\\alpha$-FeSe. Proc. Natl. Acad. Sci. U.S.A. 2008, 105, 14262.\n\n(22)Nakayama, K.; Miyata, Y.; Phan, G. N.; Sato, T.; Tanabe, Y.; Urata, T.; Tanigaki, K.; Takahashi, T. Reconstruction of band structure induced by electronic nematicity in an FeSe superconductor. Phys. Rev. Lett. 2014, 113, 237001.\n\n(23)Li, W.; Zhang, Y.; Deng, P.; Xu, Z.; Mo, S. K.; Yi, M.; Ding, H.; Hashimoto, M.; Moore, R. G.; Lu, D. H.; Chen, X.; Shen, Z. X.; Xue, Q.-K. Stripes developed at the strong limit of nematicity in FeSe film. Nat. Phys. 2017, 13, 957.\n\n(24)Chaikin, P. M.; Lubensky, T. C., Principles of condensed matter physics. Cambridge University Press: Cambridge, U.K., 1995.\n\n(25)Mermin, N. D. The topological theory of defects in ordered media. Rev. Mod. Phys. 1979, $51,591$.\n\n(26)Choi, T.; Horibe, Y.; Yi, H. T.; Choi, Y. J.; Wu, W.; Cheong, S. W. Insulating interlocked ferroelectric and structural antiphase domain walls in multiferroic $\\mathrm{YMnO}_{3}$. Nat. Mater. 2010, 9, 253.\n\n(27)Song, C.-L.; Wang, Y.-L.; Jiang, Y.-P.; Li, Z.; Wang, L.; He, K.; Chen, X.; Ma, X.-C.; Xue, Q.-K. Molecular-beam epitaxy and robust superconductivity of stoichiometric FeSe crystalline films on bilayer graphene. Phys. Rev. B 2011, 84, 020503(R).\n\n(28) Tan, S. Y.; Fang, Y.; Xie, D. H.; Feng, W.; Wen, C. H. P.; Song, Q.; Chen, Q. Y.; Zhang, W.; Zhang, Y.; Luo, L. Z.; Xie, B. P.; Lai, X. C.; Feng, D. L. Observation of Dirac cone band dispersions in FeSe thin films by photoemission spectroscopy. Phys. Rev. B 2016, 93, 104513.\n\n(29)Zhou, Y.; Miao, L.; Wang, P.; Zhu, F. F.; Jiang, W. X.; Jiang, S. W.; Zhang, Y.; Lei, B.; Chen, X. H.; Ding, H. F.; Zheng, H.; Zhang, W. T.; Jia, J. F.; Qian, D.; Wu, D. Antiferromagnetic order in epitaxial FeSe films on $\\mathrm{SrTiO}_{3}$. Phys. Rev. Lett. 2018, 120, 097001.\n\n(30)Safaei, S.; Galicka, M.; Kacman, P.; Buczko, R. Quantum spin Hall effect in IV-VI topological crystalline insulators. New J. Phys. 2015, 17, 063041.\n\n(31)Daniely, B.; Ernesto Osvaldo, W.; Tome, M. S. Symmetry-dependent topological phase transitions in PbTe layers. Mater. Res. Express 2018, 5, 015051.\n\n(32)Mong, R. S. K.; Essin, A. M.; Moore, J. E. Antiferromagnetic topological insulators. Phys. Rev. B 2010, 81, 245209.\n\n(33)Kane, C. L.; Mele, E. J. Quantum spin Hall effect in graphene. Phys. Rev. Lett. 2005, $95,226801$.\n\n(34)Hasan, M. Z.; Kane, C. L. Colloquium: Topological insulators. Rev. Mod. Phys. 2010, $82,3045$.\n\n(35)Qi, X.-L.; Zhang, S.-C. Topological insulators and superconductors. Rev. Mod. Phys. 2011, 83, 1057.\n\n(36)Bernevig, B. A.; Hughes, T. L.; Zhang, S.-C. Quantum spin Hall effect and topological phase transition in HgTe quantum wells. Science 2006, 314, 1757.\n\n(37)König, M.; Wiedmann, S.; Brüne, C.; Roth, A.; Buhmann, H.; Molenkamp, L. W.; Qi, X.-L.; Zhang, S.-C. Quantum spin Hall insulator state in $\\mathrm{HgTe}$ quantum wells. Science 2007, 318, 766.\n\n(38)Fu, L. Topological crystalline insulators. Phys. Rev. Lett. 2011, 106, 106802.\n\n(39) Tanaka, Y.; Ren, Z.; Sato, T.; Nakayama, K.; Souma, S.; Takahashi, T.; Segawa, K.; Ando, Y. Experimental realization of a topological crystalline insulator in SnTe. Nat. Phys. 2012, $8,800$.\n\n(40)Blaha, P.; Schwarz, K.; Madsen, G. K. H.; Kvasnicka, D.; Luitz, J., WIEN2K, An augmented plane wave $+$ local orbitals program for calculating crystal properties. Vienna University of Technology: Vienna, Austria, 2001. (41)Perdew, J. P.; Burke, K.; Ernzerhof, M. Generalized gradient approximation made simple. Phys. Rev. Lett. 1996, 77, 3865.\n\n(42)Liechtenstein, A. I.; Anisimov, V. I.; Zaanen, J. Density-functional theory and strong interactions: Orbital ordering in Mott-Hubbard insulators. Phys. Rev. B 1995, 52, R5467.\n\n(43)Marzari, N.; Mostofi, A. A.; Yates, J. R.; Souza, I.; Vanderbilt, D. Maximally localized Wannier functions: Theory and applications. Rev. Mod. Phys. 2012, 84, 1419.\n\n(44)Sancho, M. P. L.; Sancho, J. M. L.; Rubio, J. Quick iterative scheme for the calculation of transfer matrices: application to $\\mathrm{Mo}(100)$. J. Phys. F: Met. Phys. 1984, 14, 1205.\n\n(45)Sancho, M. P. L.; Sancho, J. M. L.; Sancho, J. M. L.; Rubio, J. Highly convergent schemes for the calculation of bulk and surface Green functions. J. Phys. F: Met. Phys. $1985,15,851$.\n\n\n\\end{document}", "record_id": "2023_09_22_81b3dfeb3597db5200c5g"}