{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Two-Dimensional Nitrides as Highly Efficient Potential Candidates for $\\mathrm{CO}_{2}$ Capture and Activation $\\dagger$ }\n\n\n\\author{Raul Morales-Salvador, Ángel Morales-García, Francesc Viñes, Francesc Illas*\\\\\nDepartament de Ciència de Materials i Química Física \\& Institut de Química Teòrica i\\\\\nComputacional (IQTCUB), Universitat de Barcelona. c/ Martí i Franquès 1, 08028 Barcelona, Spain}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\n\n\n\\begin{abstract}\nThe performance of novel two-dimensional nitrides in carbon capture and storage (CCS) is analyzed for a broad range of pressure and temperature conditions. Employing an integrated theoretical framework where $\\mathrm{CO}_{2}$ adsorption/desorption rates on the $\\mathrm{M}_{2} \\mathrm{~N}(\\mathrm{M}=\\mathrm{Ti}, \\mathrm{Zr}, \\mathrm{Hf}, \\mathrm{V}, \\mathrm{Nb}, \\mathrm{Ta}, \\mathrm{Cr}, \\mathrm{Mo}, \\mathrm{W})$ surface are derived from transition state theory and density functional theory based calculations, the present theoretical simulations consistently predict that, depending on the particular composition, $\\mathrm{CO}_{2}$ can be strongly adsorbed and even activated at temperatures above $1000 \\mathrm{~K}$. For practical purposes, $\\mathrm{Ti}_{2} \\mathrm{~N}, \\mathrm{Zr}_{2} \\mathrm{~N}, \\mathrm{Hf}_{2} \\mathrm{~N}, \\mathrm{~V}_{2} \\mathrm{~N}$, $\\mathrm{Nb}_{2} \\mathrm{~N}, \\mathrm{Ta}_{2} \\mathrm{~N}$ are predicted as the best suited materials for $\\mathrm{CO}_{2}$ activation. Moreover, the estimated $\\mathrm{CO}_{2}$ uptake of $2.32-7.96 \\mathrm{~mol} \\mathrm{CO}_{2} \\cdot \\mathrm{kg}^{-1}$ reinforces the potential of these materials for $\\mathrm{CO}_{2}$ abatement.\n\\end{abstract}\n\nE-mail: \\href{mailto:francesc.illas@ub.edu}{francesc.illas@ub.edu}; Fax:+34-93-402-1231; Tel: +34-93-402-1229\n\n$\\dagger$ Electronic supplementary information (ESI) available: See DOI:\n\n\\section{Introduction}\nThere is no doubt that the continued increase in the concentration of $\\mathrm{CO}_{2}$ in the Earth atmosphere directly correlates with global warming and that, in turn, such increase is strongly related to anthropogenic emissions resulting from the use of fossil fuels. ${ }^{1}$ The need to reduce the amount of this greenhouse gas has triggered research into $\\mathrm{CO}_{2}$ sequestration with the idea not only to contribute decreasing its concentration in the atmosphere ${ }^{2,3}$ but of its ulterior utilization as a chemical feedstock in the chemical industry. This may look as a simple idea but its practical implementation into a sufficiently large scale constitutes an enormous scientific and technological challenge. ${ }^{4}$ This is because of the very high stability of gas phase $\\mathrm{CO}_{2}$, the final product of spontaneous combustion of fuels based on organic compounds such as wood, natural gas, or gasoline.\n\nThe high chemical stability of $\\mathrm{CO}_{2}$ also implies weak interaction with solid substrates, which, according to the well-known Sabatier principle, encounters problems when aiming at using heterogeneous catalysts for $\\mathrm{CO}_{2}$ conversion. Hence, in the absence of sufficiently active catalysts, $\\mathrm{CO}_{2}$ capture appears as more attractive than direct conversion. Indeed, $\\mathrm{CO}_{2}$ capture based on amine-scrubbing technology has become a widely used method. ${ }^{5,6}$ Nevertheless, because of its non-corrosive nature, low-cost, and easy regeneration, capture by solid materials is considered as advantageous. ${ }^{7,8}$ The use of solid materials is the basis for the so-called carbon capture and storage (CCS) strategy. The requirements are similar yet less stringent than for heterogeneous catalytic conversion. ${ }^{9}$ In fact, CCS requires a specific type of solidsubstrate able to adsorb $\\mathrm{CO}_{2}$ in a sufficient strong way. Ideally, one would like to have materials able to trigger activation usually involving charge transfer towards the molecule resulting in the generation of bent anionic $\\mathrm{CO}_{2}^{\\delta-}$ species. This is the case for $\\mathrm{CO}_{2}$ sequestration through carbonation of natural silicate minerals driving to the formation of carbonates. Unfortunately, this fixes $\\mathrm{CO}_{2}$ to the substrate making it unavailable for subsequent conversion. ${ }^{10,11}$ In order to find appropriate candidates for CCS, a large number of diverse materials has been analysed involving metals, metal oxides, graphene-based materials, zeolites, metalorganic frameworks and transition metal carbides ${ }^{12-19}$ although with not completely satisfactory results.\n\nThe preceding discussion clearly illustrates the need to go beyond existing materials and to look for alternatives. In this sense, it is worth mentioning that an entirely new family of two-dimensional (2D) transition metal carbides and nitrides has been reported quite recently. These materials have a general $\\mathrm{M}_{n+1} \\mathrm{X}_{n}$ chemical formula where $\\mathrm{M}$ stands for early transition metals and X for $\\mathrm{C}$ or $\\mathrm{N}^{20,21}$ Depending on $n$, which runs from 1 to 3 , the resulting materials have 3 , 5 , or 7 atomic layers. Because of the similarities with graphene, including a hexagonal atomic structure, this new materials have been designed as MXenes. At present, several members of the potentially very large MXene family have been synthesized from the precursor so-called MAX phases. ${ }^{22}$ This was initially achieved by selectively etching Al from $\\mathrm{Ti}_{3} \\mathrm{AlC} \\mathrm{C}_{2}$ and other Al-containing MAX phases using hydrogen fluoride. ${ }^{23}$ However, the progress in this field is very fast and fluorine-free synthetic procedures have recently been proposed to synthesize MXenes. ${ }^{24,25}$ Even, more\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2e9b1b9bffe7fd47b18fg-03_141_201_136_1920}\\\\\nthat the number of these materials already obtained is likely to represent a small fraction of those to be obtained in the near future.\n\nAmong other properties recently reviewed, ${ }^{20,26} \\mathrm{MX}$ enes display high surface areas up to $1000 \\mathrm{~m}^{2} \\mathrm{~g}^{-}$ ${ }^{1}$ and excellent stability. ${ }^{23}$ The high surface area displayed by MXenes together to the reactivity of transition metal carbides towards $\\mathrm{CO}_{2}$ adsorption and activation ${ }^{18}$ triggered a systematic research where the CCS ability of MXenes with $\\mathrm{M}_{2} \\mathrm{C}$ formula have been computationally investigated. ${ }^{27}$ Using adsorption and desorption rates derived from transition state theory and density functional theory based calculations, it has been shown that the $\\mathrm{M}_{2} \\mathrm{C}$ MXenes are able to adsorb and release $\\mathrm{CO}_{2}$ at rather high temperatures and low partial pressures. Moreover, $\\mathrm{CO}_{2}$ uptakes ranging from $2.34$ to $8.25 \\mathrm{~mol} \\mathrm{CO}_{2} \\mathrm{~kg}^{-1}$ of substrate have been predicted which are a direct consequence of their chemical activity and high surface area. It is worth pointing out that this uptake is equivalent to that of other porous material used regularly for CCS purposes such as zeolites, ${ }^{28,29}$ derivatives of graphene, ${ }^{30}$ or bulk $\\mathrm{MgO}$ nanopowders ${ }^{31}$.\n\nIn the view of the very large number of potential MXene compounds and motivated by the encouraging results obtained for the $\\mathrm{M}_{2} \\mathrm{C}$ subset, ${ }^{27}$ we analyse the $\\mathrm{CCS}$ capabilities of the $\\mathrm{M}_{2} \\mathrm{~N}(\\mathrm{M}=\\mathrm{Ti}, \\mathrm{Zr}$, Hf, V, Nb, Ta, Cr, Mo, W) family for which information is scarce and new and fascinating chemistry is likely to emerge. In fact, just from the higher electronic conductivity one can already expect that their overall chemistry would be significantly different from that of their carbide counterparts. Moreover, the fact that $\\mathrm{Ti}_{2} \\mathrm{~N}$ has been already obtained and characterized ${ }^{32}$ can be seen as a starting point in the development of efficient synthetic routes leading to other members of the $\\mathrm{M}_{2} \\mathrm{~N}$ family.\n\n\\section{Materials models and computational methods}\n\\section{Models}\nSurface slabs models were used to represent the basal (0001) plan of the $\\mathrm{M}_{2} \\mathrm{~N}$ materials studied in the present work. The models were built using the crystal structure of the corresponding precursor MAX phase by removing the A element and re-optimizing both lattice parameter and fractional coordinates. The resulting slabs have three atomic layers featuring a M-N-M sandwich-like configuration as schematically shown in Fig. 1. In order to avoid interaction between the adsorbed $\\mathrm{CO}_{2}$ molecules in the periodically replicated images a $p(3 \\times 3)$ supercell was used containing $18 \\mathrm{M}$ and $9 \\mathrm{~N}$ atoms. Also, since the computational code used (see below) exploits periodic symmetry in the three directions it is necessary to add a vacuum region to avoid the interaction between interleaved slabs; a vacuum width of $10 \\AA$ probed to be sufficient to obtain numerically converged results.\n\n\\section{Density Functional Theory based calculations}\nThe interaction of $\\mathrm{CO}_{2}$ with the $\\mathrm{M}_{2} \\mathrm{~N}(0001)$ surfaces is studied by means of density functional theory $(\\mathrm{DFT})^{33,34}$ based calculations within the PBE implementation of the generalized gradient approximation (GGA) for the exchange-correlation potential. ${ }^{35}$ Additionally, the contribution of dispersion terms to the interaction of $\\mathrm{CO}_{2}$ with the $\\mathrm{M}_{2} \\mathrm{~N}(0001)$ systems is taken into account through the $\\mathrm{D} 3$ parameterization of the method proposed by Grimme. ${ }^{36}$ To solve the corresponding Kohn-Sham equations, the valence electron density is expanded in a plane-wave basis set with a cutoff of $415 \\mathrm{eV}$ for the kinetic energy, a choice that leads to converged results up to $1 \\mathrm{meV}$ whereas the interaction between the valence electron density and the core electrons is accounted for through the projector augmented wave (PAW) method. ${ }^{37}$ Integration in the reciprocal space is carried out using a $5 \\times 5 \\times 1$ grid of Monkhorst-Pack special $\\boldsymbol{k}$-points. ${ }^{38}$ Convergence in the geometry optimization is reached when forces acting on nuclei are all below $0.01 \\mathrm{eV} / \\AA$. The adsorption energy is defined as $E_{\\text {ads }}=E_{C_{2} / M_{2} N^{-}}\\left(E_{M_{2} N}+E_{C_{2}}\\right)+\\Delta E_{\\mathrm{ZPE}}$, where $E_{C_{2} / M_{2} N}$ corresponds to the energy of $\\mathrm{CO}_{2}$ adsorbed on $\\mathrm{M}_{2} \\mathrm{~N}$ surface and $E_{M_{2} N}$ stands for the energy of the relaxed pristine $\\mathrm{M}_{2} \\mathrm{~N}$ surface; $E_{\\mathrm{CO}_{2}}$ corresponds to the energy of an isolated $\\mathrm{CO}_{2}$ molecule computed in a symmetric box of $10 \\times 10 \\times 10 \\AA$ dimensions and using the $\\Gamma$-point only. Finally, $\\Delta E_{\\text {ZPE }}$ corresponds to difference in zero-point energy (ZPE) of each term contribution calculated in the harmonic approximation. Note that the vibrational frequencies were calculated decoupled form surface phonons and including frustrated rotations/translations. Attending to this definition of $E_{\\text {ads, }}$ adsorption is associated to negative values and the more negative the stronger the interaction is. All DFT based calculations are performed with the Vienna ab initio Simulation Package (VASP). ${ }^{39,40}$\n\n\\section{Adsorption/Desorption Rates}\nAssuming that $\\mathrm{CO}_{2}$ adsorption is a non-activated process, a meaningful choice, the adsorption rate $r_{\\text {ads }}$ can be calculated from the well-known Herz-Knudsen formula as in Eq. (1), ${ }^{18,41}$\n\n\\[\nr_{\\mathrm{ads}}=\\frac{S_{0} \\cdot p_{\\mathrm{CO}_{2}} \\cdot A}{\\sqrt{2 \\pi \\cdot m \\cdot k_{B} \\cdot T}}\n\\]\n\nwhere $S_{0}$ is the initial sticking coefficient, $p_{\\mathrm{CO}_{2}}$ corresponds to the $\\mathrm{CO}_{2}$ partial pressure above the surface, $A$ stands for the area of an active adsorption site and $m$ corresponds to the mass of the adsorbed molecule. A conservative value of $S_{0}=0.40$ is selected for our study following a previous analysis where the $\\mathrm{CO}_{2}$ capture, storage and activation were investigated on transition metal carbides and two-dimensional $\\mathrm{M}_{2} \\mathrm{C}$ MXenes. ${ }^{18,27}$ Note that equal adsorption probability of all sites (Fig. 1) is assumed and therefore, $A$ is approached as the supercell area of each surface divided by the total number of adsorption sites in it. Three different pressure values representative of different conditions of interest are selected to evaluate $r_{\\text {ads: }}: i$ ) the atmospheric partial pressure of $\\left.\\mathrm{CO}_{2}, p_{\\mathrm{CO}_{2}}=40 \\mathrm{~Pa},{ }^{42} i i\\right)$ a partial pressure of $p_{\\mathrm{CO}_{2}}=0.15$ bar $\\left(15 \\cdot 10^{3} \\mathrm{~Pa}\\right)$ which is a reference value for post-combustion exhaust gases $\\left.{ }^{43} i \\mathrm{iii}\\right)$ a partial pressure of $p_{\\mathrm{CO}_{2}}=1.0$ bar $\\left(10^{5}\\right.$ $\\mathrm{Pa})$ corresponding to a reference for pure $\\mathrm{CO}_{2}$ stream generation from a carbon capture and storage (CCS) system. $^{44}$ The rate of desorption, $r_{\\text {des, }}$, has been estimated from transition state theory (TST) ${ }^{45}$ stating that the reaction rate $r_{\\mathrm{i}}$ of an elementary step is given by\n\n\\[\nr_{\\mathrm{i}}=v \\cdot \\exp \\left(-\\frac{\\Delta E}{k_{B} \\cdot T}\\right) ; v=\\frac{k_{B} \\cdot T q \\#}{h \\cdot q_{0}}\n\\]\n\nwhere $k_{B} T$ is the product of Boltzmann constant, $k_{B}$, and the temperature, $T$, and $\\Delta E$ would be associated to the zero point corrected energy barrier for the described elementary step, here using the (negative) $E_{\\text {ads }}$ values implying that the transition state is supposed to be located infinitely close to the desorption final state. In Eq. (2), $v$ is the well-known pre-exponential actor term also provided by TST with $h, q^{\\#}$ and $q_{0}$ being the Planck constant, and partition functions of the transition and initial states, respectively. Hence one has\n\n\\[\nr_{\\mathrm{des}}=v_{\\mathrm{des}} \\cdot \\exp \\left(\\frac{E_{\\mathrm{ads}}}{k_{B} \\cdot T}\\right) ; v_{\\mathrm{des}}=\\frac{k_{B} \\cdot T \\cdot q_{t r a n, 2 D}^{g a s} \\cdot q_{r o t}^{g a s} \\cdot q_{v i b}^{g a s}}{q_{v i b}^{a d s}}\n\\]\n\nwhere $v_{\\text {des }}$ contains the partition function of the molecule in an early $2 \\mathrm{D}$ transition state in the numerator. This partition function is given by the product $q_{\\text {trans,2D }}^{g a s} \\cdot q_{r o t}^{g a s} \\cdot q_{v i b}^{g a s}$ in which $q_{\\text {trans,2D }}^{g a s}$ stands for the partition function for translational motion in two dimensions whereas, $q_{\\text {rot }}^{g a s}$ and $q_{v i b}^{g a s}$ correspond to the rotational and vibrational partition functions of the $\\mathrm{CO}_{2}$ molecule in the gas phase, respectively. Once the molecule is adsorbed on the surface all degrees of freedom are considered as vibrations since molecular translations and rotations become frustrated through interaction with the substrate and effectively converted into vibrations. The $q_{v i b}^{g a s}$ partition function contains vibrational contributions only. Finally, note that the electronic partition function is set to 1, which is justified by the high energy of the excited electronic states. Therefore, the necessary partition functions were evaluated as\n\n\\[\n\\begin{aligned}\n& q_{\\text {trans }, 2 D}^{g a s}=A \\cdot \\frac{2 \\pi \\cdot k_{B} \\cdot T}{h^{2}} \\\\\n& q_{\\text {vib }}^{a d s / g a s}=\\prod_{i} \\frac{\\exp \\left(-\\frac{h \\cdot v_{i}}{2 \\cdot k_{B} \\cdot T}\\right)}{1-\\exp \\left(-\\frac{h \\cdot v_{i}}{k_{B} \\cdot T}\\right)} \\\\\n& q_{\\text {rot }}^{g a s}=\\frac{T}{2 \\cdot T_{\\text {rot }}}\n\\end{aligned}\n\\]\n\nwhere $v_{\\mathrm{i}}$ is the harmonic vibrational frequency of each normal mode as predicted from the present DFT based calculations, either for $\\mathrm{CO}_{2}$ molecule in vacuum or adsorbed, $2 \\cdot T_{\\text {rot }}$ is the product of the rotational temperature for $\\mathrm{CO}_{2}$ and its symmetry number, 2. $T_{\\text {rot }}$ is taken from the literature as $0.561 \\mathrm{~K} .{ }^{46}$\n\n\\section{Results and discussion}\nOne of the main goals of the present study is to provide qualitative and quantitative information regarding the interaction- and possible activation- of $\\mathrm{CO}_{2}$ with $\\mathrm{M}_{2} \\mathrm{~N}(0001)$ surfaces. To this end, a systematic computational search has been launched considering different orientations of the $\\mathrm{CO}_{2}$ molecule with respect to the surface plane and taking all possible adsorption sites into account. The final atomic structure of the adsorbed $\\mathrm{CO}_{2}$ molecules predicted by the geometry optimization using an appropriate DFT based method reduces to eight particular sites and the explored $\\mathrm{M}_{2} \\mathrm{~N}$ systems display at least one of these configurations. To distinguish among these eight bonding modes a notation is used in which the first digit (n) is assigned depending on the number of atoms of the $\\mathrm{CO}_{2}$ molecule $(1,2$, or 3$)$ close enough to the surface $\\left(\\eta^{\\mathrm{n}}-\\mathrm{CO}_{2}\\right)$. Clearly, this depends on the orientation of the adsorbed $\\mathrm{CO}_{2}$ molecule as clearly seen in the side view in Fig. 1. The notation uses a second digit (m) describing the atomic environment (2, 3, 4, or 5) of the adsorbed $\\mathrm{CO}_{2}$ molecule $\\left(\\mu^{\\mathrm{m}}\\right)$ and ends by a specification of the location of the $\\mathrm{n}$ surface atoms in contact with the $\\mathrm{CO}_{2}$ molecule (N, M, or B which correspond to Nitrogen hollow, Metal hollow, or Bridge sites). Hence, the eight different bonding modes are univocally labelled as follow, $\\eta^{1}-\\mathrm{CO}_{2}-\\mu^{2}-\\mathrm{C}_{\\mathrm{B}}, \\eta^{2}-\\mathrm{CO}_{2}-$ $\\mu^{3}-\\mathrm{C}_{\\mathrm{M}} \\mathrm{O}_{\\mathrm{B}}, \\eta^{2}-\\mathrm{CO}_{2}-\\mu^{3}-\\mathrm{C}_{\\mathrm{N}} \\mathrm{O}_{\\mathrm{B}}, \\eta^{3}-\\mathrm{CO}_{2}-\\mu^{5}-\\mathrm{C}_{\\mathrm{M}} \\mathrm{O}_{\\mathrm{N}} \\mathrm{O}_{\\mathrm{N}}, \\eta^{3}-\\mathrm{CO}_{2}-\\mu^{5}-\\mathrm{C}_{\\mathrm{N}} \\mathrm{O}_{\\mathrm{M}} \\mathrm{O}_{\\mathrm{M}}, \\eta^{2}-\\mathrm{CO}_{2}-\\mu^{3}-\\mathrm{O}_{\\mathrm{B}} \\mathrm{O}_{\\mathrm{B}}, \\quad \\eta^{3}-\\mathrm{CO}_{2}-\\mu^{4}-$ $\\mathrm{C}_{\\mathrm{B}} \\mathrm{O}_{\\mathrm{B}} \\mathrm{O}_{\\mathrm{B}}$, and $\\eta^{3}-\\mathrm{CO}_{2}-\\mu^{4}-\\mathrm{C}_{\\mathrm{M}} \\mathrm{O}_{\\mathrm{M}} \\mathrm{O}_{\\mathrm{B}}$. Note also that whether a given bonding mode appears or not depends on each particular $\\mathrm{M}_{2} \\mathrm{~N}$ surface. For instance, $\\mathrm{O}_{B} \\mathrm{O}_{\\mathrm{B}}$ and $\\mathrm{C}_{\\mathrm{M}} \\mathrm{C}_{M} \\mathrm{O}_{\\mathrm{B}}$ are only found in $\\mathrm{Ta}_{2} \\mathrm{~N}$ and $\\mathrm{W}_{2} \\mathrm{~N}$. However, on most cases $\\left(\\mathrm{Hf}_{2} \\mathrm{~N}, \\mathrm{~V}_{2} \\mathrm{~N}, \\mathrm{Nb}_{2} \\mathrm{~N}, \\mathrm{Ta}_{2} \\mathrm{~N}, \\mathrm{Cr}_{2} \\mathrm{~N}, \\mathrm{Mo}_{2} \\mathrm{~N}\\right.$, and $\\left.\\mathrm{W}_{2} \\mathrm{~N}\\right) \\mathrm{C}_{\\mathrm{B}}$ is the most favourable bonding mode for $\\mathrm{CO}_{2}$ adsorption. It is worth pointing out that this bonding mode was also found to be the second most favourable one for the interaction of $\\mathrm{CO}_{2}$ with the related $\\mathrm{M}_{2} \\mathrm{C}$ series of MXenes. ${ }^{27}$ Note, however, that structural features of the $\\mathrm{M}_{2} \\mathrm{~N}$ materials here studied lead to sites for $\\mathrm{CO}_{2}$ that are more accessible than those of their carbide counterparts.\n\nThe analysis of results in Table 1 shows that the PBE-D3 calculated adsorption energy $\\left(E_{\\text {ads }}\\right)$ values are quite large ranging from $-1.03\\left(\\mathrm{Mo}_{2} \\mathrm{~N}\\right)$ to $-3.13 \\mathrm{eV}\\left(\\mathrm{Ti}_{2} \\mathrm{~N}\\right)$ indicating a very strong interaction. Interestingly, these values are only slightly smaller than those reported at the same computational level for their $\\mathrm{M}_{2} \\mathrm{C}$ counterparts running from $-1.13$ to $-3.69 \\mathrm{eV} .{ }^{27}$ This origin of this difference is quite simple to understand, the $\\mathrm{N}$ layer in the $\\mathrm{M}_{2} \\mathrm{~N}$ systems withdraws more charge density from the metal layers than the $\\mathrm{C}$ layer in the $\\mathrm{M}_{2} \\mathrm{C}$ ones implying a reduction in the charge transfer from the metallic layer of the MXene towards $\\mathrm{CO}_{2}$. Table 1 also shows that $E_{\\text {ads }}$ generally decreases (less negative values indicate weaker adsorption) when moving along the $d$ series, which is consistent with the trends reported for $\\mathrm{CO}_{2}$ adsorption on several $\\mathrm{M}_{3} \\mathrm{C}_{2}$ and $\\mathrm{M}_{2} \\mathrm{C}$ systems. ${ }^{18,27,47}$ One remarkable difference between $\\mathrm{M}_{2} \\mathrm{C}$ and $\\mathrm{M}_{2} \\mathrm{~N}$ systems is the importance of the contribution of dispersion terms to $E_{\\text {ads. }}$. The inclusion of these terms through the D3 Grimme method increases the PBE calculated $E_{\\text {ads }}$ (in absolute terms) for $\\mathrm{M}_{2} \\mathrm{~N}$ materials by quite a significant amount $(0.7-1.0 \\mathrm{eV})$ where a smaller contribution of $\\sim 0.40 \\mathrm{eV}$ was found for the studied $\\mathrm{M}_{2} \\mathrm{C}$ compounds. One could argue that the larger contribution for $\\mathrm{M}_{2} \\mathrm{~N}$ materials arises from artefacts in the empirical parameters entering in the D3 methods. To rule out this possibility, calculations have also been carried out with the better theoretically grounded Tkatchenko-Scheffler (TS) ${ }^{48}$ or the more sophisticated surface many-body dispersion (MBD) approach ${ }^{49}$. For $\\mathrm{V}_{2} \\mathrm{~N}$, the calculated $\\mathrm{D} 3$ contribution to $E_{\\text {ads }}$ is $-0.69$ $\\mathrm{eV}$, in full agreement with values of $-0.68$ and $-0.71 \\mathrm{eV}$ as predicted from TS and MBD methods, respectively (Additional details regarding these issues can be found in the ESI $\\dagger$ ). This unexpected important contribution of dispersion terms of up to $1 \\mathrm{eV}$ has significant implications in the temperature range at which $\\mathrm{CO}_{2}$ desorbs, which we discuss in more detail later. Here we note that, in spite of the strong interaction, the geometry optimization procedure always converges to some of the molecularly adsorbed states described above with no evidence of dissociative chemisorption indicating that this would take place an energy barrier would have to be overcome. Interestingly, a bent adsorbed $\\mathrm{CO}_{2}$ molecule is found in most cases with the $\\mathrm{O}-\\mathrm{C}-\\mathrm{O}$ angle in the 111 to $137^{\\circ}$ range and the $\\mathrm{C}-\\mathrm{O}$ bond distances in the $1.25-1.44 \\AA$ interval, significantly larger than the value for the isolated gas phase molecule. The chemical activation of adsorbed $\\mathrm{CO}_{2}$ is additionally confirmed by the net charged computed using the Bader atoms-in-molecules analysis ${ }^{50}$ indicating the formation of highly anionic adsorbed $\\mathrm{CO}_{2}{ }^{\\delta-}$ species with charges running from $-0.86$ to $-2.02$ e. The results discussed so far support the claim that $\\mathrm{M}_{2} \\mathrm{~N}$ systems are appropriate for $\\mathrm{CO}_{2}$ activation.\n\nThe very large adsorption energy and concomitant activation of $\\mathrm{CO}_{2}$ on $\\mathrm{M}_{2} \\mathrm{~N}(0001)$ surfaces strongly suggest that $\\mathrm{CO}_{2}$ may be adsorbed up to quite high temperatures. Making use of the above described theoretical framework $r_{\\text {ads }}$ and $r_{\\text {des }}$ rates are estimated for a broad range of temperatures as high as $2000 \\mathrm{~K}$. Although the upper limit corresponds to a very high temperature it is below the melting point of the corresponding 3D transition metal nitrides, ranging from 2350 to $3330 \\mathrm{~K} .{ }^{51,52}$ Obviously, the adsorption rate has a non-negligible dependence with the number of $\\mathrm{CO}_{2}$ molecules hitting the surface and so on the $\\mathrm{CO}_{2}$ partial pressure $\\left(p_{\\mathrm{CO}_{2}}\\right)$. Also, desorption rate is determined by the adsorption energy which in turn depends on the bonding mode (Table 1). Hence, two desorption curves for each $\\mathrm{M}_{2} \\mathrm{~N}^{\\text {N }}$ have been built which differ on whether the PBE or PBE-D3 $E_{\\text {ads }}$ value is used. This choice allows one to consider the least and most favourable adsorption situations thus avoiding any bias from the choice of a given computational method and providing a reasonable range of values for subsequent analysis. The estimated $r_{\\text {ads }}$ and $r_{\\text {des }}$ are illustrated in Fig. 2 a for $\\mathrm{M}_{2} \\mathrm{~N}$ systems with the lowest $\\left(\\mathrm{Cr}_{2} \\mathrm{~N}\\right)$ and highest $\\left(\\mathrm{Ti}_{2} \\mathrm{~N}\\right) E_{\\text {ads }}$ values (see also Tables 1 and $\\mathrm{S} 1$ in the Electronic supplementary information, ESI $\\dagger$ ). Note that two sites $\\left(\\mathrm{C}_{\\mathrm{M}} \\mathrm{O}_{\\mathrm{N}} \\mathrm{O}_{\\mathrm{N}}\\right.$ and $\\mathrm{C}_{\\mathrm{N}} \\mathrm{O}_{\\mathrm{M}} \\mathrm{O}_{\\mathrm{M}}$ ) with similar adsorption strength are found for $\\mathrm{Ti}_{2} \\mathrm{~N}$ and, hence, only an estimated $r_{\\text {des }}$ including PBE and PBE-D3 is expected for this MXene as reported in Fig. 2a.\n\nLet us now describe in detail the features of the plots of adsorption/desorption rates shown in Fig. 2a. The crossing point between $r_{\\text {ads }}$ and $r_{\\text {des }}$ indicates the dynamical equilibrium state where the adsorption and desorption rates coincide, temperatures below the crossing point favour adsorption and, consequently, $\\mathrm{CO}_{2}$ becomes sequestered at the material surface. For the case of $\\mathrm{Cr}_{2} \\mathrm{~N}$ at $40 \\mathrm{~Pa}_{\\mathrm{CO}_{2}}$ (labelled as air), two intersections at temperatures of 106 and $579 \\mathrm{~K}$ are clearly seen corresponding to the weakest (PBE) and the strongest (PBE-D3) estimates, respectively. In this way, $T_{1}-T_{2}$ defines the temperature range below which $\\mathrm{CO}_{2}$ adsorption dominates and, consequently, it would become stored on the $\\mathrm{M}_{2} \\mathrm{~N}$ surface, above this temperature desorption will prevail and $\\mathrm{CO}_{2}$ will be released to the gas phase. Note that an increase of $p_{\\mathrm{CO}_{2}}$ to $15 \\cdot 10^{3} \\mathrm{~Pa}$ shifts these limits to the $T_{3}-T_{4}$ interval corresponding to higher values and this is even further increased at 1 bar pressure as indicated by the $T_{5}-T_{6}$ interval. Note that these temperature ranges are quite large for $\\mathrm{Cr}_{2} \\mathrm{~N}$ and $\\mathrm{W}_{2} \\mathrm{~N}$ and this is mainly due to the significant high contribution of dispersion terms (PBE-D3 value) to the adsorption energy value. The average adsorption/desorption switch temperature for the whole set of $\\mathrm{M}_{2} \\mathrm{~N}$ surfaces explored in the present work is $\\sim 1000 \\mathrm{~K}$ (see Fig. 2b). Interestingly enough, this appears to be quite below the average value for their $\\mathrm{M}_{2} \\mathrm{C}$ counterparts where this occurs at $\\sim 1250 \\mathrm{~K} .{ }^{27}$\n\nThe above discussion applies to every $\\mathrm{M}_{2} \\mathrm{~N}$ surface studied and the analysis of the rest of cases is summarized in Fig. $2 \\mathrm{~b}$ where the temperature ranges are shown, independent of the particular adsorption energy and rate. Further information is provided in Table S3 in the ESI $\\dagger$ including details regarding the temperature range for each particular site of each $\\mathrm{M}_{2} \\mathrm{~N}$ surfaces. From Fig. $2 \\mathrm{~b}$ it also appears that $\\mathrm{M}_{2} \\mathrm{~N}$ materials with high adsorption energies feature elevated temperature ranges. Therefore, $\\mathrm{Ti}_{2} \\mathrm{~N}, \\mathrm{Zr}_{2} \\mathrm{~N}$, and $\\mathrm{Hf}_{2} \\mathrm{~N}$ ( $d^{2}$ MXenes) display the largest temperature ranges, whereas $\\mathrm{Cr}_{2} \\mathrm{~N}, \\mathrm{Mo}_{2} \\mathrm{~N}$, and $\\mathrm{W}_{2} \\mathrm{~N}\\left(d^{4} \\mathrm{MXenes}\\right)$ feature the smallest. The present results strongly suggest that, for practical purposes, $d^{2}$ and $d^{3}$ nitride MXenes $\\left(\\mathrm{Ti}_{2} \\mathrm{~N}, \\mathrm{Zr}_{2} \\mathrm{~N}, \\mathrm{Hf}_{2} \\mathrm{~N}, \\mathrm{~V}_{2} \\mathrm{~N}, \\mathrm{Nb}_{2} \\mathrm{~N}\\right.$, and $\\left.\\mathrm{Ta}_{2} \\mathrm{~N}\\right)$ are among the most appealing materials for $\\mathrm{CO}_{2}$ abatement. This is reinforced by the fact that adsorption/desorption transitions at air conditions are located near or within room temperature. Indeed, $\\mathrm{M}_{2} \\mathrm{~N}$ materials show a larger adaptability than $\\mathrm{M}_{2} \\mathrm{C}$ counterparts, where only $\\mathrm{Mo}_{2} \\mathrm{C}$ and $\\mathrm{W}_{2} \\mathrm{C}$ met this criterion.\n\nTo further examine the capability of the $\\mathrm{M}_{2} \\mathrm{~N}$ materials to store $\\mathrm{CO}_{2}$ we focus in the total amount of this compound that can be stored $\\mathrm{CO}_{2}$ per $\\mathrm{kg}$ of substrate and compare to the values for different families of materials that have been successfully proved such as $\\mathrm{Ca}-\\mathrm{X}$ and $13 \\mathrm{X}$ zeolites, ${ }^{28,29}$ with $3.36$ and $2.96 \\mathrm{~mol}$ $\\mathrm{CO}_{2} \\mathrm{~kg}^{-1}$, respectively, or derivatives of graphene, e.g. a-RGO-950 ${ }^{30}$ with $3.36 \\mathrm{~mol} \\mathrm{CO}_{2} \\mathrm{~kg}^{-1}$, which are clearly better than using bulk $\\mathrm{MgO}$ nanopowders, ${ }^{32}$ with $0.92 \\mathrm{~mol} \\mathrm{CO}_{2} \\mathrm{~kg}^{-1}$. To model the potential amount of $\\mathrm{CO}_{2}$ storage by the $\\mathrm{M}_{2} \\mathrm{~N}$ materials we take into account the surface exposure and possible $\\mathrm{CO}_{2}$ loading to the high surface area exposed by 2D MXenes. ${ }^{23}$ For the $p(3 \\times 3)$ supercell model employed in this study, one can safely argue that each $\\mathrm{M}_{2} \\mathrm{~N}$ surface could simultaneously adsorbed four $\\mathrm{CO}_{2}$ molecules. From this quite a conservative estimate one readily predicts that the $\\mathrm{M}_{2} \\mathrm{~N}$ compounds studied in the present work would be able to adsorb 2.32-7.96 $\\mathrm{mol} \\mathrm{CO}_{2} \\mathrm{~kg}^{-1}$ of substrate (Fig. 3). Clearly, practical operating conditions would require $\\mathrm{CO}_{2}$ separation from other competing (combustion) gases prior to adsorption, although recent studies on a series of 2D (MXenes) and 3D transition metal carbides show a high adsorption preference for $\\mathrm{CO}_{2}$ with respect to other gases such as $\\mathrm{CO}$ or $\\mathrm{CH}_{4}$ by more than $1.5 \\mathrm{eV} .{ }^{53,54}$\n\n\\section{Conclusions}\nThe computational modelling presented in this study, based on state of the art DFT based calculations and the use of transition state theory derived adsorption/desorption rates highlights the potential of the $2 \\mathrm{D} \\mathrm{M}_{2} \\mathrm{~N}$ materials $(\\mathrm{M}=\\mathrm{Ti}, \\mathrm{Zr}, \\mathrm{Hf}, \\mathrm{V}, \\mathrm{Nb}, \\mathrm{Ta}, \\mathrm{Cr}, \\mathrm{Mo}, \\mathrm{W})$ for $\\mathrm{CO}_{2}$ storage and activation. Our study reports high adsorption energies up to $-3.13 \\mathrm{eV}$ accompanied by a noticeably large $\\mathrm{CO}_{2}$ activation, evidenced by the appearance of a strongly anionic $\\mathrm{CO}_{2}{ }^{\\delta-}$ adsorbed species with elongated $\\delta(\\mathrm{CO})$ bonds, bent structures, and significant $\\mathrm{MXene} \\rightarrow \\mathrm{CO}_{2}$ charge transfer. The high adsorption energies are remarkable since one must point out that $\\mathrm{CO}_{2}$ adsorbs very weakly on most materials. The significantly large adsorption energy value for $\\mathrm{CO}_{2}$ on the $\\mathrm{M}_{2} \\mathrm{~N}$ materials makes them even more suitable than their carbide $\\left(\\mathrm{M}_{2} \\mathrm{C}\\right)$ counterparts indicating that $\\mathrm{M}_{2} \\mathrm{~N}$ materials may constitute effective alternatives for efficient $\\mathrm{CO}_{2}$ capture, storage, and activation. This is supported by the temperature ranges for adsorption/desorption switch and by predicted $\\mathrm{CO}_{2}$ uptakes ranging from $2.32$ to $7.96 \\mathrm{~mol} \\mathrm{CO}_{2} \\mathrm{~kg}^{-1}$ of substrate, quite competitive to other nowadays-existent material solutions. Finally, the fact $\\mathrm{CO}_{2}$ become highly activated suggest that these $2 \\mathrm{D} \\mathrm{M}_{2} \\mathrm{~N}$ MXenes could also constitute active catalysts for $\\mathrm{CO}_{2}$ conversion although this requires additional research. We hope the present results will stimulate further research in the synthesis of new members of the $\\mathrm{M}_{2} \\mathrm{~N}$ family as well as experimental studies regarding their CCS capability.\n\n\\section{Conflicts of interest}\nThere are no conflicts to declare\n\n\\section{Acknowledgements}\nThe authors acknowledge financial support from the Spanish Ministerio de Economía y Competitividad (MINECO) through the CTQ2015-64618-R grant which including FEDER funds. The authors wish also to thank Generalitat de Catalunya for partial support through 2017SGR13 and XRQTC grants and from the NOMAD Center of Excellence project; the latter received funding from the European Union's Horizon 2020 research and innovation programme under grant agreement no. 676580. A. M.-G. and F. V. are indebted to MINECO for Juan de la Cierva (FJCI-2015-23760) and Ramón y Cajal (RYC2012-10129) postdoctoral research contracts, respectively. F. I. acknowledges additional support from the 2015 ICREA Academia Award for Excellence in University Research. Table 1 Zero point corrected PBE-D3 adsorption energies $\\left(E_{\\text {ads }}\\right)$ for $\\mathrm{CO}_{2}$ above different sites of the $\\mathrm{M}_{2} \\mathrm{~N}$ 0001) surfaces. PBE values and other further details are given in the ESI $\\dagger$. The coordination notation is denoted in parenthesis to diferenciate the adsorption sites shown in Fig. 1.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e9b1b9bffe7fd47b18fg-10_390_2066_183_1873}\n\\end{center}\n\nFig. 1 Side and top view of models featuring $\\mathrm{CO}_{2}$ adsorbed on eight possible sites of $\\mathrm{M}_{2} \\mathrm{~N}(0001)$ surfaces. The colour sequence is as follows: brown and red spheres correspond to carbon and oxygen atoms of the $\\mathrm{CO}_{2}$ molecule; and dark and light blue spheres to $\\mathrm{M}$ upper and bottom layers, respectively, whereas the inner nitrogen layer is represented by dark yellow spheres in the $\\mathrm{M}_{2} \\mathrm{~N}(0001)$ surface. The coordination notation is given below each site.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e9b1b9bffe7fd47b18fg-11_658_1295_457_777}\n\\end{center}\n\n\\[\n\\eta^{1}-\\mathrm{CO}_{2}-\\mu^{2}-\\mathrm{C}_{\\mathrm{B}}\n\\]\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e9b1b9bffe7fd47b18fg-11_1381_2000_468_782}\n\\end{center}\n\n$\\eta^{3}-\\mathrm{CO}_{2}-\\mu^{5}-\\mathrm{C}_{\\mathrm{N}} \\mathrm{OMOM}_{\\mathrm{M}}$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2e9b1b9bffe7fd47b18fg-11_658_1296_776_1096}\n\n$\\eta^{2}-\\mathrm{CO}_{2}-\\mu^{3}-\\mathrm{C}_{\\mathrm{M}} \\mathrm{O}_{\\mathrm{B}}$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2e9b1b9bffe7fd47b18fg-11_1383_2003_790_1104}\n\n$\\eta^{2}-\\mathrm{CO}_{2}-\\mu^{3}-\\mathrm{O}_{\\mathrm{B}} \\mathrm{OB}_{\\mathrm{B}}$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2e9b1b9bffe7fd47b18fg-11_660_1292_1094_1416}\n\n$\\eta^{2}-\\mathrm{CO}_{2}-\\mu^{3}-\\mathrm{C}_{\\mathrm{N}} \\mathrm{O}_{\\mathrm{B}}$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2e9b1b9bffe7fd47b18fg-11_1382_2008_1104_1416}\n\n$\\eta^{3}-\\mathrm{CO}_{2}-\\mu^{4}-\\mathrm{C}_{\\mathrm{B}} \\mathrm{O}_{\\mathrm{B}} \\mathrm{O}_{\\mathrm{B}}$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2e9b1b9bffe7fd47b18fg-11_658_1290_1410_1722}\n\n$\\eta^{3}-\\mathrm{CO}_{2}-\\mu^{5}-\\mathrm{C}_{M} \\mathrm{O}_{\\mathrm{N}} \\mathrm{O}_{\\mathrm{N}}$\\\\\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e9b1b9bffe7fd47b18fg-11_1378_2072_1406_1734}Fig. 2 (a) Adsorption and desorption rates for $\\mathrm{CO}_{2}$ interacting with the $\\mathrm{Cr}_{2} \\mathrm{~N}$ and $\\mathrm{Ti}_{2} \\mathrm{~N}$ (0001) surfaces. The points with $T_{1}-T_{6}$ marked labels for $\\mathrm{Cr}_{2} \\mathrm{~N}$ show the range of desorption temperature represented in (b). Green, gray and blue colours correspond to adsorption rates on a single site per time unit for a $\\mathrm{CO}_{2}$ partial pressure of $40,15 \\cdot 10^{3}$, and $10^{5} \\mathrm{~Pa}$, respectively. Note that the bars in (b) have the same sequence of colours. Black and red lines are desorption rates per site for $E_{\\text {ads }}$ obtained from PBE (solid) and PBE-D3 (dashed) calculations.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e9b1b9bffe7fd47b18fg-12_712_2394_501_1692}\n\\end{center}\n\nFig. 3 Predicted $\\mathrm{CO}_{2}$ uptake by $\\mathrm{M}_{2} \\mathrm{~N}$ materials compared to values in the literature for zeolites (Ca- $\\mathrm{X}$ and 13X), derivatives of graphene (a-RGO-950) and bulk MgO nanopowders is represented by dark blue, red, light blue, and dark yellow bars, respectively. Details are given in the ESI $\\dagger$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e9b1b9bffe7fd47b18fg-13_500_1522_343_1856}\n\\end{center}\n\n\\section{REFERENCES}\n(1) L. Marini, Geological Sequestration of Carbon Dioxide, Developments in Geochemistry, Elsevier, 2007.\n\n(2) G. A. Olah, G. K. S. Prakash, A. Goeppert, J. Am. Chem. Soc., 2011, 133, 12881-12898.\n\n(3) A. Goeppert, M. Czaun, G. K. S. Prakash, G. A. Olah, Energy Environ. Sci., 2012, 5, 7833-7853.\n\n(4) U. Burghaus, New and Future Developments in Catalysis: Activation of Carbon Dioxide, Elsevier, 2013.\n\n(5) A. B. Rao, E. S. Rubin, Environ. Sci. Technol., 2002, 36, 4467-4475.\n\n(6) D. P. Hanak, E. J. Anthony, V. Manovic, Energy Environ. Sci., 2015, 8, 2199-2249.\n\n(7) J. Kou, L.-B. Sun, J. Mater. Chem., A 2016, 4, 17299-17307.\n\n(8) D. Qian, C. Lei, E.-M. Wang, W. C. Li, A. H. Lu, ChemSusChem, 2014, 7, 291-298.\n\n(9) Y. Li, S: H. Chan, Q. Sun, Nanoscale, 2015, 7, 8663-8683.\n\n(10) P. B. Keleman, J. Matter, Proc. Natl. Am. Soc., 2008, 105, 17295-17300.\n\n(11) E. Eikeland, A. B. Blichfeld, C. Tyrsted, A. Jensen, B. B. Iversen, ACS Appl. Mater. Interfaces, $2015,7,5258-5264$.\n\n(12) V. A. de la Peña O' Shea, S. González, F. Illas, J. L. G. Fierro, Chem. Phys. Lett., 2008, 454, 262268.\n\n(13) D. C. Sorescu, J. Lee, W. A. Al-Saidi, K. D. Jordan, J. Chem. Phys., 2012, 137, 074704:1-16.\n\n(14) Y. Jiao, A. Du, Z. Zhu, V. Rudolph, G. Q. Lu, S. C. Smith, Catal. Today, 2011, 175, 271-275.\n\n(15) D. Smykowski, B. Szyia, J. Szczygiel, J. Mol. Graphics Modell., 2013, 41, 89-96.\n\n(16) C. A. Trickett, A. Helal, B. A. Al-Maythalony, Z. H. Yamani, K. E. Cordova, O. M. Yaghi, Nat. Rev. Mater., 2017, 2, 17045:1-16.\n\n(17) M. Wriedt, J. P. Sculley, A. A. Yakovenko, Y. Ma, G. J. Halder, P. B. Balbuena, H.-C. Zhou, Angew. Chem. Int. Ed., 2012, 51, 9804-9808.\n\n(18) C. Kunkel, F. Viñes, F. Illas, Energy Environ. Sci., 2016, 9, 141-144.\n\n(19) G. A. Mutch, S. Shulda, A. J. McCue, M. J. Menart, C. V. Ciobanu, C. Ngo, J. A. Anderson, R. M. Richards, D. Vega-Maza, J. Am. Chem. Soc., 2018, 140, 4736-4742.\n\n(20) B. Anasori, M. R. Lukatskava, Y. Gogotsi, Nat. Rev. Mater., 2017, 2, 16098:1-17.\n\n(21) F. Liu, A. Zhou, J. Chen, J. Cao, L. Wang, Q. Hu, Adsorption, 2016, 22, 915-922.\n\n(22) J. Zhu, E. Ha, G. L. Zhao, Y. Zhou, D. S. Huang, G. Z. Yue, L. S. Hu, N. Sun, Y. Wang, L. Y. S. Lee, C. Xu, K. Y. Wong, D. Astruc, P. X. Zhao, Coord. Chem. Rev., 2017, 352, 306-327.\n\n(23) M. Naguib, O. Mashtalir, J. Carle, V. Presser, J. Lu, L. Hultman, Y. Gogotsi, ACS Nano 2012, 6, 1322-1331.\n\nX. Yu, X. Cai, H. Cui, S.-W. Lee, X.-F. Yu, B. Liu, Nanoscale, 2017, 9, 17859-17864. (25) T. Li, L. Yao, Q. Liu, J. Gu, R. Luo, J. Li, X. Yan, W. Wang, P. Liu, B. Chen, W. Zhang, W. Abbas, R. Naz, D. Zhang, Angew. Chem. Int. Ed., 2018, DOI: 10.1002/anie.201800887\n\n(26) M. Alhabeb, K. Maleski, T. S. Mathis, A. Sarycheva, C. B. Hatter, S. Uzun, A. Levitt, Y. Gogotsi, Angew. Chem. Int. Ed., 2018, DOI: 10.1002/anie.201802232\n\n(27) A. Morales-García, A. Fernández-Fernández, F. Viñes, F. Illas, J. Mater. Chem. A, 2018, 6, 33813385.\n\n(28) T.-H. Bae, M. R. Hudson, J. A. Mason, W. L. Queen, J. J. Dutton, K. Sumida, K. J. Micklash, S. S. Kaye, C. M. Brown, J. R. Long, Energy Environ. Sci., 2013, 6, 128-138.\n\n(29) C. Chen, D.-W. Park, W.-S. Ahn, Appl. Surf. Sci., 2014, 292, 63-67.\n\n(30) S. Chowdhury, R. Balasubramanian, Ind. Eng. Chem. Res., 2016, 55, 7906-7916.\n\n(31) W. Gao, T. Zhou, B. Louis, Q. Wang, Catalysts, 2017, 7, 116:1-15.\n\n(32) B. Soundiraraiu, B. K. George, ACS Nano, 2017, 11, 8892-8900.\n\n(33) P. Hohenberg, W. Kohn, Phys. Rev., 1964, 136, B864-B871.\n\n(34) W. Kohn, J. Sham, Phys. Rev., 1965, 140, A1133-A1138.\n\n(35) J. P. Perdew, K. Burke, M. Ernzerhof, Phys. Rev. Lett., 1996, 77, 3865-3868.\n\n(36) S. Grimme, J. Anthony, S. Ehrlich, H. A. Krieg, J. Chem. Phys., 2010, 132, 154104:1-19.\n\n(37) P. E. Blochl, Phys. Rev. B, 1994, 50, 17953-17979.\n\n(38) H. J. Monkhrost, J. D. Pack, Phys. Rev. B 1976, 13, 5188-5192.\n\n(39) G. Kresse, J. Furthmüller, Phys. Rev. B, 1996, 54, 11169-11186.\n\n(40) G. Kresse, J. Furthmüller, Comput. Mater. Sci., 1996, 6, 15-50.\n\n(41) S. Pogodin, N. López, ACS Catal., 2014, 4, 2328-2332.\n\n(42) T. Takahashi, S. Sutherland, A. Kozyr, Global Ocean Surface Water Partial Pressure of $\\mathrm{CO}_{2}$ Database: Measurements Performed During 1957-2014, Environmental Science Division, Oak Ridge National Laboratory, 2015.\n\n(43) D. M. D'Alessandro, B. Smith, J. R. Long, Angew. Chem. Int. Ed., 2010, 49, 6058-6082.\n\n(44) M. E. Boot-Handford, J. C. Abanades, E. J. Anthony, M. J. Blunt, S. Brandani, N. Mac Dowell, J. R. Fernández, M.-C. Ferrari, R. Gross, J. P. Hallett, R. S. Haszeldine, P. Heptonstall, A. Lyngfelt, Z. Makuch, E. Mangano, R. T. J. Porter, M. Pourkashanian, G. T. Rochelle, N. Shah, J. G. Yao, P. S. Fennell, Energy Environ. Sci., 2014, 7, 130-189.\n\n(45) K. Reuter, Modelling and Simulation of Heterogeneous Catalytic Reactions, Wiley-VCH Verlag GmbH \\& Co., ch. $3,2011$.\n\n(46) P. W. Atkins, P. de Paula, Atkins' Physical Chemistry, Oxford University Press, 8th edn., 2006.\n\n(47) L. M. Azofra, N. Li, D. R. MacFarlane, C. Sun, Energy Environ. Sci., 2016, 9, 2545-2549.\n\n(48) A. Tkatchenko, M. Scheffler, Phys. Rev. Lett., 2009, 102, 073005:1-4.\n\n(49) A. Tkatchenko, R. A. DiStasio, M. Scheffler, Phys. Rev. Lett., 2012, 108, 236402:1-5. (50) R. F. W. Bader, Acc. Chem. Res., $1985,18,9-15$.\n\n(51) L. E. Toth, Transition Metal Carbides and Nitrides, Academic Press, NY, 1971.\n\n(52) Y. Zhong, X. Xia, F. Shi, J. Zhan, J. Tu, H. J. Fan, Adv. Sci., 2016, 3, 1500286:1-28.\n\n(53) N. Li, X. Chen, W.-J. Ong, D. R. MacFarlane, X. Zhao, A. K. Cheetham, C. Sun. ACS Nano, 2017, 11, 10825-10833.\n\nC. Kunkel, F. Viñes, F. Illas, ACS Appl. Energy Mater., 2018, 1, 43-47.\n\n\\section{Graphic for TOC}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e9b1b9bffe7fd47b18fg-16_1019_1802_573_1483}\n\\end{center}\n\n\n\\end{document}", "record_id": "2023_09_22_2e9b1b9bffe7fd47b18fg"}