{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{HHS Public Access }\n\n\n\\author{Christopher Farley ${ }^{1,2}$, Amit Aggarwal $^{3}$, Sunaina Singh ${ }^{3}$, Aaron Dolor $^{4}$, Philip To $^{1}$, Alexander\\\\\nFalber $^{5}$, Maxwell Crossley $^{6}$, and Charles Michael Drain M $^{1,7}$\\\\\n${ }^{1}$ Department of Chemistry, Hunter College of the City University of New York, New York, NY\\\\\n10065, United States\\\\\n2Department of Chemistry, The Graduate Center of the City University of New York, New York, NY\\\\\n10016, United States\\\\\n${ }^{3}$ Department of Natural Sciences, LaGuardia Community College of the City University of New\\\\\nYork, Long Island City, NY 11101, United States\\\\\n${ }^{4}$ Department of Bioengineering, Therapeutic Sciences and Pharmaceutical Chemistry, University\\\\\nof California San Francisco, San Francisco, CA 94143, United States\\\\\n${ }^{5}$ School of Chemistry, The University of New South Wales, Sydney, NSW 2052, Australia\\\\\n${ }^{6}$ School of Chemistry, The University of Sydney, Sydney, NSW 2006, Australia\\\\\n${ }^{7}$ The Rockefeller University, New York, NY 10065, United States}\n\\date{}\n\n\n\\begin{document}\n\\maketitle\nAuthor manuscript\n\nJ Comput Chem. Author manuscript; available in PMC 2019 July 05.\n\nPublished in final edited form as:\n\nJ Comput Chem. 2018 July 05; 39(18): 1129-1142. doi:10.1002/jcc.24887.\n\n\\section{A Structural Model of Nitro-Porphyrin Dyes based on Spectroscopy and Density Functional Theory ${ }^{\\dagger}$}\n\n\n\\begin{abstract}\nNitro-porphyrins are an important class of commercial dyes with a range of potential applications. The nitro group is known to dramatically affect the photophysics of the porphyrin, but there are few systematic investigations of the contributing factors. To address this deficiency, we present spectroscopic studies of a series of nitro-porphyrins, accompanied by density functional theory calculations to elucidate their structures. In particular, we explore how the positions of the substituents affect the energy levels and nuclear geometry. As expected, nitro groups on the mesophenyl rings cause small changes to the orbital energies by induction, while those at the $\\beta$-pyrrole positions more strongly conjugate into the aromatic system. In addition, however, we find evidence that $\\beta$-pyrrole nitro groups distort the porphyrin, creating two non-planar conformations with distinct properties. This unexpected result helps explain the anomalous photophysics of nitroporphyrins reported throughout the literature, including inhomogeneous line broadening and biexponential fluorescence decay.\n\\end{abstract}\n\n\\section{Graphical abstract}\n$\\dagger^{\\dagger}$ This paper is dedicated to our colleague, Professor Lou Massa, to celebrate his contributions to Quantum Crystallography. Correspondence to: Christopher Farley (\\href{mailto:chris.d.farley@gmail.com}{chris.d.farley@gmail.com}); Amit Aggarwal (\\href{mailto:aaggarwal@lagcc.cuny.edu}{aaggarwal@lagcc.cuny.edu}). Christopher Farley and Amit Aggarwal, equal contributors\n\nAdditional Supporting Information may be found in the online version of this article. The substitution of a nitro group onto a porphyrin compound has a large effect on the photophysical properties and potential applications of the dye. These changes are usually attributed to electronic induction and resonance, but other possible factors have not been investigated as thoroughly. In this work we show that steric hindrance between the nitro group and the nearby phenyl ring causes out-of-plane distortions of the macrocycle which are important in understanding the electronic transitions.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-02_524_1156_683_1431}\n\\end{center}\n\n\\section{Keywords}\nporphyrins; photophysics; charge transfer; spectroscopy; density functional theory\n\n\\section{Introduction}\nFunctionalized porphyrins (Por) and other tetrapyrrole derivatives have been studied extensively for decades, primarily due to their importance in biological, chemical, and optical systems. ${ }^{1}$ These compounds possess enhanced photonic and electrochemical properties that can be finely tuned by grafting a variety of substituents to their peripheral positions, ${ }^{2-4}$ making them very attractive as components in advanced materials and devices. In particular, nitro substituted porphyrinoids have been investigated as redox catalysts, ${ }^{5-11}$ nonlinear optical materials, ${ }^{4,12-15}$ biomedical theranostics, ${ }^{15-17}$ and artificial solar energy harvesting devices. ${ }^{14,18-20}$\n\nNitro groups drastically affect the electronic properties of the Por when attached to the $\\beta$ pyrrole position or even to the meso-phenyl rings. The strong electron withdrawing nature of the $\\mathrm{NO}_{2}$ moiety polarizes the Por macrocycle, changing its physical and chemical properties. 4-26 On the other hand, nitro groups can also mediate the assembly of supramolecular systems by directly participating in hydrogen bonding with groups such as imidazole ${ }^{27}$ or modulating the complexation of the Por with other species in solution. ${ }^{28-32}$ These groups are also widely used in Por chemistry as precursors to amino groups because the latter tend to diminish the synthetic yield of the macrocycle. ${ }^{33-37}$ Significant attention has been paid to the excited state dynamics of Por compounds, but accurate measurements still present a substantial challenge. ${ }^{1,38,39}$ There are numerous reports of Pors showing appreciable aggregation in solution, which makes it difficult to distinguish the photophysical properties of the monomeric species from the aggregates. $2,40,41$ The extent of aggregation depends on the nature of the substituents attached to the macrocycle core, the coordinated metal ion, and external conditions such as the temperature, concentration, and solvent. Additionally, these factors also exert an influence on the photophysical characteristics of the monomer itself, including its conformational dynamics, 42 further complicating the analysis.\n\nThe aggregation and organization of nitroporphyrins can also provide a useful strategy for making supramolecular arrays via self-assembly. ${ }^{27,41}$ Por arrays are particularly appealing due to their rich photochemistry and ability to support electron and energy transfer processes. ${ }^{31,43-49}$ Self-assembly provides efficient access to ordered architectures of Por units by a variety of mechanisms, including hydrogen bond molecular recognition, electrostatic interactions, and transition metal ion coordination, among others. Since the hierarchical structure of these assemblies will obviously depend on the number and placement of the relevant functional groups on the Por, it is important to understand how these affect the intrinsic photophysical properties of the molecules as well. For example, it has been shown that tetraphenylporphyrin (TPP) compounds with nitro groups at the para phenyl position have markedly different stabilities and catalytic activities from those with nitro groups at the ortho position. ${ }^{6}$\n\nAs a part of this effort to understand the role of strong electron withdrawing groups (EWGs) on Por chemistry, we present here a combined experimental and theoretical analysis of the photophysics of a series of nitroporphyrins (see Fig. 1). These compounds were chosen to minimize other factors, such as conformational dynamics, different substituent group effects, and electroactivity of the central metal ion. We discuss the absorption and emission properties of the Pors in representative polar and non-polar solvents (DMSO and toluene, respectively), especially in light of the electron withdrawing nature of the nitro group and its effects on the molecular orbitals and the excited state polarity.\n\nIn analyzing these compounds, we are faced with a significant body of literature $^{8-10,17,22,26,28-30,34,37,39-41,47-54}$ offering a range of descriptive frameworks that must be reconciled. These reports all describe several characteristics common to these kinds of compounds, including broad and redshifted absorbance and emission spectra, quenched fluorescence quantum yield, shortened singlet lifetimes, and strong solvent dependence. Some sources also report biexponential fluorescence decays and excitation dependent emission spectra. These observations are typically explained by invoking one of three mechanisms - (1) tautomers with distinct photophysics, (2) rotation of the nitro group modulating its conjugation into the macrocycle, or (3) interaction between the excited singlet $\\left(\\mathrm{S}_{1}\\right.$ ) and a low-lying charge transfer (CT) state. To clarify the excited state dynamics and the nature of the emissive state in these porphyrins, we performed an extensive series of DFT and TD-DFT calculations. These results are discussed in terms of the energy levels, electronic transitions and, most importantly, molecular structure. Our findings suggest that none of the above mentioned three mechanisms satisfactorily explain the experimental observations. Instead, we propose that molecular distortion due to steric hindrance is the prevailing cause behind all of the unusual photophysics.\n\n\\section{Methods}\n5,10,15,20-tetraphenylporphyrinato zinc (II) (ZnTPP), 5,10,15,20-tetraphenyl-21H,23Hporphyrin ( $\\mathrm{H}_{2} \\mathrm{TPP}$ ), toluene, and dimethylsulfoxide (DMSO) were purchased from commercial sources and used without further purification. The nitrated derivatives, 2nitro-5,10,15,20-tetraphenylporphyrin $\\left(\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}\\right)$, 2-nitro-5,10,15,20-\n\ntetraphenylporphyrinato zinc (II) ( $\\left.\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}\\right)$, 2-nitro-5,10,15,20-tetrakis(2nitrophenyl)porphyrin $\\left(\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}\\right)$, 2-nitro-5,10,15,20-tetrakis(2nitrophenyl)porphyrinato zinc (II) $\\left(\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}\\right)$, and 2,7-dinitro-5,10,15,20-tetrakis(2nitrophenyl)porphyrinato zinc (II) (Zn( $\\left.\\mathrm{NO}_{2}\\right)_{6} \\mathrm{TPP}$ ) were synthesized and characterized from commercial porphyrins.\n\nMass spectrometry analyses were performed at the CUNY Mass Spectrometry Facility at Hunter College by electrospray ionization on an Agilent Technologies G6520 Q-TOF instrument and Agilent 1200 HPLC system. UV-visible absorbance spectra were obtained on a Varian Bio3 spectrophotometer. The solutions were prepared at a concentration less than $1.0 \\mu \\mathrm{M}$, and no aggregation effects were observed. Steady-state fluorescence spectra were acquired on a HORIBA Scientific FluoroLog-3 fluorescence spectrometer. The excitation wavelength $\\left(\\lambda_{\\text {ex }}\\right)$ was $412 \\mathrm{~nm}$ for porphyrin solutions in DMSO and $414 \\mathrm{~nm}$ for solutions in toluene, and the emission spectra were collected from 550 to $800 \\mathrm{~nm}$ for both. The excitation and emission monochromator bandwidths were both set to $2 \\mathrm{~nm}$. The absorbance of the solutions was $0.09$ at $412 \\mathrm{~nm}$ for DMSO solutions, and $0.10$ at $414 \\mathrm{~nm}$ for toluene solutions. For deaerated samples, the solutions were purged with nitrogen for approximately 10 min. Fluorescence lifetimes were recorded using the FluoroHub Tau-3 time-correlated single photon counting (TCSPC) module for the same instrument. Excitation for TCSPC was provided by a pulsed diode laser source (NanoLED-405L) with a pulse duration less than $200 \\mathrm{ps}$. The excitation wavelength was $405 \\mathrm{~nm}$, and emission was detected at $651 \\mathrm{~nm}$, with both monochromators set to a $2 \\mathrm{~nm}$ bandwidth. The data collected in this manner was subjected to standard multi-exponential fitting using the Decay Analysis Software package (v. 6.4) bundled with the instrument.\n\nDFT and TD-DFT calculations were performed with the Gaussian 09 software package using the resources of the City University of New York High Performance Computing Center based at the College of Staten Island and supported under National Science Foundation Grants CNS-0958379, CNS-0855217, ACI-1126113. The software, methods, basis sets, and hybrid exchange-correlation functionals are the same as our previously published report on the photophysics of phthalocyanines. ${ }^{55}$ The only difference in this case was the specification of DMSO as the solvent for the Polarizable Continuum Model. Frequency calculations were performed on all of the optimized ground state structures and no imaginary modes were observed. When possible, the excited state geometries were also optimized using TD-DFT.\n\n\\section{Results and Discussion}\n\\section{UV-Visible Absorption Spectra}\nNormalized UV-Vis absorption spectra for the compounds in DMSO and toluene are given in Fig. 2, and the data is summarized in Table 1. All of the absorbance bands for the studied compounds generally redshift with the addition of nitro groups to the molecule, similar to other reports, ${ }^{21,47-50}$ with this effect being much more pronounced for the zinc compounds. 51 This is expected based on the electron-withdrawing nature of the nitro group, which serves to stabilize the LUMO energies relative to the HOMOs.\n\nLooking first at the free base compounds, it is clear that the magnitude of molecular orbital stabilization is very different for nitro groups directly attached to the macrocycle at the $\\beta$ position and those on the meso-phenyl rings, consistent with other reports. ${ }^{4}$ The absorbance data for tetrakis(ortho-nitrophenyl)Por, $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{4} \\mathrm{TPP}$, shows only a minimal shift of at most $4 \\mathrm{~nm}$ in the $\\lambda_{\\max }$ values from $\\mathrm{H}_{2}$ TPP (Table 1 , data from reference ${ }^{39}$ ). The values for the para isomer (not shown, data in references ${ }^{58}$ and ${ }^{53}$ ) are nearly identical to the ortho isomer. However, the addition of just one nitro group to the $\\beta$ position instead, as in $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$, induces a shift of 7-8 nm, depending on the solvent. This is often ascribed to conjugation between the nitro group and the aromatic core, which is also a function of the rotational angle of the $\\mathrm{C}-\\mathrm{N}$ bond. In fact, early reports on $\\beta$-nitrated Pors ${ }^{21}$ predicted a strong $\\lambda_{\\max }$ dependence on the solvent polarity, with more polar solvents promoting more planar conformations of the nitro group with respect to the macrocycle. This effect is not observed in our data for the free base compounds, probably because the meso-phenyl groups shield the $\\mathrm{NO}_{2}$ from the solvent molecules, and more strongly influence the nitro $\\mathrm{C}-\\mathrm{N}$ bond rotational position through steric interactions ( vide infra). ${ }^{50,51}$ When both $\\beta$ and phenyl nitro groups are present, as in $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}$, the total shift is not just a linear combination of the two contributions. Instead, the shifts are greater than the sum for the Soret, $\\mathrm{Q}_{\\mathrm{x}}(1,0), \\mathrm{Q}_{\\mathrm{y}}(1,0)$ and $\\mathrm{Q}_{\\mathrm{y}}(0,0)$ bands, but less for the $\\mathrm{Q}_{\\mathrm{X}}(0,0)$ band (see data for porphyrins in toluene in Table 1). This suggests more complicated mixing of the orbitals due to interactions of the nitro groups at different positions.\n\nThe trends in the zinc compounds are slightly more complicated. Although there is no data available for the ortho isomer of $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{4} \\mathrm{TPP}$, Wróbel et al. report a value of $429 \\mathrm{~nm}$ for the Soret peak of zinc (II) tetrakis(4-nitrophenyl)porphyrin (the \"para\" isomer) in a nematic liquid crystal solution. ${ }^{59}$ Comparing this to the $\\lambda_{\\max }$ values for ZnTPP suggests that there is also only a small effect for the phenyl nitro groups in these compounds as well. A similar conclusion can be drawn by comparing $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{6} \\mathrm{TPP}$ in toluene $\\left(\\lambda_{\\max }=449 \\mathrm{~nm}\\right)$ to the literature reports of zinc (II) 2,7-dinitro-tetraphenylporphyrin in toluene $\\left(\\lambda_{\\max }=446 \\mathrm{~nm}\\right){ }^{50}$ On the other hand, the Soret band in toluene is shifted $9 \\mathrm{~nm}$ for $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$, and $23 \\mathrm{~nm}$ for $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}$, in which both the $\\beta$ and phenyl nitro groups are present. The absorbances of the solutions in DMSO appear to exhibit more moderate shifts across this same series, but the spectra themselves display a drastic solvent dependence, particularly for the asymmetric Soret peak of $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{5}$ TPP (Fig. 2d). Because the phenyl groups will still shield the $\\beta$ nitro groups for the reasons discussed previously, this solvatochromism is likely a consequence of axial coordination of DMSO to the zinc center. There are many reports relating the magnitude of the Soret band redshift to solvent parameters such as charge, polarity, polarizability, and donor number (DN), with the latter being particularly important. ${ }^{60-64}$ In addition to the redshift, DMSO ligands have been reported to induce an increase in the $\\mathrm{Q}_{\\mathrm{x}}(0,0) / \\mathrm{Q}_{\\mathrm{x}}(1,0)$ intensity ratio, ${ }^{62}$ and the development of a slight shoulder on the low-energy edge of the Soret peak, ${ }^{61}$ both of which are observed in the spectra for $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$ and $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}$.\n\n\\section{Fluorescence Emission Spectra}\nNormalized fluorescence emission spectra are shown in Fig. 3, and the data is summarized in Table 2. Unsubstituted $\\mathrm{H}_{2}$ TPP and ZnTPP show only slight differences between emission in the non-polar, non-coordinating toluene solvent and the polar, coordinating DMSO, while the nitrated derivatives are much more solvent-dependent. The toluene solutions tend to have broad, featureless emissions while the DMSO solutions exhibit narrower, more well-defined bands. While these differences could be the result of different tendencies towards aggregation in the two solvents, we find no evidence of this under the conditions used. Although the nitro groups are known to reduce solubility and mediate intermolecular interactions, ${ }^{40}$ we do not observe any straightforward relationship between the number of nitro groups and the shapes of the emission bands for these compounds. Furthermore, it has been reported that $\\beta$-nitro-Pors exhibit a \"broad and structureless\" 49 fluorescence, while tetra(nitrophenyl)-Pors retain the spectral shape of the parent molecule. ${ }^{49}$\n\nThe strongly electron withdrawing nitro groups polarize the molecule in the ground state, with this effect being even stronger in the excited state. While there is some controversy over the nature and charge-transfer (CT) character of the emissive $\\mathrm{S}_{1}$ state of a nitro-Por, there is little doubt that it has a substantial dipole moment. ${ }^{39,47-53}$ A more polar solvent like DMSO should stabilize this kind of polar excited state, red-shifting the emission relative to toluene. While this effect is observed for $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$ and $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}$, it is much harder to see for the other compounds due to the poor resolution of the individual bands. However, it is interesting to note that there does not seem to be a redshift for $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{6} \\mathrm{TPP}$ in DMSO vs. toluene, indicating that the electronic communication between the nitro groups and the macrocycle is somehow frustrated. The last point to note about the spectral shapes is the appearance of a third band in $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$ in DMSO, which could indicate the presence of a separate emissive state.\n\nThe data in Table 2 shows that adding nitro substituents at any position on $\\mathrm{H}_{2} \\mathrm{TPP}$ or ZnTPP quenches the fluorescence, consistent with a broad swath of literature. ${ }^{18,21,39,47-53}$ This quenching has been attributed to multiple, potentially concurrent mechanisms, including mixing between $\\mathrm{S}_{1}$ and CT states, ${ }^{47-51}$ spin-orbit coupling, ${ }^{49}$ and enhanced vibrational or rotational relaxation. The absence of aggregation in these solutions allows us to discount collisional or static quenching mechanisms. The introduction of one nitro group on a $\\beta$ pyrrole position causes an approximately $50 \\%$ decrease in the fluorescence quantum yield, $\\varphi_{F}$, for both the free base and zinc Pors in toluene. The effect is slightly greater for solutions under ambient atmosphere than for those under $\\mathrm{N}_{2}$, likely due to an enhanced association between the nitro groups and molecular oxygen in solution. For the penta-nitro derivatives in toluene, the total quenching is about $60 \\%$ for the free base and $70-80 \\%$ for the zinc compounds, depending on the presence of oxygen. This demonstrates that the nitro groups on the meso-phenyl rings are less efficient at depopulating the emissive $S_{1}$ state. The sixth nitro substituent, also attached at the $\\beta$ position, almost completely eliminates the remaining fluorescence in both solvents.\n\nIn more polar solvents, the quenching by the $\\mathrm{NO}_{2}$ substituents is much more effective. The first $\\beta$ nitro quenches the free base Por more than $70 \\%$ and the zinc Por almost $90 \\%$ in DMSO. The additional phenyl nitro groups quench these by more than $90 \\%$ and $97 \\%$, respectively. This could indicate that some of the quenching is due to $S_{1}$ mixing with or being in equilibrium with a highly polar state that is stabilized in polar solvents, and thus more energetically accessible. ${ }^{47-52,65}$\n\n\\section{Fluorescence Lifetimes}\nThe most salient fact about the time-resolved emission data is the appearance of two fluorescence lifetimes in each of the nitrated Pors (see Table 2). Similar dynamics have previously been reported for $\\beta$-nitro Pors and attributed either to the interconversion of tautomers with different photophysics, ${ }^{39}$ or to a distribution of conformers with respect to the dihedral angle of the nitro group. ${ }^{50,51}$ In any case, there is no reason to expect emission from higher $\\mathrm{S}_{n}$ states, so the two lifetimes must correspond to distinct molecular structures, whether they are tautomers, atropisomers, or some other kind of conformers. Perhaps more confounding is the fact that one of the lifetimes in each of the nitrated zinc compounds is longer than the unperturbed ZnTPP lifetime. Similar observations have been reported in the literature without explanation. ${ }^{50,66}$\n\nOverall, the fluorescence lifetimes shown in Table 2 are shorter under ambient conditions than under an inert $\\mathrm{N}_{2}$ atmosphere, with only a few exceptions close to the time resolution of the instrument ( $200 \\mathrm{ps})$. This is expected for a dynamic quenching mechanism between the dye and dissolved molecular oxygen. For the shorter lifetimes ( $\\tau \\leqslant 4$ ns) of all of the compounds, there is only a very slight difference between the air and $\\mathrm{N}_{2}$ saturated solutions, indicating that the radiative rate constant for this state is substantially larger than the diffusion rate constant for either solvent. For the longer lifetime components of the free base dyes (including $\\mathrm{H}_{2}$ TPP), the oxygen quenching effect is large in toluene but almost absent in DMSO. The lower viscosity of the former solvent $(0.59 \\mathrm{cP} v s .1 .996 \\mathrm{cP})$ allows for better diffusion of both species, and thus an increased likelihood for a quenching event to occur over the life of the excited fluorophore. The longer lifetimes of the zinc compounds show more sensitivity to oxygen, even in DMSO. This is likely due to an enhanced association between the dioxygen quencher and the zinc center, which would effectively increase the encounter radius and quenching efficiency of the pair.\n\nThe solvent has almost no effect on the lifetime of $\\mathrm{H}_{2} \\mathrm{TPP}$ when oxygen is excluded, while the lifetimes of the nitrated derivatives all vary dramatically with the solvent, even under $\\mathrm{N}_{2}$. Since oxygen quenching is negligible, these changes can only be explained by the presence of the nitro group. The effects of the nitro group are typically attributed to the enhancement of either internal conversion (IC) or intersystem crossing (ISC), but the appearance of a separate $\\mathrm{CT}$ interacting with $\\mathrm{S}_{1}$ has also been proposed. ${ }^{39,47-51}$ There are two opposing solvent effects which dictate the singlet lifetime: (1) Solvent viscosity will make IC more important in toluene than DMSO; and (2) Solvent polarity will cause polar states to be stabilized more in DMSO than toluene, increasing non-radiative deactivation due to the Energy Gap Law. The competition between these two effects is evident in the variations of the lifetimes seen in Table 2. Most of the lifetimes are shorter in DMSO, suggesting that they have some polar or \"CT-like\" character, but there are a few exceptions where the other factor apparently becomes more important. It is important to point out that the percent contributions of each lifetime to the overall fluorescence signal cannot be directly correlated to the fractional abundances of the different structures, because there may be intrinsic differences in their emissivity.\n\n\\section{DFT and TD-DFT Calculations}\nIn order to elucidate the structural factors governing the photodynamics, quantum mechanical calculations were performed on several different conformations of the compounds studied. All of the relevant nuclear geometries were optimized using DFT, and TD-DFT was used to generate the vertical excitation energies at the fixed nuclear ground state geometry, as well as the relaxed $\\mathrm{S}_{1}$ geometries. $\\mathrm{H}_{2}$ TPP and $\\mathrm{ZnTPP}$ are both known to be essentially planar macrocycles with almost perpendicular phenyl groups, and our calculations confirm this, with each phenyl group found to be at an angle of $71^{\\circ} \\pm 1^{\\circ}$ with respect to the flat aromatic plane. The z-coordinate plots (i.e. the vertical displacements of the core atoms from the average molecular plane) for these two compounds are shown in the Supplementary Material (Fig. S1), revealing the almost perfect planarity of the macrocycles.\n\n\\section{Tautomers}\nIn their photophysical studies of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$, Chirvony et $\\mathrm{al} .{ }^{39}$ found three unusual characteristics: (1) emission spectra that depend on $\\lambda_{\\mathrm{ex}}$, (2) biexponential fluorescence decay, and (3) inhomogeneous broadening of the absorbance even down to $77 \\mathrm{~K}$. These features, which are consistent with our own experiments, were attributed to the coexistence of two tautomers (see Fig. 4) with different excited state dynamics due to the different position of the nitro group with respect to the aromatic conjugation pathway. Other studies have established the role of asymmetric substitution in breaking the degeneracy of the tautomer energies and perturbing the equilibrium populations. ${ }^{22,67,68}$ Furthermore, while tautomerisation is \"fast\" on typical NMR timescales at room temperature, it is slow with respect to the absorption and emission processes under consideration here, and must be taken into consideration.\n\nWe therefore explicitly constructed the tautomers and optimized them with DFT to examine their properties. Our calculations confirmed that the \"orthogonal\" tautomer is more stable than the \"collinear\" form by almost $3 \\mathrm{kcal} \\cdot \\mathrm{mol}^{-1}$, indicating that the orthogonal form should predominate by more than $97 \\%$ at room temperature equilibrium. Several NMR studies of these and related compounds show similar distributions at cryogenic temperatures, but a slightly lower orthogonal population (ca. 75-90\\%) at room temperature. ${ }^{22,39,69}$ These latter distributions correspond to a $\\Delta \\mathrm{G}_{\\text {taut }}$ of about $0.65-1.30 \\mathrm{kcal} \\cdot \\mathrm{mol}^{-1}$, less than half of what we calculated by DFT. However, thermodynamic considerations don't provide all of the information needed to conclusively make this case. The rate of proton exchange, in both the ground and the excited states, will determine whether or not the absorbance, emission, and lifetimes of the different tautomers can actually be kinetically resolved. ${ }^{70}$ Since excited state proton transfer reactions can occur on the picosecond timescale and below, ${ }^{71-73}$ the dual lifetimes cannot be unambiguously ascribed to the tautomers without independent kinetic information. While studies indicate that the proton exchange is indeed very slow at $200 \\mathrm{~K}$ and below, ${ }^{67}$ direct information about excited state proton transfer at room temperature is not available to our knowledge. Moreover, the inhomogeneous broadening of the absorbance is not due to the superposition of the two tautomers, but rather is intrinsic to each ${ }^{39}$ and thus requires further explanation. Finally, the observation of a biexpoential decay in the metallated species suggests that tautomerism cannot fully account for these dynamics. We have restricted the following analysis of the other compounds to the predominant orthogonal tautomer, but when collinear tautomers were briefly investigated, similar descriptions were always found to apply.\n\n\\section{Dihedral Angle of the Nitro Group}\nWhen relatively bulky groups like $\\mathrm{NO}_{2}$ are added at either the ortho-phenyl or $\\beta$-pyrrole positions, steric hindrance will cause the phenyl angles to change, and can also distort the macrocycle itself. Many different combinations of these nitro and phenyl angles were used as starting structures for the optimization of the $\\beta$-nitro-Por ground states. The ground state structural data for a selection of these conformers is presented in Table 3. In each case, the final dihedral angle of the nitro group $(\\theta)$ lies between $37^{\\circ}$ and $42^{\\circ}$ with respect to the macrocycle plane. This angle also forces the nitro and the nearest phenyl group into a nominally coplanar arrangement, with the latter adopting a shallower angle of about $\\varphi_{1}=$ $59^{\\circ} \\pm 2^{\\circ}$ with respect to the macrocycle plane. At the same time, the nitro-bearing pyrrole itself is tilted (or \"pitched\") upwards out of the plane by the more acute angle of $\\varphi_{1}$, significantly distorting the macrocycle. In their analysis of the tautomers, Chirvony et al. ${ }^{39}$ also reported the effect of $\\theta$ on the transition energies calculated by ZINDO/S. However, these calculations began with a large initial nitro angle of $\\theta=80^{\\circ}$, and left the core macrocycle geometry frozen as $\\theta$ was decreased. Obviously, our results undermine the validity of that approach and the conclusions thereof.\n\n\\section{Macrocycle Distortion}\nDepending on the dispositions of the other phenyl groups around the ring, this distortion caused by the $\\beta$-nitro group can be either enhanced or ameliorated. When the phenyls are all nominally parallel, i.e. tilting in the same direction, each pyrrole unit experiences steric forces from both above and below. Since these forces are nearly balanced, there is little saddling of the Por structure, but the pyrroles will experience a torque (twisting or \"roll\"), becoming more parallel to the adjacent phenyls and resulting in a \"ruffled\" macrocycle. On the other hand, when the phenyls are arranged in a \"zig-zag\" pattern with each one tilted opposite to its two nearest neighbors, the forces in the z-direction are reinforced, tilting (or \"pitching\") the pyrroles further out of the plane to produce a \"saddled\" structure. There are also conformations intermediate between these two cases, in which different pyrroles experience different environments that result in complex superpositions of saddling and ruffling distortions. Figure 5 shows the saddle $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$ structure superimposed over one of the intermediate structures, and Fig. 6 shows plots of the z-coordinates for all of the optimized conformations found. While the ruffled and saddled structures are uniquely determined by the orientation and position of the $\\beta$-nitro group (see Fig. 5), there are obviously many different kinds of intermediate structures with slightly different properties.\n\nInterestingly, no set of initial geometries for $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$ resulted in a purely ruffled optimized structure. In other words, even when the molecular structure was initially constructed with all of the phenyl groups tilting in the same direction, which should produce a ruffled core, the final structure always had at least some of the phenyls oblique to one another, giving an intermediate or even saddle type core. This suggests that a local configuration with parallel adjacent phenyls is thermodynamically disfavored. Indeed, the saddled conformation, in which no two adjacent phenyls are parallel, is calculated to be the most stable conformer by $1 \\mathrm{kcal} \\cdot \\mathrm{mol}^{-1}$ or more (see Table 3), despite the dramatic effect it has on the planarity (see Fig. 6). The nitro group, a $\\pi$-acceptor, apparently draws enough electron density from the aromatic ring to cause it to violate Hückel's $4 n+2$ rule, thus destabilizing the planar conformation relative to the others. The energy differences between the conformations of $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$ are all slightly less, and thus a stable ruffled structure was found (see Fig. S2 in the Supplementary Material). Otherwise, the results are largely the same for the free base and zinc compounds.\n\nThis analysis leads to the conclusion that the mono- $\\beta$-nitro-Pors exist in multiple locally stable conformations subject to thermal equilibrium. The various intermediate conformations all fall within an energy range of about $0.5 \\mathrm{kcal} \\cdot \\mathrm{mol}^{-1}$, which is less than $\\mathrm{k}_{B} \\mathrm{~T}$ at room temperate. We thus hypothesize that they are all in rapid equilibrium with one another due to low interconversion barriers. Collectively, they represent a single \"upper state\" with dynamics that cannot be resolved on the timescale studied at room temperature. The saddled conformation, being ca. $1.0 \\mathrm{kcal} \\cdot \\mathrm{mol}^{-1}$ below the average intermediate state, should account for about $80 \\%$ of the molecular conformations according to a classical Boltzmann distribution. A significant energetic or kinetic barrier between the intermediate and saddle conformers could make interconversion between them slow on the timescale studied. Thus, if these or similar conformations persist into the excited state, they could explain both an excitation dependent emission spectrum and the dual lifetimes observed. Moreover, this description naturally accounts for the inhomogeneous broadening of the absorbance spectra, since the macrocycle geometry is more flexible and sensitive to the phenyl positions in both conformations.\n\nTo further test this hypothesis we used another TD-DFT optimization to follow the nuclear relaxation of the two different conformations in the first excited state. These results confirm the existence of two distinct conformations, similar to the ground state, with transition wavelengths separated by about $11 \\mathrm{~nm}$. A schematic of these energy levels for $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$ are given in Fig. 7. Excitation of either ground state conformation leads to an unstable excited state geometry that can relax into either of the two local minima in the $S_{1}$ potential energy surface. While the higher energy conformation in the excited state would not normally be populated at room temperature under equilibrium conditions, a kinetic barrier to interconversion could make the rate of thermal equilibration slow enough for fluorescence decay to become competitive. This would result in observable fluorescence from both states, with distinct Stokes shifts, lifetimes, etc. for each. The differences in the dipole moments and conformational dynamics of each state could also account for the different solventdependent behavior observed for the two lifetimes. Unfortunately, since we cannot accurately account for all of the deactivation processes from the relaxed excited states, we cannot use the TD-DFT results to quantitatively predict the quantum yields or lifetimes. In particular, intersystem crossing has been shown to be an important factor in depopulating $\\mathrm{S}_{1}$ for nitro-Pors, and has also been shown to increase with distortion of the macrocycle. ${ }^{74-76}$\n\nIn the free base compounds, this analysis is complicated by the existence of distinct tautomers for each conformation. According to our calculations, the collinear tautomer is almost $3 \\mathrm{kcal} \\cdot \\mathrm{mol}^{-1}$ above the orthogonal tautomer for each structural conformation, while only about 0.9-1.4 $\\mathrm{kcal} \\cdot \\mathrm{mol}^{-1}$ separates the saddle from the intermediate form for each tautomer. Since we cannot directly quantify the relative rates of tautomerisation and conformational interconversion in the excited state, as they pertain to Kasha's rule, we cannot unambiguously rule out a contribution from the distinct tautomers. However, the DFT results indicate that the two different conformations of the orthogonal tautomer will predominate over the collinear tautomers, and the similarity to experimental results for the zinc porphyrins confirms that there must be some other mechanism at play.\n\nIn contrast to the $\\beta$ substituted nitro-Pors, all of the surveyed initial structures for $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{4} \\mathrm{TPP}$ and $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{4}$ TPP converged to a very slight saddle conformation but remained almost completely planar (see Supplementary Material, Fig. S3 and S4). Steric repulsion between the electron rich nitro groups and the aromatic $\\pi$-system forces the phenyls into a more perpendicular orientation $\\left(\\varphi_{n}=78^{\\circ} \\pm 1^{\\circ}\\right.$, for all $n$ ). At the same time, this creates a significant barrier to rotation, giving rise to four distinct atropisomers, designated\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_b0501f9057db320b8ad9g-11_1445_1493_518_1765}\\\\\ndue to the orientation of the ortho-nitro groups, the ground state energies are all within about $0.3 \\mathrm{kcal} \\cdot \\mathrm{mol}^{-1}$ of one another, with $\\alpha \\beta \\alpha \\beta$ being the most stable. The TD-DFT transition energies and compositions of the various atropisomers are also nearly identical, as are the relaxed excited state geometries.\n\nWhen we performed a similar analysis on a set of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}$ conformers, however, we came to a slightly different conclusion. The presence of the pyrrole-nitro further splits the four atropisomers of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{4} \\mathrm{TPP}$ into 32 distinct geometries of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}-16$ pairs of enantiomers. In order to properly survey all of these isomers, we need to decide on a set of conventions for uniquely identifying and naming them. Before assigning the $\\alpha / \\beta$ designations, it is useful to first mentally orient all of the isomers in the same way so that the pyrrole-nitro groups (on the 2-carbon by IUPAC convention) coincide. Of the 32 isomers, half will have the nitro pointing upwards when oriented in this manner. The other half, in which the nitro points downwards in this position, are enantiomeric to the first half and thus have the same electronic structure and can be neglected for our purposes. Since the nitro group also breaks the 4-fold rotational symmetry of the macrocycle, we must also be consistent in assigning the $\\alpha / \\beta$ orientations to the individual nitro-phenyl groups. For example, the $\\alpha \\beta \\alpha \\beta$ and $\\beta \\alpha \\beta \\alpha$ isomers can be distinguished if we adopt the convention that the first character ( $\\alpha$ or $\\beta$ ) in the name corresponds to the orientation of the nitro-phenyl group closest to the $\\beta$ - $\\mathrm{NO}_{2}$. This will be the nitro-phenyl group on the 20 -carbon, under the standard porphyrin numbering scheme, but we designate it first because its orientation is most strongly correlated with that of the pyrrole-nitro group.\n\nWe again surveyed a broad sample of these various conformations, and the z-coordinate plots are shown in Fig. S5 in the Supplementary Material, with the physical data given in Table 3. These conformers also tend to group into two states that are well-separated in energy, but the determining factor here is not the distortion of the macrocycle. In fact, all of the structures sampled converged to one of the intermediate conformations - no purely ruffled or saddled type conformers were found. Rather, the orientation of the nitro-phenyl dipoles with respect to the $\\beta$-nitro group dictates the overall energy. In particular, the orientation of that nitro-phenyl closest to the $\\beta$-nitro has the largest influence on the energies, splitting them into higher energy ( $\\beta$ xxx-type) and lower energy (axxx-type) levels, where the \"xxx\" part is simply a placeholder representing the other, less important nitrophenyl orientations. The $\\beta$-nitro dipole and the closest nitro-phenyl dipole are almost perfectly orthogonal in the axxx-type atropisomers, but have an obtuse angle in the $\\beta x x x-$ type. This creates a more unfavorable dipole-dipole interaction for the latter, raising its energy almost $1.5 \\mathrm{kcal} \\cdot \\mathrm{mol}^{-1}$ relative to the former. The other nitro-phenyl dipole orientations further modulate the molecular energies, but only slightly $\\left(<0.5 \\mathrm{kcal} \\cdot \\mathrm{mol}^{-1}\\right)$. The TD-DFT results for $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{5}$ TPP again show the coexistence of two stable conformations in the excited state. The energy level scheme is shown in Fig. S9 in the Supplementary Material, and has many of the same characteristics as for $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$.\n\nIn $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{6} \\mathrm{TPP}$, all of these complications are further exacerbated by the presence of a second pyrrolic nitro group. After surveying a range of structures, a stable saddle-type conformer once again emerged. In addition, the intermediate structures further split into the $\\beta$ xxx-type and axxx-type conformers, as in the penta-nitro derivatives. Thus, there appear to be at least three separate structures that are well-resolved in terms of the energy, and possibly more. The experimental results suggest that not all of these states are populated or resolved under standard conditions.\n\nDFT calculations on the series of nitrated zinc Pors leads to results that are qualitatively similar to those just discussed. As mentioned, the energy differences between the various geometries are all slightly smaller than for the corresponding free base compounds. This lowers the ruffled conformer of $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$ enough to make it an accessible, stable geometry, and confirms that the energies of the intermediate structures are about halfway between the saddled and ruffled forms, as expected. Corresponding z-coordinate data for the zinc compounds is given in the supporting information.\n\n\\section{Charge Transfer (CT) States}\nThe presence of a strongly electron withdrawing group such as $\\mathrm{NO}_{2}$ suggests the possibility of a CT state. If the emissive singlet is able to interact with this CT state, it will be quenched and shortened in a way consistent with the experimental spectroscopy. ${ }^{39,47-52,65}$\n\nUnfortunately, there seem to be contradictory, yet at times overlapping, descriptions of how this interaction is manifested, with some authors postulating a distinct CT state formed by a separate electron transfer step, ${ }^{39,47-51}$ while others simply attribute a \"CT character\" to $\\mathrm{S}_{1}$ itself. ${ }^{50,51}$ There has also been discussion of a \"twisted intramolecular charge transfer\" (TICT) occurring when there is electron transfer to the nitro group followed by a rotation making it perpendicular to the macrocycle plane. While there is little doubt that nitro groups withdraw substantial electron density in the excited state, resulting in a large dipole moment, that alone is not sufficient to identify $\\mathrm{S}_{1}$ with an emissive CT state.\n\nTo characterize the nature of these transitions, we analyzed their composition according to the DFT and TD-DFT results. The ground state orbital energy levels of the free base Pors are shown in Fig. 8, and the corresponding levels for the zinc Pors are given in Fig. S10 in the Supplementary Material. The levels are color coded according to the type of orbital: yellow for orbitals localized on the macrocycle core, red for nitro orbitals, and blue for phenyl orbitals. Orbitals that are delocalized among two or more regions have composite colors: orange for core/nitro, green for core/phenyl, purple for nitro/phenyl, and black for all three. The $\\beta$-nitro groups mix with one of the macrocycle-centered LUMOs, lowering it in energy and breaking the degeneracy. On the other hand, the more pure nitro-localized orbitals remain relatively high in energy for these compounds. The situation for $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{4} \\mathrm{TPP}$ is different because the nitro groups are not directly conjugated into the aromatic ring. Instead, the ortho arrangement puts them close to the core $\\pi$-system and allows them to mix equally with both LUMOs equally. This \"through-space\" interaction is much weaker and only shifts the orbitals about $0.1 \\mathrm{eV}$ in energy, explaining the much smaller redshift in their spectra.\n\nIn $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}$ and $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{6}$ TPP, the phenyl-nitro groups mix with the phenyl orbitals themselves more than in $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{4}$ TPP. This is a consequence of the structural reorganization caused by the $\\beta$-nitro forcing the phenyl groups away from the more perpendicular angle attained in $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{4} \\mathrm{TPP}$. This, in turn, forces the ortho-nitro groups to adopt shallower dihedral angles with respect to the phenyl, allowing more effective orbital mixing. Meanwhile, the core nitro group lowers the energy of both LUMOs enough to decouple them from the ortho-nitro groups, albeit unequally. The primary change induced by the second $\\beta$-nitro in $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{6} \\mathrm{TPP}$ is the lowering of the second LUMO, essentially restoring the degeneracy.\n\nThe energy levels marked with open circles in Fig. 8 indicate orbitals that are involved in TD-DFT transitions less than about $3.0 \\mathrm{eV}$. The compositions of these same transitions, in terms of singly excited Slater determinants, is given in Table 4 (and Table S1 in the Online Resources). As expected, the lowering of one of the LUMOs in $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$ increases the $\\mathrm{H} \\rightarrow \\mathrm{L}$ contribution to the lowest energy transition, redshifting it substantially in both conformations. However, the next lowest transition present in $\\mathrm{H}_{2} \\mathrm{TPP}$ becomes mixed with a core $\\rightarrow$ nitro excitation in both conformations of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$, raising its energy and blueshifting it from $536 \\mathrm{~nm}$ to about $430 \\mathrm{~nm}$. Moreover, a new transition arises between these (at $468 \\mathrm{~nm}$ ) in the intermediate conformation, and has a $74 \\%$ core $\\rightarrow$ nitro excitation component. While there may be higher energy pure CT states, they would not be close enough in energy to $\\mathrm{S}_{1}$ for there to be a meaningful thermodynamic equilibrium between them.\n\nIn order to visualize these transitions in terms of the charge transfer, electron differencedensity maps ${ }^{77}$ (EDDMs) were generated for each one (see Supplementary Material, Fig. S11 through S17). There is a buildup of charge on the nitro group in all of the transitions of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)$ TPP (for both conformations), but there also remains substantial electron density on the macrocycle, even in the new $468 \\mathrm{~nm}$ transition of the intermediate conformation. Thus, none of these can be assigned to a pure CT state. A similar inspection of the wavefunctions for the relaxed excited states leads to the same conclusion. In fact, upon relaxation within the $S_{1}$ manifold, the $\\beta$-nitro dihedral angle decreases by almost $30^{\\circ}$, becoming more coplanar with the macrocycle and increasing the conjugation and thus the electron delocalization. This is in direct contradiction to the hypothesis of a TICT state, but is consistent with the results of Chirvony et al., who also report that $\\mathrm{S}_{1}$ has a transient absorbance spectrum most similar to a ${ }^{1}\\left(\\pi, \\pi^{*}\\right)$ state. ${ }^{39}$\n\nThe lowest energy transitions of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{4}$ TPP have a composition similar to the same transitions in $\\mathrm{H}_{2} \\mathrm{TPP}$, which correspond to the $\\mathrm{Q}_{\\mathrm{x}}(0,0)$ and $\\mathrm{Q}_{\\mathrm{y}}(0,0)$ bands. The transition EDDMs for the two compounds also match very closely, with some additional charge buildup on the nitro-phenyl groups in $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{4}$ TPP. Visual inspection of the maps indicates that the $533 \\mathrm{~nm}$ transition of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{4}$ TPP may be the closest to being a true CT state (see Fig. S13 in the Supplementary Material). This is consistent with previous reports of related compounds, ${ }^{47-49}$ which analyzed the intramolecular charge transfer to an ortho-nitro-phenyl in terms of Marcus theory. It is worth noting, however, that the dihedral angles of the nitro groups with respect to the phenyls decrease from $c a .25^{\\circ}$ in the ground state to $c a .17^{\\circ}$ in the relaxed excited state, contrary to the TICT hypothesis. The CT state formed here is also different in that it is actually delocalized over all four nitro groups. This will affect factors such as the solvent reorganization energy and the CT lifetime, and may have important implications for harnessing the state to use in specific applications.\n\nIn $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}$, the transitions share features of the mono- and tetra-nitro derivatives. For both the $\\operatorname{axx}$ and $\\beta \\mathrm{xxx}$ type atropisomers, transitions corresponding to the $\\mathrm{Q}_{\\mathrm{x}}(0,0)$ and $\\mathrm{Q}_{\\mathrm{y}}(0,0)$ bands are present. These are perturbed by the $\\beta$-nitro in a manner almost identical to the intermediate conformation of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$, resulting in bands near 630 and $430 \\mathrm{~nm}$. There are also new bands that arise between these with significant CT character (see Fig. S14 and S15 in the Supplementary Material), but these are formed by the mixing of multiple nitro groups simultaneously, as in $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{4} \\mathrm{TPP}$. The axxx-type atropisomers apparently have more pure CT transitions at 449 and $442 \\mathrm{~nm}$, but both of these are formed by transfer to the ortho-nitro groups with the $\\beta$-nitro actually losing electron density. The transitions of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{6} \\mathrm{TPP}$ are even further complicated by the second $\\beta$-nitro, the four ortho-nitro groups, and the coexistence of two or more conformations. The two examples in Table S1 in the Supplementary Material (see also Fig. S16 and S17) show the extreme variation in the number and character of the transitions.\n\nThe relaxed $\\mathrm{S}_{1}$ geometries of the penta- and hexa-nitro derivatives are more complicated than the other cases. For $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}$, they again display shallower angles for both the ortho- and $\\beta$-nitro groups, but for $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{6}$ TPP one of the $\\beta$-nitro groups becomes slightly more perpendicular by about $5^{\\circ}$. Moreover, the wavefunction compositions have a different character after nuclear reorganization, with more pure CT states developing. This could indicate the potential for efficient charge separation, although the ground state oscillator strengths are generally small and the transition probabilities between the excited states are unknown.\n\n\\section{Conclusions}\nThe strong electron withdrawing nature of the nitro group makes it very useful for modulating the ground state properties and excited state dynamics of porphyrinoids and other organic dyes. It can be tempting to try to explain all of the properties of a nitrated porphyrin compound strictly in terms of electronic effects, but our results indicate that structural factors related to the presence of an $\\mathrm{NO}_{2}$ group can be just as important, if not more so. Taken together, our spectroscopic and quantum chemical studies point to three principal conclusions: (1) a nitro group at a $\\beta$-pyrrole position can interact with a nearby bulky meso-substituent to significantly distort the macrocycle; (2) increased conformational dynamics can lead to multiple stable minima in both the ground and excited state potential energy surfaces, each with different photophysical characteristics; and (3) the position of the nitro group will significantly modify the excited state dynamics and dictate the existence and energy of a CT state.\n\nIn addition, there are many subtle effects that the detailed molecular structure can have on the photodynamics, especially when both meso-phenyl and $\\beta$-pyrrole nitro groups are present in the same molecule. Given the important role of atropisomerism in these compounds, for example, it may be possible to use an external field to switch between two states with distinguishable excited state dynamics. Depending on the specific interconversion barriers between states, this could manifest as electrochromic or photochromic behavior, although we have not observed any evidence for this to date. The rate of intersystem crossing is another important factor to consider, as the triplet state population can be crucial to applications in photodynamic therapy, photovoltaics, and organic light emitting diodes.\n\nThese results also have implications for organic dyes other than nitrated porphyrins. The nitro group itself has some electronic effect on the photophysics, but many of the more significant changes are due to the distortion of the macrocycle. The structural changes induced by the nitro group can also be brought about by the presence of other bulky substituents. There is at least one example of anomalous biexponential decay of distorted Pors reported in the literature, ${ }^{78}$ but while the authors discuss the possibility of multiple stable excited state conformations, they do not explicitly cite this as the reason for the dual lifetimes. This framework may be useful for interpreting other results in the literature, and should also help point to new directions for future progress.\n\n\\section{Supplementary Material}\nRefer to Web version on PubMed Central for supplementary material.\n\n\\section{Acknowledgments}\nThis work was supported by the US National Science Foundation (NSF), through CHE-1610755 to C.M.D. Hunter College science infrastructure is supported by the NSF, the City University of New York, and the National Institute of Health through award number MBRS GM-R25-60665 and award number 8G12-MD007599 of the National Institute on Minority Health and Health Disparities.\n\n\\section{References and Notes}\n\\begin{enumerate}\n  \\item Seybold PG, Gouterman M. J Mol Spectrosc. 1969; 31:1-13.\n\n  \\item Hosomizu K, Oodoi M, Umeyama T, Matano Y, Yoshida K, Isoda S, Isosomppi M, Tkachenko NV, Lemmetyinen H, Imahori H. J Phys Chem B. 2008; 112:16517–16524. [PubMed: 19053673]\n\n  \\item Mathew S, Iijima H, Toude Y, Umeyama T, Matano Y, Ito S, Tkachenko NV, Lemmetyinen H, Imahori H. J Phys Chem C. 2011; 115:14415-14424.\n\n  \\item Grover N, Sankar M, Song Y, Kadish KM. Inorg Chem. 2016; 55:584-597. [PubMed: 26716933]\n\n  \\item Wang L, She Y, Zhong R, Ji H, Zhang Y, Song X. Org Process Res Dev. 2006; 10:757-761.\n\n  \\item Zakavi S, Heidarizadi F, Rayati S. Inorg Chem Commun. 2011; 14:1010-1013.\n\n  \\item Ozette K, Leduc P, Palacio M, Bartoli JF, Barkigia KM, Fajer J, Battioni P, Mansuy D. J Am Chem Soc. 1997; 119:6442-6443.\n\n  \\item Schiavon MA, Iamamoto Y, Nascimento OR, Assis MdD. J Mol Catal A: Chem. 2001; 174:213222.\n\n  \\item Gong LC, Dolphin D. Can J Chem. 1985; 63:401-405.\n\n  \\item Bartoli JF, Battioni P, De Foor WR, Mansuy D. J Chem Soc, Chem Commun. 1994:23–24.\n\n  \\item Sun B, Ou Z, Yang S, Meng D, Lu G, Fang Y, Kadish KM. Dalton Trans. 2014; 43:10809-10815. [PubMed: 24882526]\n\n  \\item Suslick KS, Chen CT, Meredith GR, Cheng LT. J Am Chem Soc. 1992; 114:6928-6930.\n\n  \\item Sen A, Krishnan V. Tetrahedron Lett. 1996; 37:5421-5424.\n\n  \\item Chou, J-H., Kosal, ME., Nalwa, HS., Rakow, NA., Suslick, KS. The Porphyrin Handbook. Vol. 6. Academic Press; New York: 2000. p. 43-131.\n\n  \\item Senge MO, Ryppa C, Fazekas M, Zawadzka M, Dahms K. Chemistry. 2011; 17:13562-13573. [PubMed: 22038942]\n\n  \\item Schiavon MA, Iwamoto LS, Ferreira AG, Iamamoto Y, Zanoni MVB, Assis MdD. J Brazilian Chem Soc. 2000; 11:458-466.\n\n  \\item Gros CP, Desbois N, Michelin C, Demilly E, Tilkin-Mariamé AF, Mariamé B, Gallardo F. ACS Infectious Dis. 2015; 1:350-356.\n\n  \\item Maiya GB, Krishnan V. J Phys Chem. 1985; 89:5225-5235.\n\n  \\item Kim HS, Kim CH, Ha CS, Lee JK. Synth Met. 2001; 117:289-291.\n\n  \\item Tingting, X., He, H., Wang, Q., Dubey, M., Xingzhong, Y., Galipeau, D., Ropp, M. Photovoltaic Specialists Conference, 33rd IEEE. IEEE; San Diego, CA: 2008. p. 1-3.\n\n  \\item Karelson M, Pihlaja K, Tamm T, Uri A, Zerner MC. J Photochem Photobiol A. 1995; 85:119-126.\n\n  \\item Crossley MJ, Harding MM, Sternhell S. J Am Chem Soc. 1986; 108:3608-3613.\n\n  \\item Yang S, Sun B, Ou Z, Meng D, Lu G, Fang Y, Kadish KM. J Porphyrins Phthalocyanines. 2013; 17:857-869.\n\n  \\item Karki L, Vance FW, Hupp JT, LeCours SM, Therien MJ. J Am Chem Soc. 1998; 120:2606–2611.\n\n  \\item Siri O, Jaquinod L, Smith KM. Tetrahedron Lett. 2000; 41:3583-3587.\n\n  \\item Vicente MGH, Neves MGPMS, Cavaleiro JS, Hombrecher HK, Koll D. Tetrahedron Lett. 1996; 37:261-262.\n\n  \\item Barkigia KM, Renner MW, Senge MO, Fajer J. J Phys Chem B. 2004; 108:2173–2180.\n\n  \\item Pukhovskaya SG, Ivanova YB, Nam DT, Vashurin AS. Russ J Phys Chem A. 2014; 88:1670–1676.\n\n  \\item Ivanova YB, Nam DT, Chizhova NV, Mamardashvili NZ. Russ J Gen Chem. 2014; 84:1207–1211.\n\n  \\item Ivanova YB, Chizhova NV, Mamardashvili NZ. Russ J Gen Chem. 2014; 84:1394-1398.\n\n  \\item Dey S, Ikbal SA, Rath SP. New J Chem. 2014; 38:1458-1470.\n\n  \\item Kleij AW, Kuil M, Tooke DM, Spek AL, Reek JN. Inorg Chem. 2005; 44:7696-7698. [PubMed: 16241114]\n\n  \\item Weimin S, Qi S, Yucheng W, Lihong L, Jingchao T. J Heterocycl Chem. 2010; 47:1221–1224. 34. Luguya R, Jaquinod L, Fronczek FR, Vicente MGH, Smith KM. Tetrahedron. 2004; 60:27572763.\n\n  \\item Ormond AB, Freeman HS. Dyes Pigm. 2013; 96:440-448.\n\n  \\item Rose E, Cardon-Pilotaz A, Quelquejeu M, Bernard N, Kossanyi A, Desmazieres B. J Org Chem. 1995; 60:3919-3920.\n\n  \\item Serra VIV, Pires SMG, Alonso CMA, Neves MGPMS, Tomé AC, Cavaleiro JAS. Top Heterocycl Chem. 2014; 33:35-78.\n\n  \\item Karolczak J, Kowalska D, Lukaszewicz A, Maciejewski A, Steer RP. J Phys Chem A. 2004; 108:4570-4575.\n\n  \\item Chirvony VS, van Hoek A, Schaafsma TJ, Pershukevich PP, Filatov IV, Avilov IV, Shishporenok SI, Terekhov SN, Malinovskii VL. J Phys Chem B. 1998; 102:9714-9724.\n\n  \\item Senge MO, Eigenbrot CW, Brennan TD, Shusta J, Scheidt WR, Smith KM. Inorg Chem. 1993; 32:3134-3142.\n\n  \\item Ono N, Muratani E, Fumoto Y, Ogawa T, Tazima K. J Chem Soc, Perkin Trans 1. 1998:3819–3824.\n\n  \\item Drain CM, Kirmaier C, Medforth CJ, Nurco DJ, Smith KM, Holten D. J Phys Chem. 1996; 100:11984-11993.\n\n  \\item Hindin E, Kirmaier C, Diers JR, Tomizaki K-Y, Taniguchi M, Lindsey JS, Bocian DF, Holten D. J Phys Chem B. 2004; 108:8190-8200.\n\n  \\item Hwang IW, Kamada T, Ahn TK, Ko DM, Nakamura T, Tsuda A, Osuka A, Kim D. J Am Chem Soc. 2004; 126:16187-16198. [PubMed: 15584755]\n\n  \\item Hsiao JS, Krueger BP, Wagner RW, Johnson TE, Delaney JK, Mauzerall DC, Fleming GR, Lindsey JS, Bocian DF, Donohoe RJ. J Am Chem Soc. 1996; 118:11181-11193.\n\n  \\item Zhao Z, Nyokong T, Maree MD. Dalton Trans. 2005:3732–3737. [PubMed: 16471053]\n\n  \\item Knyukshto V, Zenkevich E, Sagun E, Shulga A, Bachilo S. Chem Phys Lett. 1999; 304:155-166.\n\n  \\item Knyukshto VN, Zen'kevich ÉI, Sagun EI, Shul'ga AM, Bachilo SM. J Appl Spectrosc. 1999; 66:588-592.\n\n  \\item Knyukshto VN, Sagun EI, Shul'ga AM, Bachilo SM, Zen'kevich ÉI. Opt Spectrosc. 2000; 88:205216.\n\n  \\item Dahal S, Krishnan V. J Photochem Photobiol A. 1995; 89:105-112.\n\n  \\item Dahal S, Krishnan V. Chem Phys Lett. 1997; 274:390-395.\n\n  \\item Gust D, Moore TA, Luttrull DK, Seely GR, Bittersmann E, Bensasson RV, Rougée M, Land EJ, Schryver FCD, Auweraer MVd. Photochem Photobiol. 1990; 51:419–426. [PubMed: 2343060]\n\n  \\item Harriman A, Hosie RJ. J Chem Soc Faraday Trans 2. 1981; 77:1695–1702.\n\n  \\item Wickramasinghe A, Jaquinod L, Nurco DJ, Smith KM. Tetrahedron. 2001; 57:4261-4269.\n\n  \\item Farley C, Bhupathiraju NV, John BK, Drain CM. J Phys Chem A. 2016; 120:7451-7464. [PubMed: 27552232]\n\n  \\item Kim JB, Leonard JJ, Longo FR. J Am Chem Soc. 1972; 94:3986-3992. [PubMed: 5037983]\n\n  \\item Barnett GH, Hudson MF, Smith KM. J Chem Soc, Perkin Trans 1. 1975:1401-1403.\n\n  \\item Lan M, Zhao H, Yuan H, Jiang C, Zuo S, Jiang Y. Dyes Pigm. 2007; 74:357-362.\n\n  \\item Wróbel D, Łukasiewicz J, Goc J, Waszkowiak A, Ion R. J Mol Struct. 2000; 555:407–417.\n\n  \\item Vogel GC, Stahlbush JR. Inorg Chem. 1977; 16:950-953.\n\n  \\item Cole SJ, Curthoys GC, Magnusson EA, Phillips JN. Inorg Chem. 1972; 11:1024-1028.\n\n  \\item Nappa M, Valentine JS. J Am Chem Soc. 1978; 100:5075-5080.\n\n  \\item Kolling OW. Inorg Chem. 1979; 18:1175-1176.\n\n  \\item Kolling OW. Anal Chem. 1982; 54:260-264.\n\n  \\item Takahashi K, Hase S, Komura T, Imanaga H, Ohno O. Bull Chem Soc Jap. 1992; 65:1475-1481.\n\n  \\item Krishnan V. J Indian Inst Sci. 1999; 79:3-16.\n\n  \\item Crossley MJ, Field LD, Harding MM, Sternhell S. J Am Chem Soc. 1987; 109:2335-2341.\n\n  \\item Reimers JR, Lue TX, Crossley MJ, Hush NS. J Am Chem Soc. 1995; 117:2855–2861.\n\n  \\item Crossley MJ, Harding MM, Sternhell S. J Am Chem Soc. 1992; 114:3266-3272. 70. Taylor, PJ., van der Zwan, G., Antonov, L. Tautomerism: Methods and Theories. Antonov, L., editor. Wiley-VCH Verlag GmbH \\& Co. KGaA; Weinheim, Germany: 2014.\n\n  \\item Elsaesser T, Schmetzer B. Chem Phys Lett. 1987; 140:293-299.\n\n  \\item Elsaesser T, Schmetzer B, Lipp M, Bäuerle RJ. Chem Phys Lett. 1988; 148:112–118.\n\n  \\item Laermer F, Elsaesser T, Kaiser W. Chem Phys Lett. 1988; 148:119-124.\n\n  \\item Gentemann S, Medforth CJ, Forsyth TP, Nurco DJ, Smith KM, Fajer J, Holten D. J Am Chem Soc. $1994 ; 116: 7363-7368$.\n\n  \\item Roder B, Buchner M, Ruckmann I, Senge MO. Photochem Photobiol Sci. 2010; 9:1152-1158. [PubMed: 20571638]\n\n  \\item Regev A, Galili T, Medforth CJ, Smith KM, Barkigia KM, Fajer J, Levanon H. J Phys Chem. 1994; 98:2520-2526.\n\n  \\item Steiner E. Theor Chim Acta. 1982; 60:561-572.\n\n  \\item Sazanovich IV, Galievsky VA, van Hoek A, Schaafsma TJ, Malinovskii VL, Holten D, Chirvony VS. J Phys Chem B. 2001; 105:7818-7829.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_b0501f9057db320b8ad9g-19_197_1067_342_1994}\n\n\\end{enumerate}\n\nFigure 1.\n\nStructures of the nitro substituted Por compounds studied in this paper. The abbreviated names for the different compounds indicate the total number of nitro groups, but do not explicitly specify their locations.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-20_201_1480_516_1804}\n\\end{center}\n\nFigure 2.\n\nNormalized UV-Vis absorbance spectra of the free base (a and c) and metallated (b, d, and e) nitro-porphyrins in DMSO (solid black lines) and toluene (dashed red lines). The Q band regions (from 500-750 nm) have been scaled up by a factor of 10, as indicated in the graphs. (a) $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$; (b) $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$; (c) $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}$; (d) $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP}$; (e) $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{6} \\mathrm{TPP}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-21_199_1470_516_1804}\n\\end{center}\n\nFigure 3.\n\nNormalized fluorescence emission spectra of the free base ( $\\mathrm{a}$ and $\\mathrm{c}$ ) and metallated (b, d, and e) nitroporphyrins in DMSO (black lines) and toluene (red lines). Degassed $\\mathrm{N}_{2}$ solutions are denoted by solid lines, and those under ambient atmosphere are denoted by dashed lines, although they largely overlap due to normalization. (a) $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$; (b) $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$; (c) $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP} ;$ (d) $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{5} \\mathrm{TPP} ;$ (e) $\\mathrm{Zn}\\left(\\mathrm{NO}_{2}\\right)_{6} \\mathrm{TPP}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-22_198_843_343_1045}\n\\end{center}\n\n\"Collinear\"\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-22_198_843_1080_1977}\n\\end{center}\n\n\"Orthogonal\"\n\nFigure 4.\n\nInequivalent tautomers of a free base $\\beta$-nitro-Por. The blue bonds highlight the aromatic conjugation pathways.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-23_205_1292_564_1762}\n\\end{center}\n\nFigure 5.\n\nThe two principal conformations of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right)$ TPP superimposed on one another to show the deviations. The opaque structure is the saddled conformation, and the translucent structure is an intermediate conformation. The nitro group and the nearest phenyl are locked into essentially the same position in all conformations, while rotation of the other phenyls pushes the other pyrrole groups above or below the plane. Intermediate 1\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-24_254_689_357_1156}\n\\end{center}\n\nIntermediate 3\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-24_782_1213_362_1156}\n\\end{center}\n\nIntermediate 2\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-24_259_684_1172_1972}\n\\end{center}\n\nSaddle\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-24_781_1209_1171_1973}\n\\end{center}\n\nFigure 6.\n\nZ-coordinates of the core atoms for the various optimized conformations of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$. The red arrow points to the nitro-bearing pyrrole carbon. The horizontal axis is arbitrary. There is significantly more planar deviation throughout the entire ring for the saddle conformation.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-25_206_1252_449_1882}\n\\end{center}\n\n\\section{Intermediate}\nSaddle\n\nFigure 7.\n\nSchematic energy level diagram of the two principal conformations of $\\mathrm{H}_{2}\\left(\\mathrm{NO}_{2}\\right) \\mathrm{TPP}$. The thick black horizontal lines represent optimized or relaxed nuclear geometries and the thinner black horizontal lines represent unrelaxed nuclear geometries. Vertical blue and red arrows represent absorption and emission, respectively, while the wavy orange arrows represent internal conversion. The dashed black lines indicate (unknown) barriers to interconversion between the relaxed geometries. Depending on these barrier heights, the unrelaxed geometries may be able to internally convert to either conformation, potentially scrambling the populations.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_b0501f9057db320b8ad9g-26_199_1423_366_1952}\n\nFigure 8.\n\nGround state energy levels for the series of free base nitro-Pors. The HOMO-LUMO gap energies are shown in the center for each compound. The energy levels are color coded according to the localization of the orbital density, as shown in the key at the bottom. Orbitals involved in the first few TD-DFT transitions are marked with open circles ( $\\mathrm{O}$ ).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-27_909_2365_187_1765}\n\\end{center}\n\nJ Comput Chem. Author manuscript; available in PMC 2019 July 05.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-28_195_1898_163_477}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-29_209_2361_188_1655}\n\\end{center}\n\nJ Comput Chem. Author manuscript; available in PMC 2019 July 05.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-30_1047_2363_182_1791}\n\\end{center}\n\nJ Comput Chem. Author manuscript; available in PMC 2019 July 05. Table 4\n\nTD-DFT transitions for the series of free base nitro-Pors.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b0501f9057db320b8ad9g-32_407_1773_257_1537}\n\\end{center}\n\n$\\left[{ }^{[a]}\\right.$ Energy of the transition in electron volts (eV). Only transitions with energies below $3.0 \\mathrm{eV}$ are given.\n\n$[b]$ Transition wavelength in nanometers.\n\n$[c]$ Oscillator strengths. Only transitions with oscillator strengths greater than $0.01$ are given.\n\n$[d]$ Excited state wavefunction, in terms of the contributions of single excitations of the ground state Slater determinant. Only single excitations with contributions greater than $5 \\%$ are given. The HOMO is designated \"H\", the second HOMO is \"H-1\", etc. The LUMO is designated \"L\", the second LUMO is \"L+1\", etc. Excitations involving only orbitals corresponding to Gouterman's four-orbital model are shown in bold. Excitations which populate a nitro or nitro-like orbital (CT-type) are underlined.\n\n\n\\end{document}", "record_id": "2023_09_22_b0501f9057db320b8ad9g"}