{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{PAPER }\n\n\n\\author{Ke Zhou, ${ }^{a}$ Liqing Li, (DD *a Xiancheng Ma, ${ }^{a}$ Yamian Mo, ${ }^{\\text {a }}$ Ruofei Chen, ${ }^{a}$ Hailong $L^{a}{ }^{a}$\\\\\nand Haoyang Lii}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\DeclareUnicodeCharacter{2020}{$\\dagger$}\n\n\\begin{document}\n\\maketitle\nView Article Online\n\nView Journal | View Issue\n\nCheck for updates\n\nCite this: RSC Adv., 2018, 8, 2922 Received 24th October 2017 Accepted 9th January 2018\n\nDOI: 10.1039/c7ra11740j\n\n\\href{http://rsc.li/rsc-advances}{rsc.li/rsc-advances}\n\n\\section{Activated carbons modified by magnesium oxide as highly efficient sorbents for acetone $\\dagger$}\nPorous activated carbon modified with $\\mathrm{MgO}$ was synthesized by an evaporation-induced self-assembly (EISA) method for its application to acetone capture. The textural and chemical characteristics of five modified activated carbon composites $(\\mathrm{AC}-\\mathrm{MgO})$ were characterized using X-ray diffraction, scanning electron microscopy, transmission electron microscopy and nitrogen adsorption isotherm measurements. The adsorption behaviors of samples for acetone were investigated and correlated to their physical and chemical properties. Density functional theory was also employed to calculate the charge transfer, the equilibrium distance, and the adsorption energy of acetone adsorbed on a carbon surface functionalized with crystalline MgO. An AC-MgO-10\\% sample with balanced surface area, microporosity and $\\mathrm{MgO}$ content exhibited the highest acetone adsorption capacity $\\left(432.7 \\mathrm{mg} \\mathrm{g}^{-1}\\right)$. The results indicate that an appropriate $\\mathrm{MgO}$ content on AC can effectively improve the adsorption capacity of acetone ascribed to strong chemisorption between $\\mathrm{MgO}$ nanoparticles and acetone molecules.\n\n\\section{Introduction}\nVolatile organic compounds (VOCs), the principle causes of severe air pollution, are often malodorous, toxic and carcinogenic even at a very low concentration. ${ }^{1-3}$ Therefore, the problem of how to remove and dispose of VOCs has attracted extensive attention from society. At present, several methods including condensation, distillation, biological treatment, catalytic oxidation and adsorption have been used for VOC abatement. ${ }^{4-8}$ Among them, adsorption is considered as the most economic and effective technique for control over a variety of VOCs, while an appropriate adsorbent is the key to adsorption techniques. ${ }^{9,10}$ Up to now, various adsorbents derived from silica, zeolites, metal organic frameworks, metal oxides and activated carbon have been employed to capture VOCs, ${ }^{11-16}$ and activated carbon is regarded as one of the most promising adsorbents for commercial use owing to its great surface area, excellent thermal/ chemical stability, low cost and outstanding cyclic utilization.\n\nOn the other hand, carbon-based porous materials are endowed with favorable surface hydrophobicity due to the high density of carbon atoms in graphite-like sheets, which is greatly beneficial to VOCs absorption. ${ }^{17}$ In general, activated carbon with slit-shaped micropores is associated with a high physical adsorption capacity for multifarious VOCs in a highly dispersive\n\n${ }^{a}$ School of Energy Science and Engineering, Central South University, Changsha 410083, Hunan, China. E-mail: \\href{mailto:liqingli@hotmail.com}{liqingli@hotmail.com}; Tel: +86 13807483619\n\n${ }^{b}$ School of Materials Science and Engineering, Central South University, Changsha 410083, Hunan, China\n\n$\\dagger$ Electronic supplementary information (ESI) available. See DOI: $10.1039 / \\mathrm{c} 7 \\mathrm{ra} 11740 \\mathrm{j}$ way. ${ }^{18}$ However, the widespread use of activated carbon has also deprived it of the ability to trap a specific gas for instance acetone, one of oxygenated volatile organic compounds (OVOCs). Meanwhile, chemical adsorption is an essential factor to be considered apart from physical adsorption. Researchers have demonstrated that metal oxide materials have an excellent adsorption ability for OVOCs. ${ }^{19} \\mathrm{MgO}$, an alkali earth metal oxide, is an outstanding adsorbent for OVOCs adsorption under normal temperature and pressure. ${ }^{20,21}$ Nonetheless, $\\mathrm{MgO}$ prepared by thermal decomposition of magnesium acetate has low surface area, which is a big challenge for its applications. ${ }^{22}$ Thus, improvements in active surface area, accessibility to adsorption sites and synergistic porous support are of great significance to the practical applications of $\\mathrm{MgO}$.\n\nRecently, porous carbon and metal oxide composites have been developed with metal oxide nanoparticles doped into the matrix of nanoporous carbon materials, ${ }^{21,23-25}$ which remarkably improves the adsorption capacity towards VOCs compared to the single-phase activated carbon materials and thus attracts extensive attention. The above-mentioned porous carbon/metal oxide composites are endowed with excellent physical adsorption attributed to the large surface area of activated carbon. Furthermore, they also show outstanding chemical adsorption ability due to a large number of active adsorption sites in the metal oxide. To the best of our knowledge, there is rare literature concerning the adsorption capacity of activated carbon and $\\mathrm{MgO}$ composites materials for acetone.\n\nIn this study, MgO-doped porous carbon materials were successfully prepared through a facile evaporation doping method, with magnesium acetate being used as the Mg resource while commercial activated carbon (AC) as the porous carbon frameworks for the special support for MgO. The resulting ACMgO samples were subsequently characterized via BET surface area, X-ray diffraction (XRD) and scanning electron microscope (SEM) analyses, and their adsorption performances towards acetone were also examined through dynamic adsorption tests. More importantly, the synergistic effect of nanosized MgOdoped porous carbon on its acetone adsorption performance was investigated using quantum chemical molecular modeling study.\n\n\\section{Experimental}\n\\subsection{Materials}\nAll chemicals were obtained from commercial sources and used without further purification. Magnesium acetate tetrahydrate $\\left(\\mathrm{C}_{4} \\mathrm{H}_{6} \\mathrm{O}_{4} \\mathrm{Mg} \\cdot 4 \\mathrm{H}_{2} \\mathrm{O}, \\quad 98 \\%\\right)$, acetone $\\left(\\mathrm{CH}_{3} \\mathrm{COCH}_{3}, 99.5 \\%\\right)$, ammonia solution $\\left(\\mathrm{NH}_{4} \\mathrm{OH}, 33 \\%\\right)$ and ethanol $\\left(\\mathrm{C}_{2} \\mathrm{H}_{5} \\mathrm{OH}\\right.$, 99.7\\%) were purchased from Xilong Chemicals Co., Ltd., China. The commercial activated carbon was provided by Changge Henan Limin Activated Carbon Co., Ltd., China. Nitrogen $\\left(\\mathrm{N}_{2}\\right.$ ) gas of ultrahigh purity $(99.999 \\%)$ was purchased from High-tech Gas Co., Ltd., China.\n\n\\subsection{Preparation of samples}\nThe activated carbons were modified by deposition of $\\mathrm{MgO}$ nanoparticles via a combination of evaporation induced selfassembly process with subsequent pyrolysis treatment. In a typical synthesis, $2.35 \\mathrm{~g}$ of magnesium acetate was first dissolved in $100 \\mathrm{~mL}$ of distilled water, and then $4.00 \\mathrm{~g}$ of activated carbon was dropped slowly into this solution with magnetic stirring at room temperature overnight. The mixture was evaporated at $373 \\mathrm{~K}$ and then dried at $393 \\mathrm{~K}$ to prepare the impregnated sample. Subsequently, the impregnated sample was heated to $823 \\mathrm{~K}\\left(5 \\mathrm{~K} \\mathrm{~min}^{-1}\\right)$ under $\\mathrm{N}_{2}$ flow $\\left(100 \\mathrm{~mL} \\mathrm{~min}^{-1}\\right)$ for $4 \\mathrm{~h}$ in a tubular furnace. Thus AC-MgO composites were obtained, which are denoted as AC-MgO-10\\% as the MgO content is $10 \\%$. Other MgO-AC- $n \\%$ samples were prepared using the same method but with different $\\mathrm{MgO}$ content. As a result, four AC-MgO composite samples were obtained and denoted as AC-MgO-5\\%, AC-MgO-10\\%, AC-MgO-20\\%, AC$\\mathrm{MgO}-30 \\%$ respectively. For comparison, the pure $\\mathrm{MgO}$ was synthesized by thermal decomposition of magnesium acetate at $823 \\mathrm{~K}$ under $\\mathrm{N}_{2}$ flow for $4 \\mathrm{~h}$.\n\n\\subsection{Characterization}\nThe samples were determined by XRD ( $\\mathrm{X}^{\\prime}$ PertPro MPD, PANalytical B.V., NED) with a PANalytical powder diffractometer operated at $40 \\mathrm{~mA}$ and $40 \\mathrm{kV}$ using $\\mathrm{Cu} / \\mathrm{K} \\alpha$ as the radiation source. The scanning range was from $5^{\\circ}$ to $80^{\\circ}(2 \\theta)$ with a scanning step of $0.02^{\\circ}$ per second. The sizes and morphologies of AC-MgO samples were studies through SEM (Helios NanoLab 600i, FEI Co., USA), where the measurements were operated under $10-20 \\mathrm{kV}$ acceleration voltage. Transmission electron microscopy (TEM) images were performed using a Tecnai G2 20S-Twin electron microscope equipped with a cold field emission gun under an acceleration voltage of $200 \\mathrm{kV}$. The microporosity characterization of AC-MgO composites were determined by $\\mathrm{N}_{2}$ adsorption at $77 \\mathrm{~K}$ with a specific surface area analyzer (JWGB Sci. \\&Tech. Co., Ltd., China). The samples were ground to powders and degassed at $373 \\mathrm{~K}$ for $4 \\mathrm{~h}$ in a vacuum before the test. The Brunauer-Emmett-Teller surface area ( $\\left.S_{\\text {BET }}\\right)$, micropore volume $\\left(V_{\\mathrm{m}}\\right)$ and pore size distribution (PSD) of the as-synthesized samples were calculated from the $\\mathrm{N}_{2}$ isotherm by the Brunauer-Emmett-Teller (BET) equation, ${ }^{26} t$ plot method, ${ }^{27}$ Horvath-Kawazoe (HK) equation, ${ }^{28}$ and BarrettJoyner-Halenda (BJH) method ${ }^{29}$ respectively. The total pore volume $(V)$ was estimated from the volume of $\\mathrm{N}_{2}$ (as liquid) held at a relative pressure of $0.98$.\n\n\\subsection{Acetone adsorption experiments}\nThe experimental system of acetone adsorption is shown in Fig. 1. Acetone breakthrough experiments were carried out in a glass tubular column equipped with a water jacket to maintain a constant temperature at $298 \\mathrm{~K}$. The nitrogen gas system consists of two parts and controlled by mass flow controller (D08-3F, Sevenstar Co., Ltd., China), one branch was passed through acetone gas generator to obtain high concentration vapor at $273 \\mathrm{~K}$. At the same time, in order to regulate the concentration of acetone vapor, nitrogen gas got to the gas mixing chamber by the other branch to dilute the high concentration acetone vapor. Subsequently, the gaseous mixture was directed onto the fixed-bed of a sorbent material at constant temperature $298 \\mathrm{~K}$ and atmospheric pressure. The output concentration of the fixed-bed was monitored online by a gas chromatograph (GC) (SP-6890, Ruihong Chemical, Co., Ltd., China), connected directly to the adsorption column outlet.\n\n\\section{$2.5$ Computational details}\nAll the first principle calculations were performed using density functional theory (DFT) method in $\\mathrm{DMol}^{3}$ software of Materials Studio package. ${ }^{30}$ The generalized gradient approximation (GGA) with the Perdew-Burke-Ernzerhof (PBE) exchangecorrelation functional was used to model the electron exchange and correlation interaction. ${ }^{31}$ Core treatment of the metal atoms were described by the density functional semicore pseudopotentials (DSPP), ${ }^{32}$ which was developed specifically for $\\mathrm{DMol}^{3}$ calculations. All electron double numerical atomic orbitals augmented by p- and d-polarization functions (DNP) basis set was used to describe the atomic orbital. ${ }^{33}$ The thermal smearing level was set at $0.005$ to improve the convergence, and a realspace orbital global cutoff of $3.7 \\AA$ was applied, and the convergence threshold parameters for the optimization were $10^{-5}$ (energy), $2 \\times 10^{-3}$ (gradient), and $5 \\times 10^{-3}$ (displacement), respectively. This basis sets are similar to 6-31G $(\\mathrm{d}, \\mathrm{p})$ in size, while they tend to be more accurate and have little basis set superposition error (BSSE). ${ }^{33}$ BSSE was not taken into account for calculating the energies, as the numerical basis sets implemented in $\\mathrm{DMol}^{3}$ minimized or even eliminated basis set superposition error. ${ }^{34}$ Calculations were carried out in a model system containing an acetone molecule adsorbed on the (100)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-03_160_749_464_1587}\n\\end{center}\n\nFig. 1 Isothermal adsorption device for acetone adsorption.\n\nface of $\\mathrm{MgO}$ represented by a cluster of $32 \\mathrm{O}$ atoms and $32 \\mathrm{MgO}$ atoms, (i.e. with the $(\\mathrm{MgO})_{32}$ formula). ${ }^{35}$ Because of the complexity and uncertainty of the activated carbon structure, it was modeled as monolayer graphene slabs in $7 \\times 7$ carbon ring unit cells (98 atoms for pure graphene). ${ }^{36,37}$ The adsorption behavior of acetone onto the surface of respective substrate was simulated, and the acetone adsorption energy was calculated in the following manner:\n\n\\[\nE_{\\text {ad }}=E_{\\text {surface }+\\text { acetone }}-\\left(E_{\\text {surface }}+E_{\\text {acetone }}\\right)\n\\]\n\nwhere $E_{\\text {ad }}, E_{\\text {surface+acetone }}, E_{\\text {surface }}$ and $E_{\\text {acetone }}$ are adsorption energy, total energy of adsorbate-surface complex, surface of substrate and isolated acetone, respectively. The negative value of $E_{\\text {ad }}$ indicates that the adsorption is an exothermic reaction, and a higher negative value of $E_{\\text {ad }}$ corresponds to a more stable structure and stronger interaction.\n\n\\section{Results and discussion}\n\\subsection{XRD pattern of samples}\nXRD pattern of the original activated carbons (AC-0), AC-MgO composites and pure $\\mathrm{MgO}$ is shown in Fig. 2. From the diagram, all the samples except pure $\\mathrm{MgO}$ display two broad peaks at around $25^{\\circ}$ and $44^{\\circ}$, which were assigned to the characteristic carbon (100) and (101) diffractions respectively. ${ }^{38}$ A large intensity increase in the low-angle scatter shows the presence of a high density of nanopores. Compared to the original activated carbon (AC-0), the crystalline cubic structure of $\\mathrm{MgO}$ appeared on the patterns of the AC-MgO composites and pure MgO, with the 2 theta values of $36.8^{\\circ}, 42.9^{\\circ}, 62.3^{\\circ}$ and $78.5^{\\circ}$ corresponding to the (111), (200), (220) and (222) planes, respectively. ${ }^{39}$ It is worth noting that these four peaks became obviously stronger; meanwhile, their full width at half maximum (FWHM) was marginally reduced as the $\\mathrm{MgO}$ content in the AC-MgO composites increased. Additionally, no diffraction peaks of impurities could be observed for all the samples, which further confirm the magnesium acetate tetrahydrate was fully decomposed at $823 \\mathrm{~K}$ and completely converted to MgO. Meanwhile, the average crystallite size of $\\mathrm{MgO}$ nanocrystal was calculated using the Scherrer equation, ${ }^{40,41}$ and the Scherrer equation is expressed as follows:\n\n\\[\nD=\\frac{K \\lambda}{\\beta \\cos \\theta_{\\mathrm{B}}}\n\\]\n\nwhere $D$ is the average size of the ordered (crystalline) domains, $K$ is the shape factor with a typical value of about $0.9, \\lambda$ is the $\\mathrm{X}-$ ray wavelength, $\\beta$ is the full width at half maximum of the reflection peak, and $\\theta_{\\mathrm{B}}$ is the Bragg angle. The average MgO crystallite of AC- $\\mathrm{MgO}$ composite is $25.6 \\mathrm{~nm}$.\n\n\\subsection{Morphology analysis}\nSEM technique was used to observe the surface physical morphology of the as-obtained AC-MgO composites with different MgO content. The micrographs are given in Fig. 3. In the case of AC (see Fig. 3a), the skeleton of the carbon monolith did not have defect or crack on the surface of unmodified AC\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-03_1746_2441_1071_1901}\n\\end{center}\n\nFig. 2 XRD patterns of pure $\\mathrm{MgO}$ and $\\mathrm{AC}-\\mathrm{MgO}$ composites with different $\\mathrm{MgO}$ content.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2e5b7c3f50b6a643e33ag-04_170_1024_184_1880}\n\nFig. 3 SEM images of AC-MgO composites with different $M g O$ content: (a) AC-0, (b) AC-MgO-5\\%, (c) AC-MgO-10\\%, (d) AC-MgO-20\\%, (e) $\\mathrm{AC}-\\mathrm{MgO}-30 \\%$ and (f) the amplified SEM image of AC-MgO-10\\%.\n\nsamples. However, it was observed that the synthesized AC$\\mathrm{MgO}$ (see Fig. 3b-e) collapses into small pieces and form a large number of through holes as a result of the high temperature activation process. Furthermore, with the increase of the impregnation concentration, more and more magnesia particles were supported on the surface of activated carbon. It can be clearly seen that the surface of the AC becomes coarse as the amount of MgO increases. Referring to the amplified SEM image in Fig. 3f, the MgO particles of composites surface presented a disordered small spherical structure and overlap with each other to generate a \"grape\" morphology. This fact implies that with the increase of the calcination temperature, the particle size grew up due to the particle aggregation at high calcination temperature.\n\nTo further reveal the microstructure of the AC-MgO composites, TEM, selected area electron diffraction (SAED) and energy dispersive spectroscopy (EDS) measurements were performed. Since all samples have similar morphology, the ACMgO-10\\% sample was chosen as a typical example. The TEM image (see Fig. 4a) displays that the sample consisted of many small MgO nanocrystals and carbon matrix. Fig. $4 \\mathrm{~b}$ shows the HR-TEM image of AC-MgO-10\\%. MgO crystal lattice fringes with an interlayer spacing of $2.1 \\AA$ were attributed to the (200) lattice planes of cubic MgO. The SAED patterns of the corresponding samples (inset of Fig. 4b) shows bright circled rings, indicating the polycrystalline nature of $\\mathrm{MgO}$ in the selected area. The diffracting concentric rings assigned to (111), (200), (220) and (222) reflections of $\\mathrm{MgO}$ are evident, and the result is consistent with the MgO planes obtained from XRD data. As shown in Fig. 4c-e, EDS mapping results demonstrate the Mg and $\\mathrm{O}$ elements was distributed on the activated carbon surface uniformly rather than apparent aggregation.\n\n\\subsection{Nitrogen adsorption isotherms}\nTo investigate the porous structure of the AC-MgO composite materials, the surface area and pore size analysis were carried out. Fig. 5 shows the nitrogen adsorption-desorption isotherms of the samples. All the composite and carbon materials exhibit representative type-IV isotherm profiles with unusual small H4 hysteresis loops in the relative pressure range of 0.4-1.0 according to the International Union of Pure and Applied Chemistry (IUPAC) classification. The type H4 hysteresis loop was observed, with the characteristic step down at medium relative pressures $\\left(P / P_{0} \\approx 0.4\\right)$. This kind of hysteresis loop appeared as the complex materials contain both micropores and mesopores, and the phenomenon of capillary condensation occurred in mesopores. ${ }^{42}$ Actually they presented a narrow poresize distribution centered at $0.5-2.5 \\mathrm{~nm}$. It is worth noting that the nitrogen uptake of all samples increased sharply at low relative pressure $\\left(P / P_{0} \\approx 0.01\\right)$, indicating the presence of abundant micropores in these porous composite materials. ${ }^{43,44}$ However, it can be seen from Fig. 5 that pure MgO samples showed an isotherm of type-II with a $\\mathrm{H} 4$ hysteresis loops in the relative pressure range of $0.4-0.8$, which implied the existence of mesoporous structure in $\\mathrm{MgO}$.\n\nIn addition, the pore size distributions of all samples are shown in Fig. 6. The activated carbon modified by MgO did not have significant differences in the pore size distributions at different MgO content. From Fig. 6, a range of $0.4-1.0 \\mathrm{~nm}$ was observed as the concentration area of micropore distribution, which accounts for more than $81 \\%$ of the total, with an obvious bulge in the micropore volume at $0.5-0.7 \\mathrm{~nm}$. This also confirms the previous argument that these porous materials are mainly composed of microporous structure. However, with increasing MgO content, the micropore volume decreased\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2e5b7c3f50b6a643e33ag-05_164_1258_288_1780}\n\nFig. 4 (a) TEM and (b) HR-TEM images of the AC-MgO-10\\% sample, and the inset of (b) is the corresponding SAED patterns. (c-e) EDS mapping elements of carbon, magnesium and oxygen of the AC-MgO-10\\% sample.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-05_1437_2116_168_995}\n\\end{center}\n\nFig. $5 \\mathrm{~N}_{2}$ sorption isotherms of pure $\\mathrm{MgO}$ and $\\mathrm{AC}-\\mathrm{MgO}$ composites with different $\\mathrm{MgO}$ content.\n\nslightly. The decrease in microporosity can be explained as a result of blockage from $\\mathrm{MgO}$ nanoparticles deposition on pore walls. The micropore size distribution remained about the same at 0.5-0.7 $\\mathrm{nm}$ after modification, indicating that the deposition of metal oxides and heat treatment only affects the size of the microporous structure without generating a new porous structure. It can be seen from Fig. 6 that the pure $\\mathrm{MgO}$ samples have almost no micropores.\n\nThe detailed information of surface area and pore size of all the synthesized samples is summarized in Table 1. A similar trend of the surface area and the total pore volume could be observed, which decreased with rising $\\mathrm{MgO}$ content $(0-30 \\%)$. Clearly, the original AC shows the maximum surface area of $1464 \\mathrm{~m}^{2} \\mathrm{~g}^{-1}$ and pore volume of $0.81 \\mathrm{~mL}^{-1}$. In contrast, the synthesized AC-MgO-n\\% samples have surface area of 713$1213 \\mathrm{~m}^{2} \\mathrm{~g}^{-1}$ and pore volume of $0.54-0.71 \\mathrm{~mL} \\mathrm{~g}^{-1}$, which are much lower than the unmodified AC samples. It is obvious that with the enrichment of $\\mathrm{MgO}$ on $\\mathrm{AC}$, more and more $\\mathrm{MgO}$ nanoparticles blocked the micropores of activated carbon. However, the volume of mesopores and macropores did not change much with the $\\mathrm{MgO}$ content. Consequently, a large quantity of $\\mathrm{MgO}$ species particle aggregate at micropores rather than mesopores and macropores.\n\n\\subsection{Acetone adsorption study}\nThe typical results of acetone adsorption were shown in Fig. 7a as breakthrough curves. In consideration of the diversity in absolute concentrations, the concentrations presented were then normalized, ranging from 0 to 1 . The adsorption capacity was assessed by numerical integration of the region calculated from the acetone breakthrough curve. Notably, the outlet acetone\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2e5b7c3f50b6a643e33ag-06_168_1954_289_1775}\n\nFig. 6 Pore size distribution of pure $\\mathrm{MgO}$ and $\\mathrm{AC}-\\mathrm{MgO}$ composites with different $\\mathrm{MgO}$ content.\n\nTable 1 Porous structure parameters of the pure $\\mathrm{MgO}$ and $\\mathrm{AC}-\\mathrm{MgO}$ composites\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-06_2136_2453_127_1930}\n\\end{center}\n\nconcentration was zero in all the adsorption experiments, indicating a thorough acetone removal before the breakthrough. The amount of sample used in each experiment was $0.2 \\mathrm{~g}$.\n\nAs shown in Fig. 7a, the development trend of the six penetration curves was consistent at a certain temperature $(298 \\mathrm{~K})$ and concentration $\\left(85.21 \\mathrm{~m}^{3} \\mathrm{~g}^{-1}\\right)$. Specifically, the curve started very gently, while the concentration increased dramatically as soon as the breakthrough occurred. With the passage of time, a gradual stabilization in concentration was observed. The adsorption capacity of $\\mathrm{AC}-\\mathrm{MgO}-10 \\%$ ranks the first among all the samples. Breakthrough time is defined as time when outlet concentration was $10 \\%$ of inlet concentration. ${ }^{45}$ The breakthrough time was also different for each sample, and the breakthrough time of acetone in $\\mathrm{AC}-\\mathrm{MgO}-10 \\%$ is the longest, suggesting its superior acetone capture capacity.\n\nHere, the Langmuir equation, which considers monolayer adsorption on a homogeneous surface with negligible intermolecular force, ${ }^{46}$ was used to fit the adsorption isotherms of acetone on the samples, and the Langmuir equation is expressed as follows:\n\n\\[\n\\frac{C_{\\mathrm{e}}}{q_{\\mathrm{e}}}=\\frac{1}{q_{\\mathrm{m}} K_{\\mathrm{L}}}+\\frac{C_{\\mathrm{e}}}{q_{\\mathrm{m}}}\n\\]\n\nwhere $C_{\\mathrm{e}}\\left(\\mathrm{g} \\mathrm{m}^{-3}\\right)$ refers to the equilibrium concentration, $q_{\\mathrm{e}}$ $\\left(\\mathrm{mg} \\mathrm{g}^{-1}\\right)$ is the amount of adsorbate on per unit weight of adsorbent, $q_{\\mathrm{m}}\\left(\\mathrm{mg} \\mathrm{g}^{-1}\\right)$ is the monolayer adsorption capacity, and $K_{\\mathrm{L}}\\left(\\mathrm{m}^{3} \\mathrm{~g}^{-1}\\right)$ is a constant related to adsorption rate. The fitting results are listed in Table 2 .\n\nAs shown, the experimental data were consistent with Langmuir equation. By varying the acetone concentration (9.56$\\left.85.21 \\mathrm{~g} \\mathrm{~m}^{-3}\\right)$ at a fixed temperature $(298 \\mathrm{~K})$, a set of adsorption isotherms were obtained for all samples (shown in Fig. 7b). According to the linear regression method, the Langmuir equations are suitable for the adsorption of acetone $\\left(R^{2}>0.993\\right)$. Apparently, type-I profiles were observed in all adsorption isotherms of acetone in accordance with IUPAC classification,\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-07_1741_2404_164_994}\n\\end{center}\n\nFig. 7 (a) Breakthrough curves and (b) adsorption isotherms of acetone on pure $\\mathrm{MgO}$ and $\\mathrm{AC}-\\mathrm{MgO}$ composites with different $\\mathrm{MgO}$ content. Table 2 Langmuir equation fitting of acetone adsorption\n\n\\begin{center}\n\\begin{tabular}{llll}\n\\hline\nSample & $q_{\\mathrm{m}}\\left(\\mathrm{mg} \\mathrm{g}^{-1}\\right)$ & $K_{\\mathrm{L}}\\left(\\mathrm{m}^{3} \\mathrm{~g}^{-1}\\right)$ & $R^{2}$ \\\\\n\\hline\nAC-0 & $433.86$ & $0.0322$ & $0.9996$ \\\\\nAC-MgO-5\\% & $460.75$ & $0.0377$ & $0.9995$ \\\\\nAC-MgO-10\\% & $586.22$ & $0.0351$ & $0.9994$ \\\\\nAC-MgO-20\\% & $359.88$ & $0.0342$ & $0.9971$ \\\\\nAC-MgO-30\\% & $349.09$ & $0.0265$ & $0.9936$ \\\\\n$\\mathrm{MgO}$ & $336.87$ & $0.0187$ & $0.9948$ \\\\\n\\end{tabular}\n\\end{center}\n\nin agreement with the microporous structure of porous carbons. The adsorbed amount of acetone on samples increased rapidly at the initial stage, and then kept a temperate rise with increasing adsorption concentration. By comparison, the parameter $q_{\\mathrm{m}}$ of the Langmuir model fitting was larger than adsorption capacity of the experiment, and the numerical order of $q_{\\mathrm{m}}$ was consistent with the order of the experiment. The possible explanation for this difference is that the $q_{\\mathrm{m}}$ refers to the maximal amount of adsorption corresponding to a complete\n\nTable 3 Equilibrium amount of acetone adsorbed on various adsorbents\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-07_1168_1724_1033_1928}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-07_1835_2437_1072_1910}\n\\end{center}\n\nFig. 8 The adsorption capacity of samples and its relationship with the surface area and $\\mathrm{MgO}$ content. monolayer coverage on the surface, while the experiment does not necessarily reach this value.\n\nTo further evaluate the adsorption performance, we compared the acetone uptake values between the samples synthesized in this work and the previously reported adsorbents, and the detailed experimental data are listed in Table 3. It can be seen that the acetone adsorption capacity of AC-MgO-10\\% was much higher than those of conventional adsorbents, indicating that the $\\mathrm{AC}-\\mathrm{MgO}-10 \\%$ is a promising adsorbent used for acetone removal.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-08_486_904_498_887}\n\\end{center}\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-08_1076_1504_444_931}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-08_1583_2318_465_915}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-08_489_933_968_1586}\n\\end{center}\n\n(d)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-08_962_1512_950_1587}\n\\end{center}\n\n(e)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-08_1585_2301_940_1624}\n\\end{center}\n\n(f)\n\nFig. 9 Optimized structures of (I): (a) acetone, (b) MgO and (c) graphene, and (II): (d) acetone-graphene, (e) acetone-MgO, (f) acetone-MgO/ graphene. In addition, we compared the abilities of pure $\\mathrm{MgO}$ and $\\mathrm{AC}-$ $\\mathrm{MgO}$ composite samples in acetone capture, which presented with diverse surface area and $\\mathrm{MgO}$ content (at $298 \\mathrm{~K}, 85.21 \\mathrm{~m}^{3}$ $\\mathrm{g}^{-1}$ acetone) (see Fig. 8). Consequently, it varied significantly in view of the capacities of acetone adsorption from six samples under certain situations.\n\nThere is no doubt that the presence of $\\mathrm{MgO}$ species as well as the surface area is actively involved in the determination of capacity of acetone adsorption. Of note, there is a decline in surface area along with an elevation in $\\mathrm{MgO}$ content. This is due to the gradual block of the pore in the activated carbon attributed from the increase in the number of $\\mathrm{MgO}$ nanoparticles. As shown in Fig. 8, we compared the adsorption capacity of $\\mathrm{AC}-$ $\\mathrm{MgO}$ composites and unmodified activated carbon. As a result, the AC-0 sample presented with a capacity of acetone adsorption at $315 \\mathrm{mg} \\mathrm{g}^{-1}$, and the $\\mathrm{AC}-\\mathrm{MgO}-10 \\%$ sample ranked first in capacity of acetone uptake at $433 \\mathrm{mg} \\mathrm{g}^{-1}$, which harbored intermediate surface area $\\left(1067 \\mathrm{~m}^{2} \\mathrm{~g}^{-1}\\right)$ as well as $\\mathrm{MgO}$ content (10 $\\mathrm{wt} \\%)$. In consideration of the Lewis-base active sites provided by $\\mathrm{MgO}$ nanoparticles, ${ }^{52,53}$ which play a vital role in binding the acidic acetone, the advantage of higher $\\mathrm{MgO}$ content is more obvious even if the specific surface area of AC$\\mathrm{MgO}-10 \\%$ is smaller than that of AC-0. However, the pure $\\mathrm{MgO}$ sample, with the highest $\\mathrm{MgO}$ content $(100 \\mathrm{wt} \\%)$ but the smallest surface area $\\left(120 \\mathrm{~m}^{3} \\mathrm{~g}^{-1}\\right)$, displayed the lowest acetone uptake capacity at $201 \\mathrm{mg} \\mathrm{g}^{-1}$. The reason is that the surface area of pure $\\mathrm{MgO}$ is too small to expose enough active sites of $\\mathrm{MgO}$ surface. The above finding indicates that the surface area is also involved in acetone adsorption. Collectively, the acetone adsorption capacity of AC modified by $\\mathrm{MgO}$ depends on the $\\mathrm{MgO}$ content as well as the surface area.\n\n\\subsection{Molecular modeling study}\nIn order to prove that the acetone adsorption on $\\mathrm{MgO}$-doped activated carbon samples is not only the physical adsorption but also chemical adsorption tendency, the adsorption of acetone molecules on the surface of activated carbon, $\\mathrm{MgO}$ and MgO-graphene composites was simulated using DFT method. After fully optimization by the GGA-PBE method and considering all the spatial positional relationships between adsorbate and adsorbent, optimized structures were obtained (see Fig. 9). The result of molecular interaction of acetone with graphene surface is shown in Fig. S1. $\\dagger$ Obviously, interaction between acetone and graphene is very weak even in different adsorption modes. However, from Fig. S2, $\\dagger$ molecular interaction of acetone with $\\mathrm{MgO}$ surface, we can see that $\\mathrm{O}$ and $\\mathrm{H}$ atoms in acetone interact more easily with $\\mathrm{Mg}$ and $\\mathrm{O}$ atoms on the edge sites at $\\mathrm{MgO}$ surface, respectively, which is the best adsorption mode. The surface reactivity of the MgO strongly depends to the site selected for the molecule adsorption. The $\\mathrm{MgO}$ face without defects has a low reactivity producing a weak adsorption but the adsorption on steps, edges and corners is stronger. ${ }^{54}$ The same applies to acetone-MgO/graphene system (see Fig. S3†).\n\nAfter geometry optimization of the functionalized carbon surface, acetone adsorption energy on the surface was calculated. The values of adsorption energy for acetone complexes with surface models are given in Table 4. The greater the negative value of adsorption energy, the stronger the adsorption capacity is. ${ }^{55}$ As shown, acetone molecule exhibits the stronger interaction with pure $\\mathrm{MgO}$ with the energy value of $-107.89 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$, which is categorized in the region of chemisorption, while the values of adsorption is given $-4.20 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$ for pristine graphene, which is categorized at physisorption region. ${ }^{56}$ This can be attributed to the pure MgO nanoparticles providing the active adsorption sites of Lewis base for acidic gas acetone. ${ }^{57}$ Notably, the highest binding energy occurs in the acetone- $\\mathrm{MgO}$ /graphene system, $-118.13 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$, and the energy value is larger than the sum of the other two systems. As suggested by the results, the interaction between $\\mathrm{MgO}$ and graphene can promote the adsorption of acetone.\n\nThe local charge distribution of acetone molecule before and after adsorption has been calculated with the GGA-PBE method so as to confirm the Lewis acid-base interaction between acetone and MgO nanoparticles (Fig. 10). Through comparing the charge distribution of separate acetone molecule with its complexes, it can be found that the electronic structure of acetone molecule is subjected to charges upon adsorption. As is shown in Fig. 10, acetone molecule carries the highest negative charges in the electronic structure after interacting with $\\mathrm{MgO}$ graphene model. The net charges are transferred from the surface of $\\mathrm{MgO}$-graphene (the electron pair donor) to acetone\n\nTable 4 The charge transfer $(Q)$, the equilibrium distance $\\left(d_{\\mathrm{e}}\\right)$, and adsorption energy $\\left(E_{a d}\\right)$ of all systems\n\n\\begin{center}\n\\begin{tabular}{llll}\n\\hline\nSystem & $Q(\\mathrm{e})$ & $d_{\\mathrm{e}}(\\AA)$ & $E_{\\mathrm{ad}}\\left(\\mathrm{kJ} \\mathrm{mol}^{-1}\\right)$ \\\\\n\\hline\nAcetone-MgO & $-0.201$ & $2.078$ & $-107.89$ \\\\\nAcetone-graphene & $-0.005$ & $3.632$ & $-11.55$ \\\\\nAcetone-MgO/graphene & $-0.207$ & $2.077$ & $-118.13$ \\\\\n\\end{tabular}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-09_1691_2000_1073_1438}\n\\end{center}\n\nIsolated acetone\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-09_2073_2374_1072_1434}\n\\end{center}\n\n\\section{Acetone-MgO}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-09_1696_2005_1496_1866}\n\\end{center}\n\nAcetone-graphene\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2e5b7c3f50b6a643e33ag-09_2073_2374_1494_1864}\n\\end{center}\n\nAcetone- $\\mathrm{MgO} \\mathrm{O}$ graphene Fig. 10 Local charge distribution of acetones molecule before and after adsorption interaction with $\\mathrm{MgO}$, graphene and $\\mathrm{MgO}$ /graphene. molecule (the electron pair acceptor), which results in a sharp increase in the charges of acetone molecule, as can be observed from net charge transfer data in Table 4 .\n\nAnother important index to measure the strength of adsorption is the adsorbate-adsorbent equilibrium distance. Generally speaking, the shorter distance is linked with stronger interaction. ${ }^{58}$ It can be seen in Fig. 9 that, acetone-MgO/ graphene $(2.077 \\AA$ Å) achieves the shortest equilibrium distance, which is much longer in acetone-graphene (3.632 ̊). These simulation results are totally in agreement with experiment results. From the results of experiment and simulation, it can be concluded that MgO modified activated carbon is an effective method for increasing the adsorption of acetone.\n\n\\section{Conclusions}\nIn summary, a facile and controllable method has been developed to prepare porous activated carbons modified by $\\mathrm{MgO}$ nanocomposites using magnesium acetate as magnesium source via a combination of evaporation induced self-assembly process with subsequent pyrolysis treatment. The optimized AC-MgO-10\\% composites exhibits remarkable acetone captures capacity up to $433 \\mathrm{mg} \\mathrm{g}^{-1}$ (at $298 \\mathrm{~K}, 85.21 \\mathrm{~m}^{3} \\mathrm{~g}^{-1}$ acetone). Notably, increasing $\\mathrm{MgO}$ content will greatly enhance the chemical adsorption of acetone on the composite but in the meantime decrease the physical adsorption. Quantum chemical calculation reveals that the electronic properties of $\\mathrm{MgO} /$ graphene composites are responsible for its high adsorption capacity towards acetone and the interaction belongs to chemisorption. This simple synthesis strategy can be extended to other metal oxide/carbon composites that hold great promise for OVOC adsorption.\n\n\\section{Conflicts of interest}\nThere are no conflicts to declare.\n\n\\section{Acknowledgements}\nWe acknowledge the financial support from the National Natural Science Foundation of China (No. 21376274), the National Key Technology R\\&D Program of China (No. 2015BAL04B02), and Hunan Collaborative Innovation Center of Building Energy Conservation \\& Environmental Control.\n\n\\section{References}\n1 M. S. Kamal, S. A. Razzak and M. M. Hossain, Atmos. Environ., 2016, 140, 117-134.\n\n2 R. Atkinson and J. Arey, Chem. Rev., 2003, 103, 4605-4638.\n\n3 H. Wang, T. Zhu, X. Fan and H. Na, Carbon, 2014, 67, 712720.\n\n4 G. Busca, S. Berardinelli, C. Resini and L. Arrighi, J. Hazard. Mater., 2008, 160, 265-288.\n\n5 M. C. Delhoménie and M. Heitz, Crit. Rev. Biotechnol., 2005, $25,53-72$.\n\n6 N. N. Rao, Crit. Rev. Environ. Sci. Technol., 2008, 39, 41-78. 7 Y. Zhou, L. Zhou, X. Zhang and Y. Chen, Microporous Mesoporous Mater., 2016, 225, 488-493.\n\n8 Q. Xia, L. Zhong, L. Xiao, Z. Zhang and H. Xi, J. Hazard. Mater., 2010, 179, 790-794.\n\n9 V. K. Gupta and N. Verma, Chem. Eng. Sci., 2002, 57, 26792696.\n\n10 S. Xian, X. Li, F. Xu, Q. Xia and Z. Li, Sep. Sci. Technol., 2013, 48, 1479-1489.\n\n11 D. T. Tefera, Z. Hashisho, J. H. Philips, J. E. Anderson and M. Nichols, Environ. Sci. Technol., 2014, 48, 51085117.\n\n12 J. Chen, G. Li, Z. He and T. An, J. Hazard. Mater., 2011, 190, 416-423.\n\n13 M. S. Li, S. C. Wu and Y. H. Shih, J. Hazard. Mater., 2016, 315, 35-41.\n\n14 N. M. Padial, P. E. Quartapelle, C. Montoro, E. López, J. E. Oltra, V. Colombo, A. Maspero, N. Masciocchi, S. Galli and I. Senkovska, Angew. Chem., Int. Ed., 2013, 52, 82908294.\n\n15 M. A. Lillo-Ródenas, D. Cazorla-Amorós and A. LinaresSolano, Carbon, 2005, 43, 1758-1767.\n\n16 R. Chen, L. Li, Z. Liu, M. Lu, C. Wang, H. Li, W. Ma and S. Wang, J. Air Waste Manage. Assoc., 2017, 67, 713-724.\n\n17 A. P. Katsoulidis and M. G. Kanatzidis, Chem. Mater., 2015, 24, 471-479.\n\n18 B. Nie, X. Liu, L. Yang, J. Meng and X. Li, Fuel, 2015, 158, 908-917.\n\n19 L. Sun, J. Hu, F. Gao and H. Qin, Appl. Surf. Sci., 2011, 257, 8692-8695.\n\n20 J. F. Sanz, J. Oviedo, A. Márquez, J. A. Odriozola and M. Montes, Angew. Chem., Int. Ed., 2010, 38, 506-509.\n\n21 G. B. Baur, I. Yuranov and L. Kiwi-Minsker, Catal. Today, 2015, 249, 252-258.\n\n22 Y. D. Ding, G. Song, X. Zhu, R. Chen and Q. Liao, RSC Adv., 2015, 5, 30929-30935.\n\n23 A. H. Lu and F. Schüth, Adv. Mater., 2006, 18, 1793-1805.\n\n24 Y. Y. Li, M. M. Wan, W. G. Lin, Y. Wang and J. H. Zhu, J. Mater. Chem. A, 2014, 2, 12014-12022.\n\n25 L. She, J. Li, Y. Wan, X. Yao, B. Tu and D. Zhao, J. Mater. Chem., 2010, 21, 795-800.\n\n26 C. S. Dutcher, X. Ge, A. S. Wexler and S. L. Clegg, J. Mater. Chem. C, 2011, 115, 16474-16487.\n\n27 X. Yao, L. Li, H. Li and S. He, J. Mater. Sci., 2014, 49, 48074815.\n\n28 S. U. Rege and R. T. Yang, AIChE J., 2010, 46, 734-750.\n\n$29 \\mathrm{X}$. Xu, C. Song, J. M. Andresen, B. G. M. And and A. W. Scaroni, Energy Fuels, 2017, 16, 1463-1469.\n\n30 J. Landers, G. Y. Gor and A. V. Neimark, Colloids Surf., A, $2013,437,3-32$.\n\n31 J. Perdew, K. Burke and M. Ernzerhof, Phys. Rev. Lett., 1996, 77, 3865-3868.\n\n32 Y. Liu, J. Liu, M. Chang and C. Zheng, J. Phys. Chem. C, 2012, 116, 16985-16991.\n\n33 Q. Chen, W. Zhu, X. Hou and K. Xu, Vacuum, 2015, 119, 123130.\n\n34 G. Lim, K. B. Lee and H. C. Ham, J. Phys. Chem. C, 2016, 120, 8087-8095. 35 F. Shayeganfar, J. Beheshtiyan, M. Neek-Amal and R. Shahsavari, Nanoscale, 2017, 9, 4205-4218.\n\n36 L. Wu, S. Sitamraju, J. Xiao, B. Liu, Z. Li, M. J. Janik and C. Song, Chem. Eng. J., 2014, 242, 211-219.\n\n37 W. Xing, C. Liu, Z. Zhou, L. Zhang, J. Zhou, S. Zhuo, Z. Yan, H. Gao, G. Wang and S. Z. Qiao, Energy Environ. Sci., 2012, 5, 7323-7327.\n\n38 L. Zhang, Z. Su, F. Jiang, L. Yang, J. Qian, Y. Zhou, W. Li and M. Hong, Nanoscale, 2014, 6, 6590-6602.\n\n39 X. Ma, M. Cao and C. Hu, RSC Adv., 2013, 3, 10396-10402.\n\n40 S. G. Lee, J. W. Ha, E. H. Sohn, I. J. Park and S. B. Lee, Korean J. Chem. Eng., 2017, 34, 2738-2747.\n\n41 S. Shahkarami, A. K. Dalai and J. Soltan, Ind. Eng. Chem. Res., 2016, 55, 5955-5964.\n\n42 G. Song, X. Zhu, R. Chen, Q. Liao, Y. D. Ding and L. Chen, $R S C A d v ., 2016,6,19069-19077$.\n\n43 M. Thommes, Chem. Ing. Tech., 2010, 82, 1059-1073.\n\n44 X. Ma, L. Li, S. Wang, M. Lu, H. Li, W. Ma and T. C. Keener, Appl. Surf. Sci., 2016, 369, 390-397.\n\n45 M. G. Lee, S. W. Lee and S. H. Lee, Korean J. Chem. Eng., 2006, 23, 773-778.\n\n46 R. Saadi, Z. Saadi, R. Fazaeli and N. E. Fard, Korean J. Chem. Eng., 2015, 32, 787-799. 47 L. Gales, A. Mendes and C. Costa, Carbon, 2000, 38, 10831088.\n\n48 C. Hung, H. Bai and M. Karthik, Sep. Purif. Technol., 2009, 64, 265-272.\n\n49 D. G. Lee, J. H. Kim and C. H. Lee, Sep. Purif. Technol., 2011, 77, 312-324.\n\n50 I. K. Shah, P. Pre and B. Alappat, J. Taiwan Inst. Chem. Eng., $2014,45,1733-1738$.\n\n51 L. Tang, L. Li, R. Chen, C. Wang, W. Ma and X. Ma, J. Environ. Chem. Eng., 2016, 4, 2045-2051.\n\n52 B. Moulin, L. Oliviero, P. Bazin, M. Daturi, G. Costentin and F. Mauge, Phys. Chem. Chem. Phys., 2011, 13, 10797-10807.\n\n53 S. W. Bian, J. Baltrusaitis, P. Galhotra and V. H. Grassian, J. Mater. Chem., 2010, 20, 8705-8710.\n\n54 M. M. Branda, R. M. Ferullo, P. G. Belelli and N. J. Castellani, Surf. Sci., 2003, 527, 89-99.\n\n55 R. Kakkar, P. N. Kapoor and K. J. Klabunde, J. Phys. Chem. B, $2004,108,18140-18148$.\n\n56 A. S. Rad, S. S. Shabestari, S. Mohseni and S. A. Aghouzi, J. Solid State Chem., 2016, 237, 204-210.\n\n57 D. Cornu, H. Guesmi, J. M. Krafft and H. Lauronpernot, $J$. Phys. Chem. C, 2012, 116, 6645-6654.\n\n58 R. Añez, A. Sierraalta and L. J. D. Soto, Appl. Surf. Sci., 2017, 404, 216-229.\n\n\n\\end{document}", "record_id": "2023_09_22_2e5b7c3f50b6a643e33ag"}