{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{PAPER }\n\n\n\\author{Jan Mohammad Mir (D) * and Ram Charitra Maurya}\n\\date{}\n\n\n\\DeclareUnicodeCharacter{2020}{$\\dagger$}\n\n\\begin{document}\n\\maketitle\nView Article Online\n\nView Journal | View Issue\n\n\\section{Check for updates}\nCite this: RSC Adv., 2018, 8, 35102\n\n\\section{Nitric oxide functionalized molybdenum(0) pyrazolone Schiff base complexes: thermal and biochemical study $\\dot{\\dagger}$}\nThis work describes the synthesis and characterization of three molybdenum dinitrosyl Schiff base complexes of the general formula $\\left[\\mathrm{Mo}(\\mathrm{NO})_{2}(\\mathrm{~L})(\\mathrm{OH})\\right]$, where $\\mathrm{L}$ is $\\mathrm{N}$-(dehydroacetic acid)-4-aminoantipyrene (dha-aapH), $N$-(4-acetylidene-3-methyl-1-phenyl-2-pyrazolin-5-one)-4-aminoantipyrine $\\quad$ (amphp-aapH) or $N$-(3methyl-1-phenyl-4-propionylidene-2-pyrazolin-5-one)-4-aminoantipyrine (mphpp-aapH). The complexes were formulated on the basis of spectroscopic analyses, elemental composition, magnetic susceptibility measurements, molar conductance behaviour and determination of the respective decomposition temperatures. A comparative experimental-theoretical approach was followed to elucidate the structure of the complexes. Fourier transform infra-red (FT-IR) spectroscopy, thermo-gravimetry (TG) and electronic spectral insights were mainly focused on the confirmation of the formation of the complexes. The computational density functional theory (DFT) calculations evaluated in the study involve the molecular specification for the use of LANL2DZ/RB3LYP formalism for metal atoms and 6-311G/RB3LYP for the remaining non-metal atoms. The study reveals a suitable cis-octahedral geometry for the complexes. The TG curve of one of the representative complexes was evaluated to find the respective thermodynamic and kinetic parameters using various physical methods. The Freeman \\& Carroll (FC) differential method, the Horowitz and Metzger (HM) approximation method, the Coats-Redfern method and the Broido method were employed to present a comparative thermal analysis of the complex. The Broido method proved the best fit to the results for the compound under question. In addition to structural and thermal analyses, the study also deals with the in vitro antimicrobial and anticancer sensitivity of the complexes. The results revealed potent biological properties of the representative complex containing dha-aapH. Cell toxicity tests against COLO-205 human cancer cell line using a 3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyl-2H-\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_13bcf90c3ef43f1413deg-01_1586_1628_593_1923}\\\\\n$\\mu \\mathrm{gm} \\mathrm{L}^{-1}$ for the respective complex. Similarly the same complex proved to be an effective antimicrobial agent against Aspergillus, Pseudomonas, E. coli and Streptococcus. The results indicated a more pronounced activity against Pseudomonas and Streptococcus than the other two microbial species.\n\n\\section{Introduction}\nMolybdenum (Mo) is found in the active sites of enzymes such as nitrogenase, aldehyde oxidase, xanthine oxidase, sulfite oxidase, xanthine dehydrogenase and nitrate reductase. In attempts to find the antioxidant activity of various citrus fruit extracts molybdenum has been shown to have a special role. ${ }^{1}$ Molybdopterin has very recently been updated as one of the few molybdenum-containing compounds synthesized in nature. In animals, guanosine triphosphate (GTP) acts as a precursor. ${ }^{2,3}$ It has been found that the first two enzymes in the molybdopterin\n\nCoordination, Bioinorganic and Computational Chemistry Laboratory, Department of P. G. Studies and Research in Chemistry and Pharmacy, R. D. University, Jabalpur, $M$. P., India. E-mail: \\href{mailto:mirjanmohammad@gmail.com}{mirjanmohammad@gmail.com}; Tel: $+918492801701$\n\n$\\dagger$ Electronic supplementary information (ESI) available: Refer supplemental material for Tables S1-S13 and Fig. S1-S9. See DOI: 10.1039/c8ra05956j biosynthetic pathway, MoaA and MoaC, convert GTP into cyclic pyranopterin monophosphate (cPMP). ${ }^{4}$ The importance of molybdenum nitrosyl complexes, mimicking some biological phenomena has been updated recently. ${ }^{5}$ Similarly, analogues of this metal have been found to possess special role in catalysis. ${ }^{6-13}$ Nitric oxide tagged metal complexes of this class may serve as efficient tools to carry out apoptosis. ${ }^{14-16}$ Dinitrosylmolybdenum(0) complexes have also been reported to catalyze oligomerization and polymerization reactions of alkenes and alkynes and olefin metathesis. ${ }^{17-20}$ In particular, dinitrosyl complexes of iron have been proved to be biological intermediates formed during non-heme interaction with iron. ${ }^{21}$ Due to the biomimetic action of molybdenum in nitrite reduction it is assumed that a NO-labeled complex of molybdenum could act as an intermediate in the natural nitrogen fixation process. ${ }^{22}$ Recently NO assisted Mo-mediated catalysis has proven helpful in hydrodesulfurization. ${ }^{23}$ Nitric oxide expression in relation to hypertension, cancer and various other aspects has attracted chemists to tag the molecule with a framework for dwelling beneficial effects especially releasing and scavenging properties. ${ }^{24-33}$ In addition to experimental interests towards nitric oxide bound compounds, well fascinated investigations have been reportedly updated with respect to theoretical science of this class of compounds. ${ }^{34-37}$ There has been great ambiguity for the use of functionals and basis sets corresponding to such type of study. The use of various functionals and basis sets with respect to nitrosyl complexes to go through the chemical nature of $\\mathrm{NO}$ as neutral or charged species has gained much importance in this regard. ${ }^{38-43}$\n\nThe selection of ligand for complexation is an important and careful job for synthesizing a complex. Pyrazolone based Schiff base as ONO donor ligand is the second co-ligand after NO targeted in this study. Such types of cyclic ligands have been found significant in various aspects. ${ }^{44-46}$ It has been revealed that pyrazole containing pharmacoactive agents play important role in medicinal chemistry ${ }^{47}$ Pyrazolone derivatives are counted among typical ICT (Intramolecular Charge Transfer) compounds having well pronounced transport tendency. ${ }^{48-50}$ The derivatives of this class of compounds show fluorescence because of the double bond hindering, which occurs due to cyclization. ${ }^{51}$\n\nIn continuation of the interest towards synthetic chemistry and characterization based on various techniques, encompassing both theoretical and experimental approaches over metal nitrosyl complexes, a systematic study of the preparations and characterization of dinitrosyl complexes of Mo with the 4-aminoantipyrene based Schiff bases was aimed (Scheme 1). TG-base thermodynamic/kinetic and the biochemical study of these metallic systems are scarcely found. So in addition to formulation of the complexes, thermally evolved kinetic and thermodynamic parameters, in vitro antimicrobial and anticancer aspects are among the applied interests of the complexes reported herein.\n\n\\section{Experimental section}\nAmmonium heptamolybdate tetrahydrate and dehydroacetic acid were products of Aldrich chemical Co., USA. 4-Aminoantipyrine was purchased from BDH Chemicals, Mumbai. 3-Methyl-1-phenyl2-pyrozoline-5-one was supplied by Johnson Chemical Co., Bombay. Acetyl chloride and propionyl chloride were procured from Thomas Baker Chemicals Ltd, Mumbai. Hydroxylamine hydrochloride was acquired from Sisco Chem. Pvt. Ltd, Mumbai. All the chemicals were used as supplied without any further purification and were of AR Grade.\n\n\\section{Synthesis of 4-acyl-3-methyl-1-phenyl-2-pyrazolin-5-one derivatives}\n4-Acyl-3-methyl-1-phenyl-2-pyrazolin-5-one derivatives were prepared by following the procedure reported earlier ${ }^{52}$ and were recrystallized from a methanol-water $(9: 1)$ mixture. The reaction scheme related to the synthesis of 4-acyl-3-methyl-1-phenyl2-pyrazolin-5-one is shown in Scheme 2.\n\n\\section{Synthesis of Schiff bases}\nThe Schiff base ligands were prepared by taking $1: 1$ ethanolic solution of dhaH $(1.68 \\mathrm{~g}, 10 \\mathrm{mmol})$ or amphp $(2.16 \\mathrm{~g}, 10 \\mathrm{mmol})$ or mphpp $(2.30 \\mathrm{~g}, 10 \\mathrm{mmol})$ and 4 -aminoantipyrine ( $2.03 \\mathrm{~g}, 10$ $\\mathrm{mmol}$ ) and refluxing the resulting solution for $5 \\mathrm{~h}$ (Scheme 3). The reaction mixture was then poured into distilled water ( 250 $\\mathrm{mL}$ ), when a yellow precipitate was obtained. It was filtered, washed several times with water and then dried in vacuo. The physico-chemical analytical data of the Schiff base ligands are given in Table 1.\n\n\\section{Synthesis of dinitrosylmolybdenum(0) complexes}\nAll the complexes were prepared by following the method reported elsewhere. ${ }^{53}$ The reaction scheme demonstrating the synthesis of dinitrosyl complexes has been shown in Scheme 4. Their elemental analysis data, color, \\% yield, decomposition temperature and molar conductivities have been indicated in Table 2. All the complexes were tested for their solubility and were found partially soluble in ethanol and methanol, insoluble in water and soluble in DMSO and chloroform.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-02_1858_2477_329_1733}\n\\end{center}\n\nScheme 12 2-D structure of compounds used for the synthesis of the Schiff bases.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-03_167_1113_457_1605}\n\\end{center}\n\nScheme 2 Reaction scheme for the preparation of 2-pyrazoline derivatives.\n\nAnalytical techniques applied in the study\n\nCarbon, hydrogen and nitrogen were determined micro analytically on Heraeus Carlo Erba 1108 elemental analyzer. The molybdenum content in each of the synthesized complexes was determined gravimetrically as $\\mathrm{MoO}_{2}\\left(\\mathrm{C}_{9} \\mathrm{H}_{6} \\mathrm{ON}\\right)_{2}$ by the method reported earlier. ${ }^{53}$ The identification of the coordinated nitrosyl group in the resulting complexes was made by the chemical method reported earlier. ${ }^{53}$\n\nMagnetic measurements were performed by vibrating sample magnetometer method at RSIC, IIT Chennai. Electronic spectra of the complexes were recorded in dimethylformamide on an ATI Unicam UV-1-100 UV-Vis. Spectrometer in our laboratory. Conductance measurements were made at room temperatures in dimethylformamide using a Toshniwal conductivity bridge and dip-type cell with a smooth platinum electrode of cell constant 1.02. Decomposition temperatures of the Schiff bases and the chelates were recorded using an electrothermal apparatus having the capacity to record temperatures up to $360{ }^{\\circ} \\mathrm{C}$. The IR spectra were recorded on a Perkin Elmer FTIR spectrophotometer using $\\mathrm{KBr}$ pellets in our laboratory. Thermogravimetry curves of the complexes were recorded in the temperature range $50-1000^{\\circ} \\mathrm{C}$ at the heating rate of $15^{\\circ} \\mathrm{C} \\min ^{-1}$ using a Mettler Toledo Stare System at the Regional Sophisticated Instrumentation Centre, Nagpur.\n\n\\section{Biological assays}\nFor testing the antimicrobial sensitivity, first a suitable medium was prepared by dissolving all components viz., yeast $(2 \\mathrm{gm})$, peptone $(2 \\mathrm{gm})$, dextrose $(1 \\mathrm{gm})$ and agar-agar $(2 \\mathrm{gm})$ in $100 \\mathrm{~mL}$ distilled water and boiled to dissolve the medium completely. The medium was sterilized by autoclaving at $15 \\mathrm{lbs}$ pressure at $121^{\\circ} \\mathrm{C}$ for 15 minutes. The autoclaved medium was mixed well and poured onto $100 \\mathrm{~mm}$ Petriplates (25-30 mL per plate) while still molten. The antimicrobial screening was performed using agar-well diffusion method. ${ }^{54}$ Petriplates containing $20 \\mathrm{~mL}$ Muller Hinton medium were seeded with $24 \\mathrm{~h}$ culture of bacterial strains. Wells were cut and $20 \\mu \\mathrm{L}$ of the given sample (of different concentrations) were added. The plates were then incubated at $37^{\\circ} \\mathrm{C}$ for 24 hours. The antimicrobial activity was assayed by measuring the diameter of the inhibition zone formed around the well. Aspergillus, Pseudomonas, E. coli and Streptococcus were the cultures that were used. Ofloxacin as antibacterial and fluconazole as antifungal were the standard drugs used for comparing antimicrobial properties of the model molecular systems against the selected microbes.\n\nCell toxicity tests were investigated according to the method developed by Mosmann. ${ }^{55}$ COLO-205 human cancer Cell line was used for 3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyl-2 $H$-tetrazolium bromide (MTT) assay. Cells were plated in 96 well plates at 5000-7000 cell density per well. Cells were grown overnight in $100 \\mu \\mathrm{L}$ of $10 \\%$ FBS. After 24 hours cells were replenished with fresh media and the test samples were added to the cells. Different concentrations $\\left(10,20,40, \\& 80 \\mathrm{mg} \\mathrm{L}^{-1}\\right)$ of [dha-aapH] Schiff base and its $\\left[\\mathrm{Mo}(\\mathrm{NO})_{2}(\\right.$ dha-aap $\\left.) \\mathrm{OH}\\right]$ complex were added to wells in triplicates. Cells were incubated with the solution compounds for 24 hours at $37{ }^{\\circ} \\mathrm{C}$ in $5 \\% \\mathrm{CO}_{2}$. After 24 hours 20 $\\mu \\mathrm{L}$ of MTT dye $\\left(5 \\mathrm{mg} \\mathrm{mL}^{-1}\\right)$ were added to each well and further incubated for 3 hours. Before read-out, precipitates formed were dissolved in $150 \\mu \\mathrm{L}$ of DMSO using shaker for 15 minutes. All the steps performed after MTT additions were performed in\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-04_169_1496_379_1677}\n\\end{center}\n\nScheme 3 Reaction schemes for the preparation of Schiff bases and associated keto-enol tautomerization.\n\ndark. Absorbance was measured at $590 \\mathrm{~nm}$. Cell inhibition was determined by the following equation:\n\n\\[\n\\% \\text { cell inhibition }=100-\\left\\{\\left(A_{\\mathrm{t}}-A_{\\mathrm{b}}\\right) /\\left(A_{\\mathrm{c}}-A_{\\mathrm{b}}\\right)\\right\\} \\times 100\n\\]\n\nwhere, $A_{\\mathrm{t}}=$ absorbance value of test compound, $A_{\\mathrm{b}}=$ absorbance value of blank, $A_{\\mathrm{c}}=$ absorbance value of control.\n\nAbsorbance values that are lower than the control cells indicate a reduction in the rate of cell proliferation. Conversely, a higher absorbance rate indicates an increase in cell proliferation. Rarely, an increase in proliferation may be offset by cell death; evidence of cell death may be inferred from morphological changes.\n\n\\[\n\\begin{gathered}\n\\% \\text { cell survival }=\\left\\{\\left(A_{\\mathrm{t}}-A_{\\mathrm{b}}\\right) /\\left(A_{\\mathrm{c}}-A_{\\mathrm{b}}\\right)\\right\\} \\times 100 \\\\\n\\% \\text { cell inhibition }=100-\\text { cell survival }\n\\end{gathered}\n\\]\n\n\\section{Computational methods}\nDensity functional calculations were employed to investigate the vibrational properties and structural characteristics of the two representative compounds (amphp-aapH) (II) as ligand and the respective complex $\\left[\\mathrm{Mo}(\\mathrm{NO})_{2}(\\mathrm{amphp}-\\mathrm{aap})(\\mathrm{OH})\\right]$ (2). The density functional theory (DFT) calculations with $\\mathrm{B} 3 \\mathrm{LYP} / 6^{-}$\n\nTable 1 Physical and elemental analysis data of Schiff base ligands\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-04_2227_2505_139_1929}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-05_171_707_459_1614}\n\\end{center}\n\nScheme 4 Schematic presentation of the synthesis of dinitrosylmolybdenum(0) complexes.\n\n311+G specified for non-metallic content and B3LYP/LANL2DZ for Mo were used, respectively. The observed bands were assigned on the bases of results of normal coordinate analysis. All harmonic frequencies obtained were compared with real values to confirm each of the equilibrium geometries calculated corresponding to a minimum on the potential energy surface. ${ }^{56}$ Additionally, some of the calculated harmonic frequencies, particularly the NO stretch frequencies, were directly compared with the experimental frequencies. The assignment of the calculated wave numbers was aided by the animation option of Gauss View $5.0$ graphical interface for Gaussian programs, which gives a visual presentation of the shape of the vibrational modes. ${ }^{57,58}$ The Cartesian representation of the theoretical force constants are usually computed at optimized geometry by assuming $C_{\\text {s }}$ point group symmetry. The energies of the highest occupied molecular orbital (HOMO) and lowest unoccupied molecular orbital (LUMO) levels were used for determining the existence of intramolecular charge transfer (ICT). ${ }^{\\mathbf{5 9 , 1 0 0 - 1 0 6}} \\mathrm{UV}$ visible spectral calculation confined to TD-DFT approach were also separately computed for the two model systems.\n\n\\section{Results and discussion}\nComparative theoretical and experimental infrared spectral studies\n\nThe important infrared spectral bands of the Schiff base ligands and their complexes along with their tentative assignments are given in Tables 3 and 4 , respectively. All the ligands used in the present investigation may exist in enol form as shown in Scheme 3. The ring nitrogen in these ligands is found to be inert towards coordination to molybdenum as revealed by no change in $\\nu(\\mathrm{C}=\\mathrm{N})\\left(1583-1589 \\mathrm{~cm}^{-1}\\right)$ of the free ligands after complexation. In fact, $\\nu(\\mathrm{C}=\\mathrm{N})$ mode seems to be merged with $\\nu(\\mathrm{C}-\\mathrm{O})$ (cyclic) mode in the respective complexes. For a carbonyl donor, a significant shift of $\\nu(\\mathrm{C}=\\mathrm{O})$ to lower wave number takes place because of the coordination through carbonyl oxygen. The $\\nu(\\mathrm{C}=\\mathrm{O})$ for the cyclic carbonyl group at 1670,1674 and $1669 \\mathrm{~cm}^{-1}$ in uncoordinated dha-aapH, amphp-aapH and mphpp-aapH, respectively, is shifted to lower wave numbers and appears at 1575,1581 and $1575 \\mathrm{~cm}^{-1}$ in the respective complexes. This indicates that the cyclic carbonyl oxygen is bonded to molybdenum in these complexes. ${ }^{60}$ The FT-IR spectra of these ligands exhibit a strong band at $1632-1643 \\mathrm{~cm}^{-1}$ assignable to $\\nu(\\mathrm{C}=\\mathrm{N})$ (azomethine). In the spectra of the respective complexes this band is shifted to lower frequency, suggesting the coordination of the azomethine nitrogen to the\n\nTable 3 Important FT-IR spectral bands $\\left(\\mathrm{cm}^{-1}\\right)$ observed from of Schiff base ligands\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-05_1790_2028_1036_1925}\n\\end{center}\n\nTable 2 Physical and elemental analysis data of molybdenumdinitrosyl complexes\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-05_2153_2531_137_1930}\n\\end{center}\n\nTable 4 Important FT-IR spectral bands $\\left(\\mathrm{cm}^{-1}\\right)$ observed for molybdenumdinitrosyl complexes\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-06_208_543_137_1930}\n\\end{center}\n\nmetal centre. ${ }^{61}$ In all the complexes, the absence of a broad band centred at 3419- $3440 \\mathrm{~cm}^{-1}$ and the presence of a medium band at 1164-1186 $\\mathrm{cm}^{-1}$ due to $\\nu(\\mathrm{C}-\\mathrm{O})$ (enolic) indicate the deprotonation and coordination of enolic oxygen to the metal centre. ${ }^{62}$ The appearance of two strong bands in the region 1773-1775 and 1645-1653 $\\mathrm{cm}^{-1}$ and a weak band at 620$656 \\mathrm{~cm}^{-1}$ may be assigned to $\\nu(\\mathrm{NO})^{+}$and $\\nu(\\mathrm{Mo}-\\mathrm{NO})$, respectively, which are in agreement with previously reported results. ${ }^{63}$ The appearance of two $\\nu(\\mathrm{NO})^{+}$bands in the spectra of all the synthesized complexes suggests the presence of a cis$\\left[\\mathrm{Mo}(\\mathrm{NO})_{2}\\right]^{2+}$ moiety in the complexes. ${ }^{64,65}$ The appearance of $\\nu(\\mathrm{OH})$ mode at $3410-3430 \\mathrm{~cm}^{-1}$ in all the complexes under study is most probably due to presence of a coordinated hydroxyl group. The experimental FT-IR spectra of Schiff base ligands, I, II and III have been shown in Fig S1-S3.† The respective FT-IR spectra of the complexes 1,2 and 3 are given in Fig S4-S6, $\\dagger$ respectively.\n\nTheoretical FT-IR spectra of the representative ligand II and its complex are given in Fig. 1 and 2 , respectively. DFT scheme for the calculation was same as described in geometrical optimization (vide supra) for both the compounds. The results are indicative of the absence of any imaginary frequency and hence stem the arrival of energy minimal surface for the optimized geometries. The main question of identification of functional groups solved by infra-red spectroscopy based on the computed and observed wave numbers are presented. Considering the composition of model compounds under study it is found that both the experimental spectra and spectra generated through Gaussian calculations are in close approx with one another. From the graphical interpretation, Fig. 3 and 4, it is noteworthy that the applied LANL2DZ/RB3LYP and RB3LYP/6-311G calculations fetch reliable frequency data. The main wave numbers $\\left(\\mathrm{cm}^{-1}\\right)$ computed for the ligand along with the particular assignments include $\\nu(\\mathrm{OH}), 3154 ; \\nu(\\mathrm{C}=\\mathrm{O})$ (ketonic), 1691; $\\nu(\\mathrm{C}=\\mathrm{N})$ (pyrazoline ring), 1513; $\\nu(\\mathrm{C}-\\mathrm{O})$ (enolic), 1123; $\\nu(\\mathrm{C}=$ $\\mathrm{N}$ ) (azomethine), 1636. The dinitrosyl complex is well characterized theoretically by highlighting the main frequency ranges entailed with the respective functional groups to mark the level of change that occurred to the ligand on complexation with the $\\left[\\mathrm{Mo}(\\mathrm{NO})_{2}\\right]^{2+}$. The absence of $\\nu(\\mathrm{OH}), 3154$ and the existence of $\\nu(\\mathrm{OH}$, coordinated), 3738; $\\nu(\\mathrm{C}=\\mathrm{O})$ (ketonic), 1596; $\\nu\\left(\\mathrm{NO}^{+}\\right), 1713,1614 ; \\nu(\\mathrm{C}=\\mathrm{N})$ (azomethine), 1585; $\\nu(\\mathrm{C}-\\mathrm{O})$ (enolic), 1238; $\\nu\\left(\\mathrm{Mo}^{\\left.-\\mathrm{NO}^{+}\\right)}, 630\\right.$. It is thus well established that the assumed cis geometry $\\left(C_{2 \\mathrm{v}}\\right.$ symmetry) with respect to the two NO ligands is comparable with theoretical outcomes. Other remarkable changes noticed on behalf of the ligand coordination are also obvious.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-06_1635_2478_160_1902}\n\\end{center}\n\nFig. 1 Theoretical FT-IR spectrum of ligand II.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-07_164_999_167_1890}\n\\end{center}\n\nFig. 2 Theoretical FT-IR spectrum of complex 2.\n\n\\section{Experimental and theoretical electronic spectral studies}\nExperimental-electronic spectra of the complexes (Fig. S7-S9†) were recorded in $10^{-3}$ molar dimethyl DMF solutions. The electronic spectral peaks observed in each of the complexes along with their molar extinction coefficients are present in Table 5. All the complexes in the present investigation display five transitions. The assignments of these transitions have been given in the same table, and are based on molecular orbital diagram applicable to hexa coordinated dinitrosyl complexes reported elsewhere.$^{66}$ These observations are in agreement with the results reported in the similar type of metallic systems. ${ }^{67}$ The presence of five excitation probabilities indicates the different types of bindings inside the system. The confirmation of this fashion can be directly co-related with the respective molecular orbital diagram designed for these type of metallic complexes given in Scheme 5 .\n\nIn order to explore the theoretical electronic spectral analysis, the TD-DFT LANL2DZ/RB3LYP and 6-311G/RB3LYP was applied for the representative ligand II and the complex 2 . Pattern of electronic spectra of all the complexes carried out experimentally indicate the presence of an octahedral geometry around molybdenum that was correlated theoretically as well. DFT processed UV-visible spectra and simplified MO diagram (imposed over the spectra) for the ligand and complex are shown in Fig. 5 and 6, respectively. The particular alpha MO\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-07_1790_2477_416_1587}\n\\end{center}\n\nFig. 3 A plot of observed FT-IR frequency versus theoretical data of ligand II.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-08_157_837_457_1610}\n\\end{center}\n\nFig. 4 A plot of observed FT-IR frequency versus theoretical data of complex 2.\n\nTable 5 Electronic spectral data of complexes\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-08_1015_1692_123_1019}\n\\end{center}\n\nlevels showing the possible transitions along with the energy required have been shown separately for the complex in Table 6 . From the data obtainable from the log file of the respective complex confined to three possible excitations show the oscillator strengths $f 0.005,0.0021$ and $0.0043$ for $\\lambda_{\\max } 1033.79 \\mathrm{~nm}$ $(1.1993 \\mathrm{eV}), \\lambda_{\\max } 683.87 \\mathrm{~nm}(1.8130 \\mathrm{eV})$ and $\\lambda_{\\max } 574.47 \\mathrm{~nm}$ $(2.1582 \\mathrm{eV})$, respectively. The non-zero oscillator strengths indicate that the values are acceptable to a considerable extent. Besides the above the excitation coefficients for the particular excitation have been used to calculate the percentage contribution of electronic transition for both the model compounds. From the data it is obvious that while $132 \\rightarrow 133$ is the first preferred electronic transition, which are the respective HOMO $\\rightarrow$ LUMO transitions of the dinitrosyl complex. Hence, the theoretical results indicate the relevance of the level of theory used for the electronic studies and an excellent NO-releasing capability is thus favoured. Molar conductance behaviour and magnetic susceptibility insights\n\nThe molar conductance measured in $10^{-3} \\mathrm{M}$ DMF solutions of these complexes are in the range $25.3-45.4 \\Lambda^{-1} \\mathrm{~cm}^{2} \\mathrm{~mol}^{-1}$ and thereby indicate the non-electrolytic nature of the complexes under investigation. ${ }^{68}$ The high molar conductance values are most probably due to strong donor capacity of dimethylformamide, which may lead to the displacement of anionic ligands and change of electrolyte type ${ }^{68}$ The magnetic susceptibility measurements of these complexes indicate that they are diamagnetic and, hence, they should have ground states with a molecular orbital configuration $\\left({ }^{1} a_{2}\\right)^{2}\\left({ }^{1} a_{1}\\right)^{2}$ and $\\left({ }^{1} b_{2}\\right)^{2}$ following the molecular orbital diagram reported earlier. ${ }^{69}$ This result is consistent with the low-spin $\\left\\{\\mathrm{Mo}(\\mathrm{NO})_{2}\\right\\}^{6}$ electron configuration of $\\mathrm{Mo}(0)$ in these complexes. The diamagnetic and non electrolytic nature of these complexes also supports the presence of two $\\mathrm{NO}^{+}$groupings in all of these complexes.\n\n\\section{Thermal analysis}\nThermal methods of analysis are those techniques in which changes in physical and/or chemical properties of a substance are measured as a function of temperature. Methods that deal with changes in weight, dimensions or changes in energy come within this explanation. Thermogravimetry technique is entailed with the change in the weight of a substance recorded as a function of temperature or time, DTA (differential thermal analysis) in which the temperature difference between a substance and reference material as a function of temperature is recorded, DSC (differential scanning calorimetry) finds the application by giving a record of energy difference inputs into a substance and a reference material versus temperature function, EG (evolved gas analysis) where qualitative and quantitative evaluations of volatile products formed during thermal analysis are made and while as in TMA (thermo mechanical analysis) in which changes in dimensions of a substance are measured as a function of heat (temperature). ${ }^{70}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-09_161_1256_457_1610}\n\\end{center}\n\nScheme 5 Molecular orbital scheme for cis-dinitrosyl complexes of $C_{2 v}$ symmetry.\n\nThe thermo-gravimetric analysis (TGA) for the representative dinitrosylmolybdenum $(0)$ complex, 3 was carried out within the temperature range from ambient temperature to $1000^{\\circ} \\mathrm{C}$ at the heating rate of $15{ }^{\\circ} \\mathrm{C} \\min ^{-1}$. The first weight loss of $2.65 \\%$ displayed by the compound at $150^{\\circ} \\mathrm{C}$ corresponds to the elimination of one hydroxyl group from the complex (calcd $2.89 \\%$ ).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-09_1627_2470_167_1889}\n\\end{center}\n\nFig. 5 TD-DFT UV-visible spectrum of ligand II with the overlayed MO levels.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-10_168_1006_169_1887}\n\\end{center}\n\nFig. 6 TD-DFT UV-visible spectrum of complex 2 with overlayed MO levels.\n\nThe compound exhibits some more weight losses, which we again could not correlate separately. However, the weight loss observed (83.5\\%) at $715{ }^{\\circ} \\mathrm{C}$ corresponds to the elimination of one hydroxo-, two nitrosyl-, and one ligand-group(s) from the complex (calcd 83.65\\%). The thermo-analytical curve of the compound is Fig. 7. Therefore, the TG-curve corroborates some of the assumptions made on the basis of infrared spectral studies for these complexes (vide supra).\n\n\\section{TG-based thermodynamics and kinetic studies}\nThermal analysis is the means through which information concerning the thermal stability of the investigated complexes is obtained. In order to decide the number and stage of decomposition of water/hydroxyl or solvent molecules and whether they are inside or outside the coordination sphere TGA provides the ample information. ${ }^{71-73}$ The evaluation of kinetic and thermodynamic parameters involved in pyrolysis of compounds subjected to the investigation has gained keen interest based on choice of method out of various ways developed so far. In the present work Freeman and Carroll (FC) differential method, Horowitz and Metzger method, Coats and Redfern method and Broido method have been used to deal with the comparison studies of such methods to explore the thermodynamic and kinetic aspects of the concerned thermal behaviour of the representative complex.\n\nFreeman and Carroll, using Arrhenius equation gave the following equation: ${ }^{74}$\n\n\\[\n\\ln \\left[\\frac{\\mathrm{d} W / \\mathrm{d} t}{W_{\\mathrm{r}}}\\right]=\\ln Z-\\frac{E_{\\mathrm{a}}}{R T}\n\\]\n\nwhere $W$ is the total loss in weight up to time $t$,\n\nTable 6 TD-DFT UV-visible data of $\\left[\\mathrm{Mo}(\\mathrm{NO})_{2}(\\mathrm{amphp}\\right.$-aap) $(\\mathrm{OH})](2)$ complex and the possible electronic transitions\n\n\\begin{center}\n\\begin{tabular}{llc}\n\\hline\nExcited state &  & Excitation coefficient $(C)$ \\\\\n\\hline\n &  &  \\\\\n1 & Singlet $\\mathrm{A}, 1.1993 \\mathrm{eV}, \\lambda_{\\max }=1033.79 \\mathrm{~nm}, f=0.0005$ &  \\\\\n & $130 \\rightarrow 133$ & $0.21499$ \\\\\n & $131 \\rightarrow 133$ & $-0.26490$ \\\\\n & $132 \\rightarrow 133$ & $0.60770$ \\\\\n & Singlet $\\mathrm{A}, 1.8130 \\mathrm{eV}, \\lambda_{\\max }=683.87 \\mathrm{~nm}, f=0.0021$ &  \\\\\n & $129 \\rightarrow 133$ & $0.43924$ \\\\\n & $130 \\rightarrow 133$ & $0.22547$ \\\\\n & $131 \\rightarrow 133$ & $-0.42022$ \\\\\n & $132 \\rightarrow 133$ & $-0.25833$ \\\\\n & Singlet $\\mathrm{A}, 2.1582 \\mathrm{eV}, \\lambda_{\\max }=574.47 \\mathrm{~nm}, f=0.0043$ &  \\\\\n & $129 \\rightarrow 133$ & $0.49951$ \\\\\n & $131 \\rightarrow 133$ & $0.44629$ \\\\\n & $132 \\rightarrow 133$ & $0.18713$ \\\\\n\\end{tabular}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-11_171_1236_169_1887}\n\\end{center}\n\nFig. 7 Thermo-analytical curve of complex 3.\n\n\\[\nW_{\\mathrm{r}}=W_{\\mathrm{f}}-W,\n\\]\n\n$W_{\\mathrm{f}}$ is the weight loss at the completion of the reaction. $R$ is the gas constant and $\\mathrm{d} W / \\mathrm{d} t$ is the weight time gradient, $Z$ is the preexponential factor and $E_{\\mathrm{a}}$ is the energy of activation.\n\nA plot of $\\ln \\left[\\frac{\\mathrm{d} W / \\mathrm{d} t}{W_{\\mathrm{r}}}\\right]$ against $1 / T$ should be linear for decomposition following $1^{\\text {st }}$ order kinetics. The slope of plot gives the value of $E_{\\mathrm{a}}$, while the intercept is equal to $\\ln Z$, from which the pre exponential factor $Z$ can be calculated. Having known the value of $Z$, the change in entropy $\\Delta S$ can be calculated using equation\n\n\\[\n\\begin{gathered}\n\\Delta S=R \\ln \\left(\\frac{Z h}{K_{\\mathrm{B}} T_{\\mathrm{m}}}\\right) \\\\\n\\Delta H=E_{\\mathrm{a}}-R T \\\\\n\\Delta G=\\Delta H-T \\Delta S\n\\end{gathered}\n\\]\n\n(ii) where $\\phi$ is the constant heating rate, the thermodynamic parameters can be calculated as in previous case.\n\nThe Coats-Red fern equations are in the following form: $:^{76}$\n\n\\[\n\\begin{aligned}\n& \\ln \\left[\\frac{1-(1-\\alpha)^{\\frac{1}{n}}}{(1-n) T^{2}}\\right]=\\frac{M}{T+B} \\quad \\text { for } n \\neq 1 \\\\\n& \\ln \\left[\\frac{-\\ln (1-\\alpha)}{T^{2}}\\right]=\\frac{M}{T+B} \\quad \\text { for } n=1\n\\end{aligned}\n\\]\n\nwhere $\\alpha$ represents the fraction of sample decomposed at time $t$, defined by\n\n\\[\n\\alpha=\\frac{\\left(W_{0}-W_{t}\\right)}{\\left(W_{0}-W_{\\infty}\\right)}\n\\]\n\n$W_{0}, W_{t}$ and $W_{\\infty}$ are the weight of sample before the degradation, at temperature $t{ }^{\\circ} \\mathrm{C}$ and after total conversion respectively. $T$ is the derivative peak temperature\n\n\\[\nM=-\\frac{E_{\\mathrm{a}}}{R} \\& B=\\frac{\\ln A R}{\\phi E_{\\mathrm{a}}}\n\\]\n\n$E_{\\mathrm{a}}, R, A$ and $\\phi$ are the heat of activation, the universal gas constant, pre-exponential factor and heating rate respectively.\n\nThe correlation coefficient ' $r$ ' was computed using the least square method for different values of $n(n=0.33,0.5,0.66$ and 1), by plotting the LHS of eqn (iii) or (iv) versus $T \\times 10^{-3}$\n\nThe $n$ values which gave the best fit $(n \\approx 1)$ were chosen as the order parameter for the decomposition stage of interest. From the intercept and linear slope of such stage, the A and $E_{\\mathrm{a}}$ values were determined. $\\Delta S$ was also computed using the relationship;\n\n\\[\n\\Delta S=R\\left[\\left(\\ln \\frac{A h}{k T}\\right)-1\\right]\n\\]\n\n$\\Delta H$ and $\\Delta G$ are calculated using eqn (ii) and (iii); where $k$ is the Boltzmann's constant and $h$ is the Planck's constant.\n\nBroido has developed a model and put forward a simple and sensitive graphical method for the treatment of TGA data. ${ }^{77}$ According to this method the weight at any time $t\\left(W_{t}\\right)$ is related to the fraction of initial molecular weight as shown below\n\n\\[\nY=\\frac{N}{N_{0}}=\\frac{W_{t}-W_{\\mathrm{a}}}{W_{0}-W_{\\mathrm{a}}}\n\\]\n\nwhere $W_{0}$ is the initial weight of the materials and $W_{\\mathrm{a}}$ is the weight of residue at the end of decomposition:\n\nFor isolated pyrolysis,\n\n\\[\n\\begin{array}{r}\n\\frac{\\mathrm{d} y}{\\mathrm{~d} t}=-K y^{n} \\\\\n\\text { If, } K=A \\mathrm{e}^{-E / R T}\n\\end{array}\n\\]\n\n(xiii)\n\nand if $T$ is linear fraction of time $t$, therefore:\n\n\\[\n\\begin{gathered}\nT=T_{0}+\\beta_{t} \\\\\n\\frac{\\mathrm{d} y}{\\mathrm{~d} n}=-\\frac{A}{\\beta} \\mathrm{e}^{E / R T} \\mathrm{~d} t\n\\end{gathered}\n\\]\n\nwhere, $\\beta=\\mathrm{d} T / t$, the heating rate.\n\nEqn $(\\mathrm{xv})$ is integrated as:\n\n\\[\n\\text { (i) } \\int_{Y}^{1} \\frac{\\mathrm{d} y}{\\mathrm{~d} n}=\\frac{A}{\\beta} \\int_{T_{0}}^{T} \\mathrm{e}^{-E / R T} \\mathrm{~d} t\n\\]\n\nFor the first order kinetics $(n=1)$ in which complex degrades usually:\n\n\\[\n\\text { (ii) } \\int_{Y}^{1} \\frac{\\mathrm{d} y}{y}=-\\ln y=\\ln \\left(\\frac{1}{y}\\right)\n\\]\n\nOn integrating and taking log of both sides of eqn (xvii), following equation is obtained.\n\n\\[\n\\ln \\left[\\ln \\left(\\frac{1}{y}\\right)\\right]=\\left(\\frac{E}{R T_{\\mathrm{m}+1}}\\right) \\ln T+\\mathrm{constant}\n\\]\n\nThus a plot of $\\ln \\left[\\ln \\left(\\frac{1}{y}\\right)\\right] v s .1 / T$ yields straight line, whose slope is directly related to $E_{\\mathrm{a}}$ :\n\n\\[\n-E_{\\mathrm{a}}=\\text { slope } \\times 2.303 \\times R\n\\]\n\nwhere $E_{\\mathrm{a}}$ is the activation energy and $R$ is the gas constant. Application of this method is used to determine the kinetic parameter for the complexes.\n\n\\[\n\\ln \\left[\\ln \\left(\\frac{1}{Y}\\right)\\right]=\\left(\\frac{-E_{\\mathrm{a}}}{R}\\right) \\frac{1}{T}+\\left[\\frac{R Z}{E_{\\mathrm{a}} \\phi T_{\\mathrm{m}}^{2}}\\right]\n\\]\n\nwhere, $Y=\\frac{W_{\\mathrm{f}}-W_{\\infty}}{W_{0}-W_{\\infty}}$ and $Z$ can be calculated from the relation $Z=\\left(\\frac{E_{\\mathrm{a}} \\phi}{R T_{\\mathrm{m}}^{2}}\\right) \\frac{1}{T}+\\left[\\frac{R Z}{E_{\\mathrm{a}} \\phi T_{\\mathrm{m}}^{2}}\\right]$\n\nTable 7 Overall TGA evaluated thermodynamic parameters of (3)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-12_1884_2505_127_1930}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-13_171_2251_338_1718}\n\\end{center}\n\nFig. 8 Freeman Carroll plots for the three thermal decomposition steps of complex 3.\n\nThe thermogram of the representative compound provided ample proof in all the methods reflecting the order of the decomposition of the order $(n)$ of unity. The kinetic and thermodynamic parameters of the thermal degradation of the complexes namely, activation energy $\\left(E_{\\mathrm{a}}\\right)$, enthalpy $(\\Delta H)$, entropy $(\\Delta S)$ and free energy changes $(\\Delta G)$ were also calculated against the methods described above. The relevant parameters of each involved method at each step of decomposition were\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-14_171_2251_444_1613}\n\\end{center}\n\nFig. 9 Horowitz-Metzger plots for the three thermal decomposition steps of complex 3.\n\nevaluated and are given Tables 7 and S1-S13. $\\dagger$ The respective graphical presentations have also been given in Fig. 8-11. As all the methods employed in the study have certain advancements or limitations over one another. Hence, the different values and the comparative presentation confirm these assumptions. The summary of overall results can be explained as:\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-15_161_2255_498_1564}\n\\end{center}\n\nFig. 10 Coats Redfern the three thermal decomposition steps of complex 3.\n\nThe value of change in entropy is an important factor describing the thermal stability of a coordination core. Low negative value of this factor is an indicative of more stable excited form as compared to the respective reactants of pyrolysis. $^{78}$ In the later steps, numerical assignment shows increasing trend for the values of $\\Delta G$, although no regular trend\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_13bcf90c3ef43f1413deg-16_166_2248_504_1552}\n\nFig. 11 Broido the three thermal decomposition steps of complex 3.\n\nis observed in the values of either $E_{\\mathrm{a}}$ or $\\Delta H$. It is because of the fact that $T \\Delta S$ increases from one step to another, override in the values of $\\Delta H$ is noticeable. Increasing values of $\\Delta G$ for the subsequent steps of a given complex shows that the rate of mass loss will be lower than that of the precedent species. ${ }^{79,80}$ The structural rigidity of the remaining compound gets increased Table 8 Optimized parameters of the representative complex 2\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-17_196_2480_123_1928}\n\\end{center}\n\nTable 8 (Contd.)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-18_206_2490_123_1928}\n\\end{center}\n\nTable 8 (Contd.)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-19_204_1806_136_1926}\n\\end{center}\n\nafter the expulsion of one or more species, as compared with the precedent complex. From the values of $\\Delta G$ we may confirm the coordination core where there attains increase in its value. It is known that the order has no intrinsic meaning, but is rather a mathematical smoothing parameter. ${ }^{81}$ In the present case the reaction order of all the decomposition stages of all the methods are found to nearly equal to one.\n\n\\section{DFT based geometry optimization}\nThe optimized geometry of both the model compounds furnished the zero point energy $280.99 \\mathrm{kcal} \\mathrm{mol}^{-1}$ for the representative complex, whereas $267.22 \\mathrm{kcal} \\mathrm{mol}^{-1}$ was the result obtained for the respective ligand. It directly reflects that the stability pronounces more in complex because of lower energy content. The various bond lengths, bond angles and dihedral angles generated from the equilibrium structure of one of the representative complex 2 , using Gaussian 09 software are given in the Table 8. The computed bond lengths, such as, $\\mathrm{Mo}(36)-$ $\\mathrm{O}(6), \\mathrm{Mo}(36)-\\mathrm{O}(18), \\mathrm{Mo}(36)-\\mathrm{O}(35), \\mathrm{Mo}(36)-\\mathrm{N}(30), \\mathrm{Mo}(36)-\\mathrm{N}(31)$ and $\\mathrm{Mo}(36)-\\mathrm{N}(33)$ in the present complex are $2.08248,2.22730$, 1.99819, 2.25960, $1.87183$ and $1.82578$ Å, respectively. The significant computed bond angles in the complex, such as, $\\mathrm{Mo}(36)-\\mathrm{O}(35)-\\mathrm{H}(58), \\quad \\mathrm{O}(6)-\\mathrm{Mo}(36)-\\mathrm{O}(18), \\quad \\mathrm{O}(6)-\\mathrm{Mo}(36)-\\mathrm{N}(30)$, $\\mathrm{O}(6)-\\mathrm{Mo}(36)-\\mathrm{N}(31), \\quad \\mathrm{O}(6)-\\mathrm{Mo}(36)-\\mathrm{N}(33), \\quad \\mathrm{O}(6)-\\mathrm{Mo}(36)-\\mathrm{O}(35)$, $\\mathrm{O}(18)-\\mathrm{Mo}(36)-\\mathrm{N}(30), \\mathrm{O}(18)-\\mathrm{Mo}(36)-\\mathrm{N}(31), \\mathrm{O}(18)-\\mathrm{Mo}(36)-\\mathrm{N}(33)$, $\\mathrm{O}(18)-\\mathrm{Mo}(36)-\\mathrm{O}(35), \\mathrm{N}(30)-\\mathrm{Mo}(36)-\\mathrm{N}(31), \\mathrm{N}(30)-\\mathrm{Mo}(36)-\\mathrm{N}(33)$, $\\mathrm{N}(30)-\\mathrm{Mo}(36)-\\mathrm{O}(35), \\mathrm{N}(31)-\\mathrm{Mo}(36)-\\mathrm{N}(33), \\mathrm{N}(31)-\\mathrm{Mo}(36)-\\mathrm{O}(35)$, $\\mathrm{N}(33)-\\mathrm{Mo}(36)-\\mathrm{O}(35) 123.52^{\\circ}, 165.10^{\\circ}, 86.98^{\\circ}, 95.96^{\\circ}, 98.15^{\\circ}$, $88.80^{\\circ}, 78.50^{\\circ}, 87.88^{\\circ}, 96.19^{\\circ}, 85.17^{\\circ}, 90.97^{\\circ}, 174.23^{\\circ}, 79.65^{\\circ}$, $91.09^{\\circ}, 169.27^{\\circ}, 97.76^{\\circ}$ respectively, suggest the octahedral structure of the present as well as the other complexes under investigation. The optimized structure of the representative complex is shown in Fig. 12. One of the interesting facts about the calculated bond angles is the prediction of linear nitrosyl group for the model complex by considering the bond angles like $\\mathrm{Mo}(36)-\\mathrm{N}(33)-\\mathrm{O}(34), 176.807^{\\circ}$ and $\\mathrm{Mo}(36)-\\mathrm{N}(31)-\\mathrm{O}(32)$, $172.092^{\\circ}$.\n\n\\section{DFT based molecular orbital analysis}\nHighest occupied molecular orbital (HOMO) and lowest unoccupied molecular orbital (LUMO) are also collectively called as frontier orbitals because these are very important parameters for describing chemical behaviour. ${ }^{82}$ The HOMO is referred as primarily electron donor and the LUMO on the other hand is electron acceptor, and the gap between HOMO and LUMO characterizes the molecular chemical stability. ${ }^{83}$ Six important molecular orbitals (MOs) namely, third highest [HOMO-2], second highest [HOMO-1], and highest occupied MOs $[\\mathrm{HOMO}]$, the lowest [LUMO], second lowest unoccupied MOs [LUMO+1 ] and third lowest unoccupied MOs, [LUMO+1] were worked out for ligand II and its respective dinitrosyl complex 2 as shown in Fig. 13 and 14, respectively. The computed energies of these six molecular orbitals observed for the ligand II are $-6.3434 \\mathrm{eV},-5.9970 \\mathrm{eV},-5.7678 \\mathrm{eV},-1.2928 \\mathrm{eV},-1.1342 \\mathrm{eV}$ and $-0.8863$ eV respectively, and the energy gaps $(\\Delta E)$ between [HOMO-LUMO], [HOMO-1-LUMO+1], [HOMO-2-LUMO+2] for the ligand are $4.475 \\mathrm{eV}, 4.8628 \\mathrm{eV}$ and $5.4571 \\mathrm{eV}$, respectively. Similarly four (MOs), viz., [HOMO-2], [HOMO-1], [HOMO], [LUMO], [LUMO+1] and [LUMO+2] are worked out for the complex 2 and the observed energies in the same order are as $-5.7847 \\mathrm{eV},-5.7104 \\mathrm{eV},-5.2048 \\mathrm{eV},-2.7100 \\mathrm{eV},-1.8741 \\mathrm{eV}$ and $0.6602 \\mathrm{eV}$, while the energy gap between [HOMO-LUMO], [HOMO-1-LUMO+1] and [HOMO-1-LUMO+1] are: $2.4948 \\mathrm{eV}$, $3.8363 \\mathrm{eV}$ and $5.1245 \\mathrm{eV}$ respectively. The electronic fillings of MO's in both ligand and its complex verify their diamagnetic behaviour.\n\nThe energy of the frontier orbitals for molecules in term of ionization energy (IE) and electron affinity (IA) of the (amphpaapH) and its complex are fetchable according to Koopmans's theorem. ${ }^{84}$ Similarly, the absolute electro negativity $\\left(\\chi_{\\mathrm{abs}}\\right)$ and\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-20_1134_2472_329_1733}\n\\end{center}\n\nFig. $122 D$ and 3D optimized structure of complex 2.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-21_172_2250_246_1816}\n\\end{center}\n\nFig. 13 HOMO-LOMO structure with energy level diagram of ligand II.\n\nabsolute hardness $(\\eta)$ are related to IA and EA. ${ }^{85}$ Hard molecules characterize a large HOMO-LUMO gap, and soft molecules show narrow gap. ${ }^{85}$ The absolute electro negativity $\\left(\\chi_{\\text {abs }}\\right)$, absolute hardness $(\\eta)$, electrophilicity index $(\\omega)$ and global softness $(S)$ of the two selected model compounds calculated so far are represented in Table 9.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-22_164_2252_205_1857}\n\\end{center}\n\nFig. $14 \\mathrm{HOMO}-\\mathrm{LOMO}$ structure with energy level diagram of complex 2.\n\n\\section{Antimicrobial study}\nThe antimicrobial activity of the representative complex $\\mathbf{1}$ was tested against some Gram negative, Gram positive and fungal strains of microbes including Pseudomonas, E. coli, Streptococcus and Aspergillus, by agar well diffusion method. The inhibition zones in millimeters of shown by the model complex are given in Table 10. IC IC $_{50}$ values of the complex indicate that it has good degree of antimicrobial properties. $\\mathrm{IC}_{50}$ values of 128 against Table 9 Absolute electronegativity $\\left(\\chi_{\\text {abs }}\\right.$ ), absolute hardness ( $\\eta$ ), electrophilicity index ( $\\omega$ ), global softness (S) of (amphp-aapH) (II) and complex [Mo(NO) $\\left.)_{2}(a m p h p-a a p)(\\mathrm{OH})\\right](2)$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-23_231_440_137_1930}\n\\end{center}\n\nStreptococcus, 134 against Pseudomonas, 288 against E. Coli and 219 against Aspergillus have been found. The Petriplates displaying the inhibition zones have been shown in Fig. 15. The increase in the biological activity of the metal complexes can be explained on the basis of chelation theory and overtones concept. ${ }^{86-88}$ According to chelation theory, the delocalization of $\\pi$ electrons over the whole chelate ring enhances the lipophilicity and the polarity of the metal atom is reduced due to the overlap of the ligand orbital and partial share of positive charge of metal atom with ligands. ${ }^{89-91}$ So, increase in lipophilic character results in an increase in permeability through the lipid layers of cell membrane and the metal binding sites on enzymes of microorganism are blocked. Overtone's concept is based on cell permeability, wherein the lipid membrane that surrounds the cell favours the passage of only the lipophilic materials due to which lipo-solubility is an important factor, which controls the antimicrobial action. ${ }^{92}$ It is observed that different compounds show antimicrobial activity of low variation range against bacterial and fungal species. This difference depends either on the impermeability of the cells of the microorganism which, in case of Gram positive is single layered and in the case of Gram negative is multilayered structure or differences in ribosomes of microbial cells. It can possibly be concluded that the chelation increased the activity of these complexes. The present results show that dinitrosyl molybdenum Schiff base complexes possess better cytotoxicity than the corresponding Schiff base ligand against the same microbes. Although the complexes are active, they did not reach the effectiveness of the conventional bactericide ofloxacin and fungicide fluconazole. However, it may be mentioned that the activity index (A.I.) given against each concentration, Fig. 16, showing excellent biological effects in case of the complex:\n\n\\[\n\\text { A.I. }=\\frac{\\text { Inhibition zone of sample }(\\mathrm{mm})}{\\text { Inhibition zone of standard }(\\mathrm{mm})}\n\\]\n\nTable 10 Antimicrobial screening of $\\left[\\mathrm{Mo}(\\mathrm{NO})_{2}(\\right.$ dha-aap $\\left.)\\left(\\mathrm{H}_{2} \\mathrm{O}\\right)\\right]$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-23_2067_2448_140_1034}\n\\end{center}\n\n${ }^{a}$ Z. I. is the zone of inhibition and A. I. is the activity index at the particular concentration of the sample. It is noteworthy to state here that the inhibition zones were shown to have remarkably increased on increasing the concentration of the compounds under investigation.\n\n\\section{Antiproliferative effects on colo-205 human cancer cells}\nExpression of nitric oxide in cancerous cells triggered the possible applications of nitrosyl complexes in treating cancer. In the present investigation the selected cancer cell line is related with the dreadful colon cancer which is the second most common cause of cancer-related death after lung cancer. Literature survey shows that risk parameters confined to nutrition and genes result in additive effects of the tumor. On other hand the co-relation of NO (nitric oxide) with apoptosis induction upon COLO 205 represents important asset of the targeted theme. Antiproliferative tests were carried out separately for ligand I and its respective complex using MTT assay. ${ }^{93}$ Doxorubicin with $2 \\%$ dimethylsulfoxide (DMSO) was used as standard control. Fig. 17 shows the exhibited dose-dependent antiproliferative activity against colo-205 human cancer cells of the target compounds and significantly reduced the growth rate of colo-205 cancer cells. It has been shown that the dinitrosyl complex of molybdenum bears better cytotoxic activity as compared to the corresponding Schiff base. The related data of cell inhibition and cell survival have been given in Table 11.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-23_1611_2439_1069_1902}\n\\end{center}\n\nFig. 15 Petri-plates showing zones of antimicrobial actions at different concentrations by the complex 1 .\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-24_165_744_161_997}\n\\end{center}\n\nFig. 16 Graphical presentation of inhibition zones against the particular strains at different concentrations $\\left(a=50 \\mu \\mathrm{g} \\mathrm{mL}^{-1}, b=75 \\mu \\mathrm{g} \\mathrm{mL}^{-1}\\right.$ and $c=100 \\mu \\mathrm{g} \\mathrm{mL}^{-1}$ ) shown by complex 1 .\n\nFrom $\\mathrm{IC}_{50}$ values $53.13$ in the Schiff base and $10.51$ in its complex, it is established that latter bears more anticancer potentiality. Both the biological assays are found supportive in the assumption that the complexes bears better biological relevance as compared to the free ligands. The reasons lying behind this factual observation can be explained on the basis of theoretical results also. Electron density plots and charge populations analysis are the tools which help to build up insights regards the potential characteristics of a molecule. ${ }^{\\mathbf{9 4}, 95}$\n\nMolecular charge analysis and electron density plots as biological speculative tools\n\nDrug/medicinal properties depicted by compounds are mainly focused with regard to lipophilicity, size and charge analysis. Depending on the electronic charge on the chelating atoms one may depict the bonding capability of a molecule. In order to quantify and compare specific interactions pertaining to the pictorial presentation of orbitals, numerical values serve as the keys to intensify their value. In case of donation versus back donation in transition metals and $\\sigma / \\pi$ bonding it may prove helpful by assigning charges to the constituent atoms of a molecule. Pictorial presentation of orbitals are instant informative, however for the purpose to quantify and compare specific interactions numerical values are the keys to intensify the informative representation. ${ }^{96-99}$ For instance, donation versus back donation in transition metal complexes, single, double and triple bonding in organic compounds. Assigning charges to atoms is very useful idea for performing a rough idea of charge distribution in a molecule. The total electron density is expanded in terms of molecular orbitals and then each orbital can be extrapolated in terms of a set of atomic orbitals (the basis set).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-24_1298_1911_439_1613}\n\\end{center}\n\nFig. 17 Dose dependant anti-proliferative data of the model compounds I and 1.\n\nTable 11 Antiproliferative data of (dha-aapH) ligand and its dinitrosyl complex\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-24_2086_2503_127_1930}\n\\end{center}\n\n\\[\n\\rho(r)=\\sum_{i} \\eta_{i} \\rho_{i}(r)\n\\]\n\n$\\rho_{i}(r)=\\psi_{i}^{*}(r) \\psi_{i}(r)$ and $\\eta_{i}$ accounts for the orbital occupation\n\n\\[\n\\psi_{i}(r)=\\sum_{\\alpha} C_{\\alpha i} \\chi_{\\alpha}\n\\]\n\nSo,\n\n\\[\n\\rho_{i}(r)=\\sum_{\\alpha \\beta} C_{\\alpha i} C_{\\beta i} \\chi_{\\alpha}^{*} \\chi_{\\beta}\n\\]\n\n(xxiii)\n\nSo,\n\n\\[\n\\rho(r)=\\sum_{i} \\eta_{i} \\sum_{\\alpha \\beta} C_{\\beta i} \\chi_{\\alpha}^{*} \\chi_{\\beta}\n\\]\n\nIf we interchange the summation indices, which basically means we change the order in which we sum up all the individual terms:\n\n\\[\n\\begin{gathered}\n\\rho(r)=\\sum_{\\alpha \\beta} \\sum_{i} \\eta_{i} C_{\\alpha i} C_{\\beta i} \\chi_{\\alpha}^{*} \\chi_{\\beta} \\\\\nS_{\\alpha \\beta}=\\chi_{\\alpha}^{*} \\chi_{\\beta} \\text { is the overlap matrix }\n\\end{gathered}\n\\]\n\n$D_{\\alpha \\beta}=\\sum_{i} \\eta_{i} C_{\\alpha i} C_{\\beta i}$ is the density matrix and we write $\\rho(r)$ in a simplified form,\n\n\\[\n\\rho(r)=\\sum_{\\alpha \\beta} D_{\\alpha \\beta} S_{\\alpha \\beta}\n\\]\n\n(xxvii)\n\nPopulation analysis methods divide up $D_{\\alpha \\beta} S_{\\alpha \\beta}$ to obtain numbers that tell us where the electron density in a system resides. A few of more common wave function population analyses methods include Mulliken, Lowdin, Roby, Mayer, Cioslowski, Charge decomposition analysis (CDA) and Natural Bond Order (NBO). $\\mathbf{1 0 0 - 1 0 5 ~}^{\\text {O }}$\n\nPopulation methods also assign each atom a partial charge. Each atom centre is positively charged core (charge $Z_{\\mathrm{A}}$ ) surrounded by shielding electron, once we know how much electron density each atom has we can determine the atomic partial charge\n\n\\[\nq_{\\mathrm{A}}=Z_{\\mathrm{A}}-\\int \\rho_{\\mathrm{A}}(r) \\mathrm{d} r\n\\]\n\n(xxviii)\n\nHowever, there is a problem; the charge can be distributed in different ways by different methods qualitatively. As there is no observable property associated with the \"partial charge\" and also there isn't any reference value to which computed values can be compared. Thus there is also no way to evaluate the accuracy. It is very important not to over interpret data provided by population methods as partial charges are artificial, they do not present an observable property of atoms or molecules.\n\nOne localization ad population analysis method that very popular is the natural bond order analysis. In this method natural atomic orbitals that are effective orbitals of an atom in the particular molecular environment (rather than isolated or in gas phases) are determined. There are also the maximum occupancy orbitals. NBOs are localized at few centre MOs that reflect Lewis like bonding structure. The natural atomic charges of a representative complex, $\\left[\\mathrm{Mo}(\\mathrm{NO})_{2}(\\operatorname{amph}-\\mathrm{aap})(\\mathrm{OH})\\right]$ obtained by $\\mathrm{NBO}$ and Mulliken population analysis with B3LYP/LANL2DZ basis set are compared in Fig. 18. The comparison between Mulliken's net charges and the atomic natural ones is not an easy task since the theoretical background of the two methods was very different. Looking at the results there are surprising differences between the Mulliken's and the $\\mathrm{NBO}$ charges. The observation of the data of the complex 2 shows that the atoms namely $\\mathrm{C}_{3}, \\mathrm{C}_{5}, \\mathrm{C}_{7}, \\mathrm{C}_{14}, \\mathrm{C}_{16}$, $\\mathrm{C}_{17}, \\mathrm{C}_{22}, \\mathrm{C}_{24}, \\mathrm{Mo}_{36}$ and all hydrogen bear positive charge both in NBO and Mulliken analyses. The remaining atoms possess negatively charges over them in both the analysis. It is noticeable that $\\mathrm{N}_{33}$ atom of one of the two NO ligands, is negatively charged in Mulliken scale but has positive partial charge in NBO analysis. This demonstrates the redistribution of charges when compared with the NPA analysis of representative Schiff base.\n\n\\[\nV(r)=\\sum_{A}^{N} \\frac{Z_{\\mathrm{A}}}{\\left|r-R_{\\mathrm{A}}\\right|}-\\int \\frac{\\rho\\left(r^{\\prime}\\right) d^{3} r^{\\prime}}{\\left|r-r^{\\prime}\\right|}\n\\]\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-25_1815_2478_169_1903}\n\\end{center}\n\nFig. 18 Graphical presentation of Mulliken and NBO population analysis of complex 2.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_13bcf90c3ef43f1413deg-26_168_2254_444_1613}\n\\end{center}\n\nFig. 19 Electron density plot and incremental distinction of highly electropositive and highly electronegative regions of complex 2.\n\nThe MESP diagram is used to understand the interactive behavior of a molecule, in that negative regions can be regarded as nucleophilic centers, whereas the positive regions are potential electrophilic sites. The molecular electrostatic potentials of the model complex is given in Fig. 19, displaying molecular shape, size and electrostatic potential values. The MESP map of the complex indicates the coordination sphere is the region of most negative potential. The hydrogen and nitrogen atoms in a ligand bear the region of maximum positive charge. It is noteworthy here that the two hydrogens attached to the electronegative oxygen of the coordinated water molecule are most electropositive. The predominance of green region in the MESP surfaces corresponds to a potential halfway between the two extremes red and dark blue color. ${ }^{106}$ A scheme has been developed by changing numerical assignment decreased by one unit, a stage reached when the two most electropositive and the most electronegative region become quite distinctive as shown in Fig. 19.\n\n\\section{Conclusions}\nThe comparative experimental and theoretical study of pyrazolone Schiff base dinitrosylmolybdenum(0) complexes revealed that the complexes bear a cis-octahedral geometry. The experimental and theoretical data were found in excellent agreement with one another. The evaluation of thermal chemistry using different methods indicate the Freeman Carrol method exhibits quite different readings as compared with other three methods regarding the TG-based kinetic and thermodynamic studies. In vitro anticancer and antimicrobial actions also exhibited high potent anticancer and antimicrobial activity of the compounds. Overall, the investigation suggests that the compounds reported so far are good future tools to be biologically tested against more virulent diseases.\n\n\\section{Conflicts of interest}\nNo conflict(s) of interest is declared by the authors.\n\n\\section{Acknowledgements}\nThe authors thankfully acknowledge Vice Chancellor, R. D. University Jabalpur, India, for his support in developing the lab infrastructure. SAIF, IIT Mumbai, UGC networking Centre Hyderabad Central University, PBRI, Bhopal, Food Science Department Kashmir University and IIT, Chennai are also gratefully acknowledged for rendering necessary lab facilities.\n\n\\section{References}\n1 A. Fejzic and S. Cavar, Bull. Chem. Technol. Bosnia Herzegovina, $2014,42,1-4$.\n\n2 J. Wang, R. P. Woldring, G. D. Roman-Melendez, A. M. Mcclain, B. R. Alzua and E. N. G. Marsh, ACS Chem. Biol., 2014, 9, 1929-1938.\n\n3 P. Hanzelmann and H. Schindelin, Proc. Natl. Acad. Sci. U. S. A., 2004, 101, 12870-12875.\n\n4 P. Hanzelmann, G. Schwarz and R. R. Mendel, J. Biol. Chem., 2002, 277, 18303-18312.\n\n5 R. C. Maurya and J. M. Mir, Int. J. Appl. Sci. Eng. Res., 2014, 5, 282-321.\n\n6 J. M. Mir, S. Roy, P. K. Vishwakarma and R. C. Maurya, $J$. Chin. Adv. Mater. Soc., 2018, 6, 282-300. 7 S. M. O. Quintal, H. I. S. Nogueira, H. M. Carapuca, V. Felix and M. G. B. Drew, J. Chem. Soc., Dalton Trans., 2001, 0, 3196-3201.\n\n8 L. Lisnard, P. Mialane, A. Dolbecq, J. Marrot and F. Secheresse, Inorg. Chem. Commun., 2003, 6, 503-505.\n\n9 B. Modec, J. V. Brencic, E. M. Burkholder and J. Zubieta, Dalton Trans., 2003, 0, 4618-4625.\n\n10 R. Villanneau, R. Delmont, A. Proust and P. Gouzerh, Chem.Eur. J., 2000, 6, 1184-1192.\n\n11 L. J. Csanyi, J. Mol. Catal. A: Chem., 2010, 322, 1-6.\n\n12 R. Hille, Chem. Rev., 1996, 96, 2757-2816.\n\n13 M. Nair, L. H. Nair and D. Thankamani, J. Serb. Chem. Soc., 2011, 76, 221-233.\n\n14 T. Yonemura, J. Nakata, M. Kadoda, M. Hasegawa, K. Okamoto, T. Ama, H. Kawaguchi and T. Yasui, Inorg. Chem. Commun., 2001, 4, 661-663.\n\n15 T. Yonemura, T. Hashimoto, M. Hasegawa, T. Ikenoue, T. Ama and H. Kawaguchi, Inorg. Chem. Commun., 2006, 9, 183-186.\n\n16 T. Yonemura, Acta Crystallogr., 2009, 65, 1463-1464.\n\n17 A. Sen and R. R. Thomas, Organometallics, 1982, 1, 12511254.\n\n18 A. Keller and R. Matusiak, J. Mol. Catal., 1999, 142, 317-324.\n\n19 A. Keller, J. Mol. Catal., 1993, 78, 15-18.\n\n20 A. Keller and R. Matusiak, J. Mol. Catal., 1996, 104, 213-219.\n\n21 D. D. Thomas, C. Corey, J. Hickok, Y. Wang and S. Shiva, Redox Biol., 2018, 15, 277-283.\n\n22 L. T. Elrod and E. Kim, Inorg. Chem., 2018, 57, 2594-2602.\n\n23 F. Caron, M. Rivallan, S. Humbert, A. Daudin, S. Bordiga and P. Raybaud, J. Catal., 2018, 361, 62-72.\n\n24 L. L. Thomson, F. G. Lawton, R. G. Knowles, J. E. Basley, V. Riversomoreno and S. Moncada, Cancer Res., 1994, 54, 1352-1354.\n\n25 S. Taysi, C. Uslu, F. Akcay and M. Y. Sutbeyaz, Surg. Today, $2003,33,651-654$.\n\n26 C. S. Cabs, J. E. Brenman, K. D. Aldape, D. S. Bredt and M. A. Isrnael, Cancer Res., 1995, 55, 727-730.\n\n27 S. Reveneau, L. Arnould, G. Jolimoy, S. Hilpert, P. Lejeune, V. Saint-Giorgio, C. Belichard and J. F. Jeannin, Lab. Invest., $1999,79,1215-1225$.\n\n28 J. Prazma, P. Pertrusz, W. Mims, S. S. Ball and M. C. Weissler, Otolaryngol.-Head Neck Surg., 1995, 113, 541-549.\n\n29 D. X. West, S. B. Padhye and P. B. Sonawane, Struct. Bonding (Berlin), 1991, 76, 1-50.\n\n30 A. Mortensen and J. Lykkesfeldt, Nitric Oxide, 2014, 36, 5157.\n\n31 S. Majumder, S. Sinha, J. H. Siamwala, A. Muley, H. R. Seerapu, G. K. Kolluru, V. Veeriah, S. Nagarajan, S. R. C. Sridhara, M. K. Priya, M. Kuppusamy, S. Srinivasan, S. Konikkat, G. Soundararajan, S. Venkataraman, U. Saran and S. Chatterjee, Nitric Oxide, 2014, 36, 76-86.\n\n32 A. C. B. A. Wanschel, V. M. Caceres, A. I. S. Moretti, A. B. Cardoso, H. F. de Carvalho, H. P. de Souza, F. R. M. Laurindo, R. C. Spadari and M. H. Krieger, Nitric Oxide, 2014, 36, 58-66.\n\n33 M. Bahra, V. Kapil, V. Pearl, S. Ghosh and A. Ahluwalia, Nitric Oxide, 2012, 26, 197-202. 34 C. H. Hu and D. R. Chong, Chem. Phys. Lett., 1996, 262, $733-$ 736.\n\n35 L. C. J. Thomas, W. C. Bauschlicher Jr and B. M. Hall, J. Phys. Chem. A, 1997, 101, 8530-8539.\n\n36 M. Zhou and L. Andrews, J. Phys. Chem. A, 2000, 104, 39153925.\n\n37 D. Bykov, M. Plog and F. Neese, J. Biol. Inorg Chem., 2014, 19, 97-112.\n\n38 A. S. Azizyan, T. S. Kurtikyan, G. G. Martirosyan and P. C. Ford, Inorg. Chem., 2013, 52, 5201-5205.\n\n39 G. F. Caramori, A. G. Kunitz, D. F. Coimbra, L. C. Garcia and D. E. P. Fonseca, J. Braz. Chem. Soc., 2013, 24, 1487-1496.\n\n40 P. F. Wu, S. C. Liu, Y. J. Shieh, T. S. Kuo, G. H. Lee, Y. Wang and Y. C. Tsai, Chem. Commun., 2013, 49, 4391.\n\n41 F. Neese, J. Biol. Inorg. Chem., 2006, 11, 702-711.\n\n42 J. P. Perdew, Phys. Rev. B, 1986, 33, 8822-8824.\n\n43 A. D. Becke, J. Chem. Phys., 1986, 8, 4524-4529.\n\n44 W. A. Zoubi, S. G. Mohamed, A. A. S. Al-Hamdani, A. P. Mahendradhany and Y. G. Ko, RSC $A d v ., 2018,8$, $23294-23318$.\n\n45 W. A. Zoubi, F. Kandil and M. K. Chebani, Arabian J. Chem., 2016, 9, 626-632.\n\n46 W. A. Zoubi, F. Kandil and M. K. Chebani, Spectrochim. Acta, Part A, 2011, 79, 1909-1914.\n\n47 M. Shaharyar, A. A. Siddiqui, M. A. Ali, D. Sriram and P. Yogeeswari, Bioorg. Med. Chem. Lett., 2006, 16, 39473949.\n\n48 J. F. Li, B. Guan, D. X. Li and C. Dong, Spectrochim. Acta, Part A, 2007, 68, 404-408.\n\n49 G. Bai, J. Li, D. Li, C. Dong, X. Han and P. Lin, Dyes Pigm., $2007,75,93-98$.\n\n50 Z. Lu, Q. Jiang, W. Zhu, M. Xie, Y. Hou, X. Chen and Z. Wang, Aust. J. Chem., 2005, 27, 2267-2274.\n\n51 N. A. Evans, D. E. Rivett and J. F. K. Wilshire, Aust. J. Chem., $2005,27,2267-2274$.\n\n52 B. S. Jensen, Acta Chem. Scand., 199, 13, 1668-1670.\n\n53 R. C. Maurya, A. Pandey, J. Chaurasia and H. Martin, J. Mol. Struct., 2006, 798, 89-101.\n\n54 W. B. Taylor, Biometrics, 1957, 13, 1-12.\n\n55 T. Mosmann, J. Immunol. Res., 1983, 65, 55-63.\n\n56 L. R. Holloway, A. J. Clough, J. Y. Li, E. L. Tao, F. Tao and L. Li, Polyhedron, 2014, 70, 29-38; M. J. Frisch, G. W. Trucks, H. B. Schlegel, G. E. Scuseria, M. A. Robb, J. R. Cheeseman, G. Scalmani, V. Barone, B. Mennucci, G. A. Petersson, H. Nakatsuji, M. Caricato, X. Li, H. P. Hratchian, A. F. Izmaylov, J. Bloino, G. Zheng, J. L. Sonnenberg, M. Hada, M. Ehara, K. Toyota, R. Fukuda, J. Hasegawa, M. Ishida, T. Nakajima, Y. Honda, O. Kitao, H. Nakai, T. Vreven, J. A. Montgomery, Jr, J. E. Peralta, F. Ogliaro, M. Bearpark, J. J. Heyd, E. Brothers, K. N. Kudin, V. N. Staroverov, T. Keith, R. Kobayashi, J. Normand, K. Raghavachari, A. Rendell, J. C. Burant, S. S. Iyengar, J. Tomasi, M. Cossi, N. Rega, J. M. Millam, M. Klene, J. E. Knox, J. B. Cross, V. Bakken, C. Adamo, J. Jaramillo, R. Gomperts, R. E. Stratmann, O. Yazyev, A. J. Austin, R. Cammi, C. Pomelli, J. W. Ochterski, R. L. Martin, K. Morokuma, V. G. Zakrzewski, G. A. Voth, P. Salvador, J. J. Dannenberg, S. Dapprich, A. D. Daniels, O. Farkas, J. B. Foresman, J. V. Ortiz, J. Cioslowski and D. J. Fox, Gaussian 09, Revision C.01, Gaussian, Inc., Wallingford CT, 2010.\n\n57 GaussView 9.0, Gaussian Inc., Garnegie Office Park, Pittsburgh. PA, USA.\n\n58 S. Bayari, S. Saglan and H. F Ustundag, J. Mol. Struct.: THEOCHEM, 2005, 726, 225-232.\n\n59 J. Jayabharathi, V. Thanikachalam and M. V. Perumal, Spectrochim. Acta, Part A, 2012, 95, 614-621.\n\n60 R. C. Maurya, D. D. Mishra, S. Mukherjee and P. K. Trivedi, Transition Met. Chem., 1991, 16, 524-527.\n\n61 R. C. Maurya, D. D. Mishra, N. S. Rao and N. N. Rao, Synth. React. Inorg. Met.-Org. Chem., 1994, 24, 1013-1025.\n\n62 R. C. Maurya, D. D. Mishra, N. S. Rao and N. N. Rao, Bull. Chem. Soc. Jpn., 1995, 68, 1589-1592.\n\n63 R. C. Maurya and V. Pillai, Indian J. Chem., 1999, 38A, 736739.\n\n64 R. C. Maurya, J. Dubey and B. Shukla, Synth. React. Inorg. Met.-Org. Chem., 1998, 28, 1159-1171.\n\n65 S. Sarkar, R. C. Maurya and S. C. Chaurasia, Transition Met. Chem., 1976, 1, 49.\n\n66 D. Gwost and K. G. Caulton, Inorg. Chem., 1974, 13, 414417.\n\n67 M. P. Perpinan, L. Ballester, A. Santos and A. Monge, Polyhedron, 1987, 6, 1523-1532.\n\n68 W. J. Geary, Coord. Chem. Rev., 1971, 7, 81-122.\n\n$69 \\mathrm{~J}$. H. Enemark and R. D. Feltham, in Topics in Inorganic and Organometallic Stereochemistry, ed. G. Geoffroy, Wiley, New York, 1981, vol. 12, pp. 152-215.\n\n70 M. E. Brown, Introduction to Thermal Analysis: Techniques and Applications, Springer Science, 2001, DOI: 10.1007/0306-48404-8.\n\n71 H. B. Singh, S. Maheshwari and H. Tomer, Thermochim. Acta, 1983, 64, 47-53.\n\n$72 \\mathrm{~K}$. K. Srivastavaa, S. Srivastavab and Md. T. Alam, Int. J. Pharma Bio Sci., 2013, 2, 26-37.\n\n73 P. P. Kalbende, M. V. Tarase and A. B. Zade, J. Chem., 2012, 2013, DOI: 10.1155/2013/846327.\n\n74 E. S. Freeman and B. Carroll, J. Phys. Chem., 1958, 62, 394397.\n\n75 H. H. Horowitz and G. Metzger, Anal. Chem., 1963, 35, 14641468.\n\n76 A. W. Coats and I. P. Redfern, Nature, 1964, 20, 68-69.\n\n77 A. Broido, J. Polym. Sci., Part A-2, 1969, 7, 1761-1773.\n\n78 A. A. Frost and R. G. Pearson, Kinetics and Mechanism, J. Chem. Educ., 1961, 38, P535.\n\n79 P. B. Maravalli and T. R. Goudar, Thermochim. Acta, 1999, 325, 95-105.\n\n80 K. K. M. Yusuf and R. Sreekala, Thermochim. Acta, 1990, 159, 357-368.\n\n81 D. B. Brown, E. G. Walton and J. A. Dits, J. Chem. Soc., Dalton Trans., 1980, 845-850.\n\n82 D. Shoba, S. Periandy, M. Karabacak and S. Ramalingam, Spectrochim. Acta, Part A, 2012, 83, 540-552.\n\n83 K. Fukui, Science, 1982, 218, 747-754. 84 C. J. Brabec, N. S. Sariciftci and J. C. Hummelen, Adv. Funct. Mater., 2001, 11, 15-26.\n\n85 E. E. Ebenso, T. Arslan, F. Kandemirli, I. Love, M. Saracoglu and S. A. Umoren, Int. J. Quantum Chem., 2010, 110, 26142636.\n\n86 A. H. Kianfar, L. Keramat, M. Dostani, M. Shamsipur, M. Roushani and F. Nikpour, Spectrochim. Acta, Part A, $2010,77,424-429$.\n\n87 A. A. Nejo, G. A. Kolawole and A. O. Nejo, J. Coord. Chem., $2010,63,4398-4410$.\n\n88 N. Raman, S. Sobha and A. Thamaraichelvan, Spectrochim. Acta, Part A, 2011, 78, 888-898.\n\n89 T. Rosu, E. Pahontu, C. Maxim, R. Georgescu, N. Stanica and A. Gulea, Polyhedron, 2011, 30, 154-162.\n\n90 N. Raman, A. Kulandaisamy, C. Thangaraja and K. Jeyasubramanian, Transition Met. Chem., 2003, 28, 29-36.\n\n91 R. Karvembu, C. Jayabalakrishnan, N. Dharmaraj, S. V. Renukadevi and K. Natarajan, Transition Met. Chem., 2002, 27, 631-638.\n\n92 Y. Anjaneyulu and R. P. Rao, Synth. React. Inorg. Met.-Org. Chem., 1986, 16, 257-272.\n\n93 J. M. Mir, N. Jain, P. S. Jaget and R. C. Maurya, Photodiagn. Photodyn. Ther., 2017, 19, 363-374.\n\n94 J. M. Mir and R. C. Maurya, J. Chin. Adv. Mater. Soc., 2018, 6, 156-168. 95 J. M. Mir and F. A. Itoo, J. Mol. Liq., 2017, 247, 1-5.\n\n96 R. S. Mulliken, J. Chem. Phys., 1955, 23, 1833-1840.\n\n97 J. M. Mir, P. K. Vishwakarma and R. C. Maurya, J. Chin. Adv. Mater. Soc., 2018, 6, 55-80.\n\n98 R. C. Maurya, B. A. Malik, J. M. Mir, P. K. Vishwakarma, D. K. Rajak and N. Jain, J. Coord. Chem., 2015, 68, 29022922.\n\n99 J. M. Mir, N. Jain, P. S. Jaget, W. Khan, P. K. Vishwakarma, D. K. Rajak, B. A. Malik and R. C. Maurya, J. King Saud Univ., Sci., 2017, DOI: 10.1016/j.jksus.2017.06.006, in press.\n\n100 J. M. Mir, N. Jain, B. A. Malik, R. Chourasia, P. K. Vishwakarma, D. K. Rajak and R. C. Maurya, Inorg. Chim. Acta, 2017, 467, 80-92.\n\n101 J. M. Mir, R. C. Maurya and P. K. Vishwakarma, Karbala Int. J. Mod. Sci., 2017, 3, 212-223.\n\n102 R. C. Maurya, B. A. Malik, J. M. Mir, P. K. Vishwakarma, D. K. Rajak and N. Jain, J. Mol. Struct., 2015, 1099, 266-285.\n\n103 R. C. Maurya, B. A. Malik, J. M. Mir and P. K. Vishwakarma, J. Mol. Struct., 2015, 1083, 343-356.\n\n104 P. K. Vishwakarma, J. M. Mir and R. C. Maurya, J. Chem. Sci., 2016, 128, 511-522.\n\n105 J. M. Mir, R. C. Maurya, D. K. Rajak, B. A. Malik, P. S. Jaget and N. Jain, Karbala Int. J. Mod. Sci., 2017, 3, 153-164.\n\n106 R. C. Maurya, B. A. Malik, J. M. Mir and A. K. Sharma, J. Coord. Chem., 2014, 67, 3084-3106.\n\n\n\\end{document}", "record_id": "2023_09_22_13bcf90c3ef43f1413deg"}