{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Europe PMC Funders Group }\n\n\n\\author{Pavol Jusko $^{a}$, Aude Simon $^{b}$, Shreyak Banhatti ${ }^{\\mathrm{C}}$, Sandra Brünken $^{\\mathrm{d}}$, and Christine Joblin $^{a,{ }^{*}}$\\\\\na Institut de Recherche en Astrophysique et Planétologie (IRAP), Université de Toulouse (UPS),\\\\\nCNRS, CNES, 9 Av. du Colonel Roche, 31028 Toulouse Cedex 4, France bLaboratoire de Chimie\\\\\net Physique Quantiques LCPQ/IRSAMC, Université de Toulouse (UPS) and CNRS, 118 Route de\\\\\nNarbonne, 31062 Toulouse, France 'I. Physikalisches Institut, Universität zu Köln, Zülpicher Str.\\\\\n77, 50937 Köln, Germany ${ }^{d}$ Radboud University, Institute for Molecules and Materials, FELIX\\\\\nLaboratory, Toernooiveld 7c, 6525 ED, Nijmegen, The Netherlands}\n\\date{}\n\n\n\\begin{document}\n\\maketitle\nAuthor Manuscript\n\nChemphyschem. Author manuscript; available in PMC 2019 March 15.\n\nPublished in final edited form as:\n\nChemphyschem. 2018 December 5; 19(23): 3182–3185. doi:10.1002/cphc.201800744.\n\n\\section{Direct Evidence of the Benzylium and Tropylium Cations as the two long-lived Isomers of $\\mathrm{C}_{7} \\mathrm{H}_{7}^{+}$}\n\n\n\\begin{abstract}\nDisentangling the isomeric structure of $\\mathrm{C}_{7} \\mathrm{H}_{7}^{+}$is a longstanding experimental issue. We report here the full mid-infrared vibrational spectrum of $\\mathrm{C}_{7} \\mathrm{H}_{7}{ }^{+}$tagged with Ne obtained with infraredpredissociation spectroscopy at $10 \\mathrm{~K}$. Saturation depletion measurements were used to assign the contribution of benzylium and tropylium isomers and demonstrate that no other isomer is involved. Recorded spectral features compare well with density functional theory calculations. This opens perspectives for a better understanding and control of the formation paths leading to either tropylium or benzylium ions.\n\\end{abstract}\n\n\\section{Keywords}\nbenzylium; tropylium; structure elucidation; IR spectroscopy; cryogenic ion trap\n\nBenzylium $\\left(\\mathrm{Bz}^{+}\\right)$and tropylium $\\left(\\mathrm{Tr}^{+}\\right)$ions are key isomers of $\\mathrm{C}_{7} \\mathrm{H}_{7}^{+}$commonly produced from energized toluene $\\left(\\mathrm{C}_{7} \\mathrm{H}_{8}\\right)$ ).[1,2,3] Whereas $\\mathrm{Bz}^{+}$consists of a benzene ring substituted with a methylene group, the $\\operatorname{Tr}^{+}$isomer is a fully aromatic ion made of a 7-membered $\\mathrm{CH}$ ring. The possibility that similar structures can be involved in the fragmentation of methylsubstitued polycyclic aromatic hydrocarbon ions has been recently discussed.[4,5] Still, one of the major issues in these studies is the limited understanding of the formation paths of these species, that would allow us to predict and therefore control the production of one or the other isomer. On the one hand, it was shown that the choice of the precursor is important, e. g., the use of halogen-substitued toluene is expected to optimise the production of $\\mathrm{Bz}^{+}$.[6] But on the other hand, the $\\mathrm{Bz}^{+} / \\mathrm{Tr}^{+}$ratio depends strongly on the various experimental conditions.[7,8] Another point, in photoionization experiments of toluene, is that it is not possible to produce solely $\\operatorname{Tr}^{+}$at appearance threshold,[9] despite calculations show $\\operatorname{Tr}^{+}$ being energetically more favorable than $\\mathrm{Bz}^{+}$(by $\\sim 38 \\mathrm{~kJ} \\cdot \\mathrm{mol}^{-1}$; cf. Tab S3 in the SI). The\n\n\\begin{itemize}\n  \\item \\href{mailto:christine.joblin@irap.omp.eu}{christine.joblin@irap.omp.eu}. latter results were interpreted as due both to the presence of a barrier in the dissociation path from toluene towards $\\operatorname{Tr}^{+}$, and to the role of autoionizing states in promoting a nonstatistical formation of $\\mathrm{Bz}^{+}$over $\\operatorname{Tr}^{+}$.[9] In contrast to $\\operatorname{Tr}^{+}$, theoretical studies show that paths towards $\\mathrm{Bz}^{+}$lack high barriers, and no barrier is found in the path from benzyl chloride ionization towards $\\mathrm{Bz}^{+}$formation.[10]\n\\end{itemize}\n\nIt is known since earlier studies on $\\mathrm{C}_{7} \\mathrm{H}_{7}+$ that a convenient way to identify $\\mathrm{Bz}^{+}$is through ion-molecule reaction with toluene, leading to efficient formation of $\\mathrm{C}_{8} \\mathrm{H}_{9}{ }^{+} .[11,1]$ The nonreactive part of the ion population is then attributed to $\\operatorname{Tr}^{+}$. In parallel, there have been many attempts to characterize the structure of $\\mathrm{C}_{7} \\mathrm{H}_{7}^{+}$directly, i. e., via spectroscopy. Electronic absorption features have been studied in both Ne matrix[12] and in gas-phase by photodissociation.[13,14] For $\\mathrm{Bz}^{+}$, the vibronic structure was resolved for the $\\mathrm{S}_{1} \\leftarrow \\mathrm{S}_{0}$ transition but much broader features were observed for the higher excited states. Absorption features of $\\operatorname{Tr}^{+}$are expected in the UV range,[12] but the data obtained in Ne matrices could not be confirmed in the gas-phase.[13] On the opposite, infrared and Raman spectra of $\\mathrm{Tr}$ + could be obtained in solutions or in solid phase using salts.[15,16,17] In gas-phase, one can think of infrared multiple photon dissociation (IRMPD) vibrational spectroscopy as the technique of choice when characterizing the structure of ions in mass spectrometry experiments.[18] Information on the $\\mathrm{Bz}^{+} / \\mathrm{Tr}^{+}$dichotomy[19] could be obtained from the IRMPD spectra of derivative ions with lower dissociation thresholds compared to $\\mathrm{C}_{7} \\mathrm{H}_{7}^{+}$. $[20,21,19,22]$ The spectroscopy of polycyclic hydrocarbon cations containing $\\mathrm{Bz}^{+}$and $\\operatorname{Tr}^{+}$ structure was also investigated.[8,5] However, the IRMPD spectra of pure $\\mathrm{Bz}^{+}$and $\\mathrm{Tr}^{+}$are still lacking, despite the efforts.[20] This could be due to the exceptional stability of these ions, or possible isomerisation issues, as found in the case of $\\mathrm{C}_{17} \\mathrm{H}_{11}{ }^{+}$.[5]\n\nAn alternative approach to IRMPD not owning the disadvantages of the multi-photon process, is infrared pre-dissociation (IR-PD) spectroscopy of a weakly bound complex of the ion with a rare gas atom. Thanks to this technique, we were able to obtain the first complete mid-IR-PD spectra of Ne tagged $\\mathrm{C}_{7} \\mathrm{H}_{7}{ }^{+}$recorded in gas-phase and at low temperature. We used the cryogenic 22 pole ion trap,[23] which is coupled to the free electron laser FELIX, as described in the experimental section below. We introduced different precursors and varied the ionization conditions (cf. Tab. S1 in the SI). Figure 1 gathers the recorded experimental spectra, which appear to agree well with the calculated spectra of $\\mathrm{Bz}^{+}$and $\\mathrm{Tr}^{+}$ using density functional theory (DFT) at the B3LYP/6-31G(d,p) level of theory as implemented in Gaussian09 suite of programs.[24] In addition, the contribution of $\\mathrm{Bz}^{+}$and $\\mathrm{Tr}^{+}$in each mixture could be determined directly during the spectroscopic experiment by using saturation depletion measurements. To achieve the latter, the laser is tuned in resonance with a vibrational band of interest. By applying a large number of photon pulses, the optically active isomer-Ne complex can be dissociated completely leaving only the optically inactive isomer-Ne complex in the trap. Recording the ion-Ne $(m=111 u)$ number as a function of time reveals the relative abundance of active to inactive isomers. Depletion tests for selected bands of both isomers and under varying ion source conditions are shown in Fig. 2. They show that one condition leads to $90 \\% \\mathrm{Bz}^{+}$population and another to $60-70 \\%$ of $\\operatorname{Tr}^{+}$with 40-30\\% of $\\mathrm{Bz}^{+}$. These measurements provide the first complete demonstration that $\\mathrm{Bz}^{+}$and $\\mathrm{Tr}^{+}$are the only long-lived isomers of $\\mathrm{C}_{7} \\mathrm{H}_{7}^{+}$. In a preparatory study, we also recorded the chemical reactivity with toluene and found a good agreement with the above measurements, although only $\\mathrm{Bz}^{+}$can be directly monitored (cf. Fig. S2 in the SI).\n\nAssignment of the experimental bands of $\\mathrm{Bz}^{+}$and $\\mathrm{Tr}^{+}$is made in Tables 1 and 2. Additional levels of theory were carried out for benchmarking (cf. Section 2 in the SI). For each level, the calculated band positions are linearly scaled with a scaling factor S, in order to match with the strongest $\\mathrm{Bz}^{+}$band. From calculations on Ne tagged ions, we found that the top $(\\mathrm{T})$ and molecular plane (P) isomers are quasi degenerate (cf. Tab. S3 in the SI) and that the Ne tag is not expected to induce band shifts (cf. Figs. S12 and S13, Table S4 in the SI), nor splitting of the bands due to the degeneracy lifting in the $\\operatorname{Tr}^{+}$case, that would be observable in our experiments (cf. Fig. S12 in the SI, degenerate bands always split by less than $1 \\mathrm{~cm}$ ${ }^{-1}$ ). Overall, we found a good agreement between the measured and calculated band positions. However, in the case of $\\operatorname{Tr}^{+}$, one major difference exists. The harmonic calculations provide only three infrared active bands, which can be rationalized by the high symmetry of $\\operatorname{Tr}^{+}$which pertains to the $\\mathrm{D}_{7 \\mathrm{~h}}$ point group symmetry (cf. Tab. S2 in the SI for descent in symmetry from $\\mathrm{D}_{7 \\mathrm{~h}}$ to $\\mathrm{C}_{2 v}$, in which calculations are performed). In the experimental spectrum, we found four bands, two bands including the additional one falling at low frequency. We note that two close-by bands in this range are also observed in some experiments in condensed phase.[15,16,17]\n\nSaturation depletion measurements established that bands (b) - (d) in the experimental spectrum (Fig. 1), belong solely to $\\operatorname{Tr}^{+}$, and that both $\\mathrm{Bz}^{+}$and $\\operatorname{Tr}^{+}$are active at the $630 \\mathrm{~cm}^{-1}$ band (a). Bands (c) and (d) can be assigned to the doubly degenerate in plane $\\mathrm{CH}$ bending mode and in plane CC stretching mode of $\\operatorname{Tr}^{+}$, respectively. The third $\\operatorname{Tr}^{+}$band, the $\\mathrm{CH}$ outof-plane bending mode (not degenerate) should lay around $650 \\mathrm{~cm}^{-1}$ (close to band (b), cf. Fig. S3). The performed saturation depletion measurements invalidate the hypothesis that both bands (a) and (b) are caused by distinct (T) and (P) $\\operatorname{Tr}^{+} \\cdot$ Ne isomers. We also excluded contribution from a triplet spin state, whose presence can lead to shifts in low energy modes for PAHs.[25] In the case of $\\operatorname{Tr}^{+}$, it was found distorted and $3.3 \\mathrm{eV}$ above the ground state at the B3LYP/6-31G(d,p) level of theory (cf. Fig. S14 in the SI for its computed IR spectrum). The excited state can not survive many collisions with cold buffer gas and its spectrum does not contain features in the wavelength range of interest. The most likely scenario to account for bands (a) and (b), is that a combination band comes into close resonance with the fundamental CH out-of-plane bending mode, and borrows a significant part of its intensity. Our calculations show that the combination band involves the two lowest vibrational modes of $\\operatorname{Tr}^{+}$and that the combination band is red shifted relative to the fundamental band (Tab. 2 and Tab. S5 in the SI). In our experiment, we can assign band (b) as the fundamental mode (i. e. the strongest band) since the initial dissociation rate of this band is higher and its band width at saturation is larger as compared to band (a) (Fig. 2). Finally, our spectra do not include the CH stretch range. However, we learned while writing this manuscript that this range has recently been studied using a jet experiment and a table-top laser.[26]\n\nWe recorded the mid-IR-PD spectra of $\\mathrm{C}_{7} \\mathrm{H}_{7}^{+}$tagged with Ne at $10 \\mathrm{~K}$. The comparison of the experimental spectra with the harmonic calculated spectra show, that neither significant band shifts, nor band splitting are induced by the presence of the Ne tag, that can in particular induce a symmetry decrease in the case of $\\operatorname{Tr}^{+}$. The $\\operatorname{Tr}^{+}$spectrum exhibits an interesting strong resonance at low frequency between a combination band and the fundamental $\\mathrm{CH}$ out-of-plane bending mode. Anharmonic calculations would help in providing a detailed quantitative study of this resonance.[27,28]\n\nWe used saturation depletion measurements to confirm the existence of only two long-lived isomers of $\\mathrm{C}_{7} \\mathrm{H}_{7}^{+}$, and the obtained spectra support their initial structural assumption as $\\mathrm{Bz}^{+}$ and $\\operatorname{Tr}^{+} .[1,9]$ The depletion technique in an ion trap has the advantage of being able to track the abundance of a well-defined isomer, contrary to the earlier reactivity method, which only has access to $\\mathrm{Bz}^{+}$. This technique opens new perspectives for our understanding of the isomerisation paths of $\\mathrm{C}_{7} \\mathrm{H}_{7}{ }^{+}$.\n\n\\section{Experimental Section}\nThe ions are produced by electron bombardment in a storage type ion source[29] from benzyl chloride and toluene precursors. Ions of mass $91 u\\left(\\mathrm{C}_{7} \\mathrm{H}_{7}{ }^{+}\\right)$are mass selected in a quadrupole mass filter prior to being injected into the cryogenic 22 pole rf ion trap (nominal temperature $8-9 \\mathrm{~K}$ ), where they are cooled by a $100 \\mathrm{~ms}$ long $3: 1$ He:Ne gas pulse. The high number gas density achieved during this pulse $\\left(n \\sim 10^{14} \\mathrm{~cm}^{-3}\\right)$ promotes ternary attachment of Ne to the bare ion producing $\\mathrm{Bz}^{+} \\cdot \\mathrm{Ne}$ and $\\operatorname{Tr}^{+} \\cdot \\mathrm{Ne}$ complexes. After the cooling and tagging sequence, the number density in the trap decreases quickly to a level where no further attachment takes place. The ion-Ne complex is then dissociated by infrared radiation provided by the FELIX FEL-2 free electron laser,[30] operated in the $500-1650$\n\n$\\mathrm{cm}^{-1}$ range. The laser delivers up to $30 \\mathrm{~mJ}$ in a single macropulse into the 22 pole trap with a repetition rate of $10 \\mathrm{~Hz}$ and spectral bandwidth better than $\\sigma=0.5 \\%$. After an irradiation time of typically $2.6 \\mathrm{~s}$ the trap content is emptied through a mass filter onto a counting detector.\n\n\\section{Supplementary Material}\nRefer to Web version on PubMed Central for supplementary material.\n\n\\section{Acknowledgements}\nThe research leading to this result is supported by the European Research Council under the European Union's Seventh Framework Programme ERC-2013-SyG, Grant Agreement n. 610256 NANOCOSMOS. We acknowledge support from the project CALIPSOplus under the Grant Agreement 730872 from the EU Framework Programme for Research and Innovation HORIZON 2020. We greatly appreciate the experimental support provided by the FELIX team. We gratefully acknowledge the Nederlandse Organisatie voor Wetenschappelijk Onderzoek (NWO) for the support of the FELIX Laboratory. We thank the Cologne Laboratory Astrophysics group for providing the FELion ion trap instrument and the Cologne Center for Terahertz Spectroscopy (core facility, DFG grant SCHL 341/15-1) for supporting its operation. \\href{http://S.Ba}{S.Ba}. is supported by the H2020-MSCA-ITN-2016 Program (EUROPAH project, G. A. 722346). A. S. thanks the computing facility CALMIP for generous allocation of computer resources.\n\n\\section{References}\n[1]. Dunbar RC. Journal of the American Chemical Society. 1975; 97:1382-1384. DOI: 10.1021/ ja00839a016\n\n[2]. Kuck D. Mass Spectrometry Reviews. 1990; 9:583–630. DOI: 10.1002/mas.1280090602\n\n[3]. Lifshitz C. Accounts of Chemical Research. 1994; 27:138–144. DOI: 10.1021/ar00041a004 [4]. Rapacioli M, Simon A, Marshall CCM, Cuny J, Kokkin D, Spiegelman F, Joblin C. The Journal of Physical Chemistry A. 2015; 119:12845–12854. DOI: 10.1021/acs.jpca.5b09494 [PubMed: 26600076]\n\n[5]. Jusko P, Simon A, Wenzel G, Brünken S, Schlemmer S, Joblin C. Chemical Physics Letters. 2018; 698:206–210. DOI: 10.1016/j.cplett.2018.03.028 [PubMed: 29882538]\n\n[6]. Jackson JAA, Lias SG, Ausloos P. Journal of the American Chemical Society. 1977; 99:75157521. DOI: 10.1021/ja00465a020\n\n[7]. Fridgen TD, Troe J, Viggiano AA, Midey AJ, Williams S, McMahon TB. The Journal of Physical Chemistry A. 2004; 108:5600–5609. DOI: 10.1021/jp031328s\n\n[8]. Morsa D, Gabelica V, Rosu F, Oomens J, De Pauw E. The Journal of Physical Chemistry Letters. 2014; 5:3787–3791. DOI: 10.1021/jz501903b [PubMed: 26278748]\n\n[9]. Lifshitz C, Gotkis Y, Laskin J, Ioffe A, Shaik S. The Journal of Physical Chemistry. 1993; 97:12291-12295. DOI: 10.1021/j100149a032\n\n[10]. Choe JC. The Journal of Physical Chemistry A. 2008; 112:6190–6197. DOI: 10.1021/jp802641c [PubMed: 18543898]\n\n[11]. Shen J, Dunbar RC, Olah GA. Journal of the American Chemical Society. 1974; 96:6227-6229. DOI: 10.1021/ja00826a070\n\n[12]. Nagy A, Fulara J, Garkusha I, Maier JP. Angewandte Chemie International Edition. 2011; 50:3022-3025. DOI: 10.1002/anie.201008036 [PubMed: 21404390]\n\n[13]. Dryza V, Chalyavi N, Sanelli JA, Bieske EJ. The Journal of Chemical Physics. 2012; 137:204304.doi: 10.1063/1.4767402 [PubMed: 23206000]\n\n[14]. Féraud G, Dedonder-Lardeux C, Soorkia S, Jouvet C. The Journal of Chemical Physics. 2014; 140:024302.doi: 10.1063/1.4858409 [PubMed: 24437872]\n\n[15]. Fateley WG, Lippincott ER. The Journal of Chemical Physics. 1957; 26:1471-1481. DOI: $10.1063 / 1.1743566$\n\n[16]. Sourisseau C. Spectrochimica Acta Part A: Molecular Spectroscopy. 1978; 34:881-887. DOI: $10.1016 / 0584-8539(78) 80007-5$\n\n[17]. Howard J, Graham D. Spectrochimica Acta Part A: Molecular Spectroscopy. 1985; 41:815-824. DOI: 10.1016/0584-8539(85)80027-1\n\n[18]. Oomens J, Sartakov BG, Meijer G, von Helden G. International Journal of Mass Spectrometry. 2006; 254:1–19. DOI: 10.1016/j.ijms.2006.05.009\n\n[19]. Chiavarino B, Crestoni ME, Dopfer O, Maittre P, Fornarini S. Angewandte Chemie International Edition. 2012; 51:4947–4949. DOI: 10.1002/anie.201200558 [PubMed: 22488963]\n\n[20]. Chiavarino B, Crestoni ME, Fornarini S, Dopfer O, Lemaire J, Maître P. The Journal of Physical Chemistry A. 2006; 110:9352–9360. DOI: 10.1021/jp0628380 [PubMed: 16869683]\n\n[21]. Schröder D, Schwarz H, Milko P, Roithová J. The Journal of Physical Chemistry A. 2006; 110:8346-8353. DOI: 10.1021/jp056962f [PubMed: 16821818]\n\n[22]. Zins E-L, Pepe C, Schröder D. Faraday Discuss. 2010; 145:157–169. DOI: 10.1039/B907236E\n\n[23]. Asvany O, Bielau F, Moratschke D, Krause J, Schlemmer S. Review of Scientific Instruments. 2010; 81:076102.doi: 10.1063/1.3460265 [PubMed: 20687768]\n\n[24]. Frisch, MJ, Trucks, GW, Schlegel, HB, Scuseria, GE, Robb, MA, Cheeseman, JR, Scalmani, G, Barone, V, Mennucci, B, Petersson, GA, Nakatsuji, H. , et al. Gaussian 09, Revision D.01. Gaussian Inc.; Wallingford CT: 2016.\n\n[25]. Falvo C, Calvo F, Parneix P. The Journal of Chemical Physics. 2012; 137:064303.doi: 10.1063/1.4739468 [PubMed: 22897269]\n\n[26]. Wagner JP, McDonald DC, Duncan MA. The Journal of Physical Chemistry Letters. 2018; 9:4591–4595. DOI: 10.1021/acs.jpclett.8b02121 [PubMed: 30059230]\n\n[27]. Mackie CJ, Candian A, Huang X, Maltseva E, Petrignani A, Oomens J, Buma WJ, Lee TJ, Tielens AGGM. The Journal of Chemical Physics. 2015; 143:224314.doi: 10.1063/1.4936779 [PubMed: 26671382]\n\n[28]. Mulas G, Falvo C, Cassam-Chenaï P, Joblin C. J Chem Phys. 2018\n\n[29]. Gerlich, D. Adv Chem Phys: State-Selected and State-to-State Ion-Molecule Reaction Dynamics. Ng, C-Y, Baer, M, editors. Vol. LXXXII. Wiley; New York: 1992. 1-176. [30]. Oepts D, van der Meer AFG, van Amersfoort PW. Infrared Physics and Technology. 1995; 36:297-308. DOI: 10.1016/1350-4495(94)00074-U\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_dd9f0f77c116dc99583ag-07_225_1960_543_1798}\n\\end{center}\n\nFigure 1.\n\nMid-IR spectrum of $\\mathrm{C}_{7} \\mathrm{H}_{7}^{+}$. Top panel - IR pre-dissociation spectrum of $\\mathrm{Bz}^{+}$tagged with Ne. Middle panel - stick spectrum corresponding to the scaled DFT harmonic spectra for Bz ${ }^{+}$(blue) and $\\operatorname{Tr}^{+}$(red). Convoluted spectra with $\\sigma=0.5 \\% \\mathrm{BW}$ are provided for comparison with the experiment. Bottom panel - IR pre-dissociation spectrum of $\\operatorname{Tr}^{+}$tagged with Ne. Bands marked by (a), (b), (c), (d) have been confirmed to belong to $\\operatorname{Tr}^{+}$and those marked (a), (u), (v) to $\\mathrm{Bz}^{+}$by saturation depletion measurements. Intensities for experimental spectra are in arbitrary units. All recorded bands are listed in Tab. 1 for $\\mathrm{Bz}^{+}$and Tab. 2 for $\\operatorname{Tr}$ $+$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_dd9f0f77c116dc99583ag-09_229_1950_451_1869}\n\\end{center}\n\nFigure 2.\n\nDepletion of $\\mathrm{C}_{7} \\mathrm{H}_{7}^{+} \\cdot$ Ne in the ion trap for the different experimental conditions used in Fig. 1. Color code: Blue - wavelength at which the $\\mathrm{Bz}^{+}$isomer is active. Red - wavelength at which the $\\operatorname{Tr}^{+}$isomer is active. Magenta - both isomers active. Black - corresponds to nonresonant dissociation of the $\\mathrm{Ne} \\operatorname{tag}(\\sim 8-10 \\mathrm{~mJ} /$ pulse $)$. Numbers in the right column correspond to saturation depletion in percent. Letters refer to the bands shown in Fig. 1.\n\n\\section{Table 1}\nExperimental mid-IR band positions recorded for $\\mathrm{Bz}^{+}$and calculated values using DFT (B3LYP/6-31G(d,p)) obtained in the present work (see Figure 1). Only the modes which are IR active are reported. Their symmetry in the point group of the molecular ion $\\left(\\mathrm{C}_{2 v}\\right)$ are reported.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_dd9f0f77c116dc99583ag-10_512_1851_255_743}\n\\end{center}\n\nNote: All frequencies in $\\mathrm{cm}^{-1}$, intensities in $\\mathrm{km} \\cdot \\mathrm{mol}^{-1}$. * mode used to determine the scaling factor 0.974. Cf. Fig. S15. in the SI for the visualisation of modes.\n\n\\section{Table 2}\nExperimental mid-IR band positions recorded for $\\operatorname{Tr}^{+}$and calculated values using DFT (B3LYP/6-31G(d,p)) obtained in the present work (see Figure 1). Only the modes which are IR active are reported. Although they were computed in the $\\mathrm{C}_{2 v}$ symmetry point group, their symmetry in the point group of the molecular ion (D $\\left.{ }_{7} h\\right)$ are listed.\n\n\\begin{center}\n\\begin{tabular}{ccccl}\n\\hline\nMode & Exp. & Ref. & \\multicolumn{2}{c}{Calc.} \\\\\n & $\\boldsymbol{v}$ & $\\boldsymbol{v}$ & $\\boldsymbol{v}$ (Inten.) & Sym. \\\\\n\\hline\n$v_{\\mathrm{c}}$ & 630 & $633,[15] 634,[16] 655[17]$ &  &  \\\\\n$v_{4}$ & 652 & $658,[15] 660,[16] 685[17]$ & $646(85.8)$ & $\\mathrm{A}^{\\prime \\prime}$ \\\\\n$v_{8}$ & 994 & $992,[15] 992[16]$ & $989(3.7)$ & $\\mathrm{E}_{1}^{\\prime}$ \\\\\n$v_{14}$ & 1486 & $1477,[15] 1477[16]$ & $1480(42.9)$ & $\\mathrm{E}_{1}^{\\prime}$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nNote: All frequencies in $\\mathrm{cm}^{-1}$, intensities in $\\mathrm{km} \\cdot \\mathrm{mol}^{-1}$. Scaling factor $0.974 . v_{\\mathrm{C}}$ is a combination band of the two lowest lying fundamental bands of $\\operatorname{Tr}^{+}$. Cf. Fig. S16 - S18. in the SI for the visualisation of modes.\n\n\n\\end{document}", "record_id": "2023_09_22_dd9f0f77c116dc99583ag"}