{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{Ultralow Interlayer Friction of Layered Electride Ca $_{2} \\mathbf{N}$ : A Potential Two-Dimensional Solid Lubricant Material }\n\n\n\\author{Jianjun Wang ${ }^{1, *}$, Lin $\\mathrm{Li}^{2}$, Ziting Shen ${ }^{1}$, Peng Guo $^{1}{ }^{1}$, Meng Li $^{1}$, Bin Zhao ${ }^{1}$, Lili Fang ${ }^{1}$\\\\\nand Linfeng Yang 1\\\\\n1 Computational and Design Center for Low-dimensional Quantum Material, and College of Science,\\\\\nZhongyuan University of Technology, Zhengzhou 450007, China; szting2817@163.com (Z.S.);\\\\\ngoopoo@zut.edu.cn (P.G.); limeng@zut.edu.cn (M.L.); zhaobin@zut.edu.cn (B.Z.); hnzzfll@126.com (L.F.);\\\\\n13938420289@163.com (L.Y.)\\\\\n2 Delivery Devices and Connected Solutions, Eli Lilly and Company, Indianapolis, IN 46285, USA;\\\\\nwilliamnism@gmail.com (L.L.)\\\\\n* Correspondence: hnxhwjj@163.com}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nArticle\n\nReceived: 10 October 2018; Accepted: 3 December 2018; Published: 4 December 2018\n\n\\begin{abstract}\nDispersion-corrected density functional theory (DFT) calculations reveal that the layered electride of dicalcium nitride $\\left(\\mathrm{Ca}_{2} \\mathrm{~N}\\right)$ exhibits stronger interlayer binding interactions but lower interlayer friction behavior than that of traditional layered lubricants weakly bonded by van der Waals (vdW) interactions, such as graphite, $h$-BN, and $\\operatorname{MoS}_{2}$. These results are attributed to the two-dimensional (2D) homogeneous conduction electrons distribution in the middle of the interlayer space of $\\mathrm{Ca}_{2} \\mathrm{~N}$, which yields a smooth sliding barrier and hence ultralow friction behavior. The interesting results obtained in this study have not only broadened the scope of 2D solid lubricants but also enriched the physical understanding of ultralow friction mechanism for 2D systems.\n\\end{abstract}\n\nKeywords: two-dimensional electride; dicalcium nitride $\\left(\\mathrm{Ca}_{2} \\mathrm{~N}\\right)$; ultralow interlayer friction; density functional theory (DFT)\n\n\\section{Introduction}\nThe understanding of friction origins and the search for new effective lubricants have been the focus of tribology studies [1]. Layered bulk materials, such as graphite, hexagonal boron nitride $(h$-BN), and molybdenum disulfide ( $\\left.\\mathrm{MoS}_{2}\\right)$, exhibit excellent lubricating properties and have been used to reduce friction and wear in mechanical systems for a long time [2]. The two-dimensional (2D) strong covalent bonding in plane and the weak van der Waals (vdW) interaction between adjacent layers can effectively explain the lubricating properties of these traditional solid lubricants [2,3]. Surprisingly, these multilayer or even single-layer bulk materials possess excellent frictional characteristics due to their high load carrying capacity and passivating effect, which can serve as protective coating films or nanolubricants and are used in several systems [4-8]. In addition to the homogeneous structure, recent studies have found that heterostructures made by the stacking of different $2 \\mathrm{D}$ atomic layer crystals, such as graphene/ $h$-BN and graphene $/ \\operatorname{MoS}_{2}$, also exhibit unique electronic structures $[9,10]$ and robust interfacial superlubricity $[11,12]$. The weak $\\mathrm{vdW}$ interactions and naturally occurring lattice mismatch between two contacting structures is a key ingredient for this superlubricity phenomenon. All above discussions support that layered materials are not only excellent lubricants from the macroscale to the microscale, but also ideal models for investigations of the mechanism of friction.\n\nElectronic structure calculation based on density functional theory (DFT) has become an effective method to study the tribological properties of solid interfaces [13-19]. The earlier first-principles theory that tried to solve the friction problem was developed by Zhong et al., who studied the stick-slip motion of a single Pd atom over graphite [13]. The model assumes that the potential energy is completely dissipated, but the dissipating process is not considered. Therefore, the maximum-friction model only can obtain major static frictional parameters, such as the maximal potential barrier, friction force, and coefficient of friction (COF). Wolloch et al. further presented a quasistatic model to obtain an approximation of nanofriction based on DFT [14]. In their model, energy dissipation is considered by atomic relaxations. Zilibotti et al. provided a method to calculate the ideal interfacial shear strength by constructing the potential energy surface (PES) that describes the variation of the adhesion energy between two surfaces in contact as a function of their relative lateral position [15]. Recently, Restuccia et al. released a computational protocol to calculate the intrinsic tribological properties of a solid interface from first principles [16], and the high-throughput ab initio approach can be employed to easily and effectively calculate friction. Based on these models, DFT calculations have achieved great progress in friction research of solid materials. Cahangirov et al. determined the frictional figures of merit for a pair of layered honeycomb nanostructures by carrying out ab initio calculations [17]. They explained the ultralow interlayer friction in the view of critical stiffness. Gao et al. investigated the interlayer sliding potential of multilayer $h$-BN and graphene. They found that interlayer sliding constraints can be employed to tune the contribution of electrostatic interactions and dispersive forces to the sliding energy profile [18]. Reguzzoni et al. investigated the microscopic origin of the increase of friction under load by DFT calculations [19]. They found that pressure-induced charge transfer from the interlayer region toward the near-layer regions is responsible for the increase of friction. More recently, Wolloch et al. constructed a connection between the intrinsic tribological properties and the electronic properties of a solid interface [20]. They showed that the adhesion and frictional forces are dictated by the charge redistribution occurring due to the relative displacements of the two surfaces in contact. All of the abovementioned research works indicated that the electronic structure is a decisive factor in friction, and that DFT calculation can effectively reveal the frictional mechanism.\n\nRecent studies reported a new type of 2D-layered material of dicalcium nitride $\\left(\\mathrm{Ca}_{2} \\mathrm{~N}\\right)$, which has a hexagonal layered structure in the $R \\overline{3} m$ space group with high $c / a$ ratio, where $a$ and $c$ are in-plane and out-of-plane unit cell dimensions, respectively [21-26]. The layered unit (Ca-N-Ca) is closely packed, and adjacent units have a large separation of about $4 \\AA$ (Figure 1a). Electronic structure calculations show that $\\mathrm{Ca}_{2} \\mathrm{~N}$ is a kind of $2 \\mathrm{D}$ electride with a formula of $\\left[\\mathrm{Ca}_{2} \\mathrm{~N}^{+} \\cdot \\mathrm{e}^{-}\\right.$, in which the $\\left[\\mathrm{Ca}_{2} \\mathrm{~N}\\right]^{+}$unit acts as a positively charged ionic slab and the residual electrons trapped in the interlayer space serve as anions [23,24]. Therefore, $\\mathrm{Ca}_{2} \\mathrm{~N}$ can be regarded as a crystalline structure combined by the Coulomb force between $\\left[\\mathrm{Ca}_{2} \\mathrm{~N}^{+}\\right.$and $\\mathrm{e}^{-}$. Experimental and theoretical investigations further found that $\\mathrm{Ca}_{2} \\mathrm{~N}$ exhibits excellent $2 \\mathrm{D}$ transport characteristics with a high electron mobility (520 $\\left.\\mathrm{cm}^{2} \\mathrm{~V}^{-1} \\mathrm{~S}^{-1}\\right)$ and long mean scattering time (0.6 picoseconds) with a mean free path of $0.12$ micrometers [23]. The delocalized homogeneous electrons in the 2D interlayer space are responsible for the excellent transport characteristics, which mainly conduct through the 2D space instead of the $\\left[\\mathrm{Ca}_{2} \\mathrm{~N}\\right]^{+}$layer $[23,24]$. Lee et al. also calculated the mechanical properties of the structure. They found that the in-plane stiffness is sufficient to support a $\\mathrm{Ca}_{2} \\mathrm{~N}$ monolayer and thus proposed the possibility of obtaining a $\\mathrm{Ca}_{2} \\mathrm{~N}$ monolayer via mechanical exfoliation [24]. Zhao et al. and Guan et al. further investigated the electronic and phononic structures of monolayer and few-layer $\\mathrm{Ca}_{2} \\mathrm{~N}$, respectively [25,26]. They confirmed that the monolayer and few-layer $\\mathrm{Ca}_{2} \\mathrm{~N}$ samples are stable and have great potential in nanotechnology. It is well known that for a layered structure, larger interlayer distance and high in-plane stiffness are the basic requirements for a 2D solid lubricant $[27,28]$. Considering that $\\mathrm{Ca}_{2} \\mathrm{~N}$ possesses layered geometry, in-plane mechanical properties, and interlayer distance similar to those of the traditional layered lubricant graphite, excellent friction behaviors are expected. However, the interlayer binding styles are dramatically different for the two kinds of layered materials. Therefore, the special interlayer friction mechanisms of $\\mathrm{Ca}_{2} \\mathrm{~N}$ need to be revealed. However, to our knowledge, there is no experimental or theoretical investigation on the friction properties of $\\mathrm{Ca}_{2} \\mathrm{~N}$ and other alkaline earth subnitrides, such as $\\mathrm{Sr}_{2} \\mathrm{~N}$ and $\\mathrm{Ba}_{2} \\mathrm{~N}$. Thus, elucidating the tribology properties is important to extend $\\mathrm{Ca}_{2} \\mathrm{~N}$ applications.\n\nIn the study, we investigated the interlayer friction properties between two layers of $\\mathrm{Ca}_{2} \\mathrm{~N}$ by applying first-principles calculations. An interesting finding was that the ionic crystal $\\mathrm{Ca}_{2} \\mathrm{~N}$ has comparable friction force with that of the traditional layered lubricants bonded by $\\mathrm{vdW}$ interactions. The results will contribute to understanding atomic scale friction and extending the range of 2D lubricants.\n\n\\section{Methodology}\nDensity functional theory (DFT) calculations were implemented in the Vienna ab initio Simulation Package (VASP) [29]. The projector-augmented-wave (PAW) method was utilized to model the core electrons and the generalized gradient approximation (GGA), while the Perdew-Burke-Ernzerhof (PBE) functional was employed to describe the exchange and correlation effect [30,31]. The DFT-D2 method was applied to describe the vdW interactions [32], and the default scaling parameter of $0.75$ was adopted. A plane-wave cutoff of $600 \\mathrm{eV}$ and Monkhorst-Pack grids of $25 \\times 25 \\times 1$ were used for Brillouin-zone integration [33]. A $(1 \\times 1)$ surface cell separated by at least a 15-Å vacuum was used to simulate the sliding model. Total energy was converged up to $10^{-5} \\mathrm{eV}$ for electronic relaxations. For calculating the band structures, we used Gaussian smearing in combination with a small width of $0.05 \\mathrm{eV}$, and the integration path in the first Brillouin zone was along $\\Gamma(0,0,0)-\\mathrm{K}(2 / 3$, $1 / 3,0)-\\mathrm{M}(1 / 2,0,0)-\\Gamma(0,0,0)$. All internal coordinates were relaxed until the Hellmann-Feynman forces were less than $0.01 \\mathrm{eV} / \\AA$ to optimize geometries. The method of Zhong et al. [13], which has successfully calculated several systems, was employed to calculate the interlayer friction properties of the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system [34-37]. It should be noted that the method only evaluated the maximum energy barrier caused by variations of the chemical bond strength and the work against an external force along the sliding path, but did not consider the energy dissipation. Therefore, the friction in the study belongs to static friction.\n\n\\section{Results and Discussion}\nThe calculated in-plane lattice constants and layer thickness of $\\mathrm{Ca}_{2} \\mathrm{~N}$ monolayer are $3.566$ and $2.515 \\AA$, respectively. These values are very close to the experimental values of the corresponding bulk structure ( $3.66$ and $2.51 \\AA$ ) and the other calculation results of the monolayer $\\mathrm{Ca}_{2} \\mathrm{~N}$ ( $3.562$ and $2.516 \\AA$ A) [21-26]. Based on the optimized structure, two sheets of $\\mathrm{Ca}_{2} \\mathrm{~N}$ monolayer were placed to slide against each other along two high symmetrical paths to model the friction process, as shown in Figure 1 . Along path $\\mathrm{I}$, the two sheets of $\\mathrm{Ca}_{2} \\mathrm{~N}$ alternately encountered the top and bridge stackings. Meanwhile, the top, hollow, and bridge stackings appeared on path II periodically. Therefore, the top, hollow, and bridge stackings are the three key configurations for friction calculations.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_efbe854b8da1545fbe9bg-04_296_952_382_1672}\n\nFigure 1. Sliding model. (a,b) Side and top views of the initial configuration, where $r$ and $d$ represent the interlayer distance and interfacial space, respectively. As all interfacial Ca atoms from two layers face each other, the configuration was defined as top stacking. The black dotted arrow shows the sliding path of the upper film. (c,e) Final configurations of the two paths, defined as bridge stackings. (d) Another high-symmetric configuration on sliding path II, defined as hollow stacking. The sliding process was modeled by moving the upper layer from the top to the bridge stackings in seven steps with the step lengths of $0.297$ and $0.515 \\AA$ for paths I and II, respectively. To clearly exhibit the stacking characters, the atoms in different layers are labeled with different sizes.\n\nAs friction is closely related to the interfacial interaction, we firstly calculated the interaction energy (IE) of the sliding system. IE is defined as the energy of the combined system minus the energy sum of the component films, and was calculated by using the formula $I E=E^{A B}(r)-E^{A}-E^{B}$, where $E^{A B}(r)$ is the total energy of the two contacting films at the distance of $r$ and $E^{A}\\left(E^{B}\\right)$ is the energy of the separate film. The vertical distance between the bottom and top Ca layers is defined as $r$, as shown in Figure 1a. The load effect was applied by setting different $r$ values. For each interlayer distance $r$, only the Ca atoms in the bottom layer of the lower slab and the topmost layer of the upper slab were kept frozen, whereas all other atoms were relaxed in all of our calculations. According to the definition of IE, a more negative IE indicates better stability. The calculated IEs as a function of $r$ for top, bridge, and hollow stackings are shown in Figure 2a. For comparison, the IEs for the bilayer graphene system are also presented in Figure 2b. Comparisons of IEs in different stackings reveal that both systems have the weakest interaction at the top stacking, followed by the bridge one, while the hollow stacking has the strongest values. This behavior occurs because interfacial Ca atoms exhibit large spaces for movement and avoid repulsive forces at both the hollow and bridge stackings. These results indicate that the hollow stacking has the largest binding energy (the absolute value of the minimum IE) and is the most stable stacking configuration. To reveal the difference of interlayer binding style between the two systems, we compared the IEs for the two systems. The most striking difference between the two systems is that the IEs for the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system (approximately $1 \\mathrm{~J} / \\mathrm{m}^{2}$ ) is about five times larger than that of the graphene systems (typical physical adsorption of about $0.1 \\mathrm{~J} / \\mathrm{m}^{2}$ ). Therefore, the chemical interlayer bonding character of the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system is dramatically different than the vdW interaction within the graphite system [34]. We next considered the relative difference of IEs between the top and hollow stackings for the two systems. The IE difference at the equilibrium adsorption position is about $0.063 \\mathrm{~J} / \\mathrm{m}^{2}$ for $\\mathrm{Ca}_{2} \\mathrm{~N}$ system, which is comparable with that of the graphene system (about $0.058 \\mathrm{~J} / \\mathrm{m}^{2}$ ). We also examined the influence of $\\mathrm{vdW}$ on the IE in $\\mathrm{Ca}_{2} \\mathrm{~N}$, and found that the IE difference is virtually unchanged if $\\mathrm{PBE}$ is used without $\\mathrm{vdW}$ corrections. These results illustrate that although the two systems have different bonding energies, the difference of binding energy among different stackings is comparable. Interfacial space $d$ (as shown in Figure 1a) is another important value for friction calculations, and the calculated values are $3.57 \\AA$ and $3.25 \\AA$ for $\\mathrm{Ca}_{2} \\mathrm{~N}$ and graphene, respectively. From the comparisons we can see that the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system has a larger interfacial space than that of the graphene system. Therefore, excellent friction behaviors are expected for the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system in the view of its IE and interfacial space.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_efbe854b8da1545fbe9bg-05_481_1141_543_1513}\n\nFigure 2. Interaction energy (IE) as a function of interfacial space $d$ between two sheets of (a) $\\mathrm{Ca}_{2} \\mathrm{~N}$ and (b) graphene, respectively. It should be noticed that the two parts have different y-axis scales.\n\nTo gain an overall view of friction, we also constructed the static PES by calculating the interlayer IE for different relative lateral positions of the two films at the equilibrium distance [14], as shown in Figure 3. From the figure we can see that the two systems exhibit a similar pattern of PES, with the maximum at the top and minimum at the hollow sites. The maximum is about $40 \\mathrm{meV}$ for the Ca $2 \\mathrm{~N}$ system, which is $1.6$ times larger than that of the graphene system ( $26 \\mathrm{meV})$. However, the length of the sliding path and cell area of the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system are $1.5$ and 2 times larger than those of the graphene system, respectively. Therefore, the difference of the lateral force $\\left(f_{\\alpha}=-\\nabla_{\\alpha} v\\right.$ experienced by a surface unit cell during its displacement along the direction $\\alpha$ ) between the two systems should be subtler. We also presented the lowest energy sliding path, as shown in Figure 3 a, and the minimum barrier is only about $4 \\mathrm{meV}$, which is comparable to that of the graphene system (about $3.2 \\mathrm{meV}$ ). This indicates that $\\mathrm{Ca}_{2} \\mathrm{~N}$ could be considered a candidate for lubricant materials.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_efbe854b8da1545fbe9bg-05_1828_2404_400_1666}\n\nFigure 3. Potential energy surface (PES) for the (a) Ca2N and (b) graphene systems. T, B, H are the top, bridge, and hollow sites indicated in Figure 1. We also show the two chosen paths and the minimum energy sliding path.\n\nWe next investigated the detailed frictional properties along the two chosen directions by Zhong's method [13], and more details of the calculating process can be found in our previous works [34-36]. Figure 4 exhibits the potential barrier $V$ along the sliding path, in which the hollow stacking at path I and the bridge stacking at path II are set to $0 \\mathrm{eV}$. From the figure, one can see that the relative $V$ curves periodically fluctuate along the sliding directions, with a maximum at the top stacking and a minimum at the bridge and hollow stackings for paths I and II, respectively. We also considered the load effect, which can be obtained by differentiating the fitted interaction energy function with respect to the interlayer distance [34]. It was found that $V$ increases and its curve becomes steeper with increasing loads, indicating that relative sliding is difficult to achieve under high loads. Another important characteristic is that the disparity of the potential barrier amplitude between two paths is not obvious, suggesting that $\\mathrm{Ca}_{2} \\mathrm{~N}$ has an isotropous mean interlayer friction behavior.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_efbe854b8da1545fbe9bg-06_758_1412_607_1461}\n\\end{center}\n\nFigure 4. Potential barrier $V$ curves along the sliding direction under different loads. (a,b) $V$ curves of paths I and II, respectively.\n\nThe mean friction force $<f>$ was calculated by dividing the maximum potential barrier by the distance between the two nearest neighbor maximum energies in the sliding direction, as shown in Figure 5. First of all, the curves of $\\langle f\\rangle$ for both paths are almost coincident throughout the calculated normal forces, which further illustrates that the interfacial friction is isotropous for the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system. By comparison, we also calculated the interfacial $\\langle f\\rangle$ of the bilayer graphene system. From the comparisons of $\\langle f\\rangle$ in Figure 5, it can be seen that the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system has lower friction than the graphene system for all chosen loads, which indicates that layered materials with stronger binding can have lower friction, and that friction is closely related to the IEs difference for different stackings but not the absolute IE. It should be noticed that Zhong's method can successfully deal with the vdW binding layered materials, but it underestimates frictional forces in metallic systems [14]. It is doubtful whether this method is suitable for the calculation of larger adsorption layered systems. However, as the constructed PBS of the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system has the same tendency as the friction calculation by Zhong's method, the calculated results here are reliable. It also should be emphasized that, although these results reveal static friction at $0 \\mathrm{~K}$, and the effects of velocity and temperature must affect the quantitative estimate, such effects will not break the significant ground state mechanism of atomic-level friction. Therefore, bilayer or multilayer $\\mathrm{Ca}_{2} \\mathrm{~N}$ systems may be promising candidates for nanolubricant or coating materials. Additionally, first-principles calculations have also been employed to predict two other 2D electride alkaline earth subnitrides, $\\mathrm{Sr}_{2} \\mathrm{~N}$ and $\\mathrm{Ba}_{2} \\mathrm{~N}[21,22]$, and it was found that they are stable down to monolayer thickness [23]. As these materials have structures similar to that of $\\mathrm{Ca}_{2} \\mathrm{~N}$, we can infer that this class of materials has excellent friction properties.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_efbe854b8da1545fbe9bg-07_301_909_617_1439}\n\\end{center}\n\nFigure 5. Comparison of mean friction force $\\langle f\\rangle$ between $\\mathrm{Ca}_{2} \\mathrm{~N}$ and graphene systems.\n\nThe vdW interlayer interaction is the main mechanism of traditional solid lubricants. Due to the different interlayer bonding styles, the ultralow friction mechanism of the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system may be fundamentally different from that of the vdW layered lubricants. To reveal the ultralow friction mechanism, we calculated the electronic structures of the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system, as shown in Figure 6 . The monolayer $\\mathrm{Ca}_{2} \\mathrm{~N}$ is metallic with two bands crossing the Fermi level (Figure 6a), and the corresponding partial electron density shows that the two bands are from the 2D-confined electron layers residing at the two sides of $\\left[\\mathrm{Ca}_{2} \\mathrm{NJ}^{+}\\right.$(Figure $6 \\mathrm{~d}$ ). However, when the two sheets are joined, an additional band induced by the coupling effect between the two layers appears, which is mainly from the 2D electron layers confined in the interlayer regions (Figure $6 \\mathrm{~b}$ ). As the additional band also crosses the Fermi level, the electrons confined in the interlayer regions are loosely bound conduction electrons, suggesting that the delocalized 2D charge is distributed uniformly in the interlayer space of the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system (Figure $6 \\mathrm{~d}$ ), which yields similar IEs at different stackings and smooth $V$. To obtain more information about charge distribution, we plotted the local density of states (LDOS) for monolayer and bilayer $\\mathrm{Ca}_{2} \\mathrm{~N}$ samples. Compared to the monolayer system, there is a clear peak at the Fermi level in the bilayer system, which comes from the two Ca atoms at the interface (B2 and B3 in Figure 6e). These results indicate that electrons confined in the interlayer regions are loosely bound conduction electrons, which is consistent with the above charge redistribution. Therefore, uniform interfacial charge distribution is the main cause of the ultralow friction mechanism of the layered $\\mathrm{Ca}_{2} \\mathrm{~N}$. For a larger load, the additional band becomes flat and drops below the Fermi level (Figure $6 c, \\mathrm{f}$ ). These results indicate that the confined effect becomes stronger and the homogeneity of the interfacial charge distribution decreases with the increase of the load, which can explain the larger $V$ and friction under the larger load. It should be noted that our results are in contrast to the findings of Wolloch et al., as larger adhesion corresponds to larger interlayer friction [20]. This controversy may be attributed to the unique geometric and electronic structures of the $\\mathrm{Ca}_{2} \\mathrm{~N}$ system. The large interfacial space, strong adsorption, and unique 2D uniform interfacial charge distribution make it dramatically different from any other material in their calculations [20]. (a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_efbe854b8da1545fbe9bg-08_344_764_320_1142}\n\\end{center}\n\n(d)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_efbe854b8da1545fbe9bg-08_784_1089_343_645}\n\\end{center}\n\n(e)\n\n(e) $B 4$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_efbe854b8da1545fbe9bg-08_805_879_657_874}\n\\end{center}\n\n(f)\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_efbe854b8da1545fbe9bg-08_782_1084_660_1138}\n\n(g)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_efbe854b8da1545fbe9bg-08_357_1088_1142_1742}\n\\end{center}\n\nFigure 6. Band structures of (a) monolayer $\\mathrm{Ca}_{2} \\mathrm{~N}$ and (b,c) bilayer $\\mathrm{Ca}_{2} \\mathrm{~N}$ under the loads of 0 and $3 \\mathrm{nN}$, respectively. Fermi energy is set at zero. (d) Partial electron density isosurface (with the threshold value of $\\left.0.002 / \\AA^{3}\\right)$ for all states within the energy range $|\\mathrm{E}-\\mathrm{Ef}|<0.05 \\mathrm{eV}$ of $(\\mathrm{a})$; (e,f) for the red bands of (b) and (c), respectively. (g) Local density of states LDOS for monolayer (top panel) and bilayer (bottom panel) $\\mathrm{Ca}_{2} \\mathrm{~N}$. The corresponding atoms are labeled in (d) and (e).\n\n\\section{Conclusions}\nIn summary, we have investigated the interfacial static friction properties of layered electride $\\mathrm{Ca}_{2} \\mathrm{~N}$ using the vdW-corrected first-principles approach within DFT. Our calculations reveal that the system exhibits strong interlayer Coulomb attractive forces, but an ultralow friction behavior. The findings are fundamentally different from conventional layered lubricant materials, such as graphite, $h$-BN, and $\\mathrm{MoS}_{2}$, where the interlayer bonding is decided by the relative weak $\\mathrm{vdW}$ interactions. We used electronic structures to explain the ultralow interfacial friction of $\\mathrm{Ca}_{2} \\mathrm{~N}$. The uniform interfacial charge distribution brings about a small energy barrier along the sliding path and the easily cleaved nature of $\\mathrm{Ca}_{2} \\mathrm{~N}$. Because of the large interlayer adsorption, $\\mathrm{Ca}_{2} \\mathrm{~N}$ will not fall off easily when it is used as lubricant, so it can be considered as a kind of green, anti-wear lubrication material. Our results thus identify a class of promising 2D nanolubricants and enrich the physical understanding of friction mechanisms.\n\nAuthor Contributions: Conceptualization, J.W., L.F. and L.Y; Formal analysis, L.L. and P.G.; Funding acquisition, J.W.; Investigation, Z.S., B.Z. and M.L.; Project administration, J.W.; Resources, P.G., L.Y. and L.F.; Software, M.L.; Supervision, J.W.; Writing-review \\& editing, J.W. and L.L.\n\nFunding: This work was supported by the National Natural Science Foundation of China (Grant No. U1604131, 11805295), by research team development project of Zhongyuan University of Technology (Grant No. K2018TD003).\n\nAcknowledgments: We thank Professor Yu Jia and Doctor Shouyan Bai for helpful discussions.\n\nConflicts of Interest: The authors declare no conflict of interest.\n\n\\section{References}\n\\begin{enumerate}\n  \\item Urbakh, M.; Meyer, E. The renaissance of friction. Nat. Mater. 2010, 9, 8-10. [CrossRef] [PubMed]\n\n  \\item Deacon, R.F.; Goodman, J.F. Lubrication by lamellar solids. Proc. R Soc. London Ser. A. 1958, $243,464-482$. [CrossRef]\n\n  \\item Dickinson, R.G.; Pauling, L. The crystal structure of molybdenite. J. Am. Chem. Soc. 1923, 45, 1466-1471. [CrossRef] 4. Lee, C.; Li, Q.; Kalb, W.; Liu, X.; Berger, H.; Carpick, R.W.; Hone, J. Frictional characteristics of atomically thin sheets. Science 2010, 328, 76. [CrossRef] [PubMed]\n\n  \\item Berman, D.; Erdemir, A.; Sumant, A.V. Graphene: A new emerging lubricant. Mater. Today 2014, $17,31-42$. [CrossRef]\n\n  \\item Cahangirov, S.; Ciraci, S.; Özçelik, V.O. Superlubricity through graphene multilayers between Ni (111) surfaces. Phys. Rev. B 2013, 87, 1853-1865. [CrossRef]\n\n  \\item Restucciaa, P.; Righia, M.C. Tribochemistry of graphene on iron and its possible role in lubrication of steel. Carbon 2016, 106, 118-124. [CrossRef]\n\n  \\item Chen, S.; Shen, B.; Chen, Y.; Sun, F. Synergistic friction-reducing and anti-wear behaviors of graphene with micro- and nano-crystalline diamond film. Diam. Relat. Mater. 2017, 76, 50-57. [CrossRef]\n\n  \\item Diaz, H.C.; Avila, J.; Chen, C.; Addou, R.; Asensio, M.C.; Batzill, M. Direct observation of interlayer hybridization and dirac relativistic carriers in Graphene/ $\\mathrm{MoS}_{2}$ van der Waals heterostructures. Nano Lett. 2015, 15, 1135-1140. [CrossRef]\n\n  \\item Pierucci, D.; Henck, H.; Avila, J.; Balan, A.; Naylor, C.H.; Patriarche, G.; Dappe, Y.J.; Silly, M.G.; Sirotti, F.; Johnson, A.T.C.; Asensio, M.C.; et al. Band alignment and minigaps in monolayer $\\mathrm{MoS}_{2}$-Graphene van der Waals heterostructures. Nano Lett. 2016, 16, 4054-4061. [CrossRef]\n\n  \\item Leven, I.; Krepel, D.; Shemesh, O.; Hod, O. Robust superlubricity in graphene/h-BN heterojunctions. J. Phys. Chem. Lett 2013, 4, 115-120. [CrossRef] [PubMed]\n\n  \\item Wang, L.; Ma, T.; Hu, Y.; Zheng, Q.; Wang, H.; Luo, J. Superlubricity of two-dimensional fluorographene/ MoS2 heterostructure: A first-principles study. Nanotechnology 2014, 25, 385701. [CrossRef] [PubMed]\n\n  \\item Zhong, W.; Tománek, D. First-principles theory of atomic-scale friction. Phys. Rev. Lett. 1990, 64, $3054-3057$. [CrossRef] [PubMed]\n\n  \\item Wolloch, M.; Feldbauer, G.; Mohn, P.; Redinger, J.; Vernes, A. Ab initio friction forces on the nanoscale: A density functional theory study of fcc $\\mathrm{Cu}$ (111). Phys. Rev. B 2014, 90, 195418. [CrossRef]\n\n  \\item Zilibotti, G.; Righi, M.C. Ab initio calculation of the adhesion and ideal shear strength of planar diamond interfaces with different atomic structure and hydrogen coverage. Langmuir 2011, 27, 6862-6867. [CrossRef]\n\n  \\item Restuccia, P.; Levita, G.; Wolloch, M.; Losi, G.; Fatti, G.; Ferrario, M.; Righi, M.C. Ideal adhesive and shear strengths of solid interfaces: A high throughput ab initio approach. Comput. Mat. Sci. 2018, 154, 517-529. [CrossRef]\n\n  \\item Wolloch, M.; Feldbauer, G.; Mohn, P.; Redinger, J.; Vernes, A. Ab initio friction forces on the nanoscale: A density functional theory study of fcc $\\mathrm{Cu}(111)$. Phys. Rev. Lett. 2012, 180, 126103.\n\n  \\item Reguzzoni, M.; Fasolino, A.; Molinari, E.; Righi, M.C. Potential energy surface for graphene on graphene: Ab initio derivation, analytical description, and microscopic interpretation. Phys. Rev. B 2012, $84,245434$. [CrossRef]\n\n  \\item Gao, W.; Tkatchenko, A. Sliding mechanisms in multilayered hexagonal boron nitride and graphene: The effects of directionality, thickness, and sliding sonstraints. Phys. Rev. Lett. 2015, 114, 096101. [CrossRef]\n\n  \\item Wolloch, M.; Levita, G.; Restuccia, P.; Righi, M.C. Interfacial charge density and its connection to adhesion and frictional forces. Phys. Rev. Lett. 2018, 121, 026804. [CrossRef] [PubMed]\n\n  \\item Reckeweg, O.; DiSalvo, F.J. Alkaline earth metal nitride compounds with the composition $\\mathrm{M}_{2} \\mathrm{~N}_{X}\\left(\\mathrm{M}_{\\mathrm{X}}=\\mathrm{Ca}, \\mathrm{Sr}\\right.$, Ba; X=H, Cl or Br). Solid State Sci. 2002, 4, 575-584. [CrossRef]\n\n  \\item Gregory, D.H.; Bowman, A.; Baker, C.F.; Weston, D.P. Dicalcium nitride, $\\mathrm{Ca}_{2} \\mathrm{~N}$-a $2 \\mathrm{D}$ \"excess electron\" compound; synthetic routes and crystal chemistry. J. Mater. Chem. 2000, 10, 1635-1641. [CrossRef]\n\n  \\item Lee, K.; Kim, S.; Toda, Y.; Matsuishi, S.; Hosono, H. Dicalciumnitride as a two-dimensional electride with an anionic electron layer. Nature 2013, 494,336-340. [CrossRef]\n\n  \\item Allan, G.; Backer, M.G.D.; Lannoo, M.; Lefebvre, I. Why do the electrons play the role of anions in the electrides? Europhys. Lett. 1990, 11, 49-53. [CrossRef]\n\n  \\item Guan, S.; Yang, S.A.; Zhu, L.; Hu, J.; Yao, Y. Electronic, dielectric, and plasmonic properties of two-dimensional electride materials $\\mathrm{X}_{2} \\mathrm{~N}$ (X=Ca, Sr): A first-principles study. Sci. Rep. 2015, 5, 12285. [CrossRef]\n\n  \\item Zhao, S.; Li, Z.; Yang, J. Obtaining two-dimensional electron gas in free space without resorting to electron doping: An electride based design. J. Am. Chem. Soc. 2014, 136, 13313-13318. [CrossRef]\n\n  \\item Guo, W.; Yin, J.; Qiu, H.; Guo, Y.; Wu, H.; Xue, M. Friction of low-dimensional nanomaterial systems. Friction 2014, 2, 209-225. [CrossRef] 28. Berman, D.; Erdemir, A.; Sumant, A.V. Approaches for achieving superlubricity in two-dimensional materials. ACS Nano 2018, 12, 2122-2137. [CrossRef] [PubMed]\n\n  \\item Kresse, G.; Furthmüller, J. Efficient iterative schemes for ab initio total-energy calculations using a plane-wave basis set. Phys. Rev. B 1996, 54, 11169-11186. [CrossRef]\n\n  \\item Blöchl, P.E. Projector augmented-wave method. Phys. Rev. B 1994, 50, 17953. [CrossRef]\n\n  \\item Perdew, J.P.; Burke, K.; Ernzerhof, M. Generalized gradient approximation made simple. Phys. Rev. Lett. 1996, 77, 3865. [CrossRef] [PubMed]\n\n  \\item Grimme, S. Semiempirical GGA-type density functional constructed with a long-range dispersion correction. J. Comput. Chem. 2006, 27, 1787-1799. [CrossRef]\n\n  \\item Monkhorst, H.J.; Pack, J.D. Special points for Brillouin-zone integrations. Phys. Rev. B 1976, 13, 5188-5192. [CrossRef]\n\n  \\item Wang, J.; Wang, F.; Li, J.; Wang, S.; Song, Y.; Sun, Q.; Jia, Y. Theoretical study of superlow friction between two single-side-hydrogenated graphene sheets. Tribol. Lett. 2012, 48, 255-261. [CrossRef]\n\n  \\item Wang, J.; Wang, F.; Li, J.; Sun, Q.; Yuan, P.; Jia, Y. Comparative study of friction properties for hydrogenand fluorine-modified diamond surfaces: A first-principles investigation. Surf. Sci. 2013, 608, 74-79. [CrossRef]\n\n  \\item Wang, J.; Li, M.; Zhang, X.; Cai, X.; Yang, L.; Li, J.; Jia, Y. An atomic scale study of ultralow friction between phosphorus-doped nanocrystalline diamond film. Tribol. Int. 2015, 86, 85–90. [CrossRef]\n\n  \\item Neitola, R.; Pakkanen, T.A. Ab initio studies on nanoscale friction between fluorinated diamond surface: Effect of model size and level of theory. J. Phys. Chem. B 2005, 110, 16660-16665. [CrossRef]\n\n\\end{enumerate}\n\n(C) 2018 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (http:/ / \\href{http://creativecommons.org/licenses/by/4.0/}{creativecommons.org/licenses/by/4.0/}).\n\n\n\\end{document}", "record_id": "2023_09_22_efbe854b8da1545fbe9bg"}