{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Author Manuscript }\n\n\n\\author{National Institute of Standards and Technology • U.S. Department of Commerce}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nAccepted for publication in a peer-reviewed journal\n\nPublished in final edited form as:\n\nAdv Funct Mater. 2017 January ; 3(1): . doi:10.1002/aelm.201600294.\n\n\\section{The influence of isomer purity on trap states and performance of organic thin-film transistors}\n\\section{Dr. Peter J. Diemer,}\nDepartment of Physics, Wake Forest University, Winston-Salem, NC 27109, USA\n\n\\section{Jacori Hayes,}\nDepartment of Physics, Wake Forest University, Winston-Salem, NC 27109, USA\n\n\\section{Evan Welchman,}\nDepartment of Physics, Wake Forest University, Winston-Salem, NC 27109, USA\n\n\\section{Rawad Hallani,}\nDepartment of Chemistry, University of Kentucky, Lexington, KY 40506, USA\n\n\\section{Dr. Sujitra J. Pookpanratana,}\nEngineering Physics Division, National Institute of Standards and Technology, Gaithersburg, MD 20899, USA\n\nDr. Christina A. Hacker,\n\nEngineering Physics Division, National Institute of Standards and Technology, Gaithersburg, MD 20899, USA\n\nDr. Curt A. Richter,\n\nEngineering Physics Division, National Institute of Standards and Technology, Gaithersburg, MD 20899, USA\n\nJohn E. Anthony [Prof.],\n\nDepartment of Chemistry, University of Kentucky, Lexington, KY 40506, USA\n\nTimo Thonhauser [Prof.], and\n\nDepartment of Physics, Wake Forest University, Winston-Salem, NC 27109, USA\n\nDepartment of Chemistry, Massachusetts Institute of Technology, Cambridge, MA 02139, USA\n\n\\section{Oana D. Jurchescu [Prof.]}\nDepartment of Physics, Wake Forest University, Winston-Salem, NC 27109, USA\n\n\\section{Abstract}\nOrganic field-effect transistor (OFET) performance is dictated by its composition and geometry, as well as the quality of the organic semiconductor (OSC) film, which strongly depends on purity and microstructure. When present, impurities and defects give rise to trap states in the bandgap of the OSC, lowering device performance. Here, 2,8-difluoro-5,11-bis(triethylsilylethynyl)-\n\nanthradithiophene is used as a model system to study the mechanism responsible for performance degradation in OFETs due to isomer coexistence. The density of trapping states is evaluated through temperature dependent current-voltage measurements, and it is discovered that OFETs containing a mixture of $s y n$ - and anti-isomers exhibit a discrete trapping state detected as a peak located at $\\sim 0.4 \\mathrm{eV}$ above the valence-band edge, which is absent in the samples fabricated on single-isomer films. Ultraviolet photoelectron spectroscopy measurements and density functional theory calculations do not point to a significant difference in electronic band structure between individual isomers. Instead, it is proposed that the dipole moment of the syn-isomer present in the host crystal of the anti-isomer locally polarizes the neighboring molecules, inducing energetic disorder. The isomers can be separated by applying gentle mechanical vibrations during film crystallization, as confirmed by the suppression of the peak and improvement in device performance.\n\n\\section{Graphical abstract}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a591ebf98377fd0ebe2g-02_858_1332_674_1451}\n\\end{center}\n\nDensity of states calculations on organic field-effect transistors of the mix-isomer semiconductor, 2,8-difluoro-5,11-bis(triethylsilylethynyl) anthradithiophene reveal a discrete trapping state that is not present in either of the syn- or anti-isomer devices. The presence of both isomers in the same electrically active layer introduces this energetic state and can be suppressed by improved phase separation through vibration-assisted crystallization.\n\n\\section{Keywords}\norganic thin-film transistors; organic semiconductors; charge trapping; mobility; isomer\n\n\\section{Introduction}\nOrganic semiconducting materials have emerged as an increasingly desirable and viable component of electronic devices, expanding the technologies towards applications that are impossible or not economically viable using current technologies. Due to their favorable processing conditions, which typically include moderate temperatures and ambient pressure, these compounds have applications that are not possible with their inorganic counterparts, namely, placement on flexible substrates. Many organic semiconductors are soluble in common solvents and can be deposited by a variety of solution fabrication techniques such as ink-jet printing, drop-casting, spin-coating, doctor-blading, and more. ${ }^{[1-4]}$ These have the benefit of lower fabrication costs and faster deposition rates when compared to vapor deposition methods.\n\nThe field has witnessed significant improvements over the past decades as the result of advances in material design and the development of novel processing techniques that promote the formation of high-quality films. Currently, charge carrier mobility exceeds the value of $10 \\mathrm{~cm}^{2} \\mathrm{~V}^{-1} \\mathrm{~s}^{-1}$ in several organic semiconductors. ${ }^{[5-7]}$ This performance, however, remains scarce since impurities and defects present in organic semiconductors promote the formation of electronic gap states, which give rise to trapping sites for the free charge carriers, therefore reducing the electrical conductivity. The microstructure of the thin-film, which incorporates the details of defects ranging from macroscopic domains and grainboundaries to the degree of order at the molecular level, was recognized to critically impact charge transport in these materials. Therefore, significant research effort is dedicated towards controlling the microstructure of the film to reduce the defect density and improve device performance. ${ }^{[8,9]}$ Ingenious processing methods take advantage of the weak van der Waals intermolecular interactions common to organic semiconductors, which allows for the microstructure to be altered by external factors such as the deposition method, the speed of crystallization, etc. Modifying the details of film deposition has become a versatile tool for improving device performance, with impressive results being achieved. ${ }^{[10-14]}$ Quite a bit of work is dedicated to identifying and minimizing the effect of impurities on the electrical properties of organic semiconductors. ${ }^{[15-17]}$ With the exception of a few reports, however, the impact of the isomer structure and/or co-existence has been mostly unexplored. In anthradithiophene (ADT), for example, organic field-effect transistor (OFET) devices fabricated on the anti-isomer surpassed those based on $s y n$-isomer by more than one order of magnitude in measured mobility. ${ }^{[18]} \\mathrm{A}$ more recent study focused on ADT derivatives also reported a higher field-effect mobility, $\\mu$, in the pure anti-isomer, and found that both types of pure isomer devices outperformed the mix-isomer sample. ${ }^{[19]}$ That publication reports $\\mu$ values of 2.0, 2.2, and $4.7 \\mathrm{~cm}^{2} \\mathrm{~V}^{-1} \\mathrm{~s}^{-1}$ for OFET devices of the mix-, syn-, and anti-isomers, of 2,8-difluoro-5,11-bis(triethylsilylethynyl) anthradithiophene (diF-TES ADT) and 2.3, 2.7, and $6.2 \\mathrm{~cm}^{2} \\mathrm{~V}^{-1} \\mathrm{~s}$-1 in 2,8-difluoro-5,11-bis(triethylgermylethynyl) anthradithiophene (diFTEG ADT). In addition, research into other $1 \\mathrm{D}$ and $2 \\mathrm{D}$ aromatic molecules, as well as polymers of isomeric monomers, indicate a general disparity in performance between isomers of the same compound. ${ }^{[20-23]}$ These differences can be as large as one or two orders of magnitude in mobility, and often energetic shifts are observed in the highest occupied molecular orbital (HOMO) and lowest unoccupied molecular orbital (LUMO). This is the case in the work by Osaka et al., focused on polymers based on four isomers of naphthodithiophenes (NDTs) and in a study by Brusso et al. based on 2D tetrathienoanthracene-based isomeric semiconductors. ${ }^{[21,23]}$ Geerts and collaborators have found impressive charge carrier mobility modulation in didodecyl[1]benzothieno[3,2-b] [1]benzothiophene isomers as a result of variations in the crystal and electronic structures. ${ }^{[24]}$ Theoretical work done by Thorley and Risko propose that a \"disordermer\" is present in the $s y n$-isomer of benzodithiophene and this is absent in the more ordered antiisomer. ${ }^{[25]}$\n\nIn this study, we show for the first time direct evidence that the lowering of performance in mix-isomer samples originates from the presence of additional gap states introduced by the isomer co-existence. By combining OFET electrical measurements, density of states (DOS) analysis, ultraviolet photoemission spectroscopy (UPS), and density functional theory (DFT) calculations, we identify the nature of and quantify the gap state introduced by the guest isomer in the lattice of the host isomer. We further eliminate this state by applying gentle vibrations during film crystallization, which allows for the two phases to phase separate while still in solution.\n\n\\section{Results and Discussion}\nWe have designed a set of experiments that allowed us to correlate the OFET device performance with the composition of the organic semiconductor film at the interface with the dielectric layer. The studied OFET devices utilized either one of the pure isomers or a $40 / 60$ mixture of the $s y n$ - and anti-isomers of the semiconductor diF-TES ADT (the chemical structure of the organic semiconductor is shown as an inset in Figure $1 \\mathrm{~d}-\\mathrm{f}$ ), which was deposited using the solvent-assisted crystallization (SAC) method. ${ }^{\\text {[26] }}$ The details on the synthesis of the pure isomers were reported elsewhere. ${ }^{[19]}$ Analysis of the OFET's electrical characteristics (see Figure 1) reveals a trend in performance that agrees well with previous reports. Here we plot the evolution of the drain current $I_{D}$ with the gate-source voltage $V_{G S}$ in the saturation regime (drain-source voltage $V_{D S}=-40 \\mathrm{~V}$ ) for a representative device made using the isomer mixture (Figure 1a), the $s y n$-isomer (Figure $1 \\mathrm{~b}$ ) and the anti-isomer (Figure 1c). The mobilities $\\mu$ extracted from these graphs are $0.15 \\mathrm{~cm}^{2} \\mathrm{~V}^{-1} \\mathrm{~s}^{-1}, 0.24$ $\\mathrm{cm}^{2} \\mathrm{~V}^{-1} \\mathrm{~s}^{-1}$, and $0.68 \\mathrm{~cm}^{2} \\mathrm{~V}^{-1} \\mathrm{~s}^{-1}$, for the devices of the $m i x^{-}$, syn-, and anti-isomers, respectively. We note that these mobilities are lower than those reported on the same type of organic semiconductor layer, but with a top gate Cytop dielectric. [19] This is due to the greater interfacial trap densities and larger contact resistance characteristic to the bottomgate, bottom-contact OFETs on the $\\mathrm{SiO}_{2}$ dielectric. ${ }^{[27]}$ Our choice of dielectric and device geometry, however, was strategic in order to inflate the overall trap density for better detection sensitivity. Figures $1 \\mathrm{~d}-\\mathrm{f}$ show the transport characteristics for the same devices.\n\nThe subthreshold swing, $S$, and interfacial trap density, $N_{i t}$, provide information about the trap density at the semiconductor/dielectric interface. The subthreshold swing indicates how quickly a device transitions from the off to on state while the $N_{i t}$, which is directly proportional to $S$, relates a slower turn-on to a higher trap density, according to the equation\n\n\\[\nN_{\\mathrm{it}}=\\frac{C_{i}}{e^{2}}\\left(\\frac{\\mathrm{S} \\mathrm{e}}{k_{B} T \\ln (10)}-1\\right)\n\\]\n\nwhere $C_{i}$ represents the areal capacitance of the dielectric, $e$ is the elemental charge, $k_{B}$ the Boltzmann constant, and $T$ the absolute temperature. The mix-, syn-, and anti-isomer devices of Figure 1 had $S$ values of $3.43 \\mathrm{~V} \\mathrm{dec}^{-1}, 0.89 \\mathrm{~V} \\mathrm{dec}^{-1}$, and $0.94 \\mathrm{~V} \\mathrm{dec}^{-1}$, respectively, and $N_{i t}$ of $6.23 \\times 10^{12} \\mathrm{~cm}^{-2} \\mathrm{eV}^{-1}, 1.54 \\times 10^{12} \\mathrm{~cm}^{-2} \\mathrm{eV}^{-1}$, and, $1.09 \\times 10^{12} \\mathrm{~cm}^{-2}$ $\\mathrm{eV}^{-1}$, respectively. Note that the thickness of the $\\mathrm{SiO}_{2}$ dielectric is $300 \\mathrm{~nm}$ for the antiisomer device, and $200 \\mathrm{~nm}$ for the $s y n$ - and mix-isomer devices. For this reason, the calculated trap density is lower in this case, in spite of the fact that all devices exhibit similar values of $S$.\n\n\\subsection{DOS Analysis}\nThe positions of atoms and molecules in a crystal lattice dictate the electronic states of the crystalline structure. Impurities, structural defects, and thermal fluctuations may disrupt the lattice, thereby influencing the local electronic polarization around such sites. ${ }^{[28]}$ If a specific type of defect occurs with an increased probability or if an impurity possesses an electronic state within the bandgap of the host material, it will act as a discrete trapping state. Random defects and fluctuations broaden the bandgap DOS. While the $N_{\\text {it }}$ provides a useful comparison, it only gives the total interfacial trap density, without any details on the energetics of the trap distribution within the bandgap. In order to obtain more detailed information about the energetic spectra of the trapping states, we calculated the DOS of trapping states present in the semiconductor gap for each type of device.\n\nThe DOS calculations were performed following the method developed by Kalb et al., in which the drain current is measured in the linear regime (low voltages in Figure 1 d,e,f), as modulated by a sweeping gate-source voltage, at different temperatures. ${ }^{[29]}$ The activation energies, $E_{a}$, were extracted from the Arrhenius plots according to the equation for fieldeffect conductivity:\n\n\\[\n\\sigma\\left(V_{\\mathrm{GS}}\\right)=\\frac{L}{W} \\frac{I_{D}}{V_{\\mathrm{DS}}}=A \\exp \\left(-\\frac{E_{a}}{k_{B} T}\\right)\n\\]\n\nas a function of the gate-source voltage, $V_{G S}$, where $W$ and $L$ are the channel width and length, respectively. Finally, the DOS $(N(E))$ was obtained from the equation:\n\n\\[\nN(E) \\approx \\frac{d}{\\mathrm{dE}_{a}}\\left[\\frac{\\varepsilon_{0} \\varepsilon_{i}^{2}}{\\varepsilon_{s} l} U_{g}\\left(\\frac{\\mathrm{dE}_{a}}{\\mathrm{dU}_{g}}\\right)^{-1}\\right],\n\\]\n\nwhere $\\varepsilon_{\\mathrm{i}}$ and $\\varepsilon_{\\mathrm{S}}$ are the dielectric constants of the insulator and semiconductor, respectively (3.9 for $\\mathrm{SiO}_{2}$ and 3 for diF-TES ADT) and $U_{g}$ is defined as $U_{\\mathrm{g}}=\\left|V_{G S}-V_{F B}\\right|$, where $V_{F B}$ represents the flat-band voltage. The results are shown in Figure 2. In the left panel (Figure 2a), the DOS of an OFET made from a mix-isomer starting material of typically available purity is shown as a solid black line. A discrete electronic gap state is clearly observed, as indicated by the presence of a peak in the DOS at $\\sim 0.4 \\mathrm{eV}$ from the valence band. A similar device fabricated from ultra-high purity, mix-isomer was measured and the DOS is also shown in Figure 2a (red dotted line). We observed that in this sample the overall trap densities decrease, as expected, but the peak is still present. These OFETs were processed in a nitrogen glovebox and followed immediately by electrical measurements under vacuum. This suggests that the gap state origin does not come from a particular impurity, such as synthesis precursors or oxygen, like in the case of rubrene and pentacene, but likely from the presence of one isomer in the lattice of the other. ${ }^{[29,30]}$ To test our hypothesis, we performed similar measurements in devices fabricated with pure syn- and anti-isomers as starting materials, and we plotted the results against the same curve in Figure $2 \\mathrm{~b}$ in green and blue, respectively (here the results on the similar purity mix-isomer samples are include in black). Indeed, the peak vanished in the pure-isomer devices, which correlates with the improvements observed in device properties.\n\nIn the following, we will have a closer look at the DOS presented in Figure 2b. Each curve was fitted to a double exponential with the addition of a Gaussian distribution to the $\\mathrm{mix}$ isomer curve according to:\n\n\\[\nN_{\\text {fit }}=N_{1} \\exp \\left(-\\frac{E}{E_{1}}\\right)+N_{2} \\exp \\left(-\\frac{E}{E_{2}}\\right)+A_{G} \\exp \\left(-\\frac{\\left(E-E_{\\text {peak }}\\right)^{2}}{2 \\sigma^{2}}\\right)\n\\]\n\nHere, $N_{1}, N_{2}$, and $A_{G}$ are the two exponential and Gaussian amplitudes, respectively, $E_{1}$ and $E_{2}$ the characteristic energies of exponentials, $E_{\\text {peak }}$ is the position of the Gaussian peak, and $\\sigma$ the standard deviation. The summary of the exponential slopes and Gaussian parameters can be found in Table 1. Interestingly, the modeled DOS of the mix-isomer OFET includes a discrete Gaussian peak at $0.38 \\mathrm{eV}$ that is not present in the DOS spectra of the pure syn- or anti-isomers. This value agrees well with our estimation of the trap energy based on the location of the maximum exhibited by our experimental curve.\n\n\\subsection{Electronic Structure Calculations}\nWe turned to DFT calculations to understand the mechanism responsible for the formation of the discrete trapping state in the mix-isomer sample. We created supercells from the experimental structure of the anti-isomer (which is much lower in energy than either the experimental structure of the $s y n$-isomer or the $40 / 60$ mixture). ${ }^{[19]}$ This disordered crystal structure contains atomic positions for two orientations of the anti-isomer, one being the orientation shown in Figure 3a (with sulfur atoms facing away from the neighboring molecules) and the other appearing as if the molecule has been rotated by 180 degrees about the ADT's long axis. Further, we treated the extreme ends of the molecule independently, using positions from each of these two anti orientations to create $s y n$-isomers. There are two combinations to use, resulting in two possible $s y n$-isomer orientations, related by the same 180 degree rotation as the anti orientations. By choosing one of these four orientations for each of the 16 molecules in a $4 \\times 4 \\times 1$ supercell, we simulated different stacking regimes and isomer concentrations within a single crystal. Some regimes were hand-selected, and others were randomly generated, for a total of 131 structures.\n\nWe find that the total energy of the structure (shown in Figure 3b) is mostly determined by how many of each of the four orientations it contains. For example, we made one series of these hand-selected structures by modifying the lowest-energy structure in the plot (where each molecule has the arrangement shown in Figure 3a). Starting with the lowest-energy structure, we successively changed one molecule into a syn-isomer, with each of these structures falling almost exactly along the dashed line in Figure 3b. That the composition of the structure explains most of the energy difference indicates that neighboring molecules' orientations only weakly affect the system's energetics. Consequently, the anti orientation in Figure 3a is preferred, regardless of how the molecule's neighbors are oriented.\n\n\\subsection{Ultraviolet Photoelectron Spectroscopy Measurements}\nOrganic semiconductor layers formed from the SAC method of diF-TES-ADT syn-, anti-, and mix-isomers were measured by UPS to determine their electronic properties (Figure 4). The work function was determined in the low kinetic energy region of the UPS spectrum, specifically in the secondary electron cut-off region. The work function of the syn-, anti-, and mix-isomer SAC crystals are determined as $4.4 \\pm 0.05 \\mathrm{eV}, 4.5 \\pm 0.05 \\mathrm{eV}, 4.5 \\pm 0.05 \\mathrm{eV}$, respectively. The HOMOs are determined from the high kinetic (low binding) energy region of the spectrum, and multiple HOMOs are clearly resolved when compared to an earlier report indicating that the materials in this study are of higher molecular quality and/or of dissimilar structural quality. ${ }^{[31]}$ The HOMO position was estimated using the low binding energy onset of the HOMO of the syn-, anti-, and mix-isomer SAC crystals, which are $0.68$ $\\pm 0.05 \\mathrm{eV}, 0.66 \\pm 0.05 \\mathrm{eV}$, and $0.63 \\pm 0.05 \\mathrm{eV}$, respectively. Thus, the ionization potential was estimated as $5.1 \\pm 0.1 \\mathrm{eV}, 5.2 \\pm 0.1 \\mathrm{eV}, 5.1 \\pm 0.1 \\mathrm{eV}$ for the $s y n$-, anti-, and $m i x$-isomer crystals, respectively, and are all nominally identical. We found that—although each isomer packs differently as a solid-this modification does not give rise to significantly different electronic energy levels and are indistinguishable within the resolution of the physical measurement. ${ }^{[19]}$\n\nThe two isomers exhibit subtle differences in molecular packing, which may yield different band-structures. Any shift in the HOMO/LUMO levels will generate states that may occupy within the bandgap of the other isomer. However, our UPS measurements (Figure 4) and DFT calculations (Figure 5) suggest that there was no appreciable difference in the energyband edges between the $s y n$ - and anti-isomers and therefore, the origin of the trap located at $\\sim 0.4 \\mathrm{eV}$ cannot be explained by band structures alone.\n\n\\subsection{Dipole Moment Influence on HOMO of Surrounding Material}\nNakayama et al. and Pernstich et al. proposed a mechanism in which the local dipole moment of a guest compound may introduce energetic disorder in the host material. ${ }^{32,33]}$ They showed that molecules containing a net dipole, such as water or rubrene endoperoxide, could locally polarize the surrounding nonpolar molecules such as rubrene, and locally elevate its HOMO. In our case, while the anti-isomer does not have a permanent dipole moment because of its symmetry, the syn-isomer exhibits an internal molecular dipole of $0.76 \\mathrm{D}$. By integrating over the Gaussian peak in the DOS, however, we approximated the content of the trapping state at $\\sim 400 \\mathrm{ppm}\\left(6.6 \\times 10^{-4} \\mathrm{~mol} \\mathrm{~L}^{-1}\\right)$, which indicates that this unoccupied state is only moderately denser than that of the rest of the tail states. Therefore, if the trap originates from the polar nature of the $s y n$ molecules altering the polarization of the host anti-molecules, then the concentration of the syn molecules among the anti should be very low in the transistor channel. Otherwise, the mixing would elevate the density of the trapping state to be comparable to that of the HOMO. This is probably achieved during film crystallization, when an inhomogeneous separation of the starting $40 / 60$ mix may occur such that the crystal grains of the active OFET channel dominantly contain one isomer (at least at the interface with the dielectric). Indeed, this is confirmed by our DFT calculations shown in Figure 3b, which indicate that it is energetically favorable for the anti-isomer to be secluded from the $s y n$-isomer molecules. ${ }^{[19]}$ The organic layer fabricated using the SAC process crystallizes over a period of several hours, and this lengthy process promotes the growth of highly ordered, large crystal grains, providing advantageous conditions for this phase separation.\n\n\\subsection{Isomer Separation through Device Processing}\nSince the isomer separation is a complex synthetic task which, in general, has moderate yields, we were interested in achieving this objective through thin-film processing. ${ }^{[18,34-36]}$ We thus employed our vibration-assisted crystallization (VAC) method, in which the semiconductor solution is perturbed with gentle vibrations applied during film growth in a direction perpendicular to the substrate. ${ }^{[12]}$ In an earlier report, we showed that this procedure yields lower trap densities and enhanced device performance by promoting molecular assembly in a lowest-potential energy configuration. In that study, we only accessed the total density of interfacial traps, with no details about their nature or the energetic distribution. Here, the DOS analysis allowed us to gather this information. We fabricated OFET devices of mix-isomer diF-TES ADT using VAC and the DOS curve is shown in Figure 6a in red dotted lines. The results obtained on similar SAC samples are shown in black, as a reference. This figure highlights two features of the VAC process. First, an overall lowering of the trap density can be observed (highlighted as the green checkered area), which results from the fact that a larger fraction of the molecules can reach the configuration corresponding to the global energy minimum instead of local minima, as we have discussed in detail elsewhere. ${ }^{[12]}$ Second, the lack of the signature trap state peak (gray striped area) indicates that only one type of isomer is present at the interface with the dielectric, and thus there is a greater degree of separation between the syn- and anti-isomers compared to the SAC devices.\n\nIdentifying how the separation occurs based on thin-film structural measurements is challenging due to the fact that the two components are very similar. For this reason, we fabricated devices in which the orientation of vibration was varied between $0^{\\circ}$ and $90^{\\circ}$, where the angle is defined between the vibration direction and the surface normal. The results are shown in Figure $6 \\mathrm{~b}$ for $0^{\\circ}, 30^{\\circ}, 60^{\\circ}$, and $90^{\\circ}$, where we plot the evolution of the device mobility as a function of the substrate orientation, normalized by the value corresponding to $0^{\\circ}$. Details on the sample orientation are provided in Figure 6 c. We found that the mobility decreases as the vibration is applied more in-plane with the substrate. This suggests that a vertical phase separation of the isomers occurs, in which the denser $s y n$ isomer segregates at the bottom. Such separation is also encouraged by the polarity and hydrophilicity of the $\\mathrm{SiO}_{2}$ surface, which favors assembly of the more polar syn-isomer molecules. ${ }^{[37]}$\n\n\\section{Conclusion}\nIn conclusion, we showed that an isomer can induce electronic states in the bandgap of the other isomer when they co-exist in the active layer of an OFET device. In the case of diFTES ADT, the discrete trap state is likely the result of the permanent dipole of the synisomer that locally polarizes the neighboring, non-polar anti-isomer molecules, introducing energetic disorder and lowering device performance. Our results thus provide insight into the observed improvement in mobility of single isomer OFETs over that of the mix isomer. Further, we show that this trapping state can be avoided by fabricating devices from single isomers as starting materials or by phase separation of the mix during crystallization by way of the VAC method.\n\n\\section{Experimental Section}\n\\section{OFET Fabrication}\nThe OFET devices examined in this study were fabricated on highly doped silicon that was both the substrate and the gate electrode with a $200 \\mathrm{~nm}$ or $300 \\mathrm{~nm}$ layer of thermally oxidized $\\mathrm{SiO}_{2}$, which was the gate dielectric. Source and drain electrodes of Au with a Ti adhesion layer were e-beam evaporated and patterned by either photo-resist lithography or shadow masks to form the bottom contacts. Before depositing the semiconductor layer, this testbed was soaked in hot acetone and isopropyl alcohol for 10 minutes each, followed by a 10 minute UV/ozone cleaning and a deionized water rinse. The contacts were treated with pentafluorobenzenethiol (PFBT) (Sigma Aldrich) by submersion in $30 \\mathrm{mM} \\mathrm{PFBT}$ in ethanol for 30 minutes and followed by sonication in fresh ethanol. The organic semiconductor layer consisting of the $s y n$-isomer, anti-isomer, or a 40/60 mix of the two, was deposited by the SAC method, which involves drop-casting 0.1-0.5\\% solution of diF-TES ADT in chlorobenzene onto the testbed placed in a petri dish, with an additional $250 \\mu \\mathrm{L}$ of chlorobenzene surrounding the sample, which was then covered and allowed to crystallize in the dark. ${ }^{[26]}$ In parallel, we also fabricated devices by using our recently developed VAC (vibration-assisted crystallization) method, for which $75 \\mathrm{~Hz}$ mechanical vibrations were supplied to the crystallization chamber by two audio speakers. ${ }^{[12]}$ For these samples the direction of vibration was set to $0^{\\circ}, 30^{\\circ}, 60^{\\circ}$, or $90^{\\circ}$ as measured between the substrate normal and the axis of the co-facing speakers, as shown in Figure 6c.\n\n\\section{Electrical Characterization}\nThe OFET electrical characteristics were measured under vacuum $\\left(10^{-6}\\right.$ torr $)$ with an Agilent 4155C Semiconductor Parameter Analyzer connected to a low-temperature probestation. The field-effect mobility was extracted from the saturation regime using the equation\n\n\\[\nI_{D}=\\frac{W}{L} \\frac{C_{i}}{2} \\mu\\left(V_{\\mathrm{GS}}-V_{T}\\right)^{2},\n\\]\n\nwhere $V_{T}$ is the threshold voltage.\n\n\\section{Electronic Structure Determination via Density Functional Theory}\nWe performed total energy calculations in the 16 -molecule, $4 \\times 4 \\times 1$ supercell at the DFT level as implemented in VASP, using the vdW-DF1 exchange-correlation functional. [38-44] For each structure, we performed one self-consistent calculation at the gamma point, with total energy convergence of $10^{-6} \\mathrm{eV}$ and a $500 \\mathrm{eV}$ plane-wave energy cutoff.\n\nWe calculated the dipole moment of each isomer at the DFT level in VASP, again using the $\\mathrm{vdW}$-DF1 functional at the gamma point, with total energy convergence of $10^{-6} \\mathrm{eV}$ and a $500 \\mathrm{eV}$ energy cutoff. With each isomer treated as an isolated molecule, $15 \\AA$ of vacuum in each direction proved enough to converge the moments.\n\nWe calculated the total density of states (TDOS, Figure 5) using the full-potential linearized augmented plane-wave (LAPW) code Wien2k. ${ }^{[45]}$ Using only the gamma point, we set $\\mathrm{RK}_{\\max }$ to 7 and chose muffin-tin radii to be $1.69(\\mathrm{Si}), 1.13$ (C), $0.62(\\mathrm{H}), 1.68$ (S), and $1.35$ (F) bohr, resulting in a plane wave cutoff of about $1700 \\mathrm{eV}$. Within the muffin-tin, we used spherical harmonics up to $\\mathrm{l}=10$. We used the PBE exchange-correlation functional and verified the relative energy level alignment by comparing the energy of sulfur $1 \\mathrm{~s}$ states, which are about $2400 \\mathrm{eV}$ below the Fermi level. Note that the band-gap is typically underestimated within standard DFT.\n\n\\section{Electronic Structure Determination via Ultraviolet Photoelectron Spectroscopy}\nUPS measurements were performed with a commercial instrument equipped with a He discharge lamp (21.12 eV) and a hemispherical electron energy analyzer (Epass $=5 \\mathrm{eV}, 55$ $\\mu \\mathrm{m}$ aperture), and an applied $-5.5 \\mathrm{~V}$ bias to the sample. ${ }^{[46]}$ The energy scale was calibrated by measuring the Fermi edge of a clean Au surface. Two spots on each sample were measured and averaged, and care was taken to ensure that only one crystal was analyzed.\n\n\\section{Acknowledgments}\nThe device studies were supported by NSF grant ECCS-1254757. Semiconductor synthesis was supported by NSF grant CMMI-1255494.\n\n\\section{References}\n\\begin{enumerate}\n  \\item Minemawari H, Yamada T, Matsui H, Tsutsumi J, Haas S, Chiba R, Kumai R, Hasegawa T. Nature. 2011; 475:364. [PubMed: 21753752]\n\n  \\item Zhang L, Liu H, Zhao Y, Sun X, Wen Y, Guo Y, Gao X, Di C-A, Yu G, Liu Y. Adv. Mater. 2012; 24:436. [PubMed: 22190264]\n\n  \\item Teichler A, Perelaer J, Schubert US. J. Mater. Chem. C. 2013; 1:1910.\n\n  \\item Pierre A, Sadeghi M, Payne MM, Facchetti A, Anthony JE, Arias AC. Adv. Mater. 2014; 26:5722. [PubMed: 24941920]\n\n  \\item Klauk H. Chem. Soc. Rev. 2010; 39:2643. [PubMed: 20396828]\n\n  \\item Ward JW, Lamport ZA, Jurchescu OD. Chem Phys Chem. 2015; 16:1118. [PubMed: 25757210]\n\n  \\item Labram JG, Lin Y-H, Anthopoulos TD. Small. 2015; 11:5472. [PubMed: 26349850]\n\n  \\item Treat ND, Malik JAN, Reid O, Yu L, Shuttle CG, Rumbles G, Hawker CJ, Chabinyc ML, Smith P, Stingelin-Stutzmann N. Nat. Mater. 2013; 12:628. [PubMed: 23727949]\n\n  \\item Kline RJ, Hudson SD, Zhang X, Gundlach DJ, Moad AJ, Jurchescu OD, Jackson TN, Subramanian S, Anthony JE, Toney MF, Richter LJ. Chem. Mater. 2011; 23:1194.\n\n  \\item Hunter S, Chen J, Anthopoulos TD. Adv. Funct. Mater. 2014; 24:5969.\n\n  \\item Yu L, Li X, Pavlica E, Loth MA, Anthony JE, Bratina G, Kjellander C, Gelinck G, Stingelin N. Appl. Phys. Lett. 2011; 99:263304.\n\n  \\item Diemer PJ, Lyle CR, Mei Y, Sutton C, Payne MM, Anthony JE, Coropceanu V, Brédas J-L, Jurchescu OD. Adv. Mater. 2013; 25:6956. [PubMed: 24115382]\n\n  \\item Ward JW, Li R, Obaid A, Payne MM, Smilgies D-M, Anthony JE, Amassian A, Jurchescu OD. Adv. Funct. Mater. 2014; 24:5052.\n\n  \\item Niazi MR, Li R, Qiang Li E, Kirmani AR, Abdelsamie M, Wang Q, Pan W, Payne MM, Anthony JE, Smilgies D-M, Thoroddsen ST, Giannelis EP, Amassian A. Nat. Commun. 2015; 6:8598. [PubMed: 26592862] 15. Kaake L, Dang X-D, Leong WL, Zhang Y, Heeger A, Nguyen T-Q. Adv. Mater. 2013; 25:1706. [PubMed: 23281094]\n\n  \\item Cowan SR, Leong WL, Banerji N, Dennler G, Heeger AJ. Adv. Funct. Mater. 2011; 21:3083.\n\n  \\item Jurchescu OD, Baas J, Palstra TTM. Appl. Phys. Lett. 2004; 84:3061.\n\n  \\item Mamada M, Katagiri H, Mizukami M, Honda K, Minamiki T, Teraoka R, Uemura T, Tokito S. ACS Appl. Mater. Interfaces. 2013; 5:9670. [PubMed: 24028498]\n\n  \\item Hallani RK, Thorley KJ, Mei Y, Parkin SR, Jurchescu OD, Anthony JE. Adv. Funct. Mater. 2016; $26: 2341$.\n\n  \\item Lincker F, Attias A-J, Mathevet F, Heinrich B, Donnio B, Fave J-L, Rannou P, Demadrille R. Chem. Commun. 2012; 48:3209.\n\n  \\item Osaka I, Abe T, Shinamura S, Takimiya K. J. Am. Chem. Soc. 2011; 133:6852. [PubMed: 21476552]\n\n  \\item Wex B, Kaafarani BR, Schroeder R, Majewski LA, Burckel P, Grell M, Neckers DC. J. Mater. Chem. 2006; 16:1121.\n\n  \\item Brusso JL, Hirst OD, Dadvand A, Ganesan S, Cicoira F, Robertson CM, Oakley RT, Rosei F, Perepichka DF. Chem. Mater. 2008; 20:2484.\n\n  \\item Tsutsui Y, Schweicher G, Chattopadhyay B, Sakurai T, Arlin J-B, Ruzié C, Aliev A, Ciesielski A, Colella S, Kennedy AR, Lemaur V, Olivier Y, Hadji R, Sanguinet L, Castet F, Osella S, Dudenko D, Beljonne D, Cornil J, Samorì P, Seki S, Geerts YH. Adv. Mater.\n\n  \\item Thorley KJ, Risko C. J. Mater. Chem. C. 2016; 4:4040.\n\n  \\item Goetz KP, Li Z, Ward JW, Bougher C, Rivnay J, Smith J, Conrad BR, Parkin SR, Anthopoulos TD, Salleo A, Anthony JE, Jurchescu OD. Adv. Mater. 2011; 23:3698. [PubMed: 21732562]\n\n  \\item Diemer PJ, Lamport ZA, Mei Y, Ward JW, Goetz KP, Li W, Payne MM, Guthold M, Anthony JE, Jurchescu OD. Appl. Phys. Lett. 2015; 107:103303.\n\n  \\item Schmechel R, von Seggern H. Phys. status solidi. 2004; 201:1215.\n\n  \\item Kalb WL, Mattenberger K, Batlogg B. Phys. Rev. B. 2008; 78:035334.\n\n  \\item Krellner C, Haas S, Goldmann C, Pernstich KP, Gundlach DJ, Batlogg B. Phys. Rev. B. 2007; 75:245115.\n\n  \\item Smith J, Hamilton R, Qi Y, Kahn A, Bradley DDC, Heeney M, McCulloch I, Anthopoulos TD. Adv. Funct. Mater. 2010; 20:2330.\n\n  \\item Nakayama Y, Machida S, Minari T, Tsukagishi K, Noguchi Y, Ishii H. Appl. Phys. Lett. 2008; 93:173305.\n\n  \\item Pernstich KP, Oberhoff D, Goldmann C, Batlogg B. Appl. Phys. Lett. 2006; 89:213509.\n\n  \\item Tylleman B, Vande Velde CML, Balandier J, Stas S, Sergeyev S, Geerts YH. Org. Lett. 2011; 13:5208. [PubMed: 21916399]\n\n  \\item Nakano M, Niimi K, Miyazaki E, Osaka I, Takimiya K. J. Org. Chem. 2012; 77:8099. [PubMed: 22889196]\n\n  \\item Lehnherr D, Waterloo AR, Goetz KP, Payne MM, Hampel F, Anthony JE, Jurchescu OD, Tykwinski RR. Org. Lett. 2012; 14:3660. [PubMed: 22746993]\n\n  \\item Shin N, Kang J, Richter LJ, Prabhu VM, Kline RJ, Fischer DA, DeLongchamp DM, Toney MF, Satija SK, Gundlach DJ, Purushothaman B, Anthony JE, Yoon DY. Adv. Funct. Mater. 2013; 23:366.\n\n  \\item Kresse G, Furthmüller J. Phys. Rev. B. 1996; 54:11169.\n\n  \\item Kresse G, Joubert D. Phys. Rev. B. 1999; 59:1758.\n\n  \\item Klimeš J, Bowler DR, Michaelides A. Phys. Rev. B. 2011; 83:195131.\n\n  \\item Thonhauser T, Zuluaga S, Arter CA, Berland K, Schröder E, Hyldgaard P. Phys. Rev. Lett. 2015; 115:136402. [PubMed: 26451571]\n\n  \\item Berland K, Cooper VR, Lee K, Schröder E, Thonhauser T, Hyldgaard P, Lundqvist BI. Reports Prog. Phys. 2015; 78:066501.\n\n  \\item Langreth DC, Lundqvist BI, Chakarova-Käck SD, Cooper VR, Dion M, Hyldgaard P, Kelkkanen A, Kleis J, Kong L, Li S, Moses PG, Murray E, Puzder A, Rydberg H, Schröder E, Thonhauser T. J. Phys. Condens. Matter. 2009; 21:084203. [PubMed: 21817355] 44. Thonhauser T, Cooper VR, Li S, Puzder A, Hyldgaard P, Langreth DC. Phys. Rev. B. 2007; $76: 125112$.\n\n  \\item Blaha, P., Schwarz, K., Madsen, G., Kvasnicka, D., Luitz, J. WIEN2k, An Augmented Plane Wave + Local Orbitals Program for Calculating Crystal Properties, Karlheinz Schwarz. Techn. Universität, Wien; Austria: 2001.\n\n  \\item The identification of commercial equipment or vendor is not intended to imply recommendation or endorsement by NIST, nor is it intended to imply that the materials or equipment identified are necessarily the best available for the purpose.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_9a591ebf98377fd0ebe2g-13_199_1015_302_1386}\n\n\\end{enumerate}\n\nb)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a591ebf98377fd0ebe2g-13_245_639_819_910}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a591ebf98377fd0ebe2g-13_242_630_883_1486}\n\\end{center}\n\nf)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a591ebf98377fd0ebe2g-13_629_1014_1432_1950}\n\\end{center}\n\nFigure 1.\n\nOFET I-V measurements. (a-c) transfer sweeps in the saturation regime with $V_{D S}=-40 \\mathrm{~V}$ a) 40/60 mix of $s y n$ - and anti-isomers, b) syn-isomer only, and c) anti-isomer only. (d-f) transport plots of d) 40/60 mix of syn- and anti-isomers, e) syn-isomer only, and f) antiisomer only. The summary of device parameters and the chemical structures are included as insets. a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a591ebf98377fd0ebe2g-14_253_917_302_1129}\n\\end{center}\n\nb)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a591ebf98377fd0ebe2g-14_256_920_1194_2037}\n\\end{center}\n\nFigure 2.\n\nDOS spectra comparison of 40/60 mix (black) to a) extra purified 40/60 mix (red, dashed) and b) $s y n$-isomer (green dot-dashed), anti-isomer (blue short-dashed).\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_9a591ebf98377fd0ebe2g-15_203_791_314_2040}\n\nFigure 3.\n\nMolecular arrangement energy a) molecular orientation and spacing for the lowest-energy structure b) configuration energies for 131 different combinations of 16 anti- and syn-isomer molecules. Red line marks lowest energy for each ratio.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_9a591ebf98377fd0ebe2g-16_198_1418_302_2038}\n\nFigure 4.\n\nThe surface work function (left) and highest occupied molecular orbitals (right) electronic energy levels of the syn, anti, and mix-isomers of diF-TES ADT derived from UPS. Spectra are vertically offset for clarity.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a591ebf98377fd0ebe2g-17_199_1069_294_2037}\n\\end{center}\n\nFigure 5.\n\nTotal density of states from DFT for the anti-isomer (black, solid) and $s y n$-isomer (red, dashed).\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_9a591ebf98377fd0ebe2g-18_199_1483_302_2018}\n\nFigure 6.\n\na) Vibration-assisted crystallization of mix-isomer (red short-dashed). b) Mobility dependence on orientation of vibration during film crystallization for VAC OFETs. c) Vibration orientation adjustments for samples prepared by VAC method.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a591ebf98377fd0ebe2g-19_1481_2368_252_550}\n\\end{center}\n\n\n\\end{document}", "record_id": "2023_09_22_9a591ebf98377fd0ebe2g"}