{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{HHS Public Access }\n\n\\author{}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\DeclareUnicodeCharacter{2020}{$\\dagger$}\n\n\\begin{document}\n\\maketitle\nAuthor manuscript\n\nInorg Chem. Author manuscript; available in PMC 2019 August 20.\n\nPublished in final edited form as:\n\nInorg Chem. 2018 August 20; 57(16): 9580–9591. doi:10.1021/acs.inorgchem.8b00226.\n\n\\section{Alkali Cation Effects on Redox-Active Formazanate Ligands in Iron Chemistry}\nDaniel L. J. Broere $^{\\dagger}$, Brandon Q. Mercado ${ }^{\\dagger}$, Eckhard Bill ${ }^{\\S}$, Kyle M. Lancaster $^{\\ddagger}$, Stephen Sproules $^{\\perp}$, and Patrick L. Holland ${ }^{\\dagger}$\n\n†Department of Chemistry, Yale University, New Haven, Connecticut 06520, United States\n\n${ }^{\\ddagger}$ Department of Chemistry and Chemical Biology, Baker Laboratory, Cornell University, Ithaca, New York 14853, United States\n\n§Max Planck Institute for Chemical Energy Conversion, Stiftstrasse 34-36, D-45470 Mülheim an der Ruhr, Germany\n\n${ }^{\\perp}$ WestCHEM, School of Chemistry, University of Glasgow, Glasgow G12 8QQ, United Kingdom\n\n\\begin{abstract}\nNon-covalent interactions of organic moieties with Lewis acidic alkali cations can greatly affect structure and reactivity. Herein, we describe the effects of interactions with alkali metal cations within a series of reduced iron complexes bearing a redox-active formazanate ligand, in terms of structures, magnetism, spectroscopy, and reaction rates. In the absence of a crown ether to sequester the alkali cation, dimeric complexes are isolated wherein the formazanate has rearranged to form a five-membered metallacycle. The dissociation of these dimers is dependent on the binding mode and size of the alkali cation. In the dimers, the formazanate ligands are radical dianions, as shown by X-ray absorption spectroscopy, Mössbauer spectroscopy, and analysis of metrical parameters. These experimental measures are complemented by DFT calculations that show the spin density on the bridging ligands.\n\\end{abstract}\n\n\\section{Synopsis}\nCation- $\\pi$ interactions in reduced iron complexes bearing formazanate radical dianions induce a ligand rearrangement that results in the formation of dimeric complexes. The nature of the alkali cation affects both the structure and reactivity of the dimers.\n\nCorrespondence to: Daniel L. J. Broere; Patrick L. Holland.\n\nSupporting information\n\nThe Supporting Information is available free of charge on the ACS Publications website at DOI: $x x$\n\nSynthetic procedures and characterization of all compounds, NMR, IR, Mössbauer, XAS and UV/vis spectral data, kinetic experiments, magnetic studies and details of computational and crystallographic studies (PDF)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-02_217_575_690_1435}\n\\end{center}\n\n\\section{Introduction}\nAlkali metal cations play essential roles in both biological chemistry ${ }^{1}$ and synthetic chemistry ${ }^{2}$ where they stabilize complex structures or act as cofactors in (bio)catalytic transformations. Detailed studies have shown that non-covalent interactions of organic moieties with redox-inactive metal cations can result in changes in electronic structure that affect geometry, ${ }^{3}$ redox potentials, ${ }^{4} \\mathrm{~N}_{2}$ cleavage ${ }^{5}$, reaction rates ${ }^{6}$ and selectivity of chemical transformations. ${ }^{7}$ The nature of the interaction with s-block cations is greatly influenced by their charge $(z)$ : size $(r)$ ratio. Cations with a high $z / r$ ratio have the capacity for bond polarization, inducing bond covalency. ${ }^{8}$ When descending the s-block metal groups, the radii of the metals significantly increase, ${ }^{9}$ resulting in predominantly ionic bonding and an increased tendency for ion dissociation. Noncovalent interactions in the form of cation- $\\pi$ contacts are weaker than covalent interactions but can play a significant role in metal cation association. The electrostatic nature of cation- $\\pi$ contacts causes the strength of this interaction to rise with increasing $z / r$ ratio. ${ }^{8}$ Typically, these interactions are observed when the distance is below the sum of the van der Waals radii of the independent elements. ${ }^{10}$ In the absence of neutral co-ligands such as $\\mathrm{THF}, \\mathrm{Et}_{2} \\mathrm{O}$ or HMPA, aggregates can form resulting in low solubility or concentration dependent solution speciation. Multidentate ligands such as DME, TMEDA and crown ethers can sequester/stabilize the cation, thereby preventing aggregate formation, and at times drastically affect reactivity. ${ }^{11}$ The right cation and crown ether or cryptand combination can give rise to fully separated ion pairs, which is often used to facilitate crystallization. However, allowing cation- $\\pi$ interactions to persist could be a useful strategy to tune the electronic structure and corresponding reactivity of transition metal complexes.\n\nIn many examples where alkali metal cations are involved in homogeneous catalysis and activating strong chemical bonds, the alkali metal cations result from using the corresponding zerovalent alkali and alkaline earth metals for reductive activation of precatalysts. ${ }^{12}$ In addition to classical metal-centered reduction, electrons can be stored in redox-active ligands. These ligands have been shown to facilitate multi-electron processes in systems where the transition metal changes oxidation states by less than two electrons, ${ }^{13}$ and enable the formation of substrate-centered radicals. ${ }^{14}$ Given the increasing popularity of redox-active ligands 15 that is demonstrated in this Forum, it is important to consider whether the reducing electron from the alkali metal goes into a metal- or ligand-centered orbital. Since redox-active ligands often contain extended $\\pi$-systems and/or multiple heteroatoms that are potentially capable of Coulomb interactions with alkali cations, it is evident that\n\n\\section{cation- $\\pi$ interactions must be considered when evaluating redox-active ligands, especially in reductive reactions. Indeed, cation- $\\pi$ interactions have been observed for well recognized redox-active ligands, including catecholates, ${ }^{16}$ amidophenolates, ${ }^{17} o$ phenylenediamides, ${ }^{18}$ salophens, ${ }^{19}$ dithiolenes ${ }^{20}$ and bis(imino)pyridines. ${ }^{21}$ Despite this link, there have been few systematic studies into the interplay of cation- $\\pi$ interactions and redox-active ligands. A recent example that demonstrates the effect that different alkali cations can have was reported by Mazzanti and coworkers, who showed that one-electron reduction of a (salophen)cobalt(II) complex results in either metal or ligand-centered reduction, depending on the identity of the alkali metal. ${ }^{22}$}\nAs part of our interest in redox-active ligands and low-coordinate iron chemistry, we recently reported that $\\mathrm{Fe}\\left[\\mathrm{N}\\left(\\mathrm{SiMe}_{3}\\right)_{2}\\right]_{2}{ }^{23}$ gives access to low-coordinate iron formazanate complexes that undergo ligand-centered reduction at the formazanate ligand (Scheme 1). ${ }^{24}$ Formazanates have been established as good one-electron acceptors, particularly from the work of Otten and coworkers, who demonstrated ligand-centered reduction in various formazanates bound to redox-inert boron ${ }^{25}$ or zinc. ${ }^{26}$ Interestingly, a recently reported homoleptic formazanate iron(II) complex adopted a low spin iron(I) configuration upon oneelectron reduction rather than generating a ligand-centered radical. ${ }^{27}$ We found that oneelectron reduction of complex $\\mathbf{1}$ gives a complex with a formazanate radical dianion ( $S=$ $1 / 2$ ) that is strongly antiferromagnetically coupled to a high-spin iron(II) $(S=2)$ to give an overall $S=3 / 2$ electronic configuration. When Na was used as the reductant in the presence of two equivalents of 12 -crown-4, a mononuclear anionic iron complex 2 with a sequestered sodium cation was obtained. Herein, we report that one-electron reduction of $\\mathbf{1}$ with alkali metals in the absence of a crown ether forms dimeric complexes in which alkali cation binding is connected to an isomerization of the formazanate into an unprecedented bridging mode, which changes the electron localization. Importantly, we show that the choice of alkali metal cation has a substantial effect on the structure and reactivity of these dimeric complexes.\n\n\\section{Results}\nThe addition of Na sand to a purple THF solution of $\\mathbf{1}$ at $-78{ }^{\\circ} \\mathrm{C}$ gives a dark green solution upon warming to room temperature, similar to what is observed in the synthesis of complex 2. However, concentrating the mixture and addition of pentane, followed by cooling to $-40^{\\circ} \\mathrm{C}$ affords a differently colored complex 3-Na, which is a black crystalline solid in $71 \\%$ yield (Scheme 2).\n\nCrystals suitable for single crystal X-ray diffraction were obtained by cooling a solution of 3-Na in a THF/pentane mixture to $-40^{\\circ} \\mathrm{C}$. The solid state structure of 3-Na (Figure 1) revealed a dimeric structure wherein the formazanate ligand has rearranged to coordinate through N1 and N3 to form a five-membered chelate. The exocyclic nitrogen (N4) coordinates to the other iron center in the dimer. Ligand rearrangements to bind N1 and N3 have been observed in non-reduced formazanates bound to boron ${ }^{25}$ and zinc, ${ }^{26}$ but we are not aware of any previous examples where the exocyclic N4 atom coordinates to another metal. The two $\\left[\\mathrm{Na}(\\mathrm{THF})_{3}\\right]^{+}$ions have interactions with the internal $\\mathrm{N} 2$ atoms of the five membered chelates and with nearby phenyl groups. The N-Na distances of 2.373(3) Å and 2.372(3) $\\AA$ are comparable to those observed for non-isomerized formazanates bound to B $(2.35-2.39 \\AA)^{28}$ and $\\mathrm{Zn}(2.41-2.52 \\AA)^{29}$. The formazanate Fe-N bond lengths (2.006(3) 2.067(3) $\\AA$ ) are all elongated compared to the solid state structure of $2(1.935(5)-1.958(5)$ $\\AA$ ), consistent with the higher coordination number of iron in 3-Na, which is four-coordinate in contrast to three-coordinate 2 .\n\nMetal complexes with multiple redox-active ligands can display ligand-based mixed valence, which is often reflected in distinct differences in intraligand metric parameters. ${ }^{29,30}$\n\nAlthough the two formazanate ligands in 3-Na are not crystallographically related, there are no significant differences in bond lengths and angles (Table 1), indicating that both ligands are in the same oxidation state. Analysis of the intraligand bond lengths of the formazanate core shows an elongation of the $\\mathrm{N}-\\mathrm{N}$ bonds (1.372(4) - 1.393(4) $\\AA$ ) compared to $\\mathbf{1}$ (1.317(2) - 1.325(2) A), similar but more pronounced to what is observed in 2 (1.377(6) and 1.345(6) $\\AA$ )), suggestive of a ligand-centered reduction (Chart 1). The $\\mathrm{C}-\\mathrm{N}$ bonds within the formazanate core of complex 2 (1.343(7) and 1.339(8) Å) show no significant changes when compared to 1 (1.339(2) - 1.350(2) A). However, in 3-Na a contraction of the N2-C1 bonds (both 1.323(5) $\\AA$ ) and an elongation of the C1-N3 bonds (1.370(5) and 1.363(5) Å) are observed, indicating more localized double bond character for the N2-C1 bond. A comparable observation was made for a similarly rearranged but non-reduced formazanate bound to $\\mathrm{Zn}$, which showed double bond localization for N2-C1 and N3-N4. ${ }^{26}$ In contrast, the N3-N4 bonds in 3 are significantly longer (1.393(4) and 1.378(4) $\\AA$ ), and are comparable to the N1-N2 bonds (1.372(4) and 1.375(4) Å), indicating that there is no double bond character for the N3-N4 bond as was observed for the non-reduced formazanate bound to $\\mathrm{Zn}$. The relative bond distances within the rearranged formazanate in 3-Na are very similar to DFT calculated values for a diamidoborane complex - formed upon intramolecular hydride reduction of the formazanate in a boron dihydride complex - with an identical binding mode as in 3-Na, yet protonated at N4. ${ }^{25 a}$ The possibility of ligandcentered reduction is further supported by reported examples of five-membered metallacycles consisting of isothiosemicarbazide $\\pi$-radical anions bound to nickel(II) ${ }^{31}$ and iron(III) ${ }^{32}$ with the same N-N-C-N motive as in 3-Na. In these examples elongation of the $\\mathrm{N}-\\mathrm{N}$ bonds and contraction of the C-N bonds was also observed upon reduction of a neutral ligand to the corresponding radical monoanion. The mononanionic radical form of these ligands is characterized by intraligand bond distances of 1.333(1) - 1.350(1) $\\AA$ for the $\\mathrm{N}-\\mathrm{N}$ bond. This is significantly elongated compared to $\\mathrm{N}-\\mathrm{N}$ bond in the neutral form of the ligand (1.254(7) - 1.267(2) \\&̊), similar to the difference between $\\mathbf{1}$ and 3-Na. However, in the reported isothiosemicarbazide $\\pi$-radical anions both $\\mathrm{C}-\\mathrm{N}$ bonds are comparable (1.322(1) - 1.355(1) $\\AA$ ), and less localized than in 3-Na. Overall, the metrical analysis implies that the rearranged formazanate ligands in 3-Na bind iron as radical dianions.\n\nThe zero-field Mössbauer spectrum of a solid sample of 3-Na at $80 \\mathrm{~K}$ shows a slightly asymmetric doublet with isomer shift $\\delta=0.74 \\mathrm{~mm} \\mathrm{~s}^{-1}$ and quadrupole splitting $\\left|\\Delta E_{\\mathrm{Q}}\\right|=2.30$ $\\mathrm{mm} \\mathrm{s}^{-1}$ (Figure 2). The observation of only one doublet indicates identical electronic structures and environments for the two iron sites in 3-Na. The observed isomer shift of 3$\\mathbf{N a}$ is similar to that of complex $\\mathbf{1}\\left(\\delta=0.71 \\mathrm{~mm} \\mathrm{~s}^{-1}\\right)$, suggesting that the oxidation state at iron is the same in both cases. For additional insight, 3-Na was also analyzed by X-ray absorption spectroscopy at the Fe K-edge. The spectra of 1, 2 and 3-Na overlaid in Figure 3 are characterized by electric dipole forbidden but quadrupole-allowed $1 \\mathrm{~s} \\rightarrow 3 \\mathrm{~d}$ pre-edge transitions that appear at the base of the dipole-allowed $1 \\mathrm{~s} \\rightarrow n \\mathrm{p}$ rising-edge that dominates a K-edge spectrum. Since the ligand field typically increases with increasing oxidation state for a given ligand set, the pre-edge energy often provides a useful marker for oxidation state. 33 The centers of mass for pre-edge peaks in spectra obtained for 1, 2 and 3-Na are identical within experimental error at $7112.2 \\pm 0.1 \\mathrm{eV}$. Moreover the pre- and rising-edge spectral profile for $\\mathbf{1}$ and 3 are almost superimposable, clearly indicating the same effective nuclear charge and coordination geometry (tetrahedral) about the Fe ions in these complexes. Thus, both Mössbauer and XAS analysis indicate that 1, 2, and 3-Na have the same oxidation state at iron. Since $\\mathbf{1}$ is clearly iron(II), this suggests an iron(II) oxidation state in 3-Na, which in turn implies that the formazanates are reduced to radical dianions - in agreement with the metrical analysis described above.\n\nThe room temperature magnetic moment ( $\\mu_{\\mathrm{eff}}$ ) in THF- $d_{8}$ solution using the Evans method was $6.95 \\pm 0.3 \\mu_{\\mathrm{B}}$, which is comparable to the value obtained from SQUID measurements of a solid sample in the temperature range 50-300 K, $\\mu_{\\mathrm{eff}}=7.6 \\mu_{\\mathrm{B}}$ (Figure S19). The experimental values are close to the spin-only (s.o.) value for four uncoupled spin centers, two $S_{\\mathrm{Fe}}=2$ and two ligand radicals $S_{\\mathrm{rad}}=1 / 2$, namely $\\mu_{\\text {eff, s.o. }}=g_{e} \\sqrt{ }[2(2+1)+2(2+1)+$ $1 / 2(1 / 2+1)+1 / 2(1 / 2+1)]=7.3 \\mu_{\\mathrm{B}}$. The temperature independence of $\\mu_{\\mathrm{eff}}(\\mathrm{T})$ in this temperature range indicates is consistent with this model requires that the various pair exchange coupling constants $\\left|J_{i j}\\right|$ between the four spins would need to be less than a few wavenumbers (Figure S19). Unfortunately, the low-temperature magnetic data are severely obscured by steep overshooting of $\\mu_{\\mathrm{eff}}(\\mathrm{T})$ below $50 \\mathrm{~K}$, presumably due to intermolecular interactions, which prevented us from further characterizing $J$ values or zero-field splitting. Qualitative, rough fits (adopting grad $=g_{e}$ for the radicals) suggest weak to moderate zerofield splitting for iron, iron-radical coupling of $\\left|J_{\\mathrm{Fe}-\\mathrm{rad}}\\right|<5 \\mathrm{~cm}^{-1}\\left(\\hat{H}_{\\mathrm{ex}}=-2 J S_{1} \\cdot S_{2}\\right)$, and $g_{F e}$ $=2.07$.\n\nIt is not a priori clear why exchange coupling between iron(II) centers and their coordinated ligand radicals in 3-Na should be weak, whereas the monomeric ferrous compound 2 shows strong local spin coupling. ${ }^{24}$ We presume that the reason is small overlap and nearorthogonality of magnetic orbitals in the quasi-tetrahedral coordination. We also considered a model of very strong antiferromagnetic exchange coupling between each iron(II) centers and the ligand radical coordinated to it (as in 2), but weak coupling between the two sides. This model is made up of two local site spins $S^{\\prime}=3 / 2$, and predicts a spin-only magnetic moment of $\\mu_{\\text {eff, s.o. }}=g_{e} v[3 / 2(3 / 2+1)+3 / 2(3 / 2+1)]=5.5 \\mu_{\\mathrm{B}}$, much lower than observed. Thus, the iron $g$-value would have to be $g_{F e}=2.64$ to match the experimental magnetic data. Since this value is far above the (geometrically averaged) $g$-value for 2 obtained from EPR simulations ( $g_{\\mathrm{av}}=2.35$ ), ${ }^{24}$ this model of strong iron-radical coupling for 3-Na is not defensible, particularly as the corresponding large zero-field splitting of $2\\left(D=16 \\mathrm{~cm}^{-1}\\right)$ is not consistent with the magnetic data of 3-Na (Figure S19).\n\nThe ${ }^{1} \\mathrm{H}$ NMR spectrum of 3-Na in THF- $d_{8}$ shows resonances in the range from $+160$ to $-70$ $\\mathrm{ppm}$, and the number and integration of the peaks indicates that the two $\\mathrm{SiMe}_{3}$ groups are chemically inequivalent (Figure S1). Several protons on the formazanate are also split into pairs, suggesting that the dinuclear structure, with its lowered symmetry, is retained in solution. However, over time it fully converts to a new species (Figure S2), which has a similar ${ }^{1} \\mathrm{H}$ NMR spectrum and green color as complex 2 (Figure S3), consistent with dissociation of the dimer to a mononuclear species (4-Na, Scheme 3). The rate of the dissociation of 3-Na to 4-Na in THF- $d_{8}$ was monitored between 273-313 $\\mathrm{K}$ by ${ }^{1} \\mathrm{H}$ NMR spectroscopy (Figure 4), and the concentrations followed an exponential time dependence indicating a rate law rate $=k_{\\text {obs }}$ [3-Na] (see SI for more details). Fitting the decay curves using Eq. 1 afforded rate constants, which were used to generate an Eyring plot (Figure S10) that gave the activation parameters $\\Delta H^{\\ddagger}=28.0 \\pm 1.1 \\mathrm{kcal} \\mathrm{mol}^{-1}$ and $\\Delta S^{\\ddagger}=-14.8 \\pm 3.7 \\mathrm{cal}$ $\\mathrm{mol}^{-1} \\mathrm{~K}^{-1}$. The loss in entropy in the transition state indicates an ordered early transition state that could involve binding of exogenous THF molecules to the Na atoms. This is consistent with the observation that the addition of two equiv of 12-crown-4 to complex 3Na significantly increased the rate of dimer dissociation, and gives mononuclear complex 2 as previously reported. Moreover, in the solid state structure of the K analogue of 4-Na (see below) four THF molecules are bound to K, supporting the idea that incorporation of an additional THF molecule is feasible.\n\n\\[\n[3-\\mathbf{N a}]_{t}-[3-\\mathbf{N a}]_{\\text {final }}=[\\mathbf{3}-\\mathbf{N a}]_{0} e^{-k t}\n\\]\n\nCooling mixtures of dissociated 4-Na gives no increase in dimer concentration as judged by ${ }^{1} \\mathrm{H}$ NMR spectroscopy, indicating that the dissociation of the dimer is irreversible in dilute solution. However, crystallization from THF/pentane mixtures where 3-Na has fully converted to 4-Na affords solely black crystals of the dimer 3-Na. Analysis of a frozen THF solution of 3-Na that has partially dissociated into 4-Na by Mössbauer spectroscopy showed two signals that have isomer shift and quadrupole splitting parameters within the error margin of those for pure samples of 2 and 3-Na (Figure S17). Although dissociation of the dimer is irreversible in THF solution, we propose that an equilibrium involving the different coordination modes of the formazanate is present that enables crystallization as a dimer (Scheme 3). The room-temperature ${ }^{1} \\mathrm{H}$ NMR spectra of 2 and 4-Na in THF- $d_{8}$ both show a single species with a number of peaks indicating idealized $C_{2 V}$ symmetry. However, the observed resonances broaden and start to deviate from Curie behavior below $-50{ }^{\\circ} \\mathrm{C}$ (Figure S6 and S7), which could be due to intermediate exchange between formazanate binding modes on the NMR time scale. However, we were unable to resolve details because the spectra remained difficult to interpret at $-90^{\\circ} \\mathrm{C}$, which was the lower temperature limit of the NMR spectrometer.\n\nIntrigued by the change in formazanate binding mode induced by a coordinating Na cation, we investigated the effect of using different alkali metal reductants. The addition of $\\mathrm{MC}_{8}(\\mathrm{M}$ $=\\mathrm{K}, \\mathrm{Rb}$ or $\\mathrm{Cs}$ ) to a THF solution of $\\mathbf{1}$ at $-78^{\\circ} \\mathrm{C}$ gives a dark green solutions upon warming\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_48fb54662c601e035a91g-06_2189_2235_516_1804}\\\\\nand 3-Cs as dark crystalline solids (Scheme 4). Interestingly, rapid crystallization of 3-K from a THF/pentane mixture afforded two different crystal morphologies. ${ }^{1} \\mathrm{H}$ NMR spectroscopy in THF- $d_{8}$ and Mössbauer spectroscopy of the obtained solids, and single crystal X-ray diffraction revealed a mixture of dimer 3-K (see below) and monomer 4-K. Although monomer 4-K was a minor component in the mixture, its solid state structure can be analyzed (Figure 5). The FeN and intraligand bond lengths in 4-K are within the uncertainty limits of the solid state structure of complex $\\mathbf{2}$. A notable difference is that the potassium cation is bound to N21, three THF molecules and has close contacts to C22 and C31. Crystallization of 5 from a THF solution with less pentane at $-40^{\\circ} \\mathrm{C}$, thereby slowing down the crystallization process, gives a crystalline material comprising $>95 \\% 4-\\mathbf{K}$ based on ${ }^{1} \\mathrm{H}$ NMR and Mössbauer spectroscopies.\n\nAlthough we obtained crystals of 3-K, 3-Rb and 3-Cs suitable for single crystal X-ray diffraction, the rapid desolvation of the crystalline material, when transferred from the mother liquor to the immersion oil, resulted in poorly diffracting crystals. Fortunately, handling at temperatures below $-40^{\\circ} \\mathrm{C}$ in combination with cryo-mounting of the crystals (see SI for more details), led to solid state structures of all dimers (Figure 6). In agreement with the observed rapid desolvation of the crystals, several solvent molecules are in the asymmetric units. The quality of the structures of 3-K and 3-Cs was of lower quality than the other dimers (3-K diffracted weakly, and 3-Cs appears to have whole molecule disorder; see SI for details), so the structural detail is limited. Overall, it is clear that all complexes have a similar dimeric core structure as 3-Na where the formazanate has isomerized. No significant deviations in Fe-ligand bond distances are observed between the four dimers (Table 1). However, the manner in which the alkali cations are bound varies greatly. Whereas each formazanate in complex 3-Na is bound to a single Na cation, in 3-K, 3-Rb and 3-Cs one alkali cation bridges between the N21 and N25 of two separate formazanates. Close interactions with several other atoms in the N-phenyl substituent are also observed, which is in agreement with the softer nature of the larger cations favoring interaction with delocalized $\\pi$ systems over the harder $\\mathrm{N}$ atom. ${ }^{34}$ The other alkali cation is separated from the dimer and has only THF solvent molecules coordinated in the solid state structures of 3-K and 3-Rb. Interestingly, in the solid state structure of complex 3-Cs the second Cs cation is also bound to the N21 and N25 to yield a repeating polymeric structure (Figure S18).\n\nThe zero-field Mössbauer spectra of 3-K, 3-Rb and 3-Cs show doublets with isomer shifts that are indistinguishable from that of 3-Na (Table 3, Figure S8). The observed quadrupole splittings of 3-K, 3-R $\\mathbf{B}$ and 3-Cs range from $2.16-2.18 \\mathrm{~mm} \\mathrm{~s}^{-1}$, which is slightly different from the quadrupole splitting of solid 3-Na. This is likely due to the different binding mode of the alkali cations, which is also reflected N-Fe-N bond angles of the dimers (Table 2).\n\nThe ${ }^{1} \\mathrm{H}$ NMR spectra and solution magnetic moments of 3-K, 3-Rb and 3-Cs in THF- $d_{8}$ are similar to that of 3-Na in THF- $d_{8}$, indicating that the dimeric structures are retained in solution. Similarly, 3-K, 3-Rb and 3-Cs also convert to the corresponding monomers as judged by ${ }^{1} \\mathrm{H}$ NMR spectroscopy. However, the rate at which the dimer breaks up in solution is highly dependent on the cation that is present (Figure 7). Complex 3-Cs is the most rapid $\\left(k_{\\text {obs }}=5.89 \\pm 0.03 \\times 10^{-4} \\mathrm{~s}^{-1}\\right)$ after 3-Rb $\\left(k_{\\text {obs }}=1.66 \\pm 0.01 \\times 10^{-4} \\mathrm{~s}^{-1}\\right)$ and $3-\\mathbf{K}\\left(k_{\\text {obs }}=\\right.$ $\\left.6.37 \\pm 0.04 \\times 10^{-5} \\mathrm{~s}^{-1}\\right)$. Though these follow a trend where the heavier alkali metal cation is fastest, the decay rate of 3-K is slower than that of 3-Na $\\left(k_{\\text {obs }}=8.50 \\pm 0.08 \\times 10^{-5} \\mathrm{~s}^{-1}\\right)$, breaking the periodic trend.\n\n\\section{Discussion}\n\\section{Interaction of Alkali Metals with Reduced Formazanate-Iron Complexes: Influences on Structure and Dynamics}\nThe reduction of complex $\\mathbf{1}$ in THF solution by different alkali metals gives dimeric complexes (3) featuring a rearranged formazanate. The formazanate binding mode in the dimeric complexes is stabilized by cation- $\\pi$ interactions with alkali metal cations. Although the different cations do not significantly alter the intraligand bond lengths of the rearranged formazanate, the interplanar angle $(\\theta)$ and centroid-centroid distance $(\\zeta)$ between the fivemembered metallacycles significantly increases with the larger cations (Table 4). This trend is consistent with increasing ionic radii of the corresponding alkali cations, and likely results in the observed differences in the $\\mathrm{N}-\\mathrm{Fe}-\\mathrm{N}$ bond angles (Table 2).\n\nAlthough the dimeric nature is retained in solution as judged by initial ${ }^{1} \\mathrm{H}$ NMR spectra, each dimer converts completely into the corresponding monomeric species in THF solution. Interestingly, the rate at which this process occurs varies greatly between the dimers. The slow rate of dissociation of 3-K shows that the energy barrier for dimer/monomer interconversion is higher than for the other complexes. This could explain why $\\mathbf{4 - K}$ was the only one that could be crystallized as a monomer, because the higher barrier would also slow the reverse reaction, dimerization upon crystallization.\n\nA periodic trend for the rates of monomer formation is observed with $\\mathrm{K}<\\mathrm{Rb}<\\mathrm{Cs}$, which correlates with weaker cation- $\\pi$ interactions as the $z / r$ ratio of the cations decreases. This may arise from a stronger cation- $\\pi$ interaction with smaller alkali cations, which stabilizes the isomerized binding mode of the formazanate, and increases the activation energy for isomerization and splitting of the dimer. The deviation of the periodic trend for the Na analogue could be ascribed to the different binding of the alkali cations in 3-Na, where each rearranged formazanate has an interaction with a separate alkali cation in contrast with the bridging alkali cation observed in 3-K, 3-Rb and 3-Cs. The difference in 3-Na also influences the iron center, as judged by the subtly different quadrupole splitting in the Mössbauer spectrum of 3-Na in comparison to 3-K, 3-Rb and 3-Cs. The rate of dimer cleavage is faster for 3-Na than expected from the periodic trend, suggesting that the Na cations hold the core into the dimeric structure more weakly, which is consistent with the more central position of the alkali metal cations in 3-K, 3-Rb and 3-Cs. Alternatively, the relative rates of monomer formation could be due to the need for THF to access the alkali metal cation, which is suggested by the negative activation entropy for 3-Na going to 4-Na. In this alternative explanation, the faster rates for the larger cations would result from the larger size and faster expected exchange rate for solvent.\n\nAnalysis of the chemical shifts in the ${ }^{1} \\mathrm{H}$ NMR spectra of the dimers shows another trend between the chemical shift with the size of the alkali metal for 3-K, 3-R $\\mathbf{b}$ and 3-Cs, but the trend does not fit well for all resonances of 3-Na (Figure S4), suggesting that the structural differences noted above are also retained in solution. After dissociation into the monomeric complexes, the chemical shifts in the ${ }^{1} \\mathrm{H}$ NMR spectra also vary greatly by alkali cation (Figure 8). Comparison of the chemical shifts with complex 2 , which has a fully separated ion pair in solution, shows that the chemical shifts move towards a narrower range going from 2 to 4-Na, 4-K, 4-Rb and 4-Cs. In this case the Na monomer does fit the periodic trend. Assuming that in solution the Na cation is fully sequestered by the crown ethers for 2 , this trend in chemical shifts could be interpreted by a strengthening cation- $\\pi$ interaction between the formazanate and alkali cation in the series 4-Na, to 4-K, to 4-Rb to 4-Cs. However, this would be opposite to the typical trend in magnitudes of cation- $\\pi$ interactions, which are known to become weaker as the ion becomes larger. ${ }^{8}$ Therefore, a more likely explanation is that the alkali cation and THF ligands (Figure 5) perturb the geometry of the monomeric complex in solution to accommodate the cation- $\\pi$ interaction. This effect would be more pronounced with increasing alkali cation size, as observed in the solid state structures of dimers 3-K, 3-R $\\mathbf{b}$ and 3-Cs, in agreement with the biggest change in chemical shifts between 2 and 4-Cs.\n\n\\section{Electronic structure of 3-Na}\nMössbauer and X-ray absorption spectra show experimentally that two high-spin iron(II) centers are present in 3, which implies that the two formazanate ligands are not in their usual closed-shell state but rather are reduced, open-shell radicals. The intraligand distances are distorted from that in conventional iron(II)-formazanate complexes, further supporting the assignment of a reduced formazanate.\n\nThe magnetic susceptibility data for 3-Na indicate very little magnetic coupling between the radical ligands and the iron(II) centers. It is notable that there is a short distance between the two N4 atoms of each formazanate ligand in 3 (2.989(5) - 3.046(4) A. Table 4). In addition, the two five-membered metallacyles are parallel alignment and are separated by only $3.11$ $3.37 \\AA$ in this series, indicating a $\\pi-\\pi$ interaction like those that have been reported for several chelating $\\pi$ radical ligands. ${ }^{35}$ For example, two $o$-diiminosemiquinonate ligand radicals coordinated to zirconium(IV) are aligned parallel, and the short interligand separation of $3.42 \\AA$ gives rise to intramolecularly antiferromatic coupling between this two spin centers in this complex. ${ }^{36}$ Moreover, in the previous forum on redox-active ligands, Scarborough and Wieghardt described a similar intramolecular $\\pi \\cdot-\\pi \\cdot$ antiferromagnetic interaction in a dimeric complex between two bipyridine radicals. ${ }^{37}$ In the system described here, details of weak coupling were obscured by low-temperature deviations in the SQUID magnetometry data, so we were unable to glean further experimental evidence.\n\nTo gain insight into the electronic structure of the dimeric complexes, the ground state electronic structure of 3-Na was calculated using DFT calculations at the B3LYP/ZORA level of theory, using the broken symmetry (BS) formalism to give localized spins in an overall singlet state $\\left(M_{\\mathrm{S}}=0\\right)$ ). The electronic structure derived from a BS $(5,5)$ calculation has five pairs of magnetic orbitals (the members of each pair are related to the other half of the dimer by symmetry), which are antiferromagnetically coupled to give the singlet ground state (Figure 9). The high-spin $\\mathrm{M}_{S}=5$ solution is $15.9 \\mathrm{kcal} \\mathrm{mol}^{-1}$ less favored than the BS solution.\n\nThe DFT methodology is limited because BS calculations can only partition a molecule into two orbital fragments, one with spin-up electrons ( $a$-spin) and the other spin-down electrons ( $\\beta$-spin). Of the five pairs of magnetic orbitals, three can be described as Fe-based $\\mathrm{d}_{X Z}, \\mathrm{~d}_{y z}$, $\\mathrm{d}_{z} 2$ orbitals of one Fe ion in the $a$-spin manifold that are antiferromagnetically coupled to the corresponding $\\beta$-spin of matching symmetry on the other Fe ion. The computed overlap integrals (S) between these $\\mathrm{d}$ orbitals in 3-Na are all very small, underscoring the essentially non-existent coupling between these well-separated spin centers. The highest doublyoccupied MOs are based on the $\\mathrm{d}_{x^{2}-y^{2}}$ orbital for each Fe ion. The remaining two pairs of magnetic orbitals share Fe and formazanate character. The remaining $\\mathrm{d}$ orbital $\\left(\\mathrm{d}_{x y}\\right)$ has the correct symmetry to overlap with the highest ligand-based $\\pi^{*}$ orbital (two $\\mathrm{N}-\\mathrm{N} \\pi^{*}$ interactions) previously assigned with $\\mathrm{a}_{2}$ symmetry for the formazanate ligand. ${ }^{24}$ The bonds between the $\\mathrm{d}_{X y}$ and formazanate are highly polarized, giving rise to an antiferromagnetic interaction between this symmetry-matched pair. The most unusual aspect comes from the exocyclic nitrogen (N4), which has a bonding interaction with the other $F$ $\\mathrm{d}_{X y}$ orbital that is visible in the lowest magnetic orbital with $\\mathrm{S}=0.59$ (Figure 9). This four-spin ensemble is challenging to compute because of the aforementioned limitations of BS-DFT, and the result here is one where the calculation mixes two pairs of SOMOs that are very close in energy, with polarized metal-ligand bonds at one end and covalent bonds at the other. The most appropriate description is that the first pair are predominantly ligand-centered with significant $F e \\mathrm{~d}_{x y}$ content that produces a large overlap integral. The second pair can be considered almost exclusively the $\\mathrm{d}_{X Y}$ orbital of each Fe ion, who have a significantly smaller overlap integral (Figure 9).\n\nThis description is consistent with the Mössbauer and Fe K-edge data that diagnose two high-spin iron(II) $(S=2)$ ions, which are each coordinated by a dianionic formazanate radical $(S=1 / 2)$. This description is supported by the Mulliken spin population analysis, where $3.6$ spins are found on each Fe with significant spin of the opposing sign on the coordinated dianionic formazanate radical ligands (Figure 10). This value is lower than four spins for each high-spin iron(II) center as a result of the covalent interaction with the exocyclic nitrogen that distributes some spin (of the same sign) on to the formazanate ligand. Though the calculations predict stronger antiferromagnetic coupling than we observe in the magnetic data, we ascribe the difference to the limitations of the BS formalism in a four-spin system as described above.\n\nOverall, the resonance structures in Scheme 5 best describe the electronic structure of the rearranged formazanate radical dianions in 3 as they are in agreement with the presence two high-spin Fe centers, and reflect the intra- and interligand bond distances and computational data. The dimerization that is facilitated by the ligand rearrangement produces a pair of strongly coupled magnetic orbitals that are predominantly ligand in character though have a sizeable metal content by virtue of a bonding interaction between the exocyclic nitrogen and the other iron center. The net result is two high-spin iron(II) ions characterized by four highly localized magnetic orbitals that are weakly coupled on account of their large spatial separation. This general electronic structure description accurately reflects the physical characterization data despite the limitations of the BS-DFT calculations in reproducing the magnetic coupling. Moreover, it is unique among these iron-formazanate complexes, as the monometallic species $\\mathbf{2}$ and $\\mathbf{4}$ present a more common electronic configuration, that of a $\\pi-$ radical ligand $\\left(S_{\\mathrm{L}}=1 / 2\\right)$ strongly antiferromagnetically coupled to a paramagnetic metal ion $\\left(S_{\\mathrm{Fe}}=2\\right.$ ) to give an $S=3 / 2$ spin ground state. These studies show the significant effect that cation- $\\pi$ interactions can have on metal complexes with redox-active ligands. The observed rearranged formazanate binding mode is stabilized to different extent by the various alkali cations, which is reflected in the different solid state structures and observed decay rates for the dimers. The results show that cation- $\\pi$ interactions not necessarily only affect the electronic structure according to periodic trends but that the difference in size can also change result in different chemical structure.\n\n\\section{Conclusion}\nIn the absence of a crown ether, one-electron reduction of complex $\\mathbf{1}$ by alkali metals results in the formation of dimeric complexes wherein the formazanate ligand has rearranged to form a five-membered metallacycle that is coordinated to the alkali cation. The electronic structure has two uncoupled high spin iron(II) centers and two ligand radicals as shown by Mössbauer, XAS, and DFT. Different alkali cations not only result in different orientations of the rearranged formazanate ligand but also affects how these dimers are converted to monomeric species in solution. Moreover, the difference in how the alkali cation is bound in the sodium dimer is shown to transcend periodic trends in terms of reactivity. This work demonstrates the considerable effect that Lewis-acidic cations can have on systems containing redox-active ligands, and shows the possibilities for tuning of structure and reactivity by choice of cation.\n\n\\section{Supplementary Material}\nRefer to Web version on PubMed Central for supplementary material.\n\n\\section{Acknowledgments}\nThis work was supported by The Netherlands Organization for Scientific Research (Rubicon Postdoctoral Fellowship 680-50-1517 to D.L.J.B.) and the National Institutes of Health (Grant GM-065313 to P.L.H.). K.L.M. thanks the A. P. Sloan Foundation and the National Science Foundation (CHE-1454455) for funding.\n\n\\section{References}\n\\begin{enumerate}\n  \\item a) Sigel A, Sigel H, Sigel RKO. The Alkali Metal Ions: Their Role for Life. Springer Cham; 2016. b) Ma JC, Dougherty DA. The Cation- $\\pi$ Interaction. Chem Rev. 1997; 97:1303-1324. [PubMed: 11851453] c) Dougherty DA. Cation-pi interactions in chemistry and biology: A new view of benzene, Phe, Tyr, and Trp. Science. 1996; 271:163-168. [PubMed: 8539615] d) Riordan JF. The role of metals in enzyme activity. Ann Clin Lab Sci. 1977; 7:119-129. [PubMed: 192123]\n\n  \\item a) Connor GP, Holland PLH. Coordination chemistry insights into the role of alkali metal promoters in dinitrogen reduction. Catal Today. 2017; 286:21-40. [PubMed: 28344387] b) Williams FJ, Palermo A, Tikhov MS, Lambert RM. Mechanism of alkali promotion in heterogeneous catalysis under realistic conditions: application of electron spectroscopy and electrochemical promotion to the reduction of NO by CO and by propene over rhodium. Surf Sci. 2001; 482-485:177-182.c) Oukaci R, Wu JCS, Goodwin JG Jr. Secondary Reactions during CO Hydrogenation on ZeoliteSupported Metal Catalysts: Influence of Alkali Cations. J Catal. 1987; 107:471-481.d) Mross WD. Alkali doping in heterogeneous catalysis. Catal Rev Sci Eng. 1983; 25:591-637.\n\n  \\item a) McWilliams SF, Rodgers KR, Lukat-Rodgers G, Mercado BQ, Grubel K, Holland PLH. Alkali Metal Variation and Twisting of the FeNNFe Core in Bridging Diiron Dinitrogen Complexes. Inorg Chem. 2016; 55:2960–2968. [PubMed: 26925968] b) González-Riopedre G, Bermejo MR,\n\n\\end{enumerate}\n\nFernández-García MI, Gonzalez-Noya AM, Pedrido R, Rodríguez-Douton MJ, Maneiro M. Alkali- Metal-Ion-Directed Self-Assembly of Redox-Active Manganese(III) Supramolecular Boxes. Inorg Chem. 2015; 54:2512–2521. [PubMed: 25706445]\n\n\\begin{enumerate}\n  \\setcounter{enumi}{3}\n  \\item Reath AH, Ziller JW, Tsay C, Ryan AJ, Yang JY. Redox Potential and Electronic Structure Effects of Proximal Nonredox Active Cations in Cobalt Schiff Base Complexes. Inorg Chem. 2017; 56:3713-3718. [PubMed: 28240885]\n\n  \\item Grubel K, Brennessel WW, Mercado BQ, Holland PL. Alkali Metal Control over N-N Cleavage in Iron Complexes. J Am Chem Soc. 2014; 136:16807–16816. [PubMed: 25412468]\n\n  \\item a) Kita MR, Miller AJM. An Ion-Responsive Pincer-Crown Ether Catalyst System for Rapid and Switchable Olefin Isomerization. Angew Chem Int Ed. 2017; 56:5498–5502.b) Kita MR, Miller AJM. Cation-Modulated Reactivity of Iridium Hydride Pincer-Crown Ether Complexes. J Am Chem Soc. 2014; 136:14519–14529. [PubMed: 25275727] c) Moore CM, Bark B, Szymczak NK. Simple Ligand Modifications with Pendent $\\mathrm{OH}$ Groups Dramatically Impact the Activity and Selectivity of Ruthenium Catalysts for Transfer Hydrogenation: The Importance of Alkali Metals. ACS Catal. 2016; 6:1981-1990.d) Bosch H, Van Ommen JG, Gellings PJ. On the role of alkali metals in ammonia synthesis. Appl Catal. 1985; 18:405-408.\n\n  \\item a) Rohling R, Hensen E, Pidko EA. Multi-site cooperativity in alkali-exchanged faujasites for the production of biomass derived aromatics. Chem Phys Chem. 2018; 19:446-458. [PubMed: 29105288] b) Sivaguru J, Natarajan A, Kaanumalle LS, Shailaja J, Uppili S, Joy A, Ramamurthy V. Asymmetric Photoreactions within Zeolites: Role of Confinement and Alkali Metal Ions. Acc Chem Res. 2003; 36:509–521. [PubMed: 12859212] c) O'Neill MA, Cozens FL. Influence of alkali metal cations on the photoheterolysis of 9-cyclopropyl-9-fluorenol and the reactivity of the 9cyclopropyl-9-fluorenyl cation in non-acidic zeolites. Can J Chem. 2003; 81:647-659.d) Jackman LM, Lange BC. Structure and reactivity of alkali metal enolates. Tetrahedron. 1977; 33:2737–2769.\n\n  \\item a) Rodgers MT, Armentrout PB. Cationic noncovalent interactions: energetics and periodic trends. Chem Rev. 2016; 116:5642-5687. [PubMed: 26953819] b) Dougherty DA. The Cation- $\\pi$ Interaction. Acc Chem Res. 2013; 46:885–893. [PubMed: 23214924] c) Mecozzi S, West AP Jr, Dougherty DA. Cation- $\\pi$ interactions in simple aromatics: electrostatics provide a predictive tool. J Am Chem Soc. 1996; 118:2307–2308.\n\n  \\item a) Lambert C, von Raqué Schleyer P. Are Polar Organometallic Compounds \"Carbanions\"? The Gegenion Effect on Structure and Energies of Alkali-Metal Compounds. Angew Chem. 1994; 106:1187-1199.b) Shannon RD. Revised effective ionic radii and systematic studies of interatomic distances in halides and chalcogenides. Acta Crystallogr, Sect A. 1976; A32:751–767.\n\n  \\item Torvisco A, Ruhlandt-Senge K. $s$-Block Organometallics: Analysis of Ion-Association and Noncovalent Interactions on Structure and Function in Benzyl-Based Compounds. Inorg Chem. 2011; 50:12223-12240. [PubMed: 21958062]\n\n  \\item Henderson KW, Dorigo AE, Liu Q-Y, Williard PG. Effect of Polydentate Donor Molecules on Lithium Hexamethyldisilazide Aggregation: An X-ray Crystallographic and a Combination Semiempirical PM3/Single Point ab Initio Theoretical Study. J Am Chem Soc. 1997; 119:1185511863.Torvisco A, Decker K, Uhlig F, Ruhlandt-Senge K. Heavy Alkali Metal Amides: Role of Secondary Interactions in Metal Stabilization. Inorg Chem. 2009; 48:11459-11465. [PubMed: 19902915] Bartlett RA, Hitchcock PB, Khvostov AV, Lappert MF, Protchenco AV. Ytterbium(II) amides and crown ethers: addition versus amide substitution. J Organomet Chem. 2002; 647:198204.Power PP. A Silicon-Nitrogen Analogue of the [PPN $]^{+}$Cation: Synthesis and Structural Characterization of the $\\left[\\mathrm{Ph}_{3} \\mathrm{SiNSiPh}_{3}\\right]$-Ion. J Am Chem Soc. 1987; 109:6509-6510.DiBiase SA, Gokel GW. Crown-Cation Complex Effects. 8. Reactions of Crown Ether Activated tert-Butoxide Ion. J Org Chem. 1978; 43:447-452.\n\n  \\item Selected recent examples: Buscagan TM, Oyala PH, Peters JC. $\\mathrm{N}_{2}$-to- $\\mathrm{NH}_{3}$ Conversion by a triphos-Iron Catalyst and Enhanced Turnover under Photolysis. Angew Chem Int Ed. 2017; 56:6921-692.MacLeod KC, Lewis RA, DeRosha DE, Mercado BQ, Holland PL. C-H and C-N Activation at Redox-Active Pyridine Complexes of Iron. Angew Chem Int Ed. 2017; 56:10691072.Chakraborty U, Demeshko S, Meyers F, Rebreyend C, de Bruin B, Atanasov M, Neese F, Mühldorf B, Wolf R. Electronic Structure and Magnetic Anisotropy of an Unsaturated Cyclopentadienyl Iron(I) Complex with 15 Valence Electrons. Angew Chem Int Ed. 2017; 56:7995-7999.McNeill E, Ritter T. 1,4-Functionalization of 1,3-Dienes With Low-Valent Iron Catalysts. Acc Chem Res. 2015; 48:2330–2343. [PubMed: 26214092] Anderson JS, Rittle J, Peters JC. Catalytic conversion of nitrogen to ammonia by an iron model complex. Nature. 2013; 501:84-87. [PubMed: 24005414]\n\n  \\item a) Hoyt JM, Schmidt VA, Tondreau AM, Chrik PJ. Iron-catalyzed intermolecular [2+2] cycloadditions of unactivated alkenes. Science. 2015; 349:960-963. [PubMed: 26315433] b) Wong L, Hernández Sánchez R, Logan JG, Zarkesh RA, Ziller JW, Heyduk AF. Disulfide reductive elimination from an iron(III) complex. Chem Sci. 2013; 4:1906–1910.c) Darmon JM, Stieber SCE, Sylvester KT, Fernández I, Lobkovsky E, Semproni SP, Bill E, Wieghardt K, DeBeer S, Chirik PJ. Oxidative Addition of Carbon-Carbon Bonds with a Redox-Active Bis(imino)pyridine Iron Complex. J Am Chem Soc. 2012; 134:17125–17137. [PubMed: 23043331] d) Smith AL, Hardcastle KI, Soper JD. Redox-Active Ligand-Mediated Oxidative Addition and Reductive Elimination at Square Planar Cobalt(III): Multielectron Reactions for Cross-Coupling. J Am Chem Soc. 2010; 132:14358–14360. [PubMed: 20879770] d) Blackmore KJ, Ziller JW, Heyduk AF. \"Oxidative Addition\" to a Zirconium(IV) Redox-Active Ligand Complex. Inorg Chem. 2005; 44:5559-5561. [PubMed: 16060604]\n\n  \\item a) Fujita D, Sugimoto H, Shiota Y, Morimoto Y, Yoshizawa K, Itoh S. Catalytic C-H amination driven by intramolecular ligand-to-nitrene one-electron transfer through a rhodium(III) centre. Chem Commun. 2017; 53:4849–4852.b) Jacquet J, Blanchard S, Derat E, Desage-El Murr M, Fensterbank L. Redox-ligand sustains controlled generation of $\\mathrm{CF}_{3}$ radicals by well-defined copper complex. Chem Sci. 2016; 7:2030–2036. [PubMed: 29899928] c) Broere DLJ, van Leest Reactivity of a Paramagnetic Pd Complex Bearing a Redox-Active o-Aminophenol-Derived NNO B, Reek JNH, Lutz M, Dechert S, van der Vlugt JI. Intramolecular redox-active ligand-to-substrate single-electron transfer: radical reactivity with a palladium (II) complex. J Am Chem Soc. 2014; 136:11574–11577. [PubMed: 24927362] e) Miyazato Y, Wada T, Muckerman JT, Fujita E, Tanaka\n\n\\end{enumerate}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-13_1171_1214_565_1782}\n\\end{center}\n\n\\begin{enumerate}\n  \\setcounter{enumi}{14}\n  \\item a) Jacquet J, Desage-El Murr M, Fensterbank L. Metal-Promoted Coupling Reactions Implying Ligand-Based Redox Changes. Chem Cat Chem. 2016; 8:3310–3316.b) Broere DLJ, Plessius R, van der Vlugt JI. New avenues for ligand-mediated processes-expanding metal reactivity by the use of redox-active catechol. o-aminophenol and o-phenylenediamine ligands. Chem Soc Rev. 20. Letko CS, Panetier JA, Head-Gordon M, Tilley TD. Mechanism of the Electrocatalytic Reduction of Protons with Diaryldithiolene Cobalt Complexes. J Am Chem Soc. 2014; 136:9364-9376. [PubMed: 24950387]\n\n  \\item a) Tondreau AM, Stieber SCE, Milsmann C, Lobkovsky E, Weyhermüller Semproni SP, Chirik PJ. Oxidation and Reduction of Bis(imino)pyridine Iron Dinitrogen Complexes: Evidence for Formation of a Chelate Trianion. Inorg Chem. 2013; 52:635-646. [PubMed: 23268722] b) Scott J, Vidyaratne Korobkov I, Gambarotta S, Budzelaar PHM. Multiple Pathways for Dinitrogen Activation during the Reduction of an Fe Bis(iminepyridine) Complex. Inorg Chem. 2008; 47:896-911. [PubMed: 18173261] c) Vidyaratne I, Scott J, Gambarotta S, Budzelaar PHM. Dinitrogen Activation, Partial Reduction, and Formation of Coordinated Imide Promoted by a Chromium Diiminepyridine Complex. Inorg Chem. 2007; 46:7040–7049. [PubMed: 17649991] Bouwkamp MW, Lobkovsky E, Chirik PJ. Bis(imino)pyridine Ligand Deprotonation Promoted by a Transient Iron Amide. Inorg Chem. 2006; 45:2–4. [PubMed: 16390032]\n\n  \\item Andrez J, Guidal V, Scopelliti R, Pécaut J, Gambarelli S, Mazzanti M. Ligand and Metal Based Multielectron Redox Chemistry of Cobalt Supported by Tetradentate Schiff Bases. J Am Chem Soc. 2017; 139:8628-8638. [PubMed: 28613072]\n\n  \\item a) Broere DLJ, Čorić I, Brosnahan A, Holland PLH. Quantitation of the THF Content in Fe[N(SiMe $\\left.)_{2}\\right]_{2} \\cdot x$ THF. Inorg Chem. 2017; 56:3140–3143. [PubMed: 28248496] b) Olmstead MM, Power PP, Shoner SC. Three-coordinate iron complexes: X-ray structural characterization of the amide-bridged dimers $\\left[\\mathrm{Fe}\\left(\\mathrm{NR}_{2}\\right)_{2}\\right]_{2}\\left(\\mathrm{R}=\\mathrm{SiMe}_{3}, \\mathrm{C}_{6} \\mathrm{H}_{5}\\right)$ and the adduct $\\mathrm{Fe}\\left[\\mathrm{N}\\left(\\mathrm{SiMe}_{3}\\right)_{2}\\right]_{2}(\\mathrm{THF})$ and determination of the association energy of the monomer $\\mathrm{Fe}\\left(\\mathrm{N}\\left(\\mathrm{SiMe}_{3}\\right)_{2}\\right]_{2}$ in solution. Inorg Chem. 1991; 30:2547–2551.c) Andersen RA, Faegri K, Green JC, Haaland A, Lappert MF, Leung W, Rypdal K. Synthesis of bis[bis(trimethylsilyl)-amido]iron(II). Structure and bonding in $\\mathrm{M}\\left[\\mathrm{N}\\left(\\mathrm{SiMe}_{3}\\right)_{2}\\right]_{2}(\\mathrm{M}=\\mathrm{Mn}, \\mathrm{Fe}, \\mathrm{Co})$ : two-coordinate transition-metal amides. Inorg Chem. 1988; 27:1782-1786.\n\n  \\item Broere DLJ, Mercado BQ, Lukens JT, Vilbert AC, Banerjee G, Lant HMC, Lee SH, Bill E, Sproules S, Lancaster KM, Holland PLH. Redox-Active Formazanates in Low-Coordinate Iron Chemistry. Submitted.\n\n  \\item a) Chang MC, Otten E. Intramolecular Hydride Transfer Reactions in Formazanate)Boron Dihydride Complexes. Organometallics. 2016; 35:534–542.b) Chang MC, Otten E. Synthesis and ligand-based reduction chemistry of boron difluoride complexes with redox-active formazanate ligands. Chem Commun. 2014; 50:7431-7433.\n\n  \\item Chang M-C, Roewen P, Travieso-Puente R, Lutz M, Otten E. Formazanate Ligands as Structurally Versatile, Redox-Active Analogues of $\\beta$-Diketiminates in Zinc Chemistry. Inorg Chem. 2015; 54:379-388. [PubMed: 25493709]\n\n  \\item Travieso-Puente R, Broekman JOP, Chang M-C, Demeshko S, Meyer F, Otten E. Spin-Crossover in a Pseudo-tetrahedral Bis(formazanate) Iron Complex. J Am Chem Soc. 2016; 138:5503-5506. [PubMed: 27074728]\n\n  \\item Mondol R, Snoeken DA, Chang M-C, Otten E. Stable, crystalline boron complexes with mono-, diand trianionic formazanate ligands. Chem Commun. 2017; 53:513-516.\n\n  \\item Chang M-C, Dann T, Day DP, Lutz M, Wildgoose GG, Otten E. The formazanate ligand as an electron reservoir: bis(formazanate) zinc complexes isolated in three redox states. Angew Chem Int Ed. 2014; 53:4118-4122.\n\n  \\item a) Ali A, Dhar D, Barman SK, Lloret F, Mukherjee R. Nickel(II) Complex of a Hexadentate Ligand with Two o-Iminosemiquinonato(1-) $\\pi$-Radical Units and Its Monocation and Dication. Inorg Chem. 2016; 55:5759–5771. [PubMed: 27232547] b) Broere DLJ, Plessius R, Tory J, Demeshko S, de Bruin B, Siegler MA, Hartl F, van der Vlugt JI. Localized Mixed Valence and Redox Activity within a Triazole-Bridged Dinucleating Ligand upon Coordination to Palladium. Chem Eur J. 2016; 22:13965–13975. [PubMed: 27531163] c) Broere DLJ, Metz LL, de Bruin B, Reek JNH, Siegler MA, van der Vlugt JI. Redox-Active Ligand-Induced Homolytic Bond Activation. Angew Chem, Int Ed. 2015; 54:1516-1520.\n\n  \\item Blanchard S, Neese F, Bothe E, Bill E, Weyermüller T, Wieghardt K. Square Planar vs Tetrahedral Coordination in Diamagnetic Complexes of Nickel(II) Containing Two Bidentate $\\pi$-Radical Monoanions. Inorg Chem. 2005; 44:3636–3656. [PubMed: 15877448] 32. Blanchard S, Bill E, Weyermüller T, Wieghardt K. $N, N$-Coordinated $\\pi$ Radical Anions of $S$ Methyl-1-phenyl-isothiosemicarbazide in Two Five-Coordinate Ferric Complexes [Fe ${ }^{\\mathrm{III}}\\left(\\mathrm{L}^{\\text {Me• }}\\right)_{2} \\mathrm{X}$ ] $\\left(\\mathrm{X}=\\mathrm{CH}_{3} \\mathrm{~S}^{-}, \\mathrm{Cl}^{-}\\right)$. Inorg Chem. 2004; 43:2324–2329. [PubMed: 15046508]\n\n  \\item MacMillan SN, Lancaster KM. X-ray Spectroscopic Interrogation of Transition-Metal-Mediated Homogeneous Catalysis: Primer and Case Studies. ACS Catal. 2017; 7:1776-1791.\n\n  \\item Davidson MG, Garcia-Vivo D, Kennedy AR, Mulvey RE, Robertson SD. Exploiting $\\sigma / \\pi$ Coordination Isomerism to Prepare Homologous Organoalkali Metal (Li, Na, K) Monomers with Identical Ligand Sets. Chem Eur J. 2011; 17:3364–3369. [PubMed: 21341333]\n\n  \\item a) Small D, Rosokha SV, Kochi JK, Head-Gordon M. Characterizing the Dimerizations of Phenalenyl Radicals by ab Initio Calculations and Spectroscopy: $\\sigma$-Bond Formation versus Resonance $\\pi$-Stabilization. J Phys Chem A. 2005; 109:11261-11267. [PubMed: 16331910] b) Small D, Zaitsev V, Jung Y, Rosokha SV, Head-Gordon M, Kochi JK. Intermolecular $\\pi-$-to- $\\pi$ Bonding between Stacked Aromatic Dyads. Experimental and Theoretical Binding Energies and Near-IR Optical Transitions for Phenalenyl Radical/Radical versus Radical/Cation Dimerizations. J Am Chem Soc. 2004; 126:13850–13858. [PubMed: 15493946] c) Pierpont CG, Buchanan RM. Transition metal complexes of o-benzoquinone, o-semiquinone, and catecholate ligands. Coord Chem Rev. 1981; 38:45–87.d) Pierpont CG, Buchanan RM. Distorted trigonal prismatic coordination in tris(9,10-phenanthrenequinone)molybdenum. J Am Chem Soc. 1975; 97:49124917.\n\n  \\item Ketterer NA, Fan H, Blackmore KJ, Yang X, Ziller JW, Baik M-H, Heyduk AF. $\\pi \\cdot-\\pi \\cdot$ Bonding Interactions Generated by Halogen Oxidation of Zirconium(IV) Redox-Active Ligand Complexes. J Am Chem Soc. 2008; 130:4364–4374. [PubMed: 18331029]\n\n  \\item Scarborough CC, Wieghardt K. Electronic Structure of 2,2' -Bipyridine Organotransition-Metal Complexes. Establishing the Ligand Oxidation Level by Density Functional Theoretical Calculations. Inorg Chem. 2011; 50:9773–9793. [PubMed: 21678919]\n\n\\end{enumerate}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-16_206_1377_596_1735}\n\\end{center}\n\nFigure 1.\n\nDisplacement ellipsoid plot (50\\% probability) of complex 3-Na. Hydrogen atoms and a THF molecule have been omitted, and part of the structure is depicted as a wireframe for clarity. See Tables 1 and 2 for metrical parameters.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-17_222_1003_641_1690}\n\\end{center}\n\nFigure 2.\n\nZero-field Mössbauer spectrum of a solid sample of $\\mathbf{3 - N a}$ at $80 \\mathrm{~K}$. The black circles are the data, the black line is a fit with two Lorentzians of equal intensity but slightly different line widths $\\left(\\gamma_{L}=0.328\\right.$ and $\\left.\\gamma_{R} 0.304\\right)$; the thin grey line is the residual from the fit.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-18_217_1182_565_1755}\n\\end{center}\n\nFigure 3.\n\nOverlay of the normalized Fe K-edge XAS spectra of 1 (violet), 2 (green), and 3-Na (black) at $10 \\mathrm{~K}$. Inset shows expansion of the pre-edge region.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-19_218_1148_579_1741}\n\\end{center}\n\nFigure 4.\n\nConcentration of dimer 3-Na $v s$ time in THF solution at various temperatures. Open circles are data points and solid lines are fitted curves. Log plots of the data are in the Supporting Information (Fig. S11-S16).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-20_230_1293_802_1518}\n\\end{center}\n\nFigure 5.\n\nDisplacement ellipsoid plot (50\\% probability) of 4-K. Hydrogen atoms are omitted and THF molecules are depicted in wireframe for clarity. Selected bond lengths $(\\AA)$ and angles $\\left(^{\\circ}\\right)$ :\n\nFe1-N11 1.933(1); Fe1-N41 1.937(1); Fe1-N14 1.944(1); N11-N21 1.362(2); N31-N41 1.358(2); N21-K1 2.865(1); C22-K1 3.344(1); C31-K1 3.213(1); N11-Fe1-N41 96.78(5); N11-Fe1-N14 133.75(5); N41-Fe1-N14 129.46(5).\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_48fb54662c601e035a91g-21_204_1064_515_1805}\n\nFigure 6.\n\nDisplacement ellipsoid plots (50\\% probability) of the complexes 3-Na, 3-K, 3-Rb and 3-Cs showing the core structures. Hydrogen atoms, select organic fragments and solvent molecules are omitted for clarity.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-22_209_1168_583_1737}\n\\end{center}\n\nFigure 7.\n\nConcentration of dimers 3-Na, 3-K, 3-Rb and 3-Cs $v s$ time in $d_{8}-\\mathrm{THF}$ at $21^{\\circ} \\mathrm{C}$. Open circles are data points and solid lines are fitted curves.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-23_209_1287_576_1739}\n\\end{center}\n\nFigure 8.\n\nStacked ${ }^{1} \\mathrm{H}$ NMR spectra of complex 2 (top) and dissociated complexes 4-Na, 4-K, 4-Rb and 4-Cs, showing the trends in chemical shifts upon binding of alkali cations.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_48fb54662c601e035a91g-24_204_1514_758_1562}\n\nFigure 9.\n\nQualitative MO scheme for 3-Na as derived from broken symmetry DFT calculations (B3LYP/ZORA). The Fe and formazanate (fz) content and spatial overlaps of the corresponding pairs of magnetic orbitals are given.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-25_210_1026_585_1740}\n\\end{center}\n\nFigure 10.\n\nMulliken spin population analysis for 3-Na (red: a-spin; yellow: $\\beta$-spin). Counterions and solvents have been removed for clarity.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-26_213_676_580_1740}\n\\end{center}\n\nScheme 1.\n\nPreviously reported ligand centered reduction of complex 1.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-27_213_752_579_1741}\n\\end{center}\n\nScheme 2.\n\nReduction of complex $\\mathbf{1}$ in the absence of 12-crown-4 to form dimer 3-Na.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-28_211_1442_446_1885}\n\\end{center}\n\nScheme 3.\n\nDissociation of complex 3-Na in solution into a monomeric complex 4-Na in which the different formazanate binding modes are in equilibrium, and irreversible conversion into 2 by addition of a crown ether.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-29_213_1359_602_1735}\n\\end{center}\n\nScheme 4.\n\nSynthesis of complexes 3-K, 3-Rb and 3-Cs and their decay to monomers in THF solution.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-30_209_474_625_1695}\n\\end{center}\n\nScheme 5.\n\nLimiting resonance forms for the rearranged formazanate radical dianion in dimers 3.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-31_213_579_651_1128}\n\\end{center}\n\n1\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-31_217_580_1208_1671}\n\\end{center}\n\n2\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-31_655_1004_931_1498}\n\\end{center}\n\n3-Na\n\nChart 1.\n\nAveraged metrical details of the formazanate ligands in complexes 1, 2 and 3-Na. The average error of a given bond distance is $\\pm 0.01 \\AA(3 \\sigma)$. Table 1\n\nSelected bond lengths ( $\\AA$ ) for the dimers.\n\n\\begin{center}\n\\begin{tabular}{lcccc}\n & 3-Na & 3-K & 3-Rb & 3-Cs \\\\\n\\hline\nFe1-N14 & $1.993(3)$ & $1.987(4)$ & $1.9910(2)$ & $1.985(5)$ \\\\\nFe2-N18 & $1.981(3)$ & $1.991(4)$ & $1.984(2)$ & $1.983(5)$ \\\\\n\\hline\nFe1-N11 & $2.014(3)$ & $2.051(3)$ & $2.043(2)$ & $2.025(5)$ \\\\\nFe2-N15 & $2.006(3)$ & $2.046(3)$ & $2.040(2)$ & $2.028(4)$ \\\\\n\\hline\nFe1-N31 & $2.067(3)$ & $2.053(4)$ & $2.055(2)$ & $2.051(4)$ \\\\\nFe2-N35 & $2.063(3)$ & $2.055(4)$ & $2.044(2)$ & $2.066(4)$ \\\\\n\\hline\nFe1-N45 & $2.032(3)$ & $2.055(3)$ & $2.053(2)$ & $2.030(5)$ \\\\\nFe2-N41 & $2.031(3)$ & $2.047(3)$ & $2.046(2)$ & $2.039(5)$ \\\\\n\\hline\nN11-N21 & $1.372(4)$ & $1.384(5)$ & $1.380(2)$ & $1.377(6)$ \\\\\nN15-N25 & $1.375(4)$ & $1.387(5)$ & $1.380(2)$ & $1.367(6)$ \\\\\n\\hline\nN21-C11 & $1.323(5)$ & $1.329(5)$ & $1.317(2)$ & $1.324(7)$ \\\\\nN25-C15 & $1.323(5)$ & $1.313(5)$ & $1.323(3)$ & $1.332(7)$ \\\\\n\\hline\nC11-N31 & $1.370(5)$ & $1.377(5)$ & $1.369(2)$ & $1.370(7)$ \\\\\nC15-N35 & $1.363(5)$ & $1.378(5)$ & $1.359(2)$ & $1.358(7)$ \\\\\n\\hline\nN31-N41 & $1.378(4)$ & $1.390(5)$ & $1.382(2)$ & $1.369(6)$ \\\\\nN35-N45 & $1.393(4)$ & $1.384(5)$ & $1.389(2)$ & $1.365(6)$ \\\\\nN21-M & $2.373(3)$ & $2.767(3)$ & $2.924(2)$ & $3.117(5)$ \\\\\nN25-M & $2.372(3)$ & $2.766(3)$ & $2.889(2)$ & $3.092(5)$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nTable 2\n\nSelected bond angles $\\left({ }^{\\circ}\\right)$ for the dimers.\n\n\\begin{center}\n\\begin{tabular}{lcccc}\n & 3-Na & 3-K & 3-Rb & 3-Cs \\\\\n\\hline\nN14-Fe1-N45 & $124.8(1)$ & $122.6(1)$ & $122.8(1)$ & $121.2(2)$ \\\\\nN18-Fe2-N41 & $122.7(1)$ & $123.0(1)$ & $123.2(1)$ & $120.5(2)$ \\\\\n\\hline\nN14-Fe1-N11 & $110.1(1)$ & $108.4(1)$ & $107.9(1)$ & $107.2(2)$ \\\\\nN18-Fe2-N15 & $109.4(1)$ & $108.6(1)$ & $107.9(1)$ & $108.1(2)$ \\\\\n\\hline\nN11-Fe1-N45 & $116.1(1)$ & $121.4(1)$ & $121.1(1)$ & $124.4(2)$ \\\\\nN15-Fe2-N41 & $117.3(1)$ & $120.5(1)$ & $121.2(1)$ & $123.8(2)$ \\\\\n\\hline\nN45-Fe1-N31 & $90.9(1)$ & $89.7(1)$ & $89.5(1)$ & $88.9(2)$ \\\\\nN41-Fe2-N35 & $90.3(1)$ & $89.5(1)$ & $89.5(1)$ & $88.7(2)$ \\\\\n\\hline\nN14-Fe1-N31 & $128.4(1)$ & $130.0(1)$ & $130.9(1)$ & $131.4(2)$ \\\\\nN18-Fe2-N35 & $132.2(1)$ & $130.2(1)$ & $130.1(1)$ & $132.8(2)$ \\\\\n\\hline\nN11-Fe1-N31 & $77.2(1)$ & $77.1(1)$ & $77.2(1)$ & $77.5(2)$ \\\\\nN15-Fe2-N35 & $77.4(1)$ & $77.3(1)$ & $77.1(1)$ & $77.1(2)$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\n\\section{Table 3}\nMössbauer parameters for solid samples of 3; experimental uncertainty is $\\pm 0.02 \\mathrm{~mm} \\mathrm{~s}^{-1}$.\n\n\\begin{center}\n\\begin{tabular}{ccc}\nComplex & $\\delta\\left(\\mathbf{m m ~ s}^{-1}\\right)$ & $\\left|\\Delta E_{\\mathbf{Q}}\\right|\\left(\\mathbf{m m ~ s}^{-\\mathbf{1}}\\right)$ \\\\\n\\hline\n3-Na & $0.74$ & $2.30$ \\\\\n\\hline\n3-K & $0.72$ & $2.16$ \\\\\n\\hline\n3-Rb & $0.71$ & $2.17$ \\\\\n\\hline\n3-Cs & $0.72$ & $2.18$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nTable 4\n\nDistances and angles between the 5-membered metallacycles and N4 atoms in of 3.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_48fb54662c601e035a91g-35_465_749_278_1045}\n\\end{center}\n\n\\begin{center}\n\\begin{tabular}{cccc}\nComplex & Angle $\\boldsymbol{\\theta}\\left({ }^{\\circ}\\right)$ & Distance $\\zeta(\\AA)$ & N4-N4 $(\\AA)$ \\\\\n\\hline\n3-Na & $18.3$ & $3.11$ & $3.046(4)$ \\\\\n3-K & $23.3$ & $3.21$ & $2.999(5)$ \\\\\n3-Rb & $25.9$ & $3.23$ & $2.998(2)$ \\\\\n3-Cs & $33.7$ & $3.37$ & $2.989(5)$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\n\n\\end{document}", "record_id": "2023_09_22_48fb54662c601e035a91g"}