{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{mathrsfs}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{UC Irvine }\n\n\\author{}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\n\\section{UC Irvine Previously Published Works}\n\\section{Title}\nComprehensive Experimental and Computational Spectroscopic Study of Hexacyanoferrate Complexes in Water: From Infrared to X-ray Wavelengths\n\n\\section{Permalink}\n\\href{https://escholarship.org/uc/item/6h84q4q1}{https://escholarship.org/uc/item/6h84q4q1}\n\n\\section{Journal}\nThe Journal of Physical Chemistry B, $122(19)$\n\n\\section{ISSN}\n1520-6106\n\n\\section{Authors}\n\\section{Ross, Matthew}\nAndersen, Amity\n\nFox, Zachary W\n\net al.\n\n\\section{Publication Date}\n2018-05-17\n\n\\section{DOI}\n10.1021/acs.jpcb. 7 b12532\n\nPeer reviewed\n\n\\section*{Comprehensive Experimental and Computational Spectroscopic Study of Hexacyanoferrate Complexes in Water: From Infrared to X-ray Wavelengths }\n\\textbackslash author\\{\\\\\nMatthew Ross, ${ }^{\\dagger}, \\mathscr{I l}\\left(10\\right.$ Amity Andersen, ${ }^{\\dagger}$ Zachary W. Fox, ${ }^{\\dagger}$ Yu Zhang, ${ }^{\\S, \\nabla}$ Kiryong Hong, ${ }^{\\|, O}$ Jae-Hyuk Lee,, \\textbackslash  Amy Cordones, ${ }^{\\|, \\dagger \\dagger}$ Anne Marie March, ${ }^{\\perp}$ Gilles Doumy, ${ }^{\\perp}$ Stephen H. Southworth, ${ }^{\\perp}$ Matthew A. Marcus,\n\n\\includegraphics[max width=\\textwidth]{2023_09_22_900c617369212d6bc72fg-02_705_766_200_1748} \\textbackslash  ${ }^{\\dagger}$ Department of Chemistry, University of Washington, Seattle, Washington 98115 , United States \\textbackslash  ${ }^{\\ddagger}$ Environmental Molecular Sciences Laboratory, Pacific Northwest National Laboratory, P.O. Box 999, Richland, Washington 99352, \\textbackslash  United States \\textbackslash  ${ }^{\\S}$ Department of Chemistry, Physics and Astronomy, University of California, Irvine, California 92697, United States\n\n\\includegraphics[max width=\\textwidth]{2023_09_22_900c617369212d6bc72fg-02_967_1020_198_1866} \\textbackslash  Laboratory, Berkeley, California 94720, United States \\textbackslash  ${ }^{\\perp}$ Chemical Sciences and Engineering Division, Argonne National Laboratory, Argonne, Illinois 60439, United States \\textbackslash  (S) Supporting Information\\\\\n\\}\n\n\\begin{abstract}\nWe present a joint experimental and computational study of the hexacyanoferrate aqueous complexes at equilibrium in the 250 $\\mathrm{meV}$ to $7.15 \\mathrm{keV}$ regime. The experiments and the computations include the vibrational spectroscopy of the cyanide ligands, the valence electronic absorption spectra, and Fe 1s core hole spectra using element-specificresonant $\\mathrm{X}$-ray absorption and emission techniques. Density functional theory-based quantum mechanics/molecular mechanics molecular dynamics simulations are performed to generate explicit solute-solvent configurations, which serve as inputs for the spectroscopy calculations of the experiments spanning the IR to X-ray wavelengths. The spectroscopy simulations are performed at the same level of theory across this large energy window, which allows for a systematic comparison of the effects of \n ![](http://10.128.0.40/eqn-images/2023_09_22_900c617369212d6bc72fg-02_1209_1633_1220_1933.jpg) explicit solute-solvent interactions in the vibrational, valence electronic, and core-level spectra of hexacyanoferrate complexes in water. Although the spectroscopy of hexacyanoferrate complexes in solution has been the subject of several studies, most of the previous works have focused on a narrow energy window and have not accounted for explicit solute-solvent interactions in their spectroscopy simulations. In this work, we focus our analysis on identifying how the local solvation environment around the hexacyanoferrate complexes influences the intensity and line shape of specific spectroscopic features in the UV/vis, X-ray absorption, and valence-to-core X-ray emission spectra. The identification of these features and their relationship to solutesolvent interactions is important because hexacyanoferrate complexes serve as model systems for understanding the photochemistry and photophysics of a large class of $\\mathrm{Fe}$ (II) and $\\mathrm{Fe}$ (III) complexes in solution.\n\\end{abstract}\n\n\\section{INTRODUCTION}\nThe development of transition-metal-based photosensitizers and photocatalysts hinges on both measuring and manipulating photoinduced motions of structural, electronic, spin, and vibrational degrees of freedom. Monitoring these coupled atomic and electronic motions in aqueous solutions is particularly important because many important photochemical energy-conversion reactions occur in the condensed phase. In addition, the local and long-range solvation environment can affect the photochemical reactivity and the efficacy of the energy-conversion process. Spectroscopic probes ranging from infrared to $\\mathrm{X}$-ray wavelengths are excellent reporters of the metal-ligand interactions, valence and core-electronic structure, and the solute-solvent dynamics of solvated transition- metal complexes. Relating the above spectroscopic observables to the molecular-level interactions often requires computational studies using a realistic solvation model.\n\nThe goal of this paper is to perform an experimental and computational study of the ferrous and ferric hexacyanide complexes dissolved in water in their electronic ground state and demonstrate how the solvation environment impacts the vibrational spectroscopy of the cyanide ligands and valence and core-level electronic spectroscopy of the iron atom.\n\nReceived: December 20, 2017\n\nRevised: April 2, 2018\n\nPublished: April 3, 2018 Ferrous $\\left(\\left[\\mathrm{Fe}(\\mathrm{CN})_{6}\\right]^{4-}\\right)$ and ferric $\\left(\\left[\\mathrm{Fe}(\\mathrm{CN})_{6}\\right]^{3-}\\right)$ hexacyanide complexes serve as prototypical model systems for understanding the structure and spectroscopy of $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}(\\mathrm{III})$ octahedral transition-metal complexes in solution and have been the subject of several studies. ${ }^{2-14}$ Along with equilibrium ground-state studies, the photochemistry of the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}(\\mathrm{III})$ complexes in solution has been studied with ultrafast IR, optical, and X-ray probes, revealing the role of coupled electronic and vibrational dynamics, ${ }^{15,16}$ nonequilibrium vibrational energy relaxation following charge-transfer excitation, ${ }^{17-19}$ photoaquation mechanisms, ${ }^{20,21}$ and core and valence orbital changes following photo-oxidation. ${ }^{13,17,22}$ In this paper, we focus on ground-state spectroscopic and computational studies of the hexacyanoferrate complexes in water. The effect of water and its varying hydrogen bonding interactions with the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}(\\mathrm{III})$ complexes on the vibrational frequency and dynamics of the high-frequency cyanide stretching modes have been explored with nonlinear IR spectroscopy combined with classical molecular dynamics (MD) simulations. ${ }^{2,3}$ Various X-ray absorption (XA) and emission techniques have been used to probe the oxidation state and local electronic and geometric structure around the Fe atom in the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}(\\mathrm{III})$ complexes in water. ${ }^{5,7,9-11,13}$ Iron L-edge and N K-edge resonant inelastic X-ray scattering (RIXS) experiments show that $\\pi$-back-bonding is slightly stronger in the $\\mathrm{Fe}$ (II) complex compared with the $\\mathrm{Fe}$ (III) complex dissolved in water and have been interpreted using restricted active space second-order perturbation theory (RASPT2) calculations without including explicit solvation. ${ }^{10}$ Another RIXS study of the Fe L-edge and N K-edge for the aqueous $\\mathrm{Fe}(\\mathrm{II})$ complex also probed metal-ligand interactions and was combined with the restricted active space selfconsistent first- and second-order perturbation theory (RASSCF/RASPT2) simulations also without including explicit solvation. ${ }^{5}$ The role of the solvent and its effect on pre-edge absorption transitions at the Fe K-edge was explored by Penfold et al. by measuring Fe K $\\alpha$ RIXS of the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}(\\mathrm{III})$ complexes dissolved in water and ethylene glycol. ${ }^{7} \\mathrm{MD}$ simulations were used to understand how the local solvation structure around the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}$ (III) complexes varied as a function of the solvent.\n\nAlthough the spectroscopy of hexacyanoferrate complexes in solution has been the subject of several experimental studies, most of the previous works have focused on a narrow energy window, as described above. The accompanying computations of the spectroscopic observables on these solvated transitionmetal model systems have similarly focused on a narrow energy region, and the majority of the computations have either been in the gas phase or in combination with an implicit solvent treatment. Here, we present a combined experimental and computational study of hexacyanoferrate aqueous complexes at equilibrium. Our experiments span the range of $250 \\mathrm{meV}$ to $7.15 \\mathrm{keV}$ and include the IR spectroscopy of the cyanide stretching modes, the optical absorption spectroscopy of the charge-transfer transitions, element-specific XA spectroscopy at the Fe K-edge, and valence-to-core X-ray emission spectroscopy (VtC-XES). To understand how the local solvation environment influences the geometric and electronic structure and therefore the spectroscopic signatures of these complexes, we combine explicit solvent effects via the density functional theory (DFT)-based quantum mechanics/molecular mechanics (QM/MM) MD with spectroscopic calculations of the experiments spanning the IR to X-ray wavelengths. To the best of our knowledge, spectroscopy calculations spanning these wavelengths using explicit solute-solvent configurations from MD simulations and performed within a consistent computational approach have not been previously reported for these systems. The present work also serves as a reference benchmark for our ongoing equilibrium and transient studies on a series of cyanide-bridged transition-metal mixed valence complexes: $\\left[\\left(\\mathrm{NH}_{3}\\right)_{5} \\mathrm{Ru}^{\\mathrm{III}} \\mathrm{NCFe}^{\\mathrm{II}}(\\mathrm{CN})_{5}\\right]^{-}$, trans$\\left[(\\mathrm{NC})_{5} \\mathrm{Fe}^{\\mathrm{II}} \\mathrm{CNPt}^{\\mathrm{IV}}\\left(\\mathrm{NH}_{3}\\right)_{4} \\mathrm{NCFe}^{\\mathrm{II}}(\\mathrm{CN})_{5}\\right]^{4-}$, and trans$\\left[(\\mathrm{NC})_{5} \\mathrm{Fe}^{\\mathrm{III}} \\mathrm{CNRu}{ }^{\\mathrm{II}}(\\mathrm{L})_{4} \\mathrm{NCFe}^{\\mathrm{III}}(\\mathrm{CN})_{5}\\right]^{4-}(\\mathrm{L}=$ pyridine $)$.\n\n\\section{MATERIALS AND METHODS}\nPotassium ferrocyanide $\\left(\\mathrm{K}_{4} \\mathrm{Fe}^{\\mathrm{II}}(\\mathrm{CN})_{6}\\right)$ and ferricyanide $\\left(\\mathrm{K}_{3} \\mathrm{Fe}^{\\mathrm{III}}(\\mathrm{CN})_{6}\\right)$ compounds were purchased from SigmaAldrich and used without further purification.\n\n2.1. Infrared Spectroscopy. Aqueous $100 \\mathrm{mM}$ solutions of the $\\mathrm{K}_{4} \\mathrm{Fe}^{\\mathrm{II}}(\\mathrm{CN})_{6}$ and $\\mathrm{K}_{3} \\mathrm{Fe}^{\\text {III }}(\\mathrm{CN})_{6}$ complexes were prepared for taking IR spectra of the cyanide stretching $\\left(\\nu_{\\mathrm{CN}}\\right)$ region. A JASCO FT/IR 4100 instrument was used to collect the steadystate IR spectra of the aqueous sample solutions with a spectral resolution of $2 \\mathrm{~cm}^{-1}$. The water background from the IR spectra of the hexacyanoferrate complexes was removed by subtracting an IR spectrum of the solvent taken under the same conditions.\n\n2.2. UV/Vis Spectroscopy. A JASCO V630 spectrometer with a spectral resolution of $0.5 \\mathrm{~nm}$ was used to collect the steady-state electronic UV/vis spectra of 14 and $21 \\mathrm{mM}$ aqueous solutions of the $\\mathrm{K}_{4} \\mathrm{Fe}^{\\mathrm{II}}(\\mathrm{CN})_{6}$ and $\\mathrm{K}_{3} \\mathrm{Fe}^{\\mathrm{III}}(\\mathrm{CN})_{6}$ complexes, respectively.\n\n2.3. X-ray Spectroscopy and Data Analysis. Measurements of the valence-to-core $\\mathrm{X}$-ray emission were carried out at beamline 7-ID-D of the Advanced Photon Source at Argonne National Laboratory using a 24-bunch fill mode. ${ }^{23}$ Samples of $\\mathrm{K}_{4} \\mathrm{Fe}^{\\mathrm{II}}(\\mathrm{CN})_{6}$ and $\\mathrm{K}_{3} \\mathrm{Fe}^{\\mathrm{III}}(\\mathrm{CN})_{6}$ were prepared as $400 \\mathrm{mM}$ solutions in distilled water. The samples were continuously refreshed using a sapphire nozzle jet that produced a liquid sheet of $200 \\mu \\mathrm{m}$ thickness at a $45^{\\circ}$ angle relative to the incident $\\mathrm{X}$-rays. The sample was exposed to monochromatic $\\mathrm{X}$-rays with a $7.5 \\mathrm{keV}$ incident energy and $0.4 \\mathrm{eV}$ monochromator resolution, focused to a spot size of $5 \\times 5 \\mu \\mathrm{m}^{2}$. Emitted Xrays were dispersed using a $\\mathrm{Si}(531)$ crystal analyzer $(2.5 \\times 10$ $\\left.\\mathrm{cm}^{2}\\right)$ in the von Hamos geometry with a $25 \\mathrm{~cm}$ focusing radius in the nondispersive plane (fabricated by the Optics Group at the Advanced Photon Source). Diffracted X-rays were recorded using a silicon diode array detector (Mythen). The entire spectrometer was enclosed in a $\\mathrm{He}$ environment. Energy calibration of the spectrometer was achieved by the elastic scattering of the incident X-rays at multiple energies. The spectrometer resolution was determined to be $1 \\mathrm{eV}$ fwhm. Each emission spectrum was accumulated for $180 \\mathrm{~s}$, and the data presented here are the averaged results of 32 spectra for each sample.\n\nIron K-edge XA spectra were acquired at beamline 10.3.2 of the Advanced Light Source at Lawrence Berkeley National Laboratory. ${ }^{24}$ Samples of $\\mathrm{K}_{4} \\mathrm{Fe}^{\\mathrm{II}}(\\mathrm{CN})_{6}$ and $\\mathrm{K}_{3} \\mathrm{Fe}^{\\mathrm{III}}(\\mathrm{CN})_{6}$ were prepared as $40 \\mathrm{mM}$ solutions in distilled water. To prevent changes in the spectra because of sample degradation from the X-rays, we utilized a low-volume flowing sample cell made with X-ray capillary cuvettes. Quartz capillary cuvettes with a $10 \\mu \\mathrm{m}$ wall thickness and $300 \\mu \\mathrm{m}$ OD (Hampton Research, HR6-132) were cleaved and glued to flexible tubing and mounted on a fabricated sample holder. Liquid sample flowed through the capillary tubes with flow rates of $6 \\mathrm{~mL} / \\mathrm{min}$ using a small piezoelectric pump (Bartels microComponents, MP6), and the total sample volume was $\\sim 3 \\mathrm{~mL}$. To prevent contamination, each sample used a separate set of capillary tubes. Monochromatic X-rays at $\\sim 7 \\mathrm{keV}$ impinged on the samples with a spot size of $16 \\times 7 \\mu \\mathrm{m}^{2}$. Sample capillary tubes were mounted to accommodate fluorescence detection at $90^{\\circ}$ from the incident X-rays. X-ray fluorescence was detected on an Amptek silicon drift diode. The incident X-ray energy was scanned over a range of $1 \\mathrm{keV}$ to cover the XA near-edge structure (XANES) and extended XA fine structure (EXAFS) region at the $\\mathrm{Fe}$ K-edge.\n\nData reduction of the raw steady-state XA signal was performed according to standard procedures, using the Athena program. ${ }^{25,26}$ The theoretical scattering functions for the EXAFS signal were calculated with FEFF $8.20^{27}$ using structures of the $\\mathrm{K}_{4} \\mathrm{Fe}^{\\mathrm{II}}(\\mathrm{CN})_{6}$ and $\\mathrm{K}_{3} \\mathrm{Fe}^{\\mathrm{III}}(\\mathrm{CN})_{6}$ complexes obtained from snapshots of the MD simulations described below. The fitting of the EXAFS data was performed using WinXAS 3.0.4. ${ }^{28}$ For this purpose, $k^{3}$-weighted EXAFS spectra were Fourier transformed over the $2-11 \\AA^{-1}$ range using a Bessel window. The fits are performed to both the real and imaginary part of the data in the region of $0.7<R<3.5(\\AA)$. The following parameters were allowed to vary in the fitting routine: the distances of the $\\mathrm{Fe}-\\mathrm{C}$ and the $\\mathrm{Fe}-\\mathrm{N}$ singlescattering paths, the corresponding Debye-Waller factors $\\left(\\sigma^{2}\\right)$, and the amplitude reduction factor $\\left(S_{0}^{2}\\right)$. The coordination number was held constant at six for both of the single scattering paths of $\\mathrm{Fe}-\\mathrm{C}$ and $\\mathrm{Fe}-\\mathrm{N}$. The fit also included the $\\mathrm{Fe}-\\mathrm{C}-\\mathrm{N}$ multiple scattering paths. The coordination number, distance, and Debye-Waller factor of the multiple scattering paths were correlated with the single scattering paths in the fitting routine. The error bars on the best-fit parameters are statistical errors extracted from the WinXAS program.\n\n2.4. Computational Details. All calculations were performed with the NWChem computational chemistry package. ${ }^{29}$ To study the solvated model transition-metal complexes $\\left[\\mathrm{Fe}(\\mathrm{CN})_{6}\\right]^{3-}$ and $\\left[\\mathrm{Fe}(\\mathrm{CN})_{6}\\right]^{4-}$ in aqueous solution, we have performed extensive hybrid $\\mathrm{QM} / \\mathrm{MM} M \\mathrm{MD}$ simulations. Single $\\left[\\mathrm{Fe}(\\mathrm{CN})_{6}\\right]^{3-}$ and $\\left[\\mathrm{Fe}(\\mathrm{CN})_{6}\\right]^{4-}$ anions were placed in a cubic box and solvated with 4184 and 4182 water molecules, respectively, from a previously equilibrated bulk water \"template\" system, having a density of $1 \\mathrm{~g} / \\mathrm{cm}^{3}$ (water density at the standard temperature-pressure). The resulting box size for both systems was $49.98 \\AA \\times 49.98 \\AA \\times 49.98 \\AA$. Three $\\mathrm{K}^{+}$ cations and four $\\mathrm{K}^{+}$cations were randomly placed (approximately $15 \\AA$ away from the anion) in the solvation environment for $\\left[\\mathrm{Fe}(\\mathrm{CN})_{6}\\right]^{3-}$ and $\\left[\\mathrm{Fe}(\\mathrm{CN})_{6}\\right]^{4-}$ complex systems, respectively, to provide an overall neutral charge for the entire solvated system. The $\\mathrm{K}$ counter ions were allowed to move freely. Each transition-metal complex was treated quantum mechanically $(\\mathrm{QM})$, whereas the rest of the system (the water bath) was treated at the MM level. This partitioning avoids the need for on-the-fly adaptive reassignment of atoms as $\\mathrm{QM}$ or MM during the MD simulations, which is especially challenging in simulations where solvent exchange is possible between the $\\mathrm{QM}$ and $\\mathrm{MM}$ subsystems.\n\nThe water molecules and potassium cations, which comprise the MM region, were treated with the SPC/E water $\\operatorname{model}^{30}$ and SPC/E-specific $\\mathrm{K}^{+}$force field of Joung and Cheatham, ${ }^{31}$ respectively. For the $\\mathrm{QM}$ region, the $6-311 \\mathrm{G}^{* *}$ basis set $^{32,33}$ was used for the $\\mathrm{C}$ and $\\mathrm{N}$ atoms, and the Stuttgart basis set/ relativistic small-core effective core potential $(\\mathrm{ECP})^{34}$ was assigned to the $\\mathrm{Fe}$ atom. Lennard-Jones parameters were assigned to the atoms of the complex for the nonbonding van der Waals interaction with the water molecules. Specifically, SPC/E-compatible GAFF (generalized AMBER force field) Lennard-Jones parameters were used for the C (\"c1\") and $\\mathrm{N}$ (\"n1\") atoms, and the Lennard-Jones \"feo\" parameters of CLAYFF $^{36}$ were used for the tight octahedral environment of the Fe atom.\n\nPrior to running MD, both systems were annealed through a series of freeze and thaw cycles of the complex and solvent until the energy change was less than $0.0001$ Hartrees. Five freeze and thaw cycles were used for both solution systems. Following the annealing phase, QM/MM MD was performed at $298.15 \\mathrm{~K}$ $(N V T)$ for 20 ps after a 1 ps equilibration with a time step of $0.25$ fs. For the SPC/E water model, the SHAKE algorithm ${ }^{37}$ was used to keep the water molecules rigid (constraining the bond lengths and bond angle). The QM region (i.e., complexes) was described at the DFT level of theory with the global hybrid PBE0 (25\\% Hartree-Fock exchange) exchange-correlation functional. ${ }^{38}$ The complexes, which comprise the $\\mathrm{QM}$ region in the models, were allowed to move freely (i.e., the SHAKE method was not applied).\n\nStructural models for inputs to our spectroscopy calculations were obtained from QM/MM MD snapshots following equilibration. These snapshots included the transition-metal complex along with an explicit solvation environment. For the IR simulations, 20 snapshots were further optimized, and a harmonic frequency analysis was performed in the full $\\mathrm{QM} /$ $\\mathrm{MM}$ environment. The harmonic frequency intensities from the 20 snapshots were combined to generate an IR spectrum. For the UV/vis and X-ray spectroscopy calculations, full QM calculations were performed on 10 explicitly solvated model clusters that were extracted from the same snapshots used in the IR simulations. These clusters (i.e., for the UV/vis and Xray calculations) were constructed by taking the transitionmetal complex center as well as the $4 \\AA$ thick shell of explicit water molecules surrounding the complex, corresponding to a total of 133 atoms including 40 water molecules, respectively, for each complex.\n\nThe UV/vis spectra were calculated with time-dependent DFT (TDDFT), ${ }^{39,40}$ whereas the Fe K-edge XANES spectra of the two complexes were calculated using restricted excitation window $\\operatorname{TDDFT}^{41-46}$ including multipole contributions to the oscillator strengths. This approach, which involves defining a restricted subspace of single excitations from the relevant core orbitals and no restrictions on the target unoccupied states, is valid because excitations from the deep-core states are wellseparated from pure valence-level excitations. We have successfully used this approach in several studies including the K-edges of oxygen, carbon, and fluorine in a number of molecular systems; ${ }^{45}$ ruthenium $\\mathrm{L}_{3}$-edge in a series of model $\\mathrm{Ru}(\\mathrm{II})$ and $\\mathrm{Ru}($ III $)$ complexes and mixed-valence metal ( $\\mathrm{Ru} /$ Fe) dimers; ${ }^{47}$ K-edge spectra of oxygen, nitrogen, and sulfur in cysteine $^{48}$ dissolved lithium polysulfide species in $\\mathrm{Li}-\\mathrm{S}$ batteries; ${ }^{49} \\mathrm{Al}$ K-edge studies of the aluminum distribution in zeolites ${ }^{50}$ alpha-alumina, sodium aluminate, and aqueous $\\mathrm{Al}^{3+}$ species; ${ }^{51} \\mathrm{Cl}$ K-edge spectra in actinide hexachloride complexes $;^{52} \\mathrm{Na}$ K-edge studies of the hydration structure of $\\mathrm{Na}^{+} ;^{53}$ and $\\mathrm{Ca} \\mathrm{K}$-edge studies of supersaturated calcium carbonate solutions. ${ }^{54}$ The valence-to-core X-ray emission calculations were performed using a TDDFT-based protocol that we have developed recently. ${ }^{46}$\n\nOur choice of DFT and TDDFT was motivated by the sizes and ensembles of the large explicitly solvated clusters\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_900c617369212d6bc72fg-05_228_638_501_1667}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_900c617369212d6bc72fg-05_708_952_754_1001}\n\\end{center}\n\n(d)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_900c617369212d6bc72fg-05_709_956_1150_1381}\n\\end{center}\n\n(e)\n\nFigure 1. Pair distribution functions, $g(r)$, for the (a) $\\mathrm{Fe}-\\mathrm{O}$ (water) distance, (b) $\\mathrm{Fe}-\\mathrm{C}$ bond lengths, and (c) $\\mathrm{C} \\equiv \\mathrm{N}$ bond lengths. Red: $\\left[\\mathrm{Fe}^{\\mathrm{II}}(\\mathrm{CN})_{6}\\right]^{4-}$ complex and blue: $\\left[\\mathrm{Fe}^{\\mathrm{III}}(\\mathrm{CN})_{6}\\right]^{3-}$ complex. Averaged mass-weighted density plots showing the solvent distribution around the complexes $(\\mathrm{d})\\left[\\mathrm{Fe}^{\\mathrm{II}}(\\mathrm{CN})_{6}\\right]^{4-}$ and $(\\mathrm{e})\\left[\\mathrm{Fe}^{\\mathrm{III}}(\\mathrm{CN})_{6}\\right]^{3-}$ are plotted over water molecules within $6 \\AA$ of the complex at a resolution of $0.25 \\AA$. The density plots are generated by the VolMap plugin in VMD.\n\nconsidered in this work. Both theories offer the best compromise between accuracy and computational performance for large systems. Even though higher order-correlated wave function-based approaches are more accurate, these methods quickly become prohibitively expensive computationally for large systems that lack high symmetry. All DFT and TDDFT calculations were performed with the PBE0 exchangecorrelation functional. ${ }^{38} \\mathrm{We}$ found that this functional was sufficiently accurate to describe the overall structure, dynamics, and spectra over a broad energy range (IR, UV/vis, and X-ray) for both model systems and our earlier studies on the solvated mixed valence $\\mathrm{Fe}(\\mathrm{II}) \\mathrm{Ru}(\\mathrm{III})$ dimer complex. ${ }^{47}$ The SapporoTZP-2012 ${ }^{55}$ and $6-311 G^{* * 32}$ all-electron basis set were used for the $\\mathrm{Fe}$ atom and the light atoms, respectively, for the $\\mathrm{X}$-ray spectra. We used the Stuttgart-RSC-1997 ECP and the corresponding basis set $^{56-58}$ for the $\\mathrm{Fe}$ atom in the IR and UV/vis calculations. The UV/vis, XANES, and VtC-XES spectra were broadened by $0.25,1.5$, and $1.5 \\mathrm{eV}$, respectively, using a Lorentzian line shape.\n\n\\section{RESULTS AND DISCUSSION}\n3.1. Structure of the Hexacyanoferrate Complexes in Water: Effects of Hydration. To study the solvent structures of the two solute ions, we have calculated the pair-distribution function, $g(r)$, which is defined as: $g(r)=n(r) / 4 \\pi \\rho r^{2} \\delta r$, where $n(r)$ is the mean number of atoms in a shell of width $\\delta r$ at distance $r$ and $\\rho$ is the mean atom density. Comparing the pair distribution functions for the $\\mathrm{Fe}$ (II) and $\\mathrm{Fe}$ (III) complexes in Figure 1a, we see a major peak for the first water molecule shell of the $\\mathrm{Fe}$ (II) complex at $\\sim 4.3$ and at $\\sim 4.5 \\AA$ for the $\\mathrm{Fe}$ (III) complex. This suggests that the first shell of water molecules is closer to the $\\mathrm{Fe}^{2+}$ center compared with the $\\mathrm{Fe}^{3+}$ center, and this finding has also been noted in other MD simulations. ${ }^{3,7}$ The mass-weighted density plots $(r<6.0 \\AA)$ calculated over 4000 frames, as shown in Figure $1 \\mathrm{~d}, \\mathrm{e}$, provide a $3 \\mathrm{D}$ representation of the clear difference in the local solvation structure around the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}(\\mathrm{III})$ complexes. The 3D representation provides a stark visual representation of the stronger interaction of the ferrous complex with the water molecules. The reason for the difference in the local solvation environment can be attributed to the stronger attraction between the more negatively charged ferrous anion (charge of -4) and the positive (hydrogen) ends of the water molecules compared with the ferric ion, which has a charge of $-3$. The difference in oxidation state of the complexes results in stronger $\\pi$ back-bonding between the $\\mathrm{Fe}$ atom and the cyanide ligands for the $\\mathrm{Fe}$ (II) complex as compared to the $\\mathrm{Fe}$ (III) complex. The difference in $\\pi$ back-bonding generates a more negative cyanide ligand for the ferrous species, which explains the stronger hydrogen bonding interactions with the surrounding water molecules (Figure 1d,e).\n\nIn Figure $1 \\mathrm{~b}, \\mathrm{c}$, we compare the radial distribution functions for the $\\mathrm{Fe}-\\mathrm{C}$ and $\\mathrm{C} \\equiv \\mathrm{N}$ bond lengths for the two complexes. Our calculations reveal that the average $\\mathrm{Fe}-\\mathrm{C}$ bond in the ferrous ion $(1.91 \\pm 0.05 \\AA)$ is shorter than the corresponding bond in the ferric ion $(1.94 \\pm 0.04 \\AA)$. The average $\\mathrm{C} \\equiv \\mathrm{N}$ bond is slightly shorter for the Fe(III) complex $(1.16 \\pm 0.01 \\AA$ ) as compared with the $\\mathrm{Fe}$ (II) complex $(1.17 \\pm 0.03 \\AA)$. We also find that the distance distribution of the $\\mathrm{Fe}-\\mathrm{C}$ and the $\\mathrm{C} \\equiv \\mathrm{N}$ bond lengths is narrower in the ferric complex as compared to the ferrous complex, and the average $\\mathrm{C}-\\mathrm{Fe}-\\mathrm{C}$ angle is $90^{\\circ} \\pm$ $4^{\\circ}$ for both complexes. For comparison, we have also performed MD simulations in an implicit solvent environment. In Figure $S 10$ of the Supporting Information, we compare the pair distribution functions of the $\\mathrm{Fe}-\\mathrm{C}$ and $\\mathrm{C} \\equiv \\mathrm{N}$ bond distances with the explicit solvent $\\mathrm{QM} / \\mathrm{MM} M \\mathrm{MD}$ simulations. In the next few sections, we will explore how the changes in the local solvation environment between the $\\mathrm{Fe}$ (II) and $\\mathrm{Fe}$ (III) and the disruption of the octahedral symmetry of these solvated complexes as shown by the MD simulations manifest itself in the vibrational, UV/vis, and X-ray spectra.\n\n3.2. Hexacyanoferrate Complexes in Water: Infrared Spectra of the Cyanide Stretching Region. The experimental FTIR spectra in the $\\mathrm{C} \\equiv \\mathrm{N}$ stretching region for the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}(\\mathrm{III})$ complexes in water are reported in Figure $2 \\mathrm{a}$. The spectra show a single peak corresponding to the\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_900c617369212d6bc72fg-06_336_1214_376_866}\n\nFigure 2. (a) Experimental IR spectra for the $\\mathrm{C} \\equiv \\mathrm{N}$ stretching region of the hexacyanoferrate dissolved in water. The black circles are the experimental data, and the solid lines are fits to the data with the solvent background subtracted. The $\\mathrm{C} \\equiv \\mathrm{N}$ stretches are found at $2037.6 \\pm 0.1$ and $2115.2 \\pm 0.1 \\mathrm{~cm}^{-1}$ for the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}(\\mathrm{III})$ complexes, respectively. (b) Vibrational spectra calculated using a harmonic frequency analysis of 20 snapshots from the QM/MM simulations. A broadening of $10 \\mathrm{~cm}^{-1}$ has been applied to each transition to generate the peak envelope. triply degenerate $\\mathrm{T}_{1 \\mathrm{u}}$ mode of the $\\mathrm{C} \\equiv \\mathrm{N}$ stretches of both complexes in solution. The spectra are fit using Lorentzian functions and the $\\mathrm{C} \\equiv \\mathrm{N}$ stretch of the $\\mathrm{Fe}$ (II) species is found at $2037.6 \\pm 0.1 \\mathrm{~cm}^{-1}$ and has a full width at half maximum (fwhm) of $23.5 \\pm 0.8 \\mathrm{~cm}^{-1}$. The $\\mathrm{C} \\equiv \\mathrm{N}$ stretch of the $\\mathrm{Fe}$ (III) species is found at $2115.2 \\pm 0.1 \\mathrm{~cm}^{-1}$ and has a full width at half maximum (fwhm) of $11.6 \\pm 0.4 \\mathrm{~cm}^{-1}$. It is well-known that the IR spectra in the $\\mathrm{C} \\equiv \\mathrm{N}$ stretching region of metal-cyanide complexes are reporters of the metal-ligand bonding interactions. ${ }^{59}$ An increase in the effective charge on the iron results in a decrease of the metal $-\\mathrm{C} \\equiv \\mathrm{N} \\pi$ back-bonding and an increase in the metal $-\\mathrm{C} \\equiv \\mathrm{N} \\sigma$ bonding. The difference in the metal-ligand bonding interactions of the aqueous hexacyanoferrate complexes results in the $77.6 \\mathrm{~cm}^{-1}$ blue shift and an $\\sim 3$ times decrease in the intensity of the $\\mathrm{C} \\equiv \\mathrm{N}$ stretch for the ferric species in comparison with its ferrous counterpart. The differences in line width are attributed to the stronger interactions of the ferrous species with the solvent shell, as discussed above (Figure 1) and in previous studies. ${ }^{2,3,7,14}$ The stronger interaction with the water molecules for the $\\mathrm{Fe}(\\mathrm{II})$ complex in comparison with the $\\mathrm{Fe}$ (III) species results in a larger structural heterogeneity for the former in solution. For example, in Figure 1c, we note that the distribution of $g(r)$ for the $\\mathrm{C} \\equiv \\mathrm{N}$ bond lengths is greater in the ferrous complex than the ferric one, which is a result of stronger hydrogen bonding interactions of the cyanide ligands with the water molecules.\n\nThe calculated spectra for the $\\mathrm{C} \\equiv \\mathrm{N}$ stretch using 20 snapshots from the QM/MM simulations are shown in Figure 2b. The peaks for the $\\mathrm{C} \\equiv \\mathrm{N}$ stretch frequencies of the $\\mathrm{Fe}$ (II) and $\\mathrm{Fe}(\\mathrm{III})$ complexes are found at 2180 and $2255 \\mathrm{~cm}^{-1}$, respectively. Although the absolute harmonic energies are blueshifted with respect to the experiment, the calculated red shift of $76 \\mathrm{~cm}^{-1}$ of the $\\mathrm{C} \\equiv \\mathrm{N}$ stretch frequency for the $\\mathrm{Fe}$ (II) complex compared to that of the Fe(III) complex is consistent with our experiments, as shown in Figure $2 a$. The widths of the\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_900c617369212d6bc72fg-06_1646_2434_486_1673}\n\\end{center}\n\nFigure 3. UV/vis absorption spectra for hexacyanoferrate complexes dissolved in water from $(\\mathrm{a}, \\mathrm{b})$ experiment and (c,d) simulation. The transition densities (purple $=$ negative, gold $=$ positive) corresponding to transitions from a particular structural snapshot are shown in (e-k). For the Fe(II) species, the transitions' densities plotted in (e-g) correspond to transitions at 3.67, 4.71, and $5.31$ eV. For the Fe(III) species, the transitions' densities plotted in $(\\mathrm{h}-\\mathrm{k})$ correspond to transitions at $3.42,4.08,4.45$, and $5.12 \\mathrm{eV}$. Calculations were performed over 10 solvated clusters and Lorentzian broadened by $0.25 \\mathrm{eV}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_900c617369212d6bc72fg-07_225_619_488_849}\n\\end{center}\n\n$\\left[\\mathrm{Fe} \\mathrm{III}^{\\mathrm{ICN}} \\mathrm{CN}_{6}\\right]^{3-\\text { in } \\mathrm{H}_{2} \\mathrm{O}}$\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_900c617369212d6bc72fg-07_308_618_836_1152}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_900c617369212d6bc72fg-07_633_1010_504_851}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_900c617369212d6bc72fg-07_633_1010_845_1153}\n\\end{center}\n\n(e)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_900c617369212d6bc72fg-07_265_534_1156_1386}\n\\end{center}\n\ng)\n\n(f)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_900c617369212d6bc72fg-07_538_784_1176_1646}\n\\end{center}\n\n(h)\n\n(i)\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_900c617369212d6bc72fg-07_254_1014_1303_1665}\n\n\\section{( )}\n.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_900c617369212d6bc72fg-07_780_1030_1618_1734}\n\\end{center}\n\nFigure 4. XANES spectra at the Fe K-edge for hexacyanoferrate complexes dissolved in water from $(a, b)$ experiment and $(c, d)$ simulation. $(a, b)$ Red circles and blue squares are the experimental data. The solid lines are fits of the data to a sum of pseudo-Voigt line shapes. The fits reveal that the experimental $\\mathrm{Fe}$ (II) XANES spectrum has two peaks B and $\\mathrm{C}$ at $7113.0 \\pm 0.1 \\mathrm{eV}$ and $7115.9 \\pm 0.1 \\mathrm{eV}$, respectively. The fitted experimental Fe(III) XANES spectrum has three peaks A, B, and C at $7110.3 \\pm 0.5,7113.6 \\pm 0.2$, and $7117.8 \\pm 0.1 \\mathrm{eV}$, respectively. The main molecular orbitals (MO 281 and 282) contributing to the final state in the XANES transition B for the $\\mathrm{Fe}(\\mathrm{II})$ complex are plotted in (e,f), where red = positive and blue $=$ negative. The main molecular orbitals (MO $254 \\beta, 259 \\alpha$, and $264 \\alpha)$ contributing to the final state in the XANES transition A $(254 \\beta)$ and B $(259 \\alpha)$ transitions for the Fe(III) complex are plotted in $(\\mathrm{g}-\\mathrm{i})$. The calculated XANES spectra were averaged over 10 snapshots and broadened by $1.5$ eV. The calculated spectra were blue-shifted by $143.0 \\mathrm{eV}$ to match the experiment.\n\nsimulated $\\mathrm{C} \\equiv \\mathrm{N}$ stretch spectra for the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}$ (III) complexes are 45 and $38 \\mathrm{~cm}^{-1}$, respectively. Because the vibrational energy of the $\\mathrm{C} \\equiv \\mathrm{N}$ stretches is $\\sim 250 \\mathrm{meV}$, we would not expect the shape of the calculated spectra to be in quantitative agreement with the ensemble experimental measurement after averaging 20 snapshots. In theory, we would need to average the snapshots across a 3 ps time window to obtain a $10 \\mathrm{~cm}^{-1}$ width in the IR spectrum. The calculations using explicit solute-solvent configurations are able to capture the asymmetry of the IR line shapes. Calculations on symmetric octahedral structures with an implicit solvent (see Figure S1a,b in the Supporting Information) show a relative separation of 83 $\\mathrm{cm}^{-1}$ between the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}$ (III) peaks. However, the spectral width is the same for both species, and the peaks are symmetric without the asymmetric tails seen in the explicit solvent calculations and the experiment.\n\n3.3. Hexacyanoferrate Complexes in Water: UV/Vis Electronic Absorption Spectra. The experimental UV/vis absorption spectra for the $\\mathrm{Fe}$ (II) and $\\mathrm{Fe}$ (III) species are plotted in Figure 3a,d, respectively. Because both ferrous $\\left(\\mathrm{d}^{6}\\right)$ and ferric $\\left(d^{5}\\right)$ hexacyanide complexes are low-spin octahedral complexes because of strong ligand field-splitting of the $\\mathrm{CN}$ ligands, the $\\mathrm{Fe}(\\mathrm{II})$ species has filled $3 \\mathrm{~d}-\\mathrm{t}_{2 \\mathrm{~g}}$ orbitals and is a singlet ground state, whereas the $\\mathrm{Fe}(\\mathrm{III})$ species with one empty $3 \\mathrm{~d}-\\mathrm{t}_{2 \\mathrm{~g}}$ orbital is a doublet ground state. The $\\mathrm{Fe}(\\mathrm{II}) \\mathrm{UV} /$ vis absorption spectrum, as shown in Figure 3a, has a distinct peak at $3.87 \\mathrm{eV}$ $(320 \\mathrm{~nm})$ and a weak shoulder at $4.58 \\mathrm{eV}(270 \\mathrm{~nm})$. The UV/ vis spectrum of the $\\mathrm{Fe}$ (III) complex has four distinct features at $2.95 \\mathrm{eV}(420 \\mathrm{~nm}), 3.87 \\mathrm{eV}(320 \\mathrm{~nm}), 4.10 \\mathrm{eV}(302 \\mathrm{~nm})$, and $4.76 \\mathrm{eV}(260 \\mathrm{~nm})$ along with shoulders at $3.09 \\mathrm{eV}(401 \\mathrm{~nm})$ and $4.37 \\mathrm{eV}(284 \\mathrm{~nm})$. The assignments of the features seen in these spectra have been discussed in earlier works as $d-d$ and metal-ligand charge-transfer transitions. ${ }^{60-62}$ The simulated spectra averaged over 10 solvated clusters are shown in Figure $3 \\mathrm{c}, \\mathrm{d}$ for the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}$ (III) complexes, respectively. The calculations capture all of the spectral features seen in the experiments. In our calculated $\\mathrm{Fe}$ (II) spectrum, the first two spectral features (3.67 and $4.71 \\mathrm{eV}$ ) correspond to $\\mathrm{Fe}$\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_900c617369212d6bc72fg-07_1554_1599_1114_1972}\\\\\nand $\\mathrm{p}$ orbitals and the surrounding solvent orbitals. The strong feature at $5.31 \\mathrm{eV}$ is composed of metal-to-ligand transitions. The transition densities obtained from one snapshot and displaying a spatial map of the charge redistribution on the Fe(II) complex and the surrounding water molecules during the electronic transitions at $3.67,4.71$, and $5.31 \\mathrm{eV}$ are plotted in Figure $3 \\mathrm{e}-\\mathrm{g}$. Figure $3 \\mathrm{~d}$ displays the calculated $\\mathrm{Fe}$ (III) UV/ vis spectrum, and the features seen at $3.42,4.08,4.45$, and $5.12$ $\\mathrm{eV}$ are assigned to the ligand-to-metal charge-transfer (LMCT) transitions. The transition densities from one snapshot for all of the transitions listed above are plotted in the increasing energy in Figure $3 \\mathrm{~h}-\\mathrm{k}$. The calculations and the transition densities reveal how the hydrogen bonding interaction between the cyanide ligand and the water molecules modulates the chargetransfer transitions.\n\nWe compare the calculated UV/vis spectra using the solvated clusters with those obtained using an implicit continuum solvent model in Figures S2 and S3 in the Supporting Information. We note the following differences in the implicit solvent model calculation of the UV/vis spectra: (i) the features at $\\sim 3.7$ and $4.7 \\mathrm{eV}$ corresponding to $\\mathrm{d}-\\mathrm{d}$ transitions in the Fe(II) spectrum are extremely weak and (ii) the asymmetric fine structure of the three main transitions at 3,4 , and $5 \\mathrm{eV}$ is absent. In the implicit solvent model, the Fe(II) and Fe(III) complexes have octahedral symmetry because the effects of hydrogen bonding are absent. To further explore the effect of the explicit solute-solvent interactions, we have separated the stick spectra from each cluster that are used to calculate the simulation of Figures $3 \\mathrm{c}, \\mathrm{d}$ in S2c and S3c, respectively. In the case of the $\\mathrm{Fe}(\\mathrm{II})$ complex, where the interactions with the solvent are stronger, we see that different solute-solvent environments result in the energy shifts and significant amplitude variations of the $\\mathrm{d}-\\mathrm{d}$ transitions. In the case of the Fe(III) complex, we note that the number of transitions and their amplitudes are dependent on the explicit solute-solvent configuration. This results in the asymmetric fine structure of the LMCT transition of the Fe(III) complex in solution. The strong dependence of the frequency and amplitude of the charge-transfer transitions on explicit solute-solvent configurations highlights the importance of correctly accounting for these interactions when simulating and interpreting timeresolved spectroscopies of solvated transition-metal complexes.\n\n3.4. Hexacyanoferrate Complexes in Water: MetalLigand Interactions Seen through the Fe K-Edge XANES Spectra. X-ray spectroscopy techniques are excellent elementspecific probes of the bonding environment and local electronic structure of transition-metal complexes in solution. ${ }^{63}$ The XANES technique which includes the spectral region below the absorption edge is a direct probe of the unoccupied orbitals that can be accessed by the absorbing atom. ${ }^{64,65}$ The experimental XANES spectra along with their fits at the $\\mathrm{Fe}$ K-edge for the $\\mathrm{Fe}$ (II) and $\\mathrm{Fe}($ III) complexes are shown in Figure 4a,b. The Fe(II) complex shows two peaks at $7113.0$ and $7115.9 \\mathrm{eV}$ in the calculated spectrum. In a qualitative oneelectron picture, the peak at $7113.0 \\mathrm{eV}$ represents a dipole forbidden transition, $\\mathrm{Fe}(1 \\mathrm{~s}) \\rightarrow \\mathrm{Fe}\\left(3 \\mathrm{~d}, \\mathrm{e}_{\\mathrm{g}}\\right)$, whereas the peak at $7115.9 \\mathrm{eV}$ represents $\\mathrm{Fe}(1 \\mathrm{~s}) \\rightarrow \\mathrm{Fe}(3 \\mathrm{~d}, 4 \\mathrm{p})$ mixed with $\\pi^{*}$ orbitals of the cyanide ligands. The pre-edge region of the Fe Kedge XA spectrum of the Fe(III) complex shows three peaks. The peak at $7110.3 \\mathrm{eV}$ corresponds to a transition from $\\mathrm{Fe}$ (1s) $\\rightarrow \\mathrm{Fe}\\left(3 \\mathrm{~d}, \\mathrm{t}_{2 \\mathrm{~g}}\\right)$, the peak at $7113.6 \\mathrm{eV}$ corresponds to a transitions from $\\mathrm{Fe}(1 \\mathrm{~s}) \\rightarrow \\mathrm{Fe}\\left(3 \\mathrm{~d}, \\mathrm{e}_{\\mathrm{g}}\\right)$, and the peak at $7117.8$ $\\mathrm{eV}$ corresponds to the $\\mathrm{Fe}(1 \\mathrm{~s}) \\rightarrow \\mathrm{Fe}(3 \\mathrm{~d}, 4 \\mathrm{p})$ mixed with $\\pi^{*}$ orbitals of the cyanide ligands. The differences in the energies of the various features reflect the changes in the metal-ligand bonding and interactions with the solvent as a function of the oxidation state of the Fe atom. These features are consistent with those reported previously using solid-state samples and high-energy-resolution fluorescence-detected (HERFD) XANES measurements with aqueous samples.\n\nOur XANES calculations obtained using the procedure outlined in section $2.4$ include higher order contributions to the oscillator strengths and are shown in Figure $4 \\mathrm{c}, \\mathrm{d}$ and are in good agreement with the experiment. We note that the calculated spectra are blue-shifted by $143.0 \\mathrm{eV}$. The calculations allow us to understand the XANES transitions at the molecular level and explore the effects of solvation. Figure $4 \\mathrm{e}, \\mathrm{f}$ plots examples of the molecular orbitals from one snapshot contributing significantly to the transition $\\mathrm{B}$ and $\\mathrm{C}$ in the aqueous ferrous complex. The molecular orbital in Figure $4 \\mathrm{e}$ displays the nature of the quadrupole transition for feature $B$, where the $3 \\mathrm{~d}_{z}^{2}$ orbital of the iron are heavily mixed with the $\\pi^{*}$ orbitals of the cyanide ligands. This particular transition's intensity consists of $\\sim 70 \\%$ from quadrupolar transitions. The transition intensity for the feature $C$ is roughly $50 \\%$ quadrupolar in nature. The electron density on the water molecules in the solvation shell contributes significantly to the transitions comprising the $\\mathrm{C}$ feature, as illustrated in the molecular orbitals plotted in the Supporting Information (see Figure S9). The molecular orbital in Figure $4 \\mathrm{~g}$ is the major contributor to transitions corresponding to peak $A$ in the ferric complex. Interestingly, the dipolar contribution to this peak is $\\sim 70 \\%$. The quadrupolar transition is $82 \\%$ for peak B in the ferric complex. Figure $4 \\mathrm{~h}$ plots a molecular orbital, which contributes strongly to one of the transitions comprising the B feature. The transition intensity for the feature $C$ is $90 \\%$ dipolar in nature. This is seen with the electron density on the $\\pi^{*}$ orbitals of the cyanide ligands in Figure $4 i$, which plots a plots a molecular orbital contributing strongly to one of the transitions comprising the $\\mathrm{C}$ feature. From the calculations, we see how the solvent shell disrupts octahedral symmetry of the complex and modifies the molecular-level interpretation of the XANES features. The HERFD XANES measurements of the ferrous and ferric complexes in water and ethylene glycol revealed that amplitude and energy of feature $\\mathrm{C}$ is strongly dependent on the solvent.\" Our XANES calculations help to explain that observation by showing how the electron density on the solvation shell contributes to the transitions seen in peak $C$. The explicit versus implicit solvent calculations (Figures S4 and S5) in the Supporting Information also reinforce this point.\n\n3.5. Hexacyanoferrate Complexes in Water: MetalLigand Interactions Seen through the VtC-XES. VtC-XES is emerging as an important tool to study valence excitations and for ligand identification in transition-metal systems. Here, we perform nonresonant $\\mathrm{VtC}-\\mathrm{XES}$, where the incident $\\mathrm{X}$-ray photon creates a core $1 \\mathrm{~s}$ hole. ${ }^{68,69}$ Radiative transitions from the different valence orbitals into the $1 \\mathrm{~s}$ hole give rise to the resulting spectrum. Experimental spectra for the aqueous $\\mathrm{Fe}$ (II) and $\\mathrm{Fe}$ (III) complexes are shown in Figure 5a,b. The fitted $\\mathrm{Fe}(\\mathrm{II})$ complex spectrum shows four peaks (labeled A-D) at\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_900c617369212d6bc72fg-08_1424_2226_1177_1907}\n\nFigure 5. VtC-XES spectra of hexacyanoferrate complexes dissolved in water from $(\\mathrm{a}, \\mathrm{b})$ experiment and $(\\mathrm{c}, \\mathrm{d})$ simulation. $(\\mathrm{a}, \\mathrm{b})$ Black circles and squares are the experimental data. The solid lines are fits of the data to a sum of pseudo-Voigt line shapes. The experimental $\\mathrm{Fe}$ (II) spectrum has four peaks, A-D, at $7093.5 \\pm 0.6,7104.7 \\pm 0.1,7106.6$ $\\pm 0.7$, and $7108.1 \\pm 0.1 \\mathrm{eV}$, respectively. The experimental $\\mathrm{Fe}(\\mathrm{III})$ spectrum has four peaks, A-D, 7094.6 $\\pm 0.6,7106.1 \\pm 0.1,7108.4 \\pm$ $0.3$, and $7109.7 \\pm 0.1 \\mathrm{eV}$, respectively. Calculations were performed on one representative-solvated cluster and broadened by $1.5 \\mathrm{eV}$. A red shift of $10.1 \\mathrm{eV}$ was applied to the simulated spectra to match the experiment. 7093.5, 7104.7, 7106.6, and 7108.1 eV. The Fe(III) complex spectrum also shows four peaks (labeled A-D) at 7094.6, 7106.1, 7108.4, and 7109.7 eV. The peaks labeled $\\mathrm{C}$ are seen as shoulders to the red of peaks $\\mathrm{D}$ in Figure $5 \\mathrm{a}, \\mathrm{b}$. An expanded view of the experimental VtC-XES spectra and the fits displaying peaks $\\mathrm{B}-\\mathrm{D}$ are plotted in Figure S8. The measured spectra are similar to the earlier reported spectra of the Fe(II) and $\\mathrm{Fe}(\\mathrm{III})$ complexes in aqueous solution and in the powder form. ${ }^{13,70}$ The XES line shapes were not quantitatively analyzed previously to reveal four peaks. The notable experimental differences between the two Fe(II) and Fe(III) spectra include a blue shift of the spectral features upon oxidation of the iron atom. In addition, there is a reversal in the ratio of the intensities of peaks $\\mathrm{B}$ and $\\mathrm{D}$ between the ferrous and ferric species.\n\nThe simulated spectra are shown in Figure $5 c, d$ with a red shift of $10.1 \\mathrm{eV}$ to match the experiment and are in reasonable agreement. For the open-shell Fe(III) species, ionization of both $\\alpha$ and $\\beta$ core electrons, corresponding to singlet and triplet final states, was considered for the final spectrum. For the closed-shell $\\mathrm{Fe}$ (II) species, only one core ionization mode, the doublet final state, was considered. The calculations indicate that the spectra for the $\\mathrm{Fe}$ (II) and $\\mathrm{Fe}$ (III) species have similar features and peak assignments. The weak feature A $(\\sim 7095 \\mathrm{eV})$ in the calculated Fe(II) spectrum (Figure 5c) results from transitions involving the $\\mathrm{N} 2 \\mathrm{~s}$ orbitals $\\rightarrow \\mathrm{Fe} 1 \\mathrm{~s}$. Feature $\\mathrm{B}(\\sim 7106 \\mathrm{eV})$ results from transitions involving $\\mathrm{C}$ and $\\mathrm{N} 2 \\mathrm{~s}$ orbitals $\\rightarrow \\mathrm{Fe} 1 \\mathrm{~s}$, and feature $\\mathrm{C}(\\sim 7108 \\mathrm{eV})$ represents the de-excitation involving the $\\mathrm{N}$ sp hybrid orbitals and the $\\mathrm{C} \\equiv \\mathrm{N} \\pi$ orbitals $\\rightarrow$ Fe 1 s. The strongest feature $\\mathrm{D}(\\sim 7110 \\mathrm{eV})$ corresponds to transitions between the $\\mathrm{C}$ sp hybrid orbitals, the $\\mathrm{C} \\equiv \\mathrm{N} \\pi$ orbitals, and the Fe $1 \\mathrm{~s}$ core hole. The assignments for the Fe(III) spectrum are the same as those described above. The calculated spectra for the $\\mathrm{Fe}$ (II) and $\\mathrm{Fe}$ (III) complexes also show an additional weak feature at $7116 \\mathrm{eV}$, which corresponds to quadrupole transitions between the Fe $3 \\mathrm{~d}$ and $\\mathrm{C} \\equiv \\mathrm{N} \\pi$ orbitals $\\rightarrow \\mathrm{Fe} 1 \\mathrm{~s}$.\n\nThe above discussion suggests that feature $C$, which directly reports on transitions from the $\\mathrm{N}$ sp hybrid orbitals and the $\\mathrm{C} \\equiv \\mathrm{N} \\pi$ orbitals to the Fe $1 \\mathrm{~s}$ core hole would be the most sensitive to solvation effects as the $\\mathrm{N}$ atom in the cyanide ligand is involved in hydrogen bonding with the water molecules. The heterogeneous solute-solvent interaction results in a decreased amplitude of the $\\mathrm{C}$ feature and its presence as a shoulder in the experimental and simulated spectra. Further evidence of the impact of solvation on the spectra is seen by comparing the simulated spectra using a solvated cluster, which includes explicit solute-solvent interactions with those using an implicit solvation model (see Figures S6 and S7 in the Supporting Information). The feature $\\mathrm{C}$ is a distinct peak in the calculated spectra using an implicit solvation model, where the Fe(II) and Fe(III) complexes have perfect octahedral symmetry and structural heterogeneity and solute-solvent interactions are absent. We expect a greater reduction of feature $\\mathrm{C}$ in the $\\mathrm{Fe}$ (II) complex than the Fe(III) complex because our QM/MM MD simulations reveal that the solvent interacts more strongly with the cyanide ligands in the ferrous complex. This is demonstrated in comparison with the calculated spectra in Figure $5 \\mathrm{c}, \\mathrm{d}$, which shows a more distinct $\\mathrm{C}$ feature in the case of the ferric species.\n\nThe experimental spectra, Figure 5a,b, shows that the ratio of the intensities of peak $B$ relative to peak $D$ is significantly higher in the ferric species. This is due to the longer $\\mathrm{Fe}-\\mathrm{C}$ bond in the Fe(III) complex arising from the difference in metal-ligand interactions upon oxidation of the metal atom. The reversal of the relative peak ratios is not observed in the calculated spectra using the explicit and implicit solvation models (Figures S6 and S7). We note that calculations with the B3LYP exchange-correlation functional in ref 44 did show the experimentally observed trends. As explained earlier, our choice of the PBE0 functional for this work was motivated by our past and ongoing work on mixed-valence transition-metal complexes. A detailed analysis of the dependence of the VtC-XES on exchange-correlation functional choice is beyond the scope of this paper.\n\n3.6. Hexacyanoferrate Complexes in Water: Oxidation and Geometrical Changes Measured by XA Spectroscopy. Figure 6a displays the different XA spectra at the Fe K-edge\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_900c617369212d6bc72fg-09_834_1772_1267_1819}\n\nFigure 6. (a) Fe K-edge XA spectra hexacyanoferrate complexes dissolved in water. (b) EXAFS spectra of the $\\mathrm{Fe}$ (II) and $\\mathrm{Fe}$ (III) complexes weighted by $k^{3}$. The inset shows the amplitude and imaginary part of the Fourier-transformed EXAFS spectra weighted by $k^{3}$. The solid lines correspond to the fit of the data. For the $\\mathrm{Fe}(\\mathrm{II})$ complex, the extracted $\\mathrm{Fe}-\\mathrm{C}$ bond length is $1.92(1) \\AA$ and the $\\mathrm{Fe}-\\mathrm{N}$ distance is 3.11(1) $\\AA$. For the $\\mathrm{Fe}$ (III) complex, the $\\mathrm{Fe}-\\mathrm{C}$ bond length is $1.94(1) \\AA$ and the $\\mathrm{Fe}-\\mathrm{N}$ distance is 3.13(1) Å. Note that the Fourier-transformed spectra are not corrected for the phases; therefore, the displayed distances are shorter than those listed above and in the main text.\n\nnear the edge jump of the $\\left[\\mathrm{Fe}(\\mathrm{II}) \\mathrm{CN}_{6}\\right]^{4-}$ (red) and $\\left[\\mathrm{Fe}(\\mathrm{III}) \\mathrm{CN}_{6}\\right]^{3-}$ (blue) complexes dissolved in water. The pre-edge features have been discussed earlier in section 3.4. A comparison of the two spectra in Figure 6 a reveals that the main resonances shift to higher energies from $7129.3 \\mathrm{eV}$ for $\\mathrm{Fe}(\\mathrm{II})$ to $7130.3 \\mathrm{eV}$ for $\\mathrm{Fe}($ III $)$. This trend is followed for the next shape resonance, which is found at $7147.7$ and $7148.2 \\mathrm{eV}$ for the $\\mathrm{Fe}$ (II) and $\\mathrm{Fe}$ (III) complexes, respectively. The spectra are in agreement with those reported previously for the Fe(II) and $\\mathrm{Fe}(\\mathrm{III})$ complexes in solution with higher concentration. $9,14,21$ The twoshape resonances described above result from the backscattering of the photoelectron wave from the symmetric $\\mathrm{CN}$ ligand cage for both complexes. ${ }^{71}$ The shift of 1 $\\mathrm{eV}$ for the first resonance can result from a chemical shift upon oxidation of the iron atom or changes in the $\\mathrm{Fe}-\\mathrm{C}$ or the $\\mathrm{C} \\equiv$ $\\mathrm{N}$ bond lengths. Photoelectron spectra of these complexes in the solid state have measured a chemical shift of $1 \\mathrm{eV}$ of the $2 \\mathrm{p}$ core level upon oxidation of the Fe atom and a shift of $1.4 \\mathrm{eV}$ of the complexes for the $3 \\mathrm{~d}$ core level upon oxidation in aqueous solution. ${ }^{8,72}$ We can assume a similar shift of the 1 s core level upon oxidation in aqueous solution. This assumes that there is no change in the energy positions of the final states, and therefore no significant oxidation-state-dependent structural changes in solution. We will discuss the experimentally determined structural changes below using the EXAFS oscillations.\n\nFigure $6 b$ shows the $k^{3}$-weighted EXAFS spectra of the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}(\\mathrm{III})$ complexes in water. The very slight difference in the frequency and amplitude and the phase of the detected wave vector indicates that the molecular structures of the two iron complexes are similar in solution. The Fourier transform of the EXAFS spectra are plotted in the insets of Figure $6 \\mathrm{~b}$. The positions of the first peak correspond to the distances of the Fe atom from the first coordination shell of carbon atoms. The second peak in the Fourier transform results from multiple scattering paths of $\\mathrm{Fe}-\\mathrm{C}-\\mathrm{N}$ and the single scattering $\\mathrm{Fe}-\\mathrm{N}$ path, as noted previously. ${ }^{9,14}$ Results from fitting the EXAFS data are shown as solid lines in the inset of Figure 6b. The detailed fit results are listed in Table $\\mathrm{S} 1$ of the Supporting Information. The fits reveal that the average $\\mathrm{Fe}-\\mathrm{C}$ bond length is $1.92 \\pm 0.01$ and $1.94 \\pm 0.01 \\AA$ for the $\\mathrm{Fe}(\\mathrm{II})$ and $\\mathrm{Fe}$ (III) complexes, respectively. These results are in quantitative agreement with the pair distribution functions extracted from the QM/MM MD simulations of the Fe-C bonds and plotted in Figure $1 \\mathrm{~b}$. The average $\\mathrm{Fe}-\\mathrm{N}$ distance is found to be $3.11 \\pm 0.01$ and $3.13 \\pm 0.01 \\AA$ for the $\\mathrm{Fe}($ II $)$ and $\\mathrm{Fe}$ (III) complexes, respectively. The results reveal that the average $\\mathrm{CN}$ bond length is $1.19 \\AA$. The pair distribution function calculated in Figure 1c displays a slightly shorter average bond length of $1.16 \\AA$, which we tentatively attribute to our choice of exchange-correlation functional. The bond lengths extracted from the EXAFS fitting in this study agree quantitatively with those reported earlier in aqueous and solid form. ${ }^{9,14}$ The slight changes in the geometrical structures of the ferrous and ferric cyanide complexes in aqueous solution is reflected in the IR, $\\mathrm{UV} /$ vis, and core-level transitions, as discussed in the earlier sections.\n\n\\section{SUMMARY}\nWe have presented a combined experimental and computational study of the hexacyanoferrate aqueous complexes at equilibrium. Unlike the previous studies, our work is distinguished by (i) analysis of experimental spectra in solution spanning a large energy window of $250 \\mathrm{meV}$ to $7.15 \\mathrm{keV}$, (ii) developing a microscopic picture of the solute-solvent interactions using DFT-based QM/MM MD, and (iii) extracting explicit solute-solvent configurations from the MD simulations and using them to calculate the spectra from the IR to $\\mathrm{X}$-ray wavelengths at the same level of theory. Our consistent computational approach allows for a systematic study of how explicit solute-solvent interactions affect the position, amplitudes, and line shapes of the vibrational spectra of the cyanide ligands, valence electronic spectra of the charge-transfer transitions, and core-level XA and emission spectra of $\\mathrm{K}_{4} \\mathrm{Fe}^{\\mathrm{II}}(\\mathrm{CN})_{6}$ and $\\mathrm{K}_{3} \\mathrm{Fe}^{\\mathrm{III}}(\\mathrm{CN})_{6}$ in solution.\n\nThe MD simulations clearly reveal the stronger interaction of the $\\mathrm{Fe}(\\mathrm{II})$ complex with the water molecules around it as compared to the Fe(III) complex. This difference in the local hydration structure results in the greater structural heterogeneity for the $\\mathrm{Fe}(\\mathrm{II})$ complex with a larger distribution of $\\mathrm{Fe}-$ $\\mathrm{C}$ and $\\mathrm{C} \\equiv \\mathrm{N}$ bond lengths. The $\\mathrm{Fe}-\\mathrm{C}$ bond lengths extracted from the simulations are in quantitative agreement with the EXAFS fitting results.\n\nThe calculated spectra using explicit solute-solvent configurations reveal the following: (i) the larger line width and asymmetry in the IR spectra of the cyanide stretching region for $\\mathrm{K}_{4} \\mathrm{Fe}^{\\mathrm{II}}(\\mathrm{CN})_{6}$ results from the larger structural heterogeneity of the $\\mathrm{Fe}(\\mathrm{II})$ complex in solution, (ii) the structural distortions from octahedral symmetry and modulation of the metal-ligand interactions induced by the hydrogen-bonding interactions with the surrounding water molecules results in higher intensity for $\\mathrm{d}-\\mathrm{d}$ transitions and a larger number of LMCT transitions in the UV/vis spectra of the hexacyanoferrate complexes, (iii) the effect of explicit solvation modulates the position and amplitude of feature $\\mathrm{C}$ at $7116 / 7118 \\mathrm{eV}$ for the $\\mathrm{Fe}(\\mathrm{II}) / \\mathrm{Fe}(\\mathrm{III})$ complexes in the XANES region of the Fe K-edge XA spectrum, and (iv) the intensity of the spectral feature at 7107/ $7108 \\mathrm{eV}$ for the $\\mathrm{Fe}(\\mathrm{II}) / \\mathrm{Fe}(\\mathrm{III})$ complexes in the VtC XE spectra is dependent on how strongly the hydrogen bonding interactions with the surrounding water molecules affect the metal-ligand interactions in the transition-metal complexes.\n\nThe identification and description of how the local solvent environment affects the equilibrium spectral properties of $\\mathrm{K}_{4} \\mathrm{Fe}^{\\mathrm{II}}(\\mathrm{CN})_{6}$ and $\\mathrm{K}_{3} \\mathrm{Fe}^{\\mathrm{III}}(\\mathrm{CN})_{6}$ in solution have implications for interpreting the photochemistry of these complexes and underscore the importance of accounting for explicit solutesolvent interactions on nonequilibrium electronic-excited states. More broadly, this work emphasizes the importance and provides a methodology for including explicit solute-solvent interactions to quantitatively simulate the spectroscopy of solvated transition-metal complexes from the IR to X-ray wavelengths. This work also serves as an important study for our ongoing investigations on the equilibrium and excited-state structure and spectroscopy of transition-metal-mixed valence complexes dissolved in aqueous solution, which contain the $\\left[\\mathrm{Fe}^{\\mathrm{II}}(\\mathrm{CN})_{6}\\right]^{4-}$ and $\\left[\\mathrm{Fe}^{\\mathrm{III}}(\\mathrm{CN})_{6}\\right]^{3-}$ motifs.\n\n\\section{ASSOCIATED CONTENT}\n\\section{(s) Supporting Information}\nThe Supporting Information is available free of charge on the ACS Publications website at DOI: 10.1021/acs.jpcb.7b12532.\n\nComparison of the simulated spectra using different solvation models, plot of an expanded view of the XES transitions labeled $\\mathrm{B}-\\mathrm{D}$, plot of the molecular orbitals involved in the XANES transitions, comparison of the pair-distribution functions for the $\\mathrm{Fe}-\\mathrm{C}$ and $\\mathrm{C} \\equiv \\mathrm{N}$ bond lengths calculated using different solvation models for $\\mathrm{MD}$ simulations, and list of the best-fit parameters from the EXAFS fitting (PDF)\n\n\\section{AUTHOR INFORMATION}\n\\section{ORCID $\\odot$}\nMatthew Ross: 0000-0002-0434-544X\n\nShaul Mukamel: 0000-0002-6015-3135\n\nNiranjan Govind: 0000-0003-3625-366X\n\nMunira Khalil: 0000-0002-6508-4124\n\n\\section{Present Addresses}\n\"Corning Inc., Corning NY, USA (M.R.).\n\n${ }^{\\nabla}$ PULSE Institute, SLAC National Accelerator Laboratory, Menlo Park, CA 94025, USA (Y.Z.).\n\n${ }^{\\circ}$ Center for Gas Analysis, Division of Chemical and Medical Metrology, Korea Research Institute of Standards and Science, Daejeon 34113, Republic of Korea (K.H.).\n\nPohang Accelerator Laboratory, San-31 Hyoja-dong Pohang, Kyungbuk 37673, Republic of Korea (J.-H.L.).\n\n${ }^{\\dagger}$ PULSE Institute, SLAC National Accelerator Laboratory, Menlo Park, CA 94025, USA (A.C.).\n\n${ }^{\\ddagger}$ Linac Coherent Light Source, SLAC National Accelerator Laboratory, Menlo Park, CA 94025, USA (R.W.S.).\n\n\\section{Notes}\nThe authors declare no competing financial interest.\n\n\\section{ACKNOWLEDGMENTS}\nThis research used resources of the Advanced Light Source, which is a DOE Office of Science User Facility under contract no. DE-AC02-05CH11231. This material is based upon work supported by the U.S. Department of Energy, Office of Science, Office of Basic Energy Sciences under award numbers DESC0012450, DE-FG02-04ER15571, and KC-030105066418. Computational work was performed using EMSL, a DOE Office of Science User Facility sponsored by the Office of Biological and Environmental Research and located at PNNL. PNNL is operated by Battelle Memorial Institute for the United States Department of Energy under DOE contract number DE-AC05-76RL1830. The computational work also benefited from resources provided by PNNL Institutional Computing (PIC) and by the National Energy Research Scientific Computing Center (NERSC), a DOE Office of Science User Facility supported by the Office of Science of the U.S. Department of Energy under contract no. DE-AC02$05 \\mathrm{CH} 11231$. This material is based on the work supported by the U.S. Department of Energy, Office of Basic Energy Sciences, Division of Chemical Sciences, Geosciences, and Biosciences through Argonne National Laboratory (ANL) and Lawrence Berkeley National Laboratory (LBNL). Argonne is a U.S. Department of Energy laboratory managed by the University of Chicago Argonne, LLC, under contract DEAC02-06CH11357. This research used resources of the Advanced Photon Source, a U.S. Department of Energy (DOE) Office of Science User Facility operated for the DOE Office of Science by Argonne National Laboratory under contract no. DE-AC02-06CH11357. LBNL is a U.S. Department of Energy laboratory managed and operated by the Regents of the University of California under prime contract number DE-AC02-05CH11231.\n\n\\section{REFERENCES}\n(1) Humphrey, W.; Dalke, A.; Schulten, K. VMD: Visual Molecular Dynamics. J. Mol. Graphics 1996, 14, 33-38.\n\n(2) Yu, P.; Yang, F.; Zhao, J.; Wang, J. Hydration Dynamics of Cyanoferrate Anions Examined by Ultrafast Infrared Spectroscopy. J. Phys. Chem. B 2014, 118, 3104-3114. (3) Prampolini, G.; Yu, P.; Pizzanelli, S.; Cacelli, I.; Yang, F.; Zhao, J.; Wang, J. Structure and Dynamics of Ferrocyanide and Ferricyanide Anions in Water and Heavy Water: An Insight by MD Simulations and 2D IR Spectroscopy. J. Phys. Chem. B 2014, 118, 14899-14912.\n\n(4) Risch, M.; Stoerzinger, K. A.; Regier, T. Z.; Peak, D.; Sayed, S. Y.; Shao-Horn, Y. Reversibility of Ferri-/Ferrocyanide Redox During Operando Soft X-ray Spectroscopy. J. Phys. Chem. C 2015, 119, $18903-18910$.\n\n(5) Engel, N.; Bokarev, S. I.; Suljoti, E.; Garcia-Diez, R.; Lange, K. M.; Atak, K.; Golnak, R.; Kothe, A.; Dantz, M.; Kühn, O.; et al. Chemical Bonding in Aqueous Ferrocyanide: Experimental and Theoretical X-ray Spectroscopic Study. J. Phys. Chem. B 2014, 118, $1555-1563$\n\n(6) Sando, G. M.; Zhong, Q.; Owrutsky, J. C. Vibrational and Rotational Dynamics of Cyanoferrates in Solution. J. Chem. Phys. 2004, 121, 2158-2168.\n\n(7) Penfold, T. J.; Reinhard, M.; Rittmann-Frank, M. H.; Tavernelli, I.; Rothlisberger, U.; Milne, C. J.; Glatzel, P.; Chergui, M. X-ray Spectroscopic Study of Solvent Effects on the Ferrous and Ferric Hexacyanide Anions. J. Phys. Chem. A 2014, 118, 9411–9418.\n\n(8) Seidel, R.; Thürmer, S.; Moens, J.; Geerlings, P.; Blumberger, J.; Winter, B. Valence Photoemission Spectra of Aqueous $\\mathrm{Fe}^{2+/ 3+}$ and $\\left[\\mathrm{Fe}(\\mathrm{CN})_{6}\\right]^{4 / 3-}$ and Their Interpretation by DFT Calculations. J. Phys. Chem. B 2011, 115, 11671-11677.\n\n(9) Hayakawa, K.; Hatada, K.; D’Angelo, P.; Della Longa, S.; Natoli, C. R.; Benfatto, M. Full Quantitative Multiple-Scattering Analysis of Xray Absorption Spectra: Application to Potassium Hexacyanoferrat(II) and -(III) Complexes. J. Am. Chem. Soc. 2004, 126, 15618-15623.\n\n(10) Kunnus, K.; Zhang, W.; Delcey, M. G.; Pinjari, R. V.; Miedema, P. S.; Schreck, S.; Quevedo, W.; Schröder, H.; Föhlisch, A.; Gaffney, K. J.; et al. Viewing the Valence Electronic Structure of Ferric and Ferrous Hexacyanide in Solution from the Fe and Cyanide Perspectives. J. Phys. Chem. B 2016, 120, 7182-7194.\n\n(11) Lee, T.; Jiang, Y.; Rose-Petruck, C. G.; Benesch, F. Ultrafast Tabletop Laser-Pump-X-ray Probe Measurement of Solvated Fe$(\\mathrm{CN})_{6}{ }^{(4-)}$. J. Chem. Phys. 2005, 122, 084506.\n\n(12) Freiwald, M.; Cramm, S.; Eberhardt, W.; Eisebitt, S. Soft X-ray Absorption Spectroscopy in Liquid Environments. J. Electron Spectrosc. Relat. Phenom. 2004, 137-140, 413-416.\n\n(13) March, A. M.; Assefa, T. A.; Bressler, C.; Doumy, G.; Galler, A.; Gawelda, W.; Kanter, E. P.; Németh, Z.; Pápai, M.; Southworth, S. H.; et al. Feasibility of Valence-to-Core X-ray Emission Spectroscopy for Tracking Transient Species. J. Phys. Chem. C 2015, 119, 14571-14578.\n\n(14) Tirler, A. O.; Persson, I.; Hofer, T. S.; Rode, B. M. Is the Hexacyanoferrate(II) Anion Stable in Aqueous Solution? A Combined Theoretical and Experimental Study. Inorg. Chem. 2015, 54, 1033510341.\n\n(15) Gaynor, J. D.; Courtney, T. L.; Balasubramanian, M.; Khalil, M. Fourier Transform Two-Dimensional Electronic-Vibrational Spectroscopy Using an Octave-Spanning Mid-IR probe. Opt. Lett. 2016, 41, $2895-2898$\n\n(16) Courtney, T. L.; Fox, Z. W.; Slenkamp, K. M.; Khalil, M. TwoDimensional Vibrational-Electronic Spectroscopy. J. Chem. Phys. 2015, $143,154201$.\n\n(17) Ojeda, J.; Arrell, C. A.; Longetti, L.; Chergui, M.; Helbing, J. Charge-Transfer and Impulsive Electronic-to-Vibrational Energy Conversion in Ferricyanide: Ultrafast Photoelectron and Transient Infrared Studies. Phys. Chem. Chem. Phys. 2017, 19, 17052-17062.\n\n(18) Zhang, W.; Ji, M.; Sun, Z.; Gaffney, K. J. Dynamics of SolventMediated Electron Localization in Electronically Excited Hexacyanoferrate(III). J. Am. Chem. Soc. 2012, 134, 2581-2588.\n\n(19) Anderson, N. A.; Hang, K.; Asbury, J. B.; Lian, T. Ultrafast MidIR Detection of the Direct Precursor to the Presolvated Electron Following Electron Ejection from Ferrocyanide. Chem. Phys. Lett. 2000, 329, 386-392.\n\n(20) Reinhard, M.; Auböck, G.; Besley, N. A.; Clark, I. P.; Greetham, G. M.; Hanson-Heine, M. W. D.; Horvath, R.; Murphy, T. S.; Penfold, T. J.; Towrie, M.; et al. Photoaquation Mechanism of Hexacyanoferrate(II) Ions: Ultrafast 2D UV and Transient Visible and IR Spectroscopies. J. Am. Chem. Soc. 2017, 139, 7335–7347.\n\n(21) Reinhard, M.; Penfold, T. J.; Lima, F. A.; Rittmann, J.; Rittmann-Frank, M. H.; Abela, R.; Tavernelli, I.; Rothlisberger, U.; Milne, C. J.; Chergui, M. Photooxidation and Photoaquation of Iron Hexacyanide in Aqueous Solution: A Picosecond X-ray Absorption Study. Struct. Dyn. 2014, 1, 024901.\n\n(22) Engel, N.; Bokarev, S. I.; Moguilevski, A.; Raheem, A. A.; AlObaidi, R.; Möhle, T.; Grell, G.; Siefermann, K. R.; Abel, B.; Aziz, S. G.; et al. Light-Induced Relaxation Dynamics of the Ferricyanide Ion Revisited by Ultrafast XUV Photoelectron Spectroscopy. Phys. Chem. Chem. Phys. 2017, 19, 14248-14255.\n\n(23) Walko, D. A.; Adams, B. W.; Doumy, G.; Dufresne, E. M.; Li, Y.; March, A. M.; Sandy, A. R.; Wang, J.; Wen, H.; Zhu, Y. Developments in Time-Resolved X-ray Research at APS beamline 7ID. AIP Conf. Proc. 2016, 1741, 030048.\n\n(24) Marcus, M. A.; MacDowell, A. A.; Celestre, R.; Manceau, A.; Miller, T.; Padmore, H. A.; Sublett, R. E. Beamline 10.3.2 at ALS: A Hard X-ray Microprobe for Environmental and Materials Sciences. J. Synchrotron Radiat. 2004, 11, 239-247.\n\n(25) Ravel, B.; Newville, M. ATHENA, ARTEMIS, HEPHAESTUS: Data Analysis for X-ray Absorption Spectroscopy Using IFEFFIT. J. Synchrotron Radiat. 2005, 12, 537-541.\n\n(26) Teo, B. K. EXAFS: Basic Principles and Data Analysis; Springer: Berlin, NY, 1986; p 349.\n\n(27) Ankudinov, A. L.; Ravel, B.; Rehr, J. J.; Conradson, S. D. RealSpace Multiple-Scattering Calculation and Interpretation of X-ray Absorption Near-Edge Structure. Phys. Rev. B: Condens. Matter Mater. Phys. 1998, 58, 7565-7576.\n\n(28) Ressler, T. WinXAS: A program for X-ray Absorption Spectroscopy Data Analysis Under MS-Windows. J. Synchrotron Radiat. 1998, 5, 118-122.\n\n(29) Valiev, M.; Bylaska, E. J.; Govind, N.; Kowalski, K.; Straatsma, T. P.; van Dam, H. J. J.; Wang, D.; Nieplocha, J.; Apra, E.; Windus, T. L.; et al. NWChem: A Comprehensive and Scalable Open-source Solution for Large Scale Molecular Simulations. Comput. Phys. Commun. 2010, 181, 1477-1489.\n\n(30) Berendsen, H. J. C.; Grigera, J. R.; Straatsma, T. P. The Missing Term in Effective Pair Potentials. J. Phys. Chem. 1987, 91, 6269-6271.\n\n(31) Joung, I. S.; Cheatham, T. E. Determination of Alkali and Halide Monovalent Ion Parameters for Use in Explicitly Solvated Biomolecular Simulations. J. Phys. Chem. B 2008, 112, 9020-9041.\n\n(32) Krishnan, R.; Binkley, J. S.; Seeger, R.; Pople, J. A. Selfconsistent Molecular Orbital Methods. XX. A Basis Set for Correlated Wave Functions. J. Chem. Phys. 1980, 72, 650-654.\n\n(33) McLean, A. D.; Chandler, G. S. Contracted Gaussian Basis Sets for Molecular Calculations. I. Second Row Atoms, $\\mathrm{Z}=11-18$. J. Chem. Phys. 1980, 72, 5639-5648.\n\n(34) Dolg, M.; Wedig, U.; Stoll, H.; Preuss, H. Energy-Adjusted Ab initio Pseudopotentials for the first row transition elements. J. Chem. Phys. 1987, 86, 866-872.\n\n(35) Wang, J.; Wolf, R. M.; Caldwell, J. W.; Kollman, P. A.; Case, D. A. Development and Testing of a General Amber Force Field. J. Comput. Chem. 2004, 25, 1157-1174.\n\n(36) Cygan, R. T.; Liang, J.-J.; Kalinichev, A. G. Molecular Models of Hydroxide, Oxyhydroxide, and Clay Phases and the Development of a General Force Field. J. Phys. Chem. B 2004, 108, 1255-1266.\n\n(37) Ryckaert, J.-P.; Ciccotti, G.; Berendsen, H. J. C. Numerical Integration of the Cartesian Equations of Motion of a System with Constraints: Molecular Dynamics of N-Alkanes. J. Comput. Phys. 1977, 23, 327-341.\n\n(38) Adamo, C.; Barone, V. Toward Reliable Density Functional Methods without Adjustable Parameters: The PBE0 Model. J. Chem. Phys. 1999, 110, 6158-6170.\n\n(39) Casida, M. E. Recent Advances in Density Functional Methods, Part I; Chong, D. P., Ed.; World Scientific: Singapore, 1995; pp 155-192.\n\n(40) Hirata, S.; Head-Gordon, M. Time-Dependent Density Functional Theory for Radicals: An Improved Description of Excited States with Substantial Double Excitation Character. Chem. Phys. Lett. 1999, 302, 375-382.\n\n(41) Stener, M.; Fronzoni, G.; de Simone, M. Time Dependent Density Functional Theory of Core Electrons Excitations. Chem. Phys. Lett. 2003, 373, 115-123.\n\n(42) Besley, N. A.; Noble, A. Time-Dependent Density Functional Theory Study of the X-ray Absorption Spectroscopy of Acetylene, Ethylene, and Benzene on $\\mathrm{Si}(100)$. J. Phys. Chem. C 2007, 111, 33333340.\n\n(43) George, S. D.; Petrenko, T.; Neese, F. Time-Dependent Density Functional Calculations of Ligand K-edge X-ray Absorption Spectra. Inorg. Chim. Acta 2008, 361, 965-972.\n\n(44) Liang, W.; Fischer, S. A.; Frisch, M. J.; Li, X. Energy-Specific Linear Response TDHF/TDDFT for Calculating High-Energy Excited States. J. Chem. Theory Comput. 2011, 7, 3540-3547.\n\n(45) Lopata, K.; Van Kuiken, B. E.; Khalil, M.; Govind, N. LinearResponse and Real-Time Time-Dependent Density Functional Theory Studies of Core-Level Near-Edge X-Ray Absorption. J. Chem. Theory Comput. 2012, 8, 3284-3292.\n\n(46) Zhang, Y.; Mukamel, S.; Khalil, M.; Govind, N. Simulating Valence-to-Core X-ray Emission Spectroscopy of Transition Metal Complexes with Time-Dependent Density Functional Theory. J. Chem. Theory Comput. 2015, 11, 5804-5809.\n\n(47) Van Kuiken, B. E.; Valiev, M.; Daifuku, S. L.; Bannan, C.; Strader, M. L.; Cho, H.; Huse, N.; Schoenlein, R. W.; Govind, N.; Khalil, M. Simulating $\\mathrm{Ru} \\mathrm{L}_{3}$-Edge X-ray Absorption Spectroscopy with Time-Dependent Density Functional Theory: Model Complexes and Electron Localization in Mixed-Valence Metal Dimers. J. Phys. Chem. A 2013, 117, 4444-4454.\n\n(48) Zhang, Y.; Biggs, J. D.; Healion, D.; Govind, N.; Mukamel, S. Core and Valence Excitations in Resonant X-ray Spectroscopy Using Restricted Excitation Window Time-dependent Density Functional Theory. J. Chem. Phys. 2012, 137, 194306.\n\n(49) Vijayakumar, M.; Govind, N.; Walter, E.; Burton, S. D.; Shukla, A.; Devaraj, A.; Xiao, J.; Liu, J.; Wang, C.; Karim, A.; et al. Molecular Structure and Stability of Dissolved Lithium Polysulfide Species. Phys. Chem. Chem. Phys. 2014, 16, 10923-10932.\n\n(50) Vjunov, A.; Fulton, J. L.; Huthwelker, T.; Pin, S.; Mei, D.; Schenter, G. K.; Govind, N.; Camaioni, D. M.; Hu, J. Z.; Lercher, J. A. Quantitatively Probing the Al Distribution in Zeolites. J. Am. Chem. Soc. 2014, 136, 8296-8306.\n\n(51) Fulton, J. L.; Govind, N.; Huthwelker, T.; Bylaska, E. J.; Vjunov, A.; Pin, S.; Smurthwaite, T. D. Electronic and Chemical State of Aluminum from the Single- (K) and Double-Electron Excitation (KLII\\&III, KLI) X-ray Absorption Near-Edge Spectra of $\\alpha$-Alumina, Sodium Aluminate, Aqueous $\\mathrm{Al}^{3+} .\\left(\\mathrm{H}_{2} \\mathrm{O}\\right)_{6}$, and Aqueous $\\mathrm{Al}(\\mathrm{OH})^{4-} . J$. Phys. Chem. B 2015, 119, 8380-8388.\n\n(52) Govind, N.; de Jong, W. A. Simulating Cl K-edge X-ray Absorption Spectroscopy in $\\mathrm{MCl}_{6}^{2-}(\\mathrm{M}=\\mathrm{U}, \\mathrm{Np}, \\mathrm{Pu})$ Complexes and $\\mathrm{UOCl}_{5}$ Using Time-Dependent Density Functional Theory. Theor. Chem. Acc. 2014, 133, 1463.\n\n(53) Galib, M.; Baer, M. D.; Skinner, L. B.; Mundy, C. J.; Huthwelker, T.; Schenter, G. K.; Benmore, C. J.; Govind, N.; Fulton, J. L. Revisiting the Hydration Structure of Aqueous $\\mathrm{Na}+$. J. Chem. Phys. 2017, 146, 084504.\n\n(54) Henzler, K.; Fetisov, E. O.; Galib, M.; Baer, M. D.; Legg, B. A.; Borca, C.; Xto, J. M.; Pin, S.; Fulton, J. L.; Schenter, G. K.; et al. Supersaturated Calcium Carbonate Solutions are Classical. Sci. Adv. 2018, 4, No. eaao6283.\n\n(55) Noro, T.; Sekiya, M.; Koga, T. Segmented Contracted Basis Sets for Atoms $\\mathrm{H}$ Through Xe: Sapporo-(DK)-nZP Sets $(\\mathrm{n}=\\mathrm{D}, \\mathrm{T}, \\mathrm{Q})$. Theor. Chem. Acc. 2012, 131, 1124.\n\n(56) Bergner, A.; Dolg, M.; Küchle, W.; Stoll, H.; Preuß, H. Ab initio Energy-Adjusted Pseudopotentials for Elements of Groups 13-17. Mol. Phys. 1993, 80, 1431.\n\n(57) Kaupp, M.; Schleyer, P. v. R.; Stoll, H.; Preuss, H. Pseudopotential Approaches to $\\mathrm{Ca}, \\mathrm{Sr}$, and Ba Hydrides. Why Are Some Alkaline Earth $\\mathrm{MX}_{2}$ Compounds Bent? J. Chem. Phys. 1991, 94, $1360-1366$. (58) Dolg, M.j Stoll, H.; Preuss, H.; Pitzer, R. M. Relativistic and Correlation Effects for Element 105 (Hahnium, Ha): A Comparative Study of $M$ and $M O(M=N b, T a$, Ha $)$ Using Energy-Adjusted $A b$ initio Pseudopotentials. J. Phys. Chem. 1993, 97, 5852-5859.\n\n(59) Jones, L. H. Nature of Bonding in Metal Cyanide Complexes as Related to Intensity and Frequency of Infrared Absorption Spectra. Inorg. Chem. 1963, 2, 777-780.\n\n(60) Naiman, C. S. Interpretation of the Absorption Spectra of $\\mathrm{K}_{3} \\mathrm{Fe}(\\mathrm{CN})_{6}$. J. Chem. Phys. 1961, 35, 323-328.\n\n(61) Alexander, J. J.; Gray, H. B. Electronic Structures of Hexacyanometalate Complexes. J. Am. Chem. Soc. 1968, 90, 42604271.\n\n(62) Gray, H. B.; Beach, N. A. The Electronic Structures of Octahedral Metal Complexes. I. Metal Hexacarbonyls and Hexacyanides. J. Am. Chem. Soc. 1963, 85, 2922-2927.\n\n(63) Koningsberger, D. C.; Prins, R. X-ray Absorption: Principles, Applications, Techniques of EXAFS, SEXAFS and XANES; John Wiley \\& Sons: New York, 1988; Vol. 92.\n\n(64) Stöhr, J. NEXAFS Spectroscopy; Springer Berlin Heidelberg, 1992; Vol. 25.\n\n(65) Rehr, J. J.; Ankudinov, A. L. Progress in the Theory and Interpretation of XANES. Coord. Chem. Rev. 2005, 249, 131-140.\n\n(66) George, S. D.; Petrenko, T.; Neese, F. Prediction of Iron K-edge Absorption Spectra Using Time-Dependent Density Functional Theory. J. Phys. Chem. A 2008, 112, 12936-12943.\n\n(67) Westre, T. E.; Kennepohl, P.; DeWitt, J. G.; Hedman, B.; Hodgson, K. O.; Solomon, E. I. A Multiplet Analysis of Fe K-Edge 1s $\\rightarrow 3$ d Pre-Edge Features of Iron Complexes. J. Am. Chem. Soc. 1997, $119,6297-6314$.\n\n(68) Bauer, M. HERFD-XAS and Valence-to-Core-XES: New Tools to Push the Limits in Research with Hard X-rays? Phys. Chem. Chem. Phys. 2014, 16, 13827-13837.\n\n(69) Pollock, C. J.; Delgado-Jaime, M. U.; Atanasov, M.; Neese, F.; DeBeer, S. K $\\beta$ Mainline X-ray Emission Spectroscopy as an Experimental Probe of Metal-Ligand Covalency. J. Am. Chem. Soc. 2014, 136, 9453-9463.\n\n(70) Lee, N.; Petrenko, T.; Bergmann, U.; Neese, F.; DeBeer, S. Probing Valence Orbital Composition with Iron $\\mathrm{K} \\beta \\mathrm{X}$-ray Emission Spectroscopy. J. Am. Chem. Soc. 2010, 132, 9715-9727.\n\n(71) Bianconi, A.; Dell'Ariccia, M.; Durham, P. J.; Pendry, J. B. Multiple-Scattering Resonances and Structural Effects in the X-ray Absorption Near-Edge Spectra of Fe II and Fe III Hexacyanide Complexes. Phys. Rev. B: Condens. Matter Mater. Phys. 1982, 26, 65026508.\n\n(72) Zeller, M. V.; Hayes, R. G. X-ray Photoelectron Spectroscopic Studies on the Electronic Structures of Porphyrin and Phthalocyanine Compounds. J. Am. Chem. Soc. 1973, 95, 3855-3860.\n\n\n\\end{document}", "record_id": "2023_09_22_900c617369212d6bc72fg"}