{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{A Aalto University }\n\n\n\\author{Mikko Nisula, Jarno Linnera, Antti J. Karttunen, and Maarit Karppinen*[a]}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nThis is an electronic reprint of the original article.\n\nThis reprint may differ from the original in pagination and typographic detail.\n\nNisula, Mikko; Linnera, Jarno; Karttunen, Antti J.; Karppinen, Maarit\n\nLithium Aryloxide Thin Films with Guest-Induced Structural Transformation by ALD/MLD\n\nPublished in:\n\nCHEMISTRY: A EUROPEAN JOURNAL\n\nDOI:\n\n10.1002/chem.201605816\n\nPublished: 01/01/2017\n\nDocument Version\n\nPeer reviewed version\n\nPublished under the following license:\n\nUnspecified\n\nPlease cite the original version:\n\nNisula, M., Linnera, J., Karttunen, A. J., \\& Karppinen, M. (2017). Lithium Aryloxide Thin Films with GuestInduced Structural Transformation by ALD/MLD. CHEMISTRY: A EUROPEAN JOURNAL, 2988 - 2992. \\href{https://doi.org/10.1002/chem.201605816}{https://doi.org/10.1002/chem.201605816}\n\nThis material is protected by copyright and other intellectual property rights, and duplication or sale of all or part of any of the repository collections is not permitted, except that material may be duplicated by you for your research use or educational purposes in electronic or print form. You must obtain permission for any other use. Electronic or print copies may not be offered, whether for sale or otherwise to anyone who is not an authorised user.\n\n\\section*{Lithium aryloxide thin films with guest-induced structural transformation by ALD/MLD }\n\n\n\\begin{abstract}\nCrystalline Li-organic thin films are grown with the atomic/molecular layer deposition (ALD/MLD) technique from lithium hexamethyldisilazide and hydroquinone. The as-deposited films are found to undergo a reversible structural transformation upon exposure to ambient humid air. According to density functional theory calculations, the guest-induced transformation may be related to an unsaturated Li site in the crystal structure.\n\\end{abstract}\n\nHigh-quality thin films of the (porous) coordination polymers (CPs) would be highly beneficial for applications in microelectronics, as e.g. Sensors or smart membranes. ${ }^{[1]}$ However, the present solution-based thin-film deposition methods of CPs may not be readily scalable for industrial production, whereas vapour-phase deposition would comply well with the needs of microelectronics fabrication processes. ${ }^{[2,3]}$ Another potential difficulty arises from the fact that in the sensing applications it is beneficial for the thinfilm material to contain open metal sites, i.e. metal nodes with an unsaturated coordination sphere to enhance the interaction towards guest molecules. ${ }^{[4]}$ The inherent drawback of the solution-based synthesis methods is the unavoidable inclusion of the solvent molecules on these sites necessitating their often complicated post-deposition removal. Being intrinsically solventfree, the vapour phase methods obviously circumvent this issue.\n\nAtomic layer deposition (ALD) is a gas-phase thin film deposition technique with a well-established track record within the semiconductor industry. Owing to its unique deposition mechanism based on successive self-terminating surface reactions, the technique is well suited for the fabrication of conformal nanostructures on a wide range of substrate materials. ${ }^{[5]}$ Moreover the emergence of the combined atomic/molecular layer deposition (ALD/MLD) technique now allows various metal constituents to be combined with organic moieties to yield hybrid inorganic-organic thin films. ${ }^{[6]}$ Nevertheless, efforts to deposit porous CPs (also known as metalorganic frameworks or MOFs) utilizing gas-phase routes are scarce yet, ${ }^{[7,8]}$ and only one direct ALD/MLD process to yield insitu crystalline porous CP thin films has so far been reported. ${ }^{[9]}$\n\n[a] M. Nisula, J. Linnera, Prof. A.J. Karttunen, Prof. M. Karppinen Department of Chemistry and Materials Science Aalto University\n\nFI-00076, Aalto, Finland\n\nE-mail: \\href{mailto:maarit.karppinen@aalto.fi}{maarit.karppinen@aalto.fi}\n\nSupporting information for this article is given via a link at the end of the document. Thus understanding the conditions leading to wellcrystallized inorganic-organic thin films is a key requirement on the road to gas-phase deposition of porous CP thin films. In our very recent ALD/MLD works we have indeed been able to deposit in-situ crystalline (but not necessarily porous) inorganic-organic thin films with several different precursor combinations. ${ }^{[9-11]}$ Especially with the s-block metals, Ca and Li, well-crystalline films were obtained over a wide temperature range when combined with 1,4-benzenedicarboxylic acid as the organic component. Of the s-block metals, lithium has probably been most extensively investigated as the active, undersaturated metal site in the field of coordination polymers ${ }^{[12-15]}$ and thus was chosen as the metal constituent in the present study as well. Since carboxylic acids tend to form rather stable compounds with lithium in tetrahedral coordination, $[16,17]$ hydroquinone with its only two binding sites in para positions was chosen as the organic moiety on the basis that steric hindrance during the film deposition might prevent lithium from achieving the full coordination sphere.\n\nIn this study the lithium aryloxide thin films were deposited from lithium hexamethyldisilazide (LiHMDS, alternatively lithium bis(trimethylsilyl)amide) and hydroquinone (HQ) precursors using a commercial flow type F-120 ALD reactor from ASM Microchemistry (see ESI for full experimental details). The asdeposited films were uniform by visual observation; exposure to ambient air then led to a rapid colour change indicative of an increase in the film thickness while the uniformity in colour was well preserved. For the detailed study of the pristine samples, the films were coated with $40 \\mathrm{ALD}$-cycles of $\\mathrm{Al}_{2} \\mathrm{O}_{3}$, which rendered the films stable for the duration of relevant experiments (confirmed by FTIR)\n\nThe film growth was studied in the temperature range of $105-280^{\\circ} \\mathrm{C}$ (Figure 1a), at the low end limited by the sublimation temperature of $\\mathrm{HQ}\\left(95^{\\circ} \\mathrm{C}\\right)$, and at the high end by the drastic increase in the film roughness, which was taken as a sign of nonuniform growth. From 105 to $240{ }^{\\circ} \\mathrm{C}$ a rather monotonous decrease in the growth rate was observed, which is typical for the ALD/MLD processes of inorganic-organic hybrid materials. ${ }^{[6,18,19]}$ The hallmark of ALD/MLD processes is the surface-saturationlimited growth, which manifests itself as a constant growth-percycle (GPC) value regardless of the precursor pulse lengths employed. Accordingly, this was verified for both the precursors at 120 and $220^{\\circ} \\mathrm{C}$ (Figures $1 \\mathrm{~b}$ and 1c). Moreover, the film thickness was confirmed to increase in a highly linear manner as a function of the number of deposition cycles. In the FTIR spectrum of a pristine $\\mathrm{Al}_{2} \\mathrm{O}_{3}$-capped film from our Li-HMDS $+\\mathrm{HQ}$ process, prominent absorption bands are seen only at $1500 \\mathrm{~cm}^{-1}$ and below, attributable to the different modes of the benzene ring and the $\\mathrm{C}-\\mathrm{O}$ bond. Importantly, the $\\mathrm{O}-\\mathrm{H}$ stretching mode of the free $\\mathrm{HQ}$ molecule expected at around $3700 \\mathrm{~cm}^{-1}$ is absent for our thin films (Inset, Figure 2b). ${ }^{[20]}$ It can thus be concluded that the HQ precursor has reacted completely to the expected aryloxide,\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_87d405f182ae3706ea0cg-3_290_992_151_981}\n\nFigure 1. (a) The growth-per-cycle (GPC, solid squares) and roughness (open circles) of the $\\mathrm{Li}_{2} \\mathrm{Q}$ thin films as a function of the deposition temperature, (b) and (c) the GPC as a function of the LiHMDS (solid squares) and $\\mathrm{HQ}$ (open circles) pulse lengths determined at 120 and $220{ }^{\\circ} \\mathrm{C}$, respectively, (d) the $\\mathrm{Li}_{2} \\mathrm{Q}$ film thickness as a function of number of ALD/MLD cycles determined at deposition temperature of $120^{\\circ} \\mathrm{C}$.\n\ni.e. dilithium 1,4-benzenediolate $\\left(\\mathrm{Li}_{2}\\left[p-\\mathrm{C}_{6} \\mathrm{H}_{4} \\mathrm{O}_{2}\\right]\\right.$, hereafter $\\left.\\mathrm{Li}_{2} \\mathrm{Q}\\right)$. Also importantly, no signs of $\\mathrm{LiOH}$ or $\\mathrm{Li}_{2} \\mathrm{CO}_{3}$ were detected either.\n\nThe as-deposited $\\mathrm{Li}_{2} \\mathrm{Q}$ thin films were crystalline at all deposition temperatures as verified by grazing incidence $X$-ray diffraction (GIXRD) (Figure S1, ESI). With increasing deposition temperature, a change in the GIXRD patterns can be observed: the peak at $11.5^{\\circ}$ diminishes, while a new peak appears at $23.3^{\\circ}$. The density of the films, as determined by $X R R$, however stays rather constant at $1.2 \\mathrm{~g} / \\mathrm{cm}^{3}$. More detailed diffraction patterns were measured from ca. $800 \\mathrm{~nm}$ thick samples deposited at 105 and $220^{\\circ} \\mathrm{C}$. At the low-temperature end, a well-defined pattern could be obtained (Figure 2a), whereas the high-temperature sample yielded only a few reflections which partially overlapped with those of the low-temperature sample (Figure S2, ESI). Importantly, once formed, the low-temperature sample retains its crystal structure even at elevated temperatures as was investigated through a post-deposition heat treatment at $250^{\\circ} \\mathrm{C}$ in vacuum.\n\nTo the best of our knowledge, no prior reports exist on the crystal structure of $\\mathrm{Li}_{2} \\mathrm{Q}$ or related $\\mathrm{Li}$-based compounds. However, in bulk samples $\\mathrm{HQ}$ is known to form crystalline structures with $\\mathrm{Ti}^{[21]}$ and alkali metals ${ }^{[22]}$ other than Li. Most importantly, $\\mathrm{Na}_{2}[p$ $\\left.\\mathrm{C}_{6} \\mathrm{H}_{4} \\mathrm{O}_{2}\\right]$ and $\\mathrm{K}_{2}\\left[p-\\mathrm{C}_{6} \\mathrm{H}_{4} \\mathrm{O}_{2}\\right]$ (hereafter $\\mathrm{Na}_{2} \\mathrm{Q}$ and $\\mathrm{K}_{2} \\mathrm{Q}$, respectively) are reported to be isostructural. Thus by assuming that $\\mathrm{Li}_{2} \\mathrm{Q}$ would share the same structural motif, the atomic-level structure of the corresponding $\\mathrm{Li}_{2} \\mathrm{Q}$ compound was predicted using density functional theory (PBEO/TZVP, computational details are described in full detail in the ESI). ${ }^{[23-29]}$\n\nInitial optimization of $\\mathrm{Li}_{2} \\mathrm{Q}$ using the space group $\\mathrm{P}_{2} / \\mathrm{ncm}$ and atomic positions from the $\\mathrm{Na}_{2} \\mathrm{Q}$ data of Couhorn and Dronskowski[22] ended up in a transition state characterized by a single imaginary frequency $\\left(64 i \\mathrm{~cm}^{-1}\\right)$. Changing the geometry in the direction of the normal modes of the imaginary frequency reduced the symmetry to the orthorhombic subgroup $P c c n$, and the subsequent optimization resulted in a true local minimum accompanied with a total energy reduction of $9 \\mathrm{~kJ} / \\mathrm{mol}$ per unit cell. The calculated structural parameters are listed in Table S2 in ESI. The structure, shown in the inset of Figure $2 \\mathrm{a}$, is still closely similar to that of $\\mathrm{Na}_{2} \\mathrm{Q}$ and $\\mathrm{K}_{2} \\mathrm{Q}$, and the predicted lattice parameters are: $a=11.49 \\AA, b=10.38 \\AA, c=4.74 \\AA$. In this structure, infinite $\\mathrm{Li}_{2} \\mathrm{O}_{2}$ pillars running along the c-axis are interconnected by the bidentate $\\mathrm{C}_{6} \\mathrm{H}_{4} \\mathrm{O}_{2}{ }^{2-}$ units with each $\\mathrm{Li}$ atom coordinated to three oxygen atoms (Figure S3, ESI). The length of the c-axis for our $\\mathrm{Li}_{2} \\mathrm{Q}$ falls perfectly in line with those reported for the $\\mathrm{Na}$ and $\\mathrm{K}$ analogues when these values are plotted against the ionic radius of the alkali metal (Figure S4, ESI). On the contrary, the $a$ and $b$ lattice parameters are comparatively larger; this is because in $\\mathrm{Na}_{2} \\mathrm{Q}$ and $\\mathrm{K}_{2} \\mathrm{Q}$ the benzene ring lies more parallel in respect to the $\\mathrm{M}_{2} \\mathrm{O}_{2}$ chain. In the case of $\\mathrm{Li}_{2} \\mathrm{Q}$ the shorter Li-O bonds lead to a less distorted chain and consequently, the $\\mathrm{C}-\\mathrm{O}$ bond in the oxygen tetrahedron points to a more outwards\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_87d405f182ae3706ea0cg-3_1058_2346_1065_1917}\n\nFigure 2. Comparisons between (a) the experimental and calculated X-ray diffraction patterns (the inset shows the proposed crystal structure of the $\\mathrm{Li}_{2} \\mathrm{Q}$ thin films along the c-axis; the structure was drawn using the VESTA software), and (b) the experimental and calculated IR spectra, for our $\\mathrm{Li}_{2} \\mathrm{Q}$ thin films.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_87d405f182ae3706ea0cg-4_276_780_154_980}\n\nFigure 3. GIXRD patterns of $\\mathrm{Li}_{2} \\mathrm{Q}$ samples (a) after exposure to ambient air, and (b) after drying; (c) and (d) are the corresponding IR spectra.\n\ndirection. The orientation of the benzene ring in relation to the $\\mathrm{Li}_{2} \\mathrm{O}_{2}$ chain also explains the shift to the orthorhombic symmetry. The undercoordinated Li with a positive charge interacts with the delocalized negative charge of the $\\mathrm{C}_{6} \\mathrm{H}_{4} \\mathrm{O}_{2}{ }^{2-}$ anion. As the $\\mathrm{C}_{6} \\mathrm{H}_{4} \\mathrm{O}_{2}^{2-}$ anion has a rotational degree of freedom about its centre axis, it is energetically more favourable for it to twist so that the opposing corners of the benzene rings are closest to the adjacent Li ions. Consequently, the corresponding carbon atoms exhibit a somewhat higher negative charge than the other members of the ring.\n\nThe Li-O bond lengths $(1.90-1.94 \\AA)$ are very close to those reported for structurally similar lithium phenolate cubane clusters $(1.91-1.98 \\AA) .{ }^{[30]}$ Also the $\\mathrm{C}-\\mathrm{O}$ lengths are essentially equal in the two structures (1.34 $\\AA$ and $1.33 \\AA$ for $\\mathrm{Li}_{2} \\mathrm{Q}$ and Li-phenolate, respectively), ${ }^{[30]}$ which implies of charge localization on the oxygen atom of equal magnitude. ${ }^{[31]}$ When compared to the experimental data, the calculated diffraction pattern matches very closely to the experimental one (Figure 2a) and Le Bail fitting (Figure S5, ESI) in space group $P c c n$ yields an excellent fit with lattice parameters very close to the predicted values: $a=11.25 \\AA$, $b=10.45 \\AA, c=4.66 \\AA$. The original tetragonal structure isotypic to $\\mathrm{Na}_{2} \\mathrm{Q}$ was also evaluated, but this resulted in a markedly poorer fit (Figure S6, ESI).\n\nFigure $2 b$ shows further validation of the structure as the theoretical IR spectrum produces all the IR absorption bands that appear in the experimental spectrum (full interpretation of the vibrational modes in Table S2, ESI). The small systematic differences in peak positions between the theoretical and experimental spectra can be attributed to the harmonic approximation used in the calculations. Main features in the lower wavenumbers $\\left(1100-400 \\mathrm{~cm}^{-1}\\right)$ arise from the different stretching and bending modes of $\\mathrm{Li}$ and the benzene ring and the higher wavenumber $\\left(1600-1200 \\mathrm{~cm}^{-1}\\right)$ peaks stem from the stretching of $\\mathrm{C}=\\mathrm{C}$ and $\\mathrm{C}-\\mathrm{O}$ bonds. Characteristic aromatic $\\mathrm{C}-\\mathrm{H}$ stretching vibrations are also visible as small peaks just above $3000 \\mathrm{~cm}^{-1}$.\n\nThe poor quality of the diffraction data for the hightemperature sample prevented a more detailed study of its crystal structure. The pattern cannot however be explained by the structure proposed for the low-temperature $\\mathrm{Li}_{2} \\mathrm{Q}$ phase.\n\nWhen the samples were exposed to ambient atmosphere without the protective $\\mathrm{Al}_{2} \\mathrm{O}_{3}$ coating, a drastic change in the GIXRD pattern could be observed (Figure 3a). Afterwards, the newly formed phase was rather stable in ambient air with a slow deterioration in crystallinity on a time scale of several months. This was accompanied by a possible formation of $\\mathrm{Li}_{2} \\mathrm{CO}_{3}$ as determined from the IR data. Similarly, in the IR spectrum of the air-exposed sample (Figure 3c), several new absorption bands are observed. Again the spectrum does not match those of $\\mathrm{LiOH}$ and $\\mathrm{Li}_{2} \\mathrm{CO}_{3}$. The strong bands at 3590 and $3304 \\mathrm{~cm}^{-1}$ indicate the presence of free and hydrogen bonded -OH groups, respectively. ${ }^{[32]}$ Additionally, the band at $1621 \\mathrm{~cm}^{-1}$ might arise from the $\\mathrm{H}-\\mathrm{O}-\\mathrm{H}$ bending mode. However, the bands between 2000 and $3000 \\mathrm{~cm}^{-1}$ could not be identified. Hydrogen bonding, especially in confined environments with short interaction distances may cause red shifting and broadening of absorption bands in the magnitude of hundreds of reciprocal centimetres, which complicates the identification. ${ }^{[32]}$ Atomic force microscopy (AFM) images taken from pristine (Figure S7a, ESI) and exposed (Figure S7b, ESI) samples showed an evolution in the RMS roughness from $2.9$ to $7.8 \\mathrm{~nm}$. The apparent increase in the crystallite size might imply the expansion of the unit cell size upon exposure.\n\nInterestingly, the transformation appears to be reversible. When the exposed samples were heated in vacuum at $120^{\\circ} \\mathrm{C}$, and then capped with $\\mathrm{Al}_{2} \\mathrm{O}_{3}$, the FTIR spectrum was found to revert back to the pristine one (Figure $3 \\mathrm{~d}$ ) and at the same time the GIXRD pattern (Figure 3b) indicated that the original phase had been recovered although the crystallinity did somewhat suffer Optical band gap as determined by UV-vis spectroscopy (Figure S8, ESI), was found to be essentially similar for the pristine (3.67 $\\mathrm{eV})$ and the air-exposed sample ( $3.64 \\mathrm{eV})$.\n\nThe proposed structure would reasonably explain the observed behaviour upon the exposure to ambient air. The undercoordinated lithium atoms in pristine $\\mathrm{Li}_{2} \\mathrm{Q}$ would readily complete their coordination spheres by absorption of water molecules. Unfortunately we could not adequately solve the crystal structure of the exposed sample by merely placing water molecules at the open metal sites. Although multiple different geometries were considered with varying amount of water molecules, the theoretical diffraction pattern never quite matched the experimental at a satisfactory degree. This is likely because of all the empty space in the material and the vast number of possible configurations $\\mathrm{H}_{2} \\mathrm{O}$ can occupy the structure. A single static geometry is unlikely to produce the diffraction pattern of a structure that can contain free water molecules and is thus prone to rapid ligand exchange\n\nGiven the observed reactivity of the samples, it seems that the gas-phase deposition method did indeed avert the issue of solvent-molecule inclusion in the unsaturated metal sites. In the case of vapour-phase synthesis investigated in the present work, such 'solvent' molecule would either be one of the precursors or the side product of the reaction, bis(trimethylsilyl)amine $\\left(\\left[\\left(\\mathrm{CH}_{3}\\right)_{3} \\mathrm{Si}\\right]_{2} \\mathrm{NH}\\right)$. As none of these alternatives appear in the FTIR spectrum of the pristine sample, it seems that either they are unable to act as guest molecules or the synthesis conditions prevent their absorption. Although we were unable to determine the porosity of our coordination network material, the present findings might be relevant also in the field of metal-organic frameworks. An interesting concept, though not tried here, would be to functionalize the as-deposited films with some suitable guest molecule prior to the exposure to ambient air. Moreover, as the $\\mathrm{Li}_{2} \\mathrm{Q}$ phase was reported to be unattainable through solution based methods, ${ }^{[22]}$ our results can be taken as a promising demonstration of the advantage of vapor phase methods on the synthesis of novel coordination polymers.\n\nRegarding the crystallization of ALD/MLD samples, it is interesting to notice that including the present findings, all the reported ALD/MLD processes for s-block metals have yielded crystalline thin films over wide temperature windows, ${ }^{[10,11,33]}$ whereas the transition metal and aluminium based processes, with the exception of Cu-terephthalate ${ }^{[9]}$ have resulted in amorphous thin films. The s-block metals are known to form mainly ionic compounds with organic constituents. ${ }^{[34]}$ The nondirectionality of the ionic bond might be advantageous for the crystallization of the films during the film growth as it might give the molecules more freedom for proper orientation. Or the other way around, the more directional covalent bonds of transition metals may force the organic constituent to an unsuitable angle for the formation of a well-defined structure. Also the deposition temperature appears to play a significant role with low temperature being seemingly more favourable for thin films with high crystallinity.\n\nIn conclusion, we have successfully deposited crystalline thin films of lithium aryloxide through an ALD/MLD process for which all the hallmarks of the expected atomic/molecular layerby-layer growth could be demonstrated. According to DFT calculations the crystal structure of the new Li-based hybrid material appears to be closely related to those previously reported for bulk samples of $\\mathrm{Na}_{2} \\mathrm{Q}$ and $\\mathrm{K}_{2} \\mathrm{Q}$. Most interestingly, the asgrown $\\mathrm{Li}_{2} \\mathrm{Q}$ thin films were found to undergo a reversible structural transformation associated with their reaction with ambient humid air. The reactivity of the films could be ascribed to the coordinatively-undersaturated $\\mathrm{Li}$ site in the $\\mathrm{Li}_{2} \\mathrm{Q}$ structure promoting strong interaction with the guest molecules. While the reversibility of the absorption reaction is not ideal for the present compound, we believe that our findings should serve as a strong foothold for the development of gas-phase layer-by-layer synthesis of coordination network materials with advanced functionalities.\n\n\\section{Acknowledgements}\nThe present work has received funding from the European Research Council under the European Union's Seventh Framework Programme (FP/2007-2013)/ERC Advanced Grant Agreement (No. 339478), and also from the Academy of Finland (Nos. 296299 and 303452). Mr. Panagiotis Spiliopoulos and Prof. Eero Kontturi are thanked for the AFM images.\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_87d405f182ae3706ea0cg-5_294_340_1049_1897}\\\\\nfilm • Atomic layer deposition - Molecular layer deposition\n\n[1] D. Zacher, O. Shekhah, C. Wöll, R. A. Fischer, Chem. Soc. Rev. 2009, $38,1418-1429$.\n\n[2] I. Stassen, D. De Vos, R. Ameloot, Chem. - A Eur. J. 2016, 22, 1445214460.\n\n[3] M. D. Allendorf, A. Schwartzberg, V. Stavila, A. A. Talin, Chem. - A Eur. J. 2011, 17, 11372-11388.\n\n[4] L. E. Kreno, K. Leong, O. K. Farha, M. Allendorf, R. P. Van Duyne, J. T. Hupp, Chem. Rev. 2011, 112, 1105-1125.\n\n[5] S. M. George, Chem. Rev. 2010, 110, 111-131.\n\n[6] P. Sundberg, M. Karppinen, Beilstein J. Nanotechnol. 2014, 5, 11041136.\n\n[7] I. Stassen, M. Styles, G. Grenci, H. Van Gorp, W. Vanderlinden, S. De Feyter, P. Falcaro, D. De Vos, P. Vereecken, R. Ameloot, Nat. Mater. 2015, $15,304-310$\n\n[8] K. B. Lausund, O. Nilsen, Nat. Commun. 2016, 7, 13578.\n\n[9] E. Ahvenniemi, M. Karppinen, Chem. Commun. 2015, 52, 1139-1142.\n\n[10] E. Ahvenniemi, M. Karppinen, Chem. Mater. 2016, 28, 6260-6265.\n\n[11] M. Nisula, M. Karppinen, ACS Nano Lett. 2016, 16, 1276-1281.\n\n[12] K. L. Mulfort, O. K. Farha, C. L. Stern, A. A. Sarjeant, J. T. Hupp, J. Am. Chem. Soc. 2009, 131, 3866-3868.\n\n[13] L. H. Xie, J. Bin Lin, X. M. Liu, Y. Wang, W. X. Zhang, J. P. Zhang, X. M. Chen, Inorg. Chem. 2010, 49, 1158-1165.\n\n[14] R. El Osta, M. Frigoli, J. Marrot, N. Guillou, H. Chevreau, R. I. Walton, F. Millange, Chem. Commun. 2012, 48, 10639-10641.\n\n[15] D. Banerjee, S. J. Kim, W. Li, H. Wu, J. Li, L. a. Borkowski, B. L. Philips, J. B. Parise, Cryst. Growth Des. 2010, 10, 2801-2805.\n\n[16] D. Banerjee, J. B. Parise, Cryst. Growth Des. 2011, 11, 4704-4720.\n\n[17] U. Olsher, R. M. Izatt, J. S. Bradshaw, N. K. Dalley, Chem. Rev. 1991, 91, 137-164.\n\n[18] P. Sundberg, M. Karppinen, Eur. J. Inorg. Chem. 2014, 968-974.\n\n[19] B. H. Lee, B. Yoon, A. I. Abdulagatov, R. a. Hall, S. M. George, Adv. Funct. Mater. 2013, 23, 532-546.\n\n[20] A. J. Karttunen, T. Tynell, M. Karppinen, J. Phys. Chem. C 2015, 119, $13105-13114$.\n\n[21] T. P. Vaid, E. B. Lobkovsky, P. T. Wolczanski, C. U. V, 1997, 7863 8742-8743.\n\n[22] U. Couhorn, R. Dronskowski, Z. Anorg. Allg. Chem. 2003, 629, 647652.\n\n[23] R. Dovesi, R. Orlando, A. Erba, C. M. Zicovich-Wilson, B. Civalleri, S. Casassa, L. Maschio, M. Ferrabone, M. De La Pierre, P. D'Arco, Y. Noël, M Causà, M. Rérat, B. Kirtman, Int. J. Quantum Chem. 2014, 114, 1287–1317. [24] R. Dovesi, V. R. Saunders, C. Roetti, R. Orlando, C. M. Zicovich-\n\nWilson, F. Pascale, B. Civalleri, K. Doll, N. M. Harrison, I. J. Bush, P. D'Arco, M. Llunell, M. Causà, Y. Noël, CRYSTAL14 User's Manual, University of Torino, Torino, Italy, 2004.\n\n[25] F. Pascale, C. M. Zicovich-Wilson, F. López Gejo, B. Civalleri, R. Orlando, R. Dovesi, J. Comput. Chem. 2004, 25, 888-897.\n\n[26] C. M. Zicovich-Wilson, F. Pascale, C. Roetti, V. R. Saunders, R. Orlando, R. Dovesi, J. Comput. Chem. 2004, 25, 1873-1881.\n\n[27] J. P. Perdew, K. Burke, M. Ernzerhof, Phys. Rev. Lett. 1996, 77, 38653868.\n\n[28] C. Adamo, V. Barone, J. Chem. Phys. 1999, 110, 6158-6170.\n\n[29] F. Weigend, R. Ahlrichs, Phys. Chem. Chem. Phys. 2005, 7, $3297-$ 3305.\n\n[30] T. S. De Vries, A. Goswami, L. R. Liou, J. M. Gruver, E. Jayne, D. B. Collum, J. Am. Chem. Soc. 2009, 131, 13142-13154.\n\n[31] S. Tominaka, H. H.-M. Yeung, S. Henke, A. K. Cheetham, CrystEngComm 2016, 18, 398-406.\n\n[32] T. Steiner, Angew. Chemie Int. Ed. 2002, 41, 48-76.\n\n[33] Z. Giedraityte, O. Lopez-Acevedo, L. A. Espinosa Leal, V. Pale, J. Sainio, T. S. Tripathi, M. Karppinen, J. Phys. Chem. C 2016, 120, 2634226349 (2016).\n\n[34] K. M. Fromm, Coord. Chem. Rev. 2008, 252, 856-885. Entry for the Table of Contents (Please choose one layout)\n\nLayout 1:\n\n\\section{COMMUNICATION}\nFrom precursor vapours to crystalline hybrid thin films: Atomic/molecular layer deposition allows the layer-by-layer vapourphase growth of highly crystalline coordination polymer thin films. Benefiting from the unsaturated metal sites the novel lithium aryloxide structure is capable to reversibly react with guest molecules.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_87d405f182ae3706ea0cg-6_692_1523_750_1306}\n\\end{center}\n\nMikko Nisula, Jarno Linnera, Antti J. Karttunen, and Maarit Karppinen*\n\nPage No. - Page No.\n\nLithium aryloxide thin films with guest-induced structural transformation by ALD/MLD\n\n\n\\end{document}", "record_id": "2023_09_22_87d405f182ae3706ea0cg"}