{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{Phosphate-Catalyzed Succinimide Formation from Asp Residues: A Computational Study of the Mechanism }\n\n\n\\author{Ryota Kirikoshi, Noriyoshi Manabe and Ohgi Takahashi *\\\\\nFaculty of Pharmaceutical Sciences, Tohoku Medical and Pharmaceutical University, 4-4-1 Komatsushima,\\\\\nAoba-ku, Sendai 981-8558, Japan; kirikoshi@tohoku-mpu.ac.jp (R.K.); manabe@tohoku-mpu.ac.jp (N.M.)\\\\\n* Correspondence: ohgi@tohoku-mpu.ac.jp; Tel.: +81-22-727-0208}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nArticle\n\nReceived: 6 February 2018; Accepted: 22 February 2018; Published: 24 February 2018\n\n\\begin{abstract}\nAspartic acid (Asp) residues in proteins and peptides are prone to the non-enzymatic reactions that give biologically uncommon L- $\\beta-A s p$, D-Asp, and $D-\\beta$-Asp residues via the cyclic succinimide intermediate (aminosuccinyl residue, Suc). These abnormal Asp residues are known to have relevance to aging and pathologies. Despite being non-enzymatic, the Suc formation is thought to require a catalyst under physiological conditions. In this study, we computationally investigated the mechanism of the Suc formation from Asp residues that were catalyzed by the dihydrogen phosphate ion, $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$. We used Ac-L-Asp-NHMe (Ac = acetyl, NHMe = methylamino) as a model compound. The $\\mathrm{H}_{2} \\mathrm{PO}_{4}$ - ion (as a catalyst) and two explicit water molecules (as solvent molecules stabilizing the negative charge) were included in the calculations. All of the calculations were performed by density functional theory with the B3LYP functional. We revealed a phosphate-catalyzed two-step mechanism (cyclization-dehydration) of the Suc formation, where the first step is predicted to be rate-determining. In both steps, the reaction involved a proton relay mediated by the $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$ion. The calculated activation barrier for this mechanism $\\left(100.3 \\mathrm{~kJ} \\mathrm{~mol}^{-1}\\right)$ is in reasonable agreement with an experimental activation energy $\\left(107 \\mathrm{~kJ} \\mathrm{~mol}^{-1}\\right)$ for the Suc formation from an Asp-containing peptide in a phosphate buffer, supporting the catalytic mechanism of the $\\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$ion that is revealed in this study.\n\\end{abstract}\n\nKeywords: aspartic acid residue; succinimide; isomerization; racemization; non-enzymatic reaction; buffer catalysis; dihydrogen phosphate ion; proton transfer; computational chemistry; density functional theory\n\n\\section{Introduction}\nThere are optical isomers of L- and D-forms for amino acids. All of the amino acid residues that constitute proteins in vivo had been considered to be the L-form, except for glycine (Gly). Recently, however, it has become clear that D-amino acid residues are also widely present in proteins and peptides. Biologically uncommon D-amino acid residues are known to be related to aging, and have been found in various tissues such as those in the lens [1-4], tooth [5], aorta [6], brain [7,8], bone [9], and skin [10,11] of elderly donors. Moreover, their relationships with age-related pathologies such as cataract and Alzheimer's disease have also attracted considerable attention [4,8,12-16].\n\nMost of the amino acid residues that are prone to racemization are aspartic acid (Asp) residues. This is because the racemization occurs easily via the five-membered ring succinimide intermediate (aminosuccinyl residue, Suc) (Scheme 1) [17-19]. In this mechanism, the actual species undergoing racemization is Suc, and due to the difference in the position of the ring-opening, a total of four isomers can be produced, i.e., L-Asp and L- $\\beta-A$ sp from L-Suc, and D-Asp and D- $\\beta-A s p$ from D-Suc. For peptides, a typical ratio of L-Asp and L- $\\beta$-Asp (or D-Asp and $D-\\beta$-Asp) residues is 1:3 [17,18,20-22]. Therefore, the susceptibility to the Suc formation is reflected by the isomerized and/or racemized Asp residues.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cff3389f103b8f7971d0g-02_434_1039_384_1672}\n\\end{center}\n\nScheme 1. Isomerization and racemization of Aspartic acid (Asp) residues via the five-membered ring succinimide intermediate (aminosuccinyl residue, Suc). A total of four isomers are generated. At around $\\mathrm{pH} 7$, the Suc racemization is expected to occur through an enol intermediate.\n\nThe Suc residue is formed by the nucleophilic attack of the main chain nitrogen of the C-terminal adjacent residue on the Asp carboxyl carbon, with the release of a water molecule. This is an intramolecular nucleophilic substitution reaction, and is basically regarded to proceed in two steps (cyclization-dehydration, Scheme 2) [22,23].\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cff3389f103b8f7971d0g-02_1483_1875_387_1669}\n\\end{center}\n\nScheme 2. Two-step (cyclization-dehydration) mechanism for the succinimide formation from an Asp residue. In the first step, the nucleophilic attack gives rise to a gem-diol (tetrahedral intermediate). In the second step, a water molecule is released from this intermediate to give the succinimide species.\n\nAlthough the above reactions via the succinimide intermediate in proteins and peptides are non-enzymatic, they will not occur without a catalyst at room or physiological temperature because of high activation barriers [24,25]. We have previously shown that the Asp cyclization can be catalyzed by water or acetic acid molecules by density functional theory (DFT) calculations [23,25,26]; however, what the actual catalysts are in vivo has not yet been clarified.\n\nThe experiment by Tomizawa et al. [27] on the hen egg-white lysozyme suggests that Asp racemization is accelerated by phosphate ions at $\\mathrm{pH}$ 6. At this $\\mathrm{pH}$, phosphate ions exist mainly as dihydrogen phosphate, $\\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}\\left(\\mathrm{p} K_{\\mathrm{a}} 6.82\\right.$ [28]). In vivo, this ion is also present in a significant amount (about one fifth of the total phosphate species), and plays an important role in maintaining homeostasis. We have recently shown by DFT calculations that the racemization of the succinimide intermediate via an enol intermediate (the central part of Scheme 1) is effectively catalyzed by a $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$ion [29]. Thus, the $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$ion was proposed to be a candidate for an in vivo catalyst of the succinimide racemization. This success motivated us to investigate the possibility that this ion may also catalyze the Asp cyclization reaction to yield a Suc residue. Very recently, Nakayoshi et al. [30] reported a DFT study on the Suc formation from Ac-D-Asp-Gly-NHMe catalyzed by a $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$ion. However, an unnaturally large conformational change was involved in the reaction pathway reported.\n\nIn the present paper, we focus on the Suc formation from Asp residues, especially on the catalytic role of the $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$ion. We employed the B3LYP DFT method, as in the previous study on the Suc racemization [29]. The compound shown in Figure 1, in which an L-Asp residue is capped with acetyl (Ac) and methylamino (NHMe) groups on the N and C termini, respectively (Ac-L-Asp-NHMe), was used for the present study. The succinimide product from this model compound is the same as the Suc-containing compound used in the previous study [29]. As in this previous study, only the extended main chain conformation was considered. $\\mathrm{A} \\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$ion (as a catalyst) and two explicit $\\mathrm{H}_{2} \\mathrm{O}$ molecules (as solvent molecules stabilizing the negative charge) were included in the calculations. Kiriukhin and Collins [31] estimated the \"dynamic hydration numbers (ADHNs)\" for biologically important ions by using size-exclusion chromatography. The ADHN for an ion was interpreted as the number of tightly bound water molecules that move with the ion. $\\mathrm{For} \\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$, the $\\mathrm{ADHN}$ was estimated to be $1.91 \\pm 0.17$. This may support the validity of the two water molecules included in the present calculations.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cff3389f103b8f7971d0g-03_1146_1652_662_1393}\n\\end{center}\n\nFigure 1. The model compound used in the present study (Ac-L-Asp-NHMe, Ac = acetyl, Asp $=$ aspartyl, and NHMe $=$ methylamino $)$. The $\\phi\\left(\\mathrm{C}-\\mathrm{N}-\\mathrm{C}_{\\alpha}-\\mathrm{C}\\right)$ and $\\psi\\left(\\mathrm{N}-\\mathrm{C}_{\\alpha}-\\mathrm{C}-\\mathrm{N}\\right)$ dihedral angles that characterize the main-chain conformation, and the $\\chi_{1}$ dihedral angle $\\left(\\mathrm{N}-\\mathrm{C}_{\\alpha}-\\mathrm{C}_{\\beta}-\\mathrm{C}_{\\gamma}\\right)$ that characterizes the side-chain conformation are indicated.\n\n\\section{Results and Discussion}\nFigure 2 shows the energy profile in water for the two-step succinimide formation catalyzed by the $\\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$ion obtained in this study, and Figures 3-8 shows the optimized geometries. $\\mathrm{RC}$ is the reactant complex consisting of the model compound and $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-} \\cdot 2 \\mathrm{H}_{2} \\mathrm{O}$. PC is the product complex consisting of Ac-L-Suc-NMe and $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-} \\cdot 3 \\mathrm{H}_{2} \\mathrm{O}$. Further, TS1 and TS2 are the transition states of the first step (cyclization) and the second step (dehydration), respectively. IC1 and IC 2 are the tetrahedral intermediate complexes directly connected to TS1 and TS2, respectively, and are different from each other in the conformation of the gem-diol moiety and the position of $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-} \\cdot 2 \\mathrm{H}_{2} \\mathrm{O}$. Geometry optimizations were performed in the gas phase by the DFT method using the B3LYP functional and the 6-31+G $(\\mathrm{d}, \\mathrm{p})$ basis set. Furthermore, single-point calculations of hydration Gibbs energies were carried out for the gas-phase optimized geometries by the SM8 (solvation model 8) continuum model [32,33] using the 6-31G(d) basis set. The relative energies shown in Figure 2 are those after the zero-point energy $(\\mathrm{ZPE})$, thermodynamic $\\left(25^{\\circ} \\mathrm{C}\\right)$, and hydration Gibbs energy corrections. The dihedral angles of the optimized geometries defined in Figure 1 are shown in Table 1; the Cartesian coordinates, total energies, ZPEs, and hydration Gibbs energies of the optimized geometries are provided in Tables S1-S7. cyclization (rate-determining step)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cff3389f103b8f7971d0g-04_368_911_378_1690}\n\\end{center}\n\nFigure 2. Energy profile for the two-step succinimide formation catalyzed by the $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$ion. RC: reactant complex; TS: transition state; IC: intermediate complex; PC: product complex. The relative energies after the zero-point energy (ZPE), thermodynamic $\\left(25^{\\circ} \\mathrm{C}\\right)$, and hydration Gibbs energy corrections are shown in $\\mathrm{kJ} \\mathrm{mol}^{-1}$ with respect to the RC. Also shown are the imaginary frequencies of the two transition states.\n\n\\subsection{First Step: Cyclization}\nFigure 3 shows the optimized geometry of the reactant complex (RC) formed between Ac-L-Asp-NHMe and $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-} \\cdot 2 \\mathrm{H}_{2} \\mathrm{O}$. The structure of the $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-} \\cdot 2 \\mathrm{H}_{2} \\mathrm{O}$ moiety in $\\mathrm{RC}$ is the optimal one among those found in our systematic search. In the RC, two hydrogen bonds and one $\\mathrm{CH}-\\mathrm{O}$ interaction are observed between Ac-L-Asp-NHMe and the $\\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$ion. These two hydrogen bonds are between the Asp side-chain carbonyl oxygen and $\\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$(1.973 $\\AA$ ), and between the NH proton of NHMe and $\\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$(1.718 А̊), and are important as they are involved in the proton transfers occurring in the first step (see below). The $\\mathrm{CH}-\\mathrm{O}$ interaction is observed between one of the two Asp $\\beta$-protons and $\\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$( $2.226 \\AA$, indicated by boldface in Figure 3), and should have an additional contribution in stabilizing RC. In addition, the $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$ion and the two water molecules are bound to each other by four hydrogen bonds $(1.660,1.889,2.024$, and $2.080 \\AA$ A). In the RC, the distance between the carbon $\\left(C_{\\gamma}\\right)$ and nitrogen atoms to form a bond during the ring closure is $3.426 \\AA$ (indicated by boldface in Figure 3 ).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cff3389f103b8f7971d0g-04_1877_2406_587_1492}\n\\end{center}\n\nFigure 3. The geometry of the reactant complex (RC). This complex is formed between the model compound (Figure 1), a $\\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$ion, and two water molecules. Selected interatomic distances are shown in Å. Grey: carbon; white: hydrogen; blue: nitrogen; red: oxygen; orange: phosphorus. Figure 4 shows the transition state TS1 (transition state of the first step) connecting the RC and the IC1 (complex of the tetrahedral intermediate and $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-} \\cdot 2 \\mathrm{H}_{2} \\mathrm{O}$ directly connected to TS1, Figure 5). The activation barrier of the first step (cyclization forming the tetrahedral intermediate) was calculated to be $100.3 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$. The energy of TS1 is higher than that of TS2 (transition state of the second step) by about $34 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$, indicating that the first step (cyclization) is rate determining. Experimentally, an Arrhenius plot was reported by Aki et al. [19] for the succinimide formation from an Asp-containing peptide in phosphate-buffered saline (PBS, $\\mathrm{pH}$ 7.4). From the slope of this plot, the activation energy is calculated to be $107 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$. Our calculated barrier $\\left(100.3 \\mathrm{~kJ} \\mathrm{~mol}^{-1}\\right)$ is in reasonable agreement with this experimental value.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cff3389f103b8f7971d0g-05_765_1234_521_1535}\n\\end{center}\n\nFigure 4. The geometry of the first-step transition state (TS1). This transition state is for cyclization, and connects the RC (Figure 3) and the first tetrahedral intermediate complex (IC1) (Figure 5). Selected interatomic distances are shown in Å. Grey: carbon; white: hydrogen; blue: nitrogen; red: oxygen; orange: phosphorus.\n\nIn TS1, the abstraction of the $\\mathrm{NH}$ proton by the oxygen atom of $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$, which originally formed the hydrogen bond to this proton, is almost completed (the NH and OH distances are $1.697$ and $1.017 \\AA$ A, respectively). Therefore, the nucleophilicity of the peptide nitrogen is enhanced in an early stage of the first step (note that the amide nitrogen is generally poorly nucleophilic). The distance to the carbonyl carbon atom $\\left(\\mathrm{C}_{\\gamma}\\right)$ of the Asp side chain is drastically shortened to $1.974 \\AA$ An TS1 (indicated by boldface in Figure 4), indicating that a bond is being formed between these atoms. Additionally, the proton transfer from $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$to the Asp side-chain carbonyl oxygen is in an initial stage, and a $\\mathrm{H}_{3} \\mathrm{PO}_{4}$-like moiety is temporarily created in TS1. Due to cyclization, relatively large changes occur in $\\psi$ and $\\chi_{1}$ (by $38^{\\circ}$ and $29^{\\circ}$, respectively) when going from the RC to TS1, while $\\phi$ is almost unchanged (see Table 1).\n\nIC1, as shown in Figure 5, is the intermediate complex that is directly connected to TS1, and is composed of the tetrahedral intermediate and $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-} \\cdot 2 \\mathrm{H}_{2} \\mathrm{O}$. The energy of IC1 relative to the RC is $23.1 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$. The proton transfer from $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$to the Asp side-chain carbonyl oxygen has been completed (the $\\mathrm{OH}$ distances are $1.013$ and $1.584 \\AA$ ). The distance of the newly formed $\\mathrm{C}-\\mathrm{N}$ bond is $1.484 \\AA$ (indicated by boldface in Figure 5). A relatively large change in $\\chi_{1}$ (by $41^{\\circ}$ ) was observed in going from TS1 to IC1.\n\nThere are three important changes in the first step: (i) the proton transfer from the $\\mathrm{NH}$ to $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$, (ii) the nucleophilic attack of the \"deprotonated\" nitrogen on the Asp $\\mathrm{C}_{\\gamma}$ atom, and (iii) the proton transfer from $\\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$to the Asp side-chain. These three changes occur in a domino-like manner. Change (i) enhances the nucleophilicity of the nitrogen atom and induces change (ii), which, in turn, accumulates a negative charge on the side-chain carbonyl oxygen, inducing change (iii), i.e., the second proton transfer. In Figure S1, we provided four representative geometries on the intrinsic reaction coordinate (IRC) of the first step to show the domino-like changes.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cff3389f103b8f7971d0g-06_297_760_611_1445}\n\\end{center}\n\nFigure 5. The geometry of the intermediate complex IC1. This complex is directly connected to TS1 (Figure 4). Selected interatomic distances are shown in Å. Grey: carbon; white: hydrogen; blue: nitrogen; red: oxygen; orange: phosphorus.\n\n\\subsection{Second Step: Dehydration}\nFigure 6 shows the intermediate complex IC2 directly connected to TS2. The position of $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-} \\cdot 2 \\mathrm{H}_{2} \\mathrm{O}$ and the conformation in the gem-diol moiety in IC2 are different from those in IC1. Both of the diol protons form a hydrogen bond to the $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$ion (1.665 and $1.840 \\AA$ A). The relative energy of IC2 with respect to RC is $22.1 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$, which is about $1 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$ lower than IC1. The conversion of IC1 to IC 2 is expected to occur without a high energy barrier.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cff3389f103b8f7971d0g-06_1322_1847_568_1482}\n\\end{center}\n\nFigure 6. The geometry of the intermediate complex IC2. This complex is directly connected to TS2 (Figure 7). Selected interatomic distances are shown in Å. Grey: carbon; white: hydrogen; blue: nitrogen; red: oxygen; orange: phosphorus.\n\nFigure 7 shows the second-step transition state TS2 connecting IC2 and the PC (complex of Ac-L-Suc-NMe and $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-} \\cdot 3 \\mathrm{H}_{2} \\mathrm{O}$ directly connected to TS2, as shown in Figure 8). The local activation barrier for this second step of the succinimide formation was about $44.6 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$, which is much lower than in the first step (cyclization). The abstraction of one of the diol $\\mathrm{OH}$ protons by the $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$ion is almost completed, as may be seen from two $\\mathrm{OH}$ distances, $1.633$ and $1.005 \\AA$, as shown in Figure 7. That is, a $\\mathrm{H}_{3} \\mathrm{PO}_{4}$-like moiety is also temporarily formed in the second step. Also, the other $\\mathrm{OH}$ group of the gem-diol moiety is leaving; that is, the corresponding $\\mathrm{C}-\\mathrm{O}$ bond is being broken (1.882 А̊, indicated by boldface in Figure 7). This distance was $1.406 \\AA$ An IC2 (indicated by boldface in Figure 6). Furthermore, a proton transfer from $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$to the leaving oxygen atom has already started for the formation of a water molecule. Here, it should be noted that the distance of the forming $\\mathrm{OH}$ bond (1.318 Å, Figure 7) is much shorter than the corresponding distance in IC2 (3.846 Å, Figure 6). This means that the approach of the phosphate moiety to the $\\mathrm{OH}$ group occurs in the very initial stage of the second step. Apart from this, there are also three important changes in the second step: (i) the proton transfer to $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$, (ii) the $\\mathrm{C}-\\mathrm{O}$ bond cleavage, and (iii) the proton transfer from $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$. Change (i) occurs first, and this induces changes (ii) and (iii), which occur rather synchronously. As may be seen by comparing Figures 6 and 7 , the $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-} \\cdot 2 \\mathrm{H}_{2} \\mathrm{O}$ moiety migrates significantly in going from IC2 to TS2, while the skeleton of the main chain and the five-membered ring remains almost unchanged structurally.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cff3389f103b8f7971d0g-07_580_1179_678_1378}\n\\end{center}\n\nFigure 7. The geometry of the second-step transition state (TS2). This transition state is for dehydration, and connects IC2 (Figure 6) and the PC (Figure 8). Selected interatomic distances are shown in Å. Grey: carbon; white: hydrogen; blue: nitrogen; red: oxygen; orange: phosphorus.\n\nFigure 8 shows the resultant product complex (PC), which comprises the succinimide product, a $\\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$ion, and three $\\mathrm{H}_{2} \\mathrm{O}$ molecules. Note that three $\\mathrm{H}_{2} \\mathrm{O}$ molecules exist in the $\\mathrm{PC}$, since a $\\mathrm{H}_{2} \\mathrm{O}$ molecule has been released. The distance of the broken $\\mathrm{C}-\\mathrm{O}$ bond is $3.130 \\AA$ (as indicated by boldface in Figure 8). The energy of the PC is lower than that of the RC by about $21 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$. This may seem to contradict succinimide's role as an intermediate in the overall reaction scheme, as shown in Scheme 1. However, this is not so. It should be noted that, in the present case, we should use the biochemical conventions for the standard states of water and proton (instead of the physical chemical conventions), because the reactions are postulated to occur in aqueous media near neutral $\\mathrm{pH}[28,34]$. For water, the biochemical standard state corresponds to the concentration of $55.5 \\mathrm{M}$. For a reaction that releases a water molecule (such as the reaction studied here), the biochemical standard Gibbs energy of reaction is higher by about $10 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$ (at $25{ }^{\\circ} \\mathrm{C}$ ) than when the physical chemical standard state is used [28]. Therefore, the standard Gibbs energy of reaction is roughly estimated to be about $-11 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$ for the present reaction. This value is consistent with the standard enthalpies and entropies of reaction reported for the Suc formation from two small peptides, Ac-L-Asp-Gly-NHMe and Ac-Gly-L-Asp-Gly-Gly-NHMe [22], from which the standard Gibbs energies of reaction at $25^{\\circ} \\mathrm{C}$ are calculated to be about $-5 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$ (for the protonated form, see below).\n\nThere is another factor to be considered. It is usually postulated that in order for the succinimideforming reactions of Asp residues to occur, the Asp side-chain needs to be protonated, because the Asp $\\gamma$ carbon undergoes a nucleophilic attack. However, at a neutral or physiological $\\mathrm{pH}$, the Asp side chains rarely exist in the protonated form. If we use the value of $3.90$ for the $\\mathrm{p} K_{\\mathrm{a}}$ of Asp side chain [28] and the biochemical standard state $(\\mathrm{pH} 7)$ for the proton, the standard Gibbs energy of the protonated form is calculated to be higher than that of the deprotonated form by about $18 \\mathrm{~kJ} \\mathrm{~mol}^{-1}\\left(\\right.$ at $\\left.25^{\\circ} \\mathrm{C}\\right)$. Therefore, roughly speaking, our results show that the standard Gibbs energy of the succinimide product is higher than that of the deprotonated reactant by about $7 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$. This is consistent with the succinimide being an intermediate.\n\nThere was no significant change in the main-chain conformation in the second step $\\left(5^{\\circ}\\right.$ in $\\phi$, and $12^{\\circ}$ in $\\psi$ ). Throughout the entire reaction from the RC to the $P C$, there was no significant conformational change on the N-terminal side, as may be seen from the $\\phi$ values reported in Table 1, and the main changes occurred in the $\\mathrm{C}$-terminal side and the Asp side chain. This result suggests that the succinimide-forming reaction occurs readily when the $\\mathrm{C}$-terminal side of the Asp residue is in a flexible region of proteins, and is also exposed to solvent water. In human $\\alpha$ A-crystallin from elderly donors, the Asp58 and Asp151 residues were found to be highly stereoinverted [2]. Interestingly, these two Asp residues were suggested to reside in flexible and solvent-accessible regions [35]. As another example, the X-ray structure of the hen egg-white lysozyme shows that the Asp101 residue, which is prone to succinimide formation, also resides in a flexible and solvent-accessible region, although it is not in an extended conformation, as in the present study [36,37]. Moreover, it would be necessary that the following residue is sterically small, because the catalytic $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$ion binds to the C-terminal side of the Asp reside (see Figure 3). This is consistent with the well-known notion that the succinimide-mediated reactions mainly occur when the following residue has a sterically small side chain $[17,18,35,38,39]$. Indeed, the Asp58 and Asp151 residues of human $\\alpha$ A-crystallin are followed by serine (Ser) and alanine (Ala) residues, respectively; the Asp101 residue of the hen egg-white lysozyme is followed by a Gly residue.\n\nVery recently, Nakayoshi et al. [30] reported a DFT study on the succinimide formation from Ac-D-Asp-Gly-NHMe catalyzed by a $\\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$ion. However, in the reaction pathway they found, an unnaturally large conformational change occurred. On the other hand, in the reaction pathway found in the present study, the structural change of the main-chain and side-chain skeleton is minimized, as may be seen by comparing Figures 3-8, and from the dihedral angles listed in Table 1. This may be one of the reasons why our activation barrier $\\left(100.3 \\mathrm{~kJ} \\mathrm{~mol}^{-1}\\right)$ is lower than that calculated by Nakayoshi et al. $\\left(112.5 \\mathrm{~kJ} \\mathrm{~mol}^{-1}\\right)[30]$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cff3389f103b8f7971d0g-08_1375_1972_658_1398}\n\\end{center}\n\nFigure 8. The geometry of the product complex (PC). This complex is directly connected to TS2 (Figure 7). Selected interatomic distances are shown in Å. Grey: carbon; white: hydrogen; blue: nitrogen; red: oxygen; orange: phosphorus.\n\nTable 1. The main-chain dihedral angles $\\phi$ and $\\psi$, and the side-chain dihedral angle $\\chi_{1}$ (in degrees) of the optimized geometries ${ }^{1}$.\n\n\\begin{center}\n\\begin{tabular}{cccc}\n\\hline\nGeometry & $\\boldsymbol{\\phi}$ & $\\boldsymbol{\\psi}$ & $\\chi_{\\mathbf{1}}$ \\\\\n\\hline\nRC & $-166$ & 177 & 75 \\\\\nTS1 & $-166$ & $-145$ & 104 \\\\\nIC1 & 180 & $-138$ & 145 \\\\\nIC2 & $-169$ & $-146$ & 148 \\\\\nTS2 & $-169$ & $-143$ & 144 \\\\\nPC & $-174$ & $-134$ & 128 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\n${ }^{1}$ See Figure 1 for definitions of $\\phi, \\psi$, and $\\chi_{1}$.\n\n\\section{Computational Details}\nThe model compound used in the present study (Ac-L-Asp-NHMe) is shown in Figure 1. $\\mathrm{A} \\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$ion (as a catalyst) and two $\\mathrm{H}_{2} \\mathrm{O}$ molecules (as solvent molecules stabilizing the negative charge) were included in the calculations. All of the calculations were performed by DFT with the B3LYP functional using Spartan '14 [40]. Geometry optimizations and vibrational frequency calculations were performed in the gas phase using the $6-31+G(d, p)$ basis set. All of the optimized geometries were confirmed to be an energy minimum (with no imaginary frequency) or a transition state (with a single imaginary frequency) by vibrational frequency calculations. The energy minima connected by each transition state were confirmed by IRC calculations, followed by full geometry optimizations. Furthermore, single-point calculations of hydration Gibbs energies were carried out for the gas-phase optimized geometries by the SM8 continuum model [32,33], as implemented in Spartan '14. This solvation model uses partial atomic changes, which can be strongly basis-set dependent. We used the 6-31G(d) basis set for the SM8 calculations, since it is recommended by the developers of the model for giving stable partial atomic changes [41]. The relative energies reported in the present paper include the ZPE and thermodynamic corrections to give the Gibbs energy at $298.15 \\mathrm{~K}$, and the SM8 hydration Gibbs energy correction.\n\n\\section{Conclusions}\nIn the present study, we computationally revealed a phosphate-catalyzed mechanism for the succinimide formation from Asp residues. This mechanism proceeds in two steps (cyclizationdehydration); in both, $\\mathrm{a} \\mathrm{H}_{2} \\mathrm{PO}_{4}^{-}$ion plays an important role as a proton relay mediator by receiving and donating protons. In both steps, a proton abstraction by the $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$ion occurs in an early stage, and this induces the subsequent bond reorganization. In particular, the changes in the first step was found to proceed in a domino-like manner. This type of mechanism will be difficult to reveal without calculating the transition state and the IRC. The transition states of both steps have a $\\mathrm{H}_{3} \\mathrm{PO}_{4}$-like moiety.\n\nThe rate-determining step of the succinimide formation from Asp residues was predicted to be the first step, i.e., the cyclization that forms the tetrahedral intermediate. The activation barrier was calculated to be $100.3 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$ for our model compound, which is in reasonable agreement with an experimental barrier $\\left(107 \\mathrm{~kJ} \\mathrm{~mol}^{-1}\\right)$ for the succinimide-forming reaction of an Asp-containing peptide in a phosphate buffer $\\left(\\mathrm{pH}\\right.$ 7.4) [19]. This supports the catalytic mechanism by a $\\mathrm{H}_{2} \\mathrm{PO}_{4}{ }^{-}$ion, as revealed in the present study. Therefore, there is enough of a possibility that this ion is involved in the succinimide formation from Asp residues in vivo as a catalyst.\n\nIn this study, a useful knowledge for understanding age-related changes and diseases was obtained. We used the simplest model compound, but the succinimide-forming reactions are known to be largely affected by the nature (especially the size) of the neighboring residue on the carboxyl side $[17,18,35,38,39]$. So, further studies are needed for the present mechanism by clarifying the influence of adjacent residues.\n\nFinally, it is interesting to note that a relationship between inorganic phosphate and aging has recently attracted interest in a different field, that of life sciences [42-44]. It has been revealed that excess dietary phosphate intake accelerates aging and renal dysfunction [45]. Since the circulating phosphate levels are regulated in a complex manner, further experimental studies are expected to reveal a possible relationship between aging, inorganic phosphate, and the succinimide-mediated non-enzymatic reactions of Asp residues.\n\nSupplementary Materials: Supplementary materials can be found at \\href{http://www.mdpi.com/1422-0067/19/2/637/s1}{www.mdpi.com/1422-0067/19/2/637/s1}.\n\nAcknowledgments: The authors would like to acknowledge Tohoku Medical and Pharmaceutical University for financial support. Author Contributions: Ryota Kirikoshi conceived and designed the calculations; Ryota Kirikoshi, Noriyoshi Manabe, and Ohgi Takahashi performed the calculations; Ryota Kirikoshi and Ohgi Takahashi wrote the paper; all authors read and approved the manuscript.\n\nConflicts of Interest: The authors declare no conflict of interest.\n\n\\section{References}\n\\begin{enumerate}\n  \\item Fujii, N.; Ishibashi, Y.; Satoh, K.; Fujino, M.; Harada, K. Simultaneous racemization and isomerization at specific aspartic acid residues in $\\alpha$ B-crystallin from the aged human lens. Biochim. Biophys. Acta 1994, 1204, 157-163. [CrossRef]\n\n  \\item Fujii, N.; Satoh, K.; Harada, K.; Ishibashi, Y. Simultaneous stereoinversion and isomerization at specific aspartic acid residues in $\\alpha$ A-crystallin from human lens. J. Biochem. 1994, 116, 663-669. [CrossRef] [PubMed]\n\n  \\item Fujii, N.; Kawaguchi, T.; Sasaki, H.; Fujii, N. Simultaneous stereoinversion and isomerization at the Asp-4 residue in $\\beta$ B2-crystallin from the aged human eye lenses. Biochemistry 2011, 50, 8628-8635. [CrossRef] [PubMed]\n\n  \\item Fujii, N.; Sakaue, H.; Sasaki, H.; Fujii, N. A rapid, comprehensive liquid chromatography-mass spectrometry (LC-MS)-based survey of the Asp isomers in crystallins from human cataract lenses. J. Biol. Chem. 2012, 287, 39992-40002. [CrossRef] [PubMed]\n\n  \\item Helfman, P.M.; Bada, J.L. Aspartic acid racemization in tooth enamel from living humans. Proc. Nat. Acad. Sci. USA 1975, 72, 2891-2894. [CrossRef] [PubMed]\n\n  \\item Powell, J.T.; Vine, N.; Crossman, M. On the accumulation of D-aspartate in elastin and other proteins of the ageing aorta. Atherosclerosis 1992, 97, 201-208. [CrossRef]\n\n  \\item Fisher, G.H.; Garcia, N.M.; Payan, I.L.; Cadilla-Perezrios, R.; Sheremata, W.A.; Man, E.H. D-Aspartic acid in purified myelin and myelin basic protein. Biochem. Biophys. Res. Commun. 1986, 135, 683-687. [CrossRef]\n\n  \\item Roher, A.E.; Lowenson, J.D.; Clarke, S.; Wolkow, C.; Wang, R.; Cotter, R.J.; Reardon, I.M.; Zürcher-Neely, H.A.; Heinrikson, R.L.; Ball, M.J.; et al. Structural alterations in the peptide backbone of $\\beta$-amyloid core protein may account for its deposition and stability in Alzheimer's disease. J. Biol. Chem. 1993, 268, 3072-3083. [PubMed]\n\n  \\item Ritz, S.; Turzynski, A.; Schütz, H.W.; Hollmann, A.; Rochholz, G. Identification of osteocalcin as a permanent aging constituent of the bone matrix: basis for an accurate age at death determination. Forensic Sci. Int. 1996, 770, 13-26. [CrossRef]\n\n  \\item Fujii, N.; Tajima, S.; Tanaka, N.; Fujimoto, N.; Takata, T.; Shimo-oka, T. The presence of D- $\\beta$-aspartic acid-containing peptides in elastic fibers of sun-damaged skin: a potent marker for ultraviolet-induced skin aging. Biochem. Biophys. Res. Commun. 2002, 294, 1047-1051. [CrossRef]\n\n  \\item Ritz-Timme, S.; Laumeier, I.; Collins, M.J. Aspartic acid racemization: Evidence for marked longevity of elastin in human skin. Br. J. Dermatol. 2003, 149, 951-959. [CrossRef] [PubMed]\n\n  \\item Clarke, S. Aging as war between chemical and biochemical processes: Protein methylation and the recognition of age-damaged proteins for repair. Ageing Res. Rev. 2003, 2, 263-285. [CrossRef]\n\n  \\item Hooi, M.Y.S.; Truscott, R.J.W. Racemisation and human cataract. D-Ser, D-Asp/Asn and D-Thr are higher in the lifelong proteins of cataract lenses than in age-matched normal lenses. AGE 2011, 33, 131-141. [CrossRef] [PubMed]\n\n  \\item Fujii, N.; Takata, T.; Fujii, N. Quantitative analysis of isomeric (L- $\\alpha-$, L- $\\beta-$, D- $\\alpha-$, D- $\\beta-$ ) aspartyl residues in proteins from elderly donors. J. Pharm. Biomed. Anal. 2015, 116, 25-33. [CrossRef] [PubMed]\n\n  \\item Fujii, N.; Takata, T.; Fujii, N.; Aki, K. Isomerization of aspartyl residues in crystallins and its influence upon cataract. Biochim. Biophys. Acta 2016, 1860, 183-191. [CrossRef] [PubMed]\n\n  \\item Truscott, R.J.W.; Friedrich, M.G. The etiology of human age-related cataract. Proteins don't last forever. Biochim. Biophys. Acta 2016, 1860, 192-198. [CrossRef] [PubMed]\n\n  \\item Geiger, T.; Clarke, S. Deamidation, isomerization, and racemization at asparaginyl and aspartyl residues in peptides. Succinimide-linked reactions that contribute to protein degradation. J. Biol. Chem. 1987, 262, 785-794. [PubMed]\n\n  \\item Stephenson, R.C.; Clarke, S. Succinimide formation from aspartyl and asparaginyl peptides as a model for the spontaneous degradation of proteins. J. Biol. Chem. 1989, 264, 6164-6170. [PubMed] 19. Aki, K.; Fujii, N.; Fujii, N. Kinetics of isomerization and inversion of aspartate 58 of $\\alpha$ A-crystalline peptide mimics under physiological conditions. PLoS ONE 2013, 8, e58515. [CrossRef] [PubMed]\n\n  \\item Capasso, S.; Mazzarella, L.; Sica, F.; Zagari, A. Deamidation via cyclic imide in asparaginyl peptides. Pept. Res. 1989, 2, 195-200. [PubMed]\n\n  \\item Patel, K.; Borchardt, R.T. Chemical pathways of peptide degradation. II. Kinetics of deamidation of an asparaginyl residue in a model hexapeptide. Pharm. Res. 1990, 7, 703-711. [CrossRef] [PubMed]\n\n  \\item Capasso, S. Thermodynamic parameters of the reversible isomerization of aspartic residues via a succinimide derivative. Thermochim. Acta 1996, 286, 41-50. [CrossRef]\n\n  \\item Takahashi, O.; Kirikoshi, R.; Manabe, N. Acetic acid can catalyze succinimide formation from aspartic acid residues by a concerted bond reorganization mechanism: A computational study. Int. J. Mol. Sci. 2015, 16, 1613-1626. [CrossRef] [PubMed]\n\n  \\item Catak, S.; Monard, G.; Aviyente, V.; Ruiz-López, M.F. Deamidation of asparagine residues: Direct hydrolysis versus succinimide-mediated deamidation mechanisms. J. Phys. Chem. A 2009, 113, 1111-1120. [CrossRef] [PubMed]\n\n  \\item Takahashi, O.; Kirikoshi, R. Intramolecular cyclization of aspartic acid residues assisted by three water molecules: A density functional theory study. Comput. Sci. Discov. 2014, 7, 015005. [CrossRef]\n\n  \\item Takahashi, O.; Kirikoshi, R.; Manabe, N. Roles of intramolecular and intermolecular hydrogen bonding in a three-water-assisted mechanism of succinimide formation from aspartic acid residues. Molecules 2014, 19, 11440-11452. [CrossRef] [PubMed]\n\n  \\item Tomizawa, H.; Yamada, H.; Wada, K.; Imoto, T. Stabilization of lysozyme against irreversible inactivation by suppression of chemical reactions. J. Biochem. 1995, 117, 635-640. [CrossRef] [PubMed]\n\n  \\item Voet, D.; Voet, J.G. Biochemistry, 4th ed.; John Wiley \\& Sons, Inc.: Hoboken, NJ, USA, 2011; pp. 45-69, ISBN 13: 978-0470-57095-1.\n\n  \\item Takahashi, O.; Kirikoshi, R.; Manabe, N. Racemization of the succinimide intermediate formed in proteins and peptides: A computational study of the mechanism catalyzed by dihydrogen phosphate ion. Int. J. Mol. Sci. 2016, 17, 1698. [CrossRef] [PubMed]\n\n  \\item Nakayoshi, T.; Kato, K.; Fukuyoshi, S.; Takahashi, O.; Kurimoto, E.; Oda, A. Comparison of the activation energy barrier for succinimide formation from $\\alpha$ - and $\\beta$-aspartic acid residues obtained from density functional theory calculations. Biochim. Biophys. Acta Proteins Proteomics 2018, in press. [CrossRef] [PubMed]\n\n  \\item Kiriukhin, M.Y.; Collins, K.D. Dynamic hydration numbers for biologically important ions. Biophys. Chem. 2002, 99, 155-168. [CrossRef]\n\n  \\item Marenich, A.V.; Olson, R.M.; Kelly, C.P.; Cramer, C.J.; Truhlar, D.G. Self-consistent reaction field model for aqueous and nonaqueous solutions based on accurate polarized partial charges. J. Chem. Theory Comput. 2007, 3, 2011-2033. [CrossRef] [PubMed]\n\n  \\item Cramer, C.J.; Truhlar, D.G. A universal approach to solvation modeling. Acc. Chem. Res. 2008, 41, 760-768. [CrossRef] [PubMed]\n\n  \\item Chang, R. Physical Chemistry for the Biosciences; University Science Books: Mill Valley, CA, USA, 2005; pp. 218-220, ISBN 13: 978-1-891389-33-7.\n\n  \\item Shimizu, K.; Kita, A.; Fujii, N.; Miki, K. Structural features of isomerizable aspartyl residues in human\n\n\\end{enumerate}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cff3389f103b8f7971d0g-11_2056_2102_333_1078}\n\\end{center}\n\n\\begin{enumerate}\n  \\setcounter{enumi}{35}\n  \\item Vaney, M.C.; Maignan, S.; Riès-Kautt, M.; Ducruix, A. High-resolution structure (1.33 Å) of a HEW lysozyme tetragonal crystal grown in the APCF apparatus. Data and structural comparison with a crystal grown under microgravity from SpaceHab-01 mission. Acta Cryst. 1996, D52, 505-517. [CrossRef] [PubMed]\n\n  \\item Noguchi, S.; Miyawaki, K.; Satow, Y. Succinimide and isoaspartate residues in the crystal structures of hen egg-white lysozyme complexed with tri-N-acetylchitotriose. J. Mol. Biol. 1998, 278, 231-238. [CrossRef] [PubMed]\n\n  \\item Fujii, N.; Momose, Y.; Harada, K. Kinetic study of racemization of aspartyl residues in model peptides of $\\alpha$ A-crystallin. Int. J. Pept. Protein Res. 1996, 48, 118-122. [CrossRef] [PubMed]\n\n  \\item Radkiewicz, J.L.; Zipse, H.; Clarke, S.; Houk, K.N. Neighboring side chain effects on asparaginyl and aspartyl degradation: An ab initio study of the relationship between peptide conformation and backbone $\\mathrm{NH}$ acidity. J. Am. Chem. Soc. 2001, 123, 3499-3506. [CrossRef] [PubMed]\n\n  \\item Spartan '14, version 1.1.4; Wavefunction, Inc.: Irvine, CA, USA, 2014. 41. Chamberlin, A.C.; Cramer, C.J.; Truhlar, D.G. Performance of SM8 on a test to predict small-molecule solvation free energies. J. Phys. Chem. B 2008, 112, 8651-8655. [CrossRef] [PubMed]\n\n  \\item Kuro-o, M. A potential link between phosphate and aging-Lessons from Klotho-deficient mice. Mech. Ageing Dev. 2010, 131, 270-275. [CrossRef] [PubMed]\n\n  \\item Ohnishi, M.; Razzaque, M.S. Dietary and genetic evidence for phosphate toxicity accelerating mammalian aging. FASEB J. 2010, 24, 3562-3571. [CrossRef] [PubMed]\n\n  \\item Watanabe, R.; Fujita, N.; Sato, Y.; Kobayashi, T.; Morita, M.; Oike, T.; Miyamoto, K.; Kuro-o, M.; Michigami, T.; Fukumoto, S.; et al. Enpp1 is an anti-aging factor that regulates Klotho under phosphate overload conditions. Sci. Rep. 2017, 7, 7786. [CrossRef] [PubMed]\n\n  \\item McClelland, R.; Christensen, K.; Mohammed, S.; McGuinness, D.; Cooney, J.; Bakshi, A.; Demou, E.; MacDonald, E.; Caslake, M.; Stenvinkel, P.; et al. Accelerated ageing and renal dysfunction links lower socioeconomic status and dietary phosphate intake. Aging 2016, 8, 1135-1148. [CrossRef] [PubMed]\n\n\\end{enumerate}\n\n(c) 2018 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (http:/ / \\href{http://creativecommons.org/licenses/by/4.0/}{creativecommons.org/licenses/by/4.0/}).\n\n\n\\end{document}", "record_id": "2023_09_22_cff3389f103b8f7971d0g"}