{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{A Aalto University }\n\n\n\\author{Shigeki Kawai, ${ }^{1, *}$ Ondrěj Krejčcí, ${ }^{2}$ Adam S. Foster, ${ }^{2,3,4}$ Rémy\\\\\nPawlak, ${ }^{5}$ Feng Xu, ${ }^{6}$ Lifen Peng, ${ }^{6}$ Akihiro Orita, ${ }^{6}$ and Ernst Meyer ${ }^{5}$\\\\\n${ }^{1}$ International Center for Materials Nanoarchitectonics,\\\\\nNational Institute for Materials Science, 1-1,\\\\\nNamiki, Tsukuba, Ibaraki 305-0044, Japan.\\\\\n${ }^{2}$ Department of Applied Physics, Aalto University School of Science,\\\\\nP.O. Box 11100, FI-00076 Aalto, Finland.\\\\\n${ }^{3}$ WPI Nano Life Science Institute (WPI-NanoLSI),\\\\\nKanazawa University, Kakuma-machi, Kanazawa 920-1192, Japan.\\\\\n${ }^{4}$ Graduate School Materials Science in Mainz,\\\\\nStaudinger Weg 9, 55128, Germany\\\\\n${ }^{5}$ Department of Physics, University of Basel,\\\\\nKlingelbergstrasse 82, CH-4056 Basel, Switzerland.\\\\\n${ }^{6}$ Department of Applied Chemistry and Biotechnology,\\\\\nOkayama University of Science, 1-1 Ridai-cho,\\\\\nKita-ku, Okayama, 700-0005, Japan.}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nThis is an electronic reprint of the original article.\n\nThis reprint may differ from the original in pagination and typographic detail.\n\nKawai, Shigeki; Krejci, Ondrej; Foster, Adam; Pawlak, Rémy; Xu, Feng; Peng, Lifen; Orita, Akihiro; Meyer, Ernst\n\nDiacetylene Linked Anthracene Oligomers Synthesized by One-Shot Homocoupling of Trimethylsilyl on Cu(111)\n\nPublished in:\n\nACS Nano\n\nDOI:\n\n10.1021/acsnano.8b05116\n\nPublished: 07/08/2018\n\nDocument Version\n\nPeer reviewed version\n\nPlease cite the original version:\n\nKawai, S., Krejci, O., Foster, A., Pawlak, R., Xu, F., Peng, L., Orita, A., \\& Meyer, E. (2018). Diacetylene Linked Anthracene Oligomers Synthesized by One-Shot Homocoupling of Trimethylsilyl on Cu(111). ACS Nano, 12(8), 8791-8797. \\href{https://doi.org/10.1021/acsnano.8b05116}{https://doi.org/10.1021/acsnano.8b05116}\n\nThis material is protected by copyright and other intellectual property rights, and duplication or sale of all or part of any of the repository collections is not permitted, except that material may be duplicated by you for your research use or educational purposes in electronic or print form. You must obtain permission for any other use. Electronic or print copies may not be offered, whether for sale or otherwise to anyone who is not an authorised user.\n\n\\section*{Diacetylene Linked Anthracene Oligomers Synthesized by One-Shot Homo-Coupling of Trimethelsilyl on Cu(111) }\n\n\n\\begin{abstract}\nOn-surface chemical reaction has become a very powerful technique to conjugate small precursor molecules and several reactions have been proposed with the aim to fabricate functional nanostructures on surfaces. Here we present an unforeseen adsorption mode of 9,10bis((trimethylsilyl)ethynyl)anthracene on a $\\mathrm{Cu}(111)$ surface and the resulting one-shot desilylative homo-coupling of of the adsorbate by annealing at $400 \\mathrm{~K}$. With a combination of high-resolution atomic force microscopy and density functional theory calculations, we found that the triple bonds and silicon atoms of the monomer chemically interact with the copper surface. After the oligomerization, we discovered that the anthracene units are linked to each other via buta-1,3-diynediyl fragments while keeping the surface clean. Furthermore, the force measurement revealed the chemical nature at the center of anthracene unit.\n\\end{abstract}\n\nKEYWORDS: on-surface chemical reaction, Glaser coupling, trimethylsilyl, anthracene, atomic force microscopy Since the first systematic nano-architecture via covalent bonding of bromo-substituted porphyrin, ${ }^{1}$ the investigation of on-surface chemical reactions has attracted tremendous research interest. By synthesizing appropriate precursor molecules in solution and subsequently linking them to each other on surfaces, functionalized nano-carbon materials can be fabricated in a bottom-up manner. ${ }^{2-4}$ Such conjugated molecular wires and ribbons have been used for the electronic ${ }^{5,6}$ and mechanical measurements ${ }^{7,8}$ as well as the study of electroluminescence. ${ }^{9}$ Exploring on-surface chemical reactions is of central importance to realize a large variety of conjugation schemata on different substrates at different temperatures. ${ }^{10}$ Among them, the most common reaction is the Ullmann type reaction, where several hydrogen atoms in precursor molecules are substituted by halogen atoms $(\\mathrm{X}=\\mathrm{Br}, \\mathrm{I})$ and annealing them on noble metal surfaces results in cleavage of the $\\mathrm{C}-\\mathrm{X}$ bonds. Depending on the substrate, the precursor molecules form either first organometallic intermediates ${ }^{11}$ or directly carbon-carbon conjugations. ${ }^{1}$ The cleaved halogen atoms usually remain on the surface and may affect the reaction. ${ }^{12}$ By increasing the substrate annealing temperature, these sub-products of the reaction can be also desorbed from the surface. Thus, this approach has developed as a reliable method if the synthesized nanostructures are thermally stable, such as graphene nanoribbons. ${ }^{2,3}$ In contrast, Glaser-type reactions, such as the traditional acetylenic coupling, ${ }^{13}$ can be completed at lower temperature (typically $400 \\mathrm{~K}$ ). In these reactions a non-aromatic group connected to the acetylene unit is cleaved from two monomer units, then forming a oligomer or polymer connected via triple-single-triple carbon bond. Gao et al., demonstrated this reaction on a surface and formed 1,3-butadiynediyllinked polymers of a 1,4-di(phenylethynyl)benzene $\\pi$ system. ${ }^{14}$ Very recently, they further discovered that the terminal ethyne could be produced by desilylation with carboxylic acid on $\\operatorname{Ag}(111)$ and $A u(111)$ at room temperature and subsequently the synthesized products were linked to each other by on-surface Glaser coupling at high temperature in a two-step reaction. ${ }^{15}$\n\nAtomic force microscopy (AFM) has become an important technique in the field of onsurface chemistry, since the functionalized tip with a small carbon monoxide (CO) molecule allows us to observe the inner structures of molecules on surfaces. ${ }^{16}$ This direct observation has been used to study single ${ }^{17-19}$ and self-assembled molecules ${ }^{20-23}$ as well as products in on-surface chemical reactions. ${ }^{24-27}$ Furthermore, compounds were successfully synthesized by tip-induced dehydrogenation or dehalogenation and were characterized with AFM. ${ }^{28-30}$ Therefore, AFM is an appropriate tool to investigate on-surface reactions and their reactants and products on surfaces via direct and real-space observation.\n\nHere, we present the revealed geometry of adsorbed 9,10-bis((trimethylsilyl)ethynyl)anthracene (TMSEA) on a $\\mathrm{Cu}(111)$ surface showing unconventional chemical interaction of the triple bond and Si atom, accompanied by change of binding of a methyl group. From this precursor we performed Glaser type one-shot homo-coupling using trimethylsilyl (TMS) groups by annealing at $400 \\mathrm{~K}$. We found that the desilylation of the adsorbed TMSEA was caused on $\\mathrm{Cu}(111$ ) just by moderate annealing, leading to 9,10-di(ethynyl)anthracene oligomeric chains. Since the dissociated TMS group is highly volatile at the reaction temperature, no significant contamination was seen. Structures of the precursor and its product were analyzed with a combination of high-resolution scanning tunneling microscopy (STM) and AFM as well as the density functional theory (DFT) calculations. Furthermore, the chemical nature of anthracene derivative was investigated by force measurements.\n\n\\section{RESULTS AND DISCUSSION}\n\\section{As-Deposited on $\\mathrm{Cu}(111)$.}\nFigure 1a shows the chemical structure of TMSEA, in which anthracene is substituted with a pair of TMS groups at 9 and 10 positions. TMSEA was deposited on a clean Cu(111) surface kept at room temperature. At low coverage, isolated molecules were observed at low temperature. In each molecule, two bright spots appear (Figure 1b), and by checking the relative position, we found that the molecule adsorbs at three different orientations, indicated by bars with different colours. By increasing the coverage, the molecule condenses into one-dimensional structures with the bright spots facing each other (Figure S1), in agreement with the recent study on $A g(111)$ and $A u(111) .{ }^{15}$ In order to investigate the inner structure of a single TMSEA, we employed AFM with a CO functionalized tip. Figures 1c-f show the constant height images taken at different tip-sample distances. At the largest distance (Figure 1c), two bright spots appear at the same peripheral positions as observed in the STM image. The gap is approximately $750 \\mathrm{pm}$, which is close to the value for C17-C18 in\n\nFigure 1a. At this tip-sample separation, no other features are observed, implying that two moieties of the molecule are significantly higher than the rest - only the methyl groups are\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_910aca2a500d3bf9bf47g-06_236_1414_606_1502}\n\nFigure 1. (a) Molecular structure of 9,10-bis((trimethylsilyl)ethynyl)anthracene (TMSEA). (b) Scanning tunneling microscopy (STM) topography of as-deposited TMSEA on Cu(111). (c-f) A series of constant height atomic force microscopy (AFM) images, taken with a CO functionalized tip at different tip-sample separations. (g) Molecular structure and three-dimensional representation of TMSEA adsorbed on $\\mathrm{Cu}(111)$, calculated with density functional theory (DFT) calculations. (hk) A series of simulated AFM images at different heights based on the relaxed molecular structure. Measurement parameters: $V_{\\text {tip }}=-200 \\mathrm{mV}$ and $I=5 \\mathrm{pA}$ for STM measurements in (b). $V_{\\text {tip }}=$ $0 \\mathrm{mV}$ and oscillation amplitude $A=50 \\mathrm{pm}$ for AFM measurements in (c-f).\n\ncandidates for such the three-dimensional structure, thus one or two $\\mathrm{C}-\\mathrm{H}$ bonds would point out from the surface with the $\\mathrm{CO} \\cdots \\mathrm{HC}$ interaction responsible for the imaging contrast. ${ }^{31}$ This is further supported by DFT calculations of the adsorbed molecular structure (Figure $1 \\mathrm{~g}$ ), where a configuration with four methyl groups binding to the silicon atoms situated close to the surface and two other methyls bound pointing upwards is the most favourable configuration (Figure S2). To form this adsorbed configuration, the triple bonds of TMSEA react with $\\mathrm{Cu}$ surface and transform themselves to double bonds with C15 and C16 being considerably lower than other carbon atoms - $2 \\AA$ above the surface. The silicon atoms that lose one of the methyl groups also chemically interact with the surface and its height is lowered to $2.2 \\AA$ above the surface. Consequently, the dissociated methyl group connects to the adjacent carbon (C17 and C18), inducing two bright spots with a gap of $750 \\mathrm{pm}$ as observed in both the experiment and DFT calculations. Therefore, TMSEA deposited on $\\mathrm{Cu}(111)$ is no longer intact due to the high reactivity.\n\nWhen the tip approaches closer to the surface, an additional two pairs of bright contrast appear at both termini (Figure 1d), with two short lines visible, which most probably relates to two C-H bonds in the top-most methyl groups, ${ }^{32}$ but it can be also connected with hydrogens of the lower-laying methyl groups. Note that during our DFT simulations we observed that rotation of hydrogens in the top-most methyl group by 30 degrees (Figure $1 \\mathrm{~g}$ ) has a minimal energy cost. Therefore we assume that the top most hydrogens can partially rotate during the scan, but this cannot be captured in our static AFM simulations. Hence, we scanned through several possibilities (Figure S3) to find the best agreement with experiment for this case. Also note that the agreement in distance between AFM image features in experiment and theory was much better for this molecular configuration than the others considered (Figure S3).\n\nThe anthracene backbone becomes visible when the tip is set even closer to the molecule (Figure 1e). Since both ends appear first in the constant height image, the anthrylene seems to be bent on $\\mathrm{Cu}(111)$, as seen in the simulations (Figure $1 \\mathrm{~g}$ ). When the benzene rings are resolved, the nature of the image (Figure 1f) implies that the TMS moieties are already highly distorted due to the deflection of the CO tip, but the stability of the adsorbed molecule is clear evidence that the molecule is adsorbed mainly by the $\\pi$ electron of the anthracene unit (Figure S4) and the flexible 2,3,3-trimethyl-3-silapropenylene moiety is highly bent (Figure $1 \\mathrm{~g}$ ). The weak standing wave pattern with a center of the adsorbed molecule also indicates that the molecule adsorbed on the $\\mathrm{Cu}(111)$ with a relatively strong bonding (Figure S5).\n\n\\section{On-Surface Reaction and Its Product.}\nAfter the system had been annealed at $400 \\mathrm{~K}$, the surface was scanned again at low temperature. While isolated single molecules are no longer visible in the STM topography\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_910aca2a500d3bf9bf47g-08_240_1170_693_1415}\n\nFigure 2. Synthesis of oligomer. (a) STM image after annealing. Inset shows a closer view. (b) AFM image scanned in the area indicated with a dashed square in (a). (c) Close view of the oligomer. Green arrows indicate the diacetylene unit. (d) Corresponding Laplace filtered image for a better view of the inner structure. Measurement parameters: $V_{\\text {tip }}=-600 \\mathrm{mV}$ and $I=5 \\mathrm{pA}$ for STM measurements in (a). $V_{\\text {tip }}=0 \\mathrm{mV}$ and oscillation amplitude $A=50 \\mathrm{pm}$ for AFM measurements in (b-d).\n\n(Figure 2a), one-dimensional structures appear, suggesting that an on-surface chemical reaction took place. In contrast to the STM topography of the precursor, the anthracene unit is clearly visible and between units, one bright spot appears. Thus, the silyl groups seem to dissociate completely (inset of Figure 2a). Figure 2 b shows an AFM image taken in the area indicated by a square in Figure 2a. Ladder structures, composed of the anthracene units, are clearly visible. The contrast of the anthracene units and the linkers varies, presumably due to the adsorption sites. Nevertheless, the center of anthracene unit does not show up clearly at this distance. Note that the bright spot indicated by a red arrow is a CO molecule and no significant contamination is seen.\n\nIn order to investigate the structures in detail, a closer image was taken (Figure 2c), and the corresponding Laplace filtered image to enhance the bond features is shown in Figure 2d. In between the anthracene units, two bright spots can be seen, while the corresponding STM image shows only one bright spot (inset of Figure 2a). Since the positions are not in line perfectly, a certain flexibility exists. It is known that the triple bond appears as a large spot due to the greater total charge density where the CO tip deflects significantly. ${ }^{21,24,33}$ In the precursor molecule, the anthracene backbone is connected to two sets of TMS via the acetylene moiety, thus it is conclusive that two bright spots (marked by green arrows in Figure $2 \\mathrm{c}$ and $\\mathrm{d}$ ) correspond to two triple bonds, forming a diacetylene. Thus, the anthracene units are linked to each other and the product is poly-diacetylene-anthracene. Simulations show that this structure is stable (Figure 3a,b) on the surface, and the resulting STM (Figure 3c) and AFM (Figure 3d) simulated images are in good agreement with experiment. We also observed a pentagonal ring when the angle of the adjacent molecules is not parallel (Figure S6). It relates to the fact that 1,3-butadiynediyl fragment is thermally reactive on noble metal surfaces ${ }^{24,25}$ and consequently reacts with the anthracene units.\n\nFigure 4 summarizes the scheme of the on-surface reaction with TMSEA. At room temperature TMSEA adsorbs on the surface forming a partially chemisorbed structure. Despite the chemical bond to the surface, the monomer units probably stay mobile enough so they can condense due to intermolecular van der Waals interactions between the methyl groups on silicons. The bulkiness of the methyl groups also enhances the diffusion of the molecule. It is deduced that $\\mathrm{C}=\\mathrm{CCH}_{3}-\\mathrm{Si}\\left(\\mathrm{CH}_{3}\\right)_{2}$ change itself back to the original chemical state upon annealing and later, $\\mathrm{Si}\\left(\\mathrm{CH}_{3}\\right)_{3}$ is transformed to $\\mathrm{Si}\\left(\\mathrm{CH}_{3}\\right)_{3} \\mathrm{H}$ by taking an atomic hydrogen from the $\\mathrm{Cu}$ substrate or vacuum at the reaction temperature, as similar to previous dehalogenation experiments. ${ }^{34}$ Thus, trimethylsilane desorbs from the substrate because of its high volatility. Indeed, no significant contamination was observed on the surface.\n\n\\section{Force Measurement of Anthracene Unit.}\nFigure 5a shows a close-view AFM image of the anthracene unit, in which both termini appear lifted up from the surface (which is generally the case in Figure 2). Pentacene, a longer polycyclic aromatic hydrocarbon, has similar features in its adsorption geometry, but all six-membered rings appear almost the same in the constant height AFM image. ${ }^{16,35}$ To investigate the mechanism of the contrast in detail, a series of Z-distance dependent curves of the frequency shift were taken along the longitudinal axis of the anthracene unit as\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_910aca2a500d3bf9bf47g-10_236_1180_454_1652}\n\n$\\mathbf{G}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_910aca2a500d3bf9bf47g-10_985_1140_1218_1644}\n\\end{center}\n\nFigure 3. (a, b) Snapshots of the simulated oligomer adsorption structure. (c) Simulated STM image at a bias of $-1.0 \\mathrm{~V}$. (d) Simulated AFM image with the tip oxygen at $0.355 \\mathrm{~nm}$ from the average position of the oligomer, plots in the region indicated by the box in (a). (e) Charge of adsorbed system, where red is negative and blue is positive (plotted range $-0.2 \\mathrm{e} \\sim 0.2 \\mathrm{e})$. (f, g) Differential charge density upon adsorption at contours of $-0.01 \\mathrm{e}^{-1}$ (blue) and $0.01 \\mathrm{e}^{-1}$ (red).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_910aca2a500d3bf9bf47g-10_1653_1892_320_1800}\n\\end{center}\n\nFigure 4. Oligomerization of TMSEA by on-surface desilylative homo-coupling.\n\nindicated by I-II in Figure 5a. Figure 5b shows the represented two-dimensional frequency shift map. Approaching to the molecule, the negative frequency shift was first caused by the van der Waals interaction between tip and molecule. While the frequency shift is still negative at the center of the molecule $(\\mathrm{Z}=100 \\mathrm{pm}),{ }^{35}$ the repulsive interaction becomes dominant at the termini, leading to a positive frequency shift. By taking the turning point of the Z-distance v.s. frequency shift curve, we measured the corrugation of the molecule as indicated with the white line. Since the contrast of the bond is strongly affected by the tilt of the CO molecule on the tip, we compare the $\\mathrm{Z}$ distance only at the center of benzene rings as indicated by arrows and found that this method predicts that the central ring of anthracene adsorbs to the surface closer than the external rings by about $23 \\mathrm{pm}$. This value is in the same range as one for pentacene on $\\mathrm{Cu}(111) .{ }^{35}$ Calculations of the adsorption geometry of the oligomer on copper show that the adsorption height differences between the central and external rings are of the order of $10 \\mathrm{pm}$, but this can be either closer or further from the surface depending on the specific adsorption geometry (there are variations in the anthracene units across the simulation system as shown in Figure 3 and also shown in Figure 2). If we focus on an anthracene unit with minimal tilt, as indicated by Figure 5a, so that termini appear equivalent, then the difference in adsorption height is less than $5 \\mathrm{pm}$ according to DFT calculations, and the difference in contrast is unlikely to be purely due to physical topography.\n\nNext, the measured force was extracted from the frequency map (Figure 5c) after testing a recently proposed criteria for a reliability of force extraction. ${ }^{36,37}$ We found that the magnitude of the most attractive force at the center benzene is about $30 \\%$ greater than the others, which cannot be explained only by the local modulation of van der Waals interaction between tip and molecule (estimated about $20 \\%$ from simulations). Since we have established that the rings are effectively at the same height, this reflects a difference in the measured electrostatic and/or chemical interaction. Figure 3e suggests a source of this difference, where we see that the electrostatic potential (represented by effective charges) are significantly different around the central ring, demonstrating a concentration of positive charge as a result of the formation of the oligomer. This is present even for an isolated oligomer system (see Figure S7), with minor changes caused by the charge transfer processes upon adsorption to the surface (see Figure $3 f, g$ ). The resultant effect can be clearly seen also in the simulated AFM image and vertical slice through the force map (Figure 5d). In this way, we confirm a different chemical nature of the center benzene, which may relate to the high reactivity. We found that the magnitude of the most attractive force at the center benzene is about $30 \\%$ greater than the others, which cannot be explained only by the local modulation of van der Waals interaction between tip and molecule (estimated about $20 \\%$ from simulations). Since we have established that the rings are effectively at the same height, this reflects a difference in the measured electrostatic and/or chemical interaction. Figure 3e suggests a source of this difference, where we see that the electrostatic potential (represented by effective charges) are significantly different around the central ring, demonstrating a concentration of positive charge as a result of the formation of the oligomer. This is present even for an isolated oligomer system (see Figure S7), with minor changes caused by the charge transfer processes upon adsorption to the surface (see Figure 3f,g). The resultant effect can be clearly seen also in the simulated AFM image and vertical slice through the force map (Figure $5 \\mathrm{~d}$ ). In this way, we confirm a different chemical nature of the center benzene, which may relate to the high reactivity.\n\n\\section{CONCLUSION}\nIn summary, we reported one-shot homo-coupling with trimethylsilyl groups on $\\mathrm{Cu}(111)$ by Glaser type on-surface reaction. Anthracene oligomers with diacetylene linkers were synthesized by annealing at $400 \\mathrm{~K}$, we deduce that the mechanism involves a $\\mathrm{Cu}$ atom catalyzing desilylation, and subsequently a hydrogen atom from the substrate or vacuum terminates the dissociated trimethylsilyl radical. As the trimethylsilane is quite volatile, fully hydrogenated silyl group was desorbed from the surface at the annealing temperature, which means that the side-product is completely removed. This contamination free onsurface reaction can be used to construct nano-carbon materials on the surface. Furthermore, the synthesized anthracene oligomer was used to investigate the reactivity of anthracene units via force mapping. We found that the center six-membered ring has $30 \\%$ greater attractive force, implying higher reactivity in, for instance Diels-Alder reactions and $[4+4]$ cycloadditions preferentially caused at the center.\n\n\\section{METHODS}\nAFM Measurements. All measurements were performed with a commercially available Omicron low temperature scanning tunneling microscopy (STM)/atomic force microscopy (AFM) system, operating in ultra-high vacuum at $4.8 \\mathrm{~K}$. We used a tuning fork with a chem-\n\nically etched tungsten tip as a force sensor. ${ }^{38}$ The resonance frequency and the mechanical quality factor are $24756.3 \\mathrm{~Hz}$ and 23484 , respectively. The high-stiffness of $1800 \\mathrm{~N} / \\mathrm{m}$ realizes a stable operation with small amplitude of 50 pm. ${ }^{39}$ The frequency shift, caused by the tip-sample interaction, was detected with a commercially available digital phase-locked loop (Nanonis: OC-4 and Zurich Instruments: HF2-LI and HF2-PLL). ${ }^{40}$ For the STM measurement, the bias voltage was applied to the tip while the sample was electronically grounded. The tip apex was ex situ sharpened by milling with a focused ion beam. The tip radius was less than $10 \\mathrm{~nm}$. A clean copper tip was in situ formed by indenting to the $\\mathrm{Cu}$ sample surface and applying a pulse bias voltage between tip and sample several times. For AFM, the tip apex was terminated with a CO molecule, which was picked up from the surface. ${ }^{41}$ Clean $\\mathrm{Cu}(111)$ surfaces were in situ prepared by repeated cycles of standard $\\mathrm{Ar}^{+}$sputtering $\\left(3 \\times 10^{-6} \\mathrm{mbar}, 1000 \\mathrm{eV}\\right.$, and $\\left.15 \\mathrm{~min}\\right)$ and annealing at $770 \\mathrm{~K}$. In this experiment,9,10-bis((trimethylsilyl)ethynyl)anthracene molecules were deposited on the surface from crucibles of a Knudsen cell, heated at $356 \\mathrm{~K}$. The temperature of the substrate was kept at room temperature. Two-dimensional frequency shift mapping was performed by a series of $Z$ distance measurements of the frequency shift. Measured images were partially analyzed using the WSxM software. ${ }^{42}$\n\nTheoretical Calculations. All first principles calculations in this work were performed using the periodic plane-wave basis VASP code ${ }^{43,44}$ implementing the spin-polarized density functional theory (DFT). To accurately include van der Waals interactions in this system we used the optB86B +vdW-DF functional, ${ }^{45-47}$ selected based on previous work showing that it provides a sufficiently accurate description for all subsystems involved in the measurement. For similar systems, ${ }^{48}$ this has given comparable accuracy in adsorbed molecular structures to vdW functionals D3 ${ }^{49}$ and TS. ${ }^{50}$ Projected augmented wave (PAW) potentials were used to describe the core electrons, ${ }^{51}$ with a kinetic energy cutoff of $550 \\mathrm{eV}$ (with PREC=accurate). Systematic $k$-point convergence was checked for all systems, with sampling chosen according to system size and a mesh of $3 \\times 3 \\times 1$ being used for the final production runs. This approach converged the total energy of all the systems to the order of $\\mathrm{meV}$. The properties of the bulk and surface of $\\mathrm{Cu}$, and the isolated molecular structures were carefully checked within this methodology, and excellent agreement was achieved with experiments. For calculations of the isolated molecules on the surface, a surface slab of $8 \\times 8 \\times 5$ in terms of the $\\mathrm{Cu}$ unit cell was used, with a vacuum gap of at least $1.5 \\mathrm{~nm}$ and the upper three layers of $\\mathrm{Cu}$ and all atoms in the molecule allowed to relax. The oligomer on copper unit cell consisted of a surface slab of $11 \\times 6 \\times 5$ in terms of the $\\mathrm{Cu}$ unit cell, expanded by $1.5 \\%$, to match the equilibrium structure of the unsupported oligomer. All adsorption energies reported are calculated by subtracting the individual components of the system, in the same unit cell, from the total energy of the final system. Bader charge analysis, with a $30 \\%$ increased kinetic energy cutoff, was used to estimate charge transfer in the simulations. ${ }^{52}$\n\nSimulated AFM images were obtained with 2-point implementation ${ }^{53}$ of the Probe Particle model. ${ }^{54,55}$ The Lennard-Jones forces between sample and carbon and oxygen atom of the tip were calculated using parameters taken from OPLS force-field. ${ }^{56}$ The electrostatic forces were calculated from monopole charges on the carbon, oxygen and two copper atoms representing a metallic tip-base and DFT calculated Hartree potentials of the sample. ${ }^{55}$ The atomic charges used for simulations are $-0.117,0.213,-0.063$ and $-0.067$ e for C, O lower $\\mathrm{Cu}$ and upper $\\mathrm{Cu}$, respectively, which were obtained using the RESP method ${ }^{57}$ applied on results of DFT calculations of the tip model above a pentacene molecule. ${ }^{58} \\mathrm{STM}$ images were calculated using the HIVE package ${ }^{59}$ based on the Tersoff-Hamann approximation. ${ }^{60}$\n\n\\section{ACKNOWLEDGEMENTS}\nThis work was supported in part by Japan Society for the Promotion of Science (JSPS) KAKENHI Grant Number 15K21765, JP18H04430 in Middle Molecular Strategy, JP15K05440, and JP18K05134, by the Swiss National Science Foundation, by the Swiss Nanoscience Institute, by COST action MP1303 'Understanding and Controlling nano and Mesoscale Friction', and by the Okayama Prefecture Industrial Promotion Foundation and Grant for Promotion of OUS Research Projects. OK and ASF have been supported by the Academy of Finland through its Centres of Excellence Program Project No. 915804, and by the World Premier International Research Center Initiative (WPI), MEXT, Japan. They acknowledge use of the CSC, Helsinki for computational resources. OK would like to thank to Aliaksandr V. Yakutovich for his help with the AFM simulations.\n\n\\section{ASSOCIATED CONTENT}\nThis material is available free of charge on the ACS Publications website at DOI: xxxxxxxxxxx.\n\nMore coverage of TMSEA, possible configuration of the isolated TMSEA, lowest energy configuration of TMSEA, simulation results for the isolated TMSEA, another STM topog- raphy, AFM image of single TMSEA, formation of five-membered ring, plot of the charge of the oligomer system are discussed.\n\n\\begin{itemize}\n  \\item \\href{mailto:Kawai.shigeki@nims.go.jp}{Kawai.shigeki@nims.go.jp}\n\\end{itemize}\n\n\\section{REFERENCES}\n1 Grill, L.; Dyer, M.; Lafferentz, L.; Persson, M.; Peters, M. V.; Hecht, S. Nano-Architectures by Covalent Assembly of Molecular Building Blocks. Nat. Nanotechnol. 2007, 2, 687-691.\n\n2 Cai, J.; Ruffieux, P.; Jaafar, R.; Bieri, M.; Braun, T.; Blankenburg, S.; Muoth, M.; Seitsonen, A. P.; Saleh, M.; Feng, X.; Müllen, K.; Fasel, R. Atomically Precise Bottom-Up Fabrication of Graphene Nanoribbons. Nature $\\mathbf{2 0 1 0}, 466,470-473$.\n\n3 Ruffieux, P.; Wang, S.; Yang, B.; Sánchez-Sánchez, C.; Liu, J.; Dienel, T.; Talirz, L.; Shinde, P.; Pignedoli, C. A.; Passerone, D.; Dumslaff, T.; Feng, X.; Müllen, K.; Fasel, R. On-Surface Synthesis of Graphene Nanoribbons with Zigzag Edge Topology. Nature 2016, 531, 489-492.\n\n4 Moreno, C.; Vilas-Varela, M.; Kretz, B.; Garcia-Lekue, A.; Costache, M. V.; Paradinas, M.; Panighel, M.; Ceballos, G.; Valenzuela, S. O.; Peña, D. P.; Mugarza, A. Bottom-Up Synthesis of Multifunctional Nanoporous Graphene. Science 2018, 360, 199-203.\n\n5 Lafferentz, L.; Ample, F.; Yu, H.; Hecht, S.; Joachim, C.; Grill, L. Conductance of a Single Conjugated Polymer as a Continuous Function of Its Length. Science 2009, 323, 1193-1197.\n\n6 Koch, M.; Ample, F.; Joachim, C.; Grill, L. Voltage-Dependent Conductance of a Single Graphene Nanoribbon. Nat. Nanotechnol. 2012, 7, 713-717.\n\n7 Kawai, S.; Koch, M.; Gnecco, E.; Sadeghi, A.; Pawlak, R.; Glatzel, T.; Schwarz, J.; Goedecker, S.; Hecht, S.; Baratoff, A.; Grill, L.; Meyer, E. Quantifying the Atomic-Level Mechanics of Single Long Physisorbed Molecular Chains. Proc. Natl. Acad. Sci. U. S. A. 2014, 111, 3968-3972.\n\n8 Kawai, S.; Benassi, A.; Gnecco, E.; Söde, H.; Pawlak, R.; Feng, X.; Müllen, K.; Passerone, D.; Pignedoli, C. A.; Ruffieux, P.; Fasel, R.; Meyer, E. Superlubricity of Graphene Nanoribbons on Gold Surfaces. Science 2016, 351, 957-961.\n\n9 Reecht, G.; Scheurer, F.; Speisser, V.; Dappe, Y. J.; Mathevet, F.; Schull, G. Electroluminescence of a Polythiophene Molecular Wire Suspended between a Metallic Surface and the Tip of a Scanning Tunneling Microscope. Phys. Rev. Lett. 2014, 112, 047403.\n\n10 Held, P. A.; Fuchs, H.; Studer, A. Covalent-Bond Formation via On-Surface Chemistry. Chem. Eur. J 2017, 23, 5874-5892.\n\n11 Lipton-Duffin, J. A.; Ivasenko, O.; Perepichka, D. F.; Rosei, F. Synthesis of Polyphenylene Molecular Wires by Surface-Confined Polymerization. Small 2009, 5, 592-597.\n\n12 Lahrood, A. R.; Björk, J.; Heckl, W. M.; Lackinger, M. 1,3-Diiodobenzene on Cu(111) an Exceptional Case of On-Surface Ullmann Coupling. Chem. Commun. 2015, 68, 13301-13304.\n\n13 Siemsen, P.; Livingston, R. C.; Diederich, F. Acetylenic Coupling: A Powerful Tool in Molecular Construction. Angew. Chem. Int. Ed. 2000, 39, 2632-2657.\n\n14 Gao, H.-Y.; Wagner, H.; Zhong, D.; Franke, J.-H.; Studer, A.; Fuchs, H. Glaser Coupling at Metal Surfaces. Angew. Chem. Int. Ed. 2013, 52, 4024-4028.\n\n15 Gao, H.-Y.; Held, P. A.; Amirjalayer, S.; Liu, L.; Timmer, A.; Schirmer, B.; Arado, O. D.; Mönig, H.; Mück-Lichtenfeld, C.; Neugebauer, J.; Studer, A.; Fuchs, H. Intermolecular OnSurface s-Bond Metathesis. J. Am. Chem. Soc. 2017, 139, 7012-7019.\n\n16 Gross, L.; Mohn, F.; Moll, N.; Liljeroth, P.; Meyer, G. The Chemical Structure of a Molecule Resolved by Atomic Force Microscopy. Science 2009, 325, 1110-1114.\n\n17 Gross, L.; Mohn, F.; Moll, N.; Meyer, G.; Ebel, R.; Abdel-Mageed, W. M.; Jaspars, M. Organic Structure Determination Using Atomic-Resolution Scanning Probe Microscopy. Nat. Chem. 2010, 2, 821-825.\n\n18 Pavlicek, N.; Fleury, B.; Neu, M.; Niedenführ, J.; Herranz-Lancho, C.; Ruben, M.; Repp, J. Atomic Force Microscopy Reveals Bistable Configurations of Dibenzo $[a, h]$ thianthrene and Their Interconversion Pathway. Phys. Rev. Lett. 2012, 108, 086101.\n\n19 Schuler, B.; Meyer, G.; Peña, D. P.; Mullins, O. C.; Gross, L. Unraveling the Molecular Structures of Asphaltenes by Atomic Force Microscopy. J. Am. Chem. Soc. 2015, 137, 9870-98876.\n\n20 Zhang, J.; Chen, P.; Yuan, B.; Ji, W.; Cheng, Z.; Qiu, X. Real-Space Identification of Intermolecular Bonding with Atomic Force Microscopy. Science 2013, 342, 611-614.\n\n21 Kawai, S.; Sadeghi, A.; Feng, X.; Lifen, P.; Pawlak, R.; Glatzel, T.; Willand, A.; Orita, A.; Otera, J.; Goedecker, S.; Meyer, E. Obtaining Detailed Structural Information about Supramolecular Systems on Surfaces by Combining High-Resolution Force Microscopy with ab Initio Calculations. ACS Nano 2013, 7, 9098-9105. 22 Hmlinen, S. K.; van der Heijden, N.; van der Lit, J.; den Hartog, S.; Liljeroth, P.; Swart, I. Intermolecular Contrast in Atomic Force Microscopy Images without Intermolecular Bonds. Phys. Rev. Lett. 2014, 113, 186102.\n\n23 Sweetman, A. M.; Jarvis, S. P.; Sang, H.; Lekkas, I.; Rahe, P.; Wang, Y.; Wang, J.; Champness, N.; Kantorovich, L.; Moriarty, P. Mapping the Force Field of a Hydrogen-Bonded Assembly. Nat. Commun. 2014, 5, 3931.\n\n24 de Oteyza, D. G.; Gorman, P.; Chen, Y.-C.; Wickenburg, S.; Riss, A.; Mowbray, D. J.; Etkin, G.; Pedramrazi, Z.; Tsai, H.-Z.; Rubio, A.; Crommie, M. F.; Fischer, F. R. Direct Imaging of Covalent Bond Structure in Single-Molecule Chemical Reactions. Science 2013, 340, 1434-1437.\n\n25 Kawai, S.; Haapasilta, V.; Lindner, B. D.; Tahara, K.; Spijker, P.; Buitendijk, J. A.; Pawlak, R.; Meier, T.; Tobe, Y.; Foster, A. S.; Meyer, E. Thermal Control of Sequential On-Surface Transformation of a Hydrocarbon Molecule on a Copper Surface. Nat. Commun. 2016, 7, 12711. 26 Stetsovych, O.; Švec, M.; Vacek, J.; Chocholoušová, J. V.; Jančařík, A.; Rybácek, J.; Kosmider, K.; Stará, I. G.; Jelínek, P.; Starý, I. From Helical to Planar Chirality by On-Surface Chemistry. Nat. Chem. 2017, 9, 213-218.\n\n27 Kocić, N.: S. Decurtins, S.: Liu, S.-X.: Repp, J. Forces from Periodic Charging of Adsorbed Molecules J. Phys. Chem. 2017, 146, 092327.\n\n28 Pavlicek, N.; Schuler, B.; Collazos, S.; Moll, N.; Pérez, D.; Guitián, E.; Meyer, G.; Peña, D. P.; Gross, L. On-Surface Generation and Imaging of Arynes by Atomic Force Microscopy. Nat. Chem. 2015, 7, 623-628.\n\n29 Schuler, B.; Fatayer, S.; Mohn, F.; Moll, N.; Pavlicek, N.; Meyer, G.; Peña, D. P.; Gross, L. Reversible Bergman Cyclization by Atomic Manipulation. Nat. Chem. 2016, 8, 220-224.\n\n30 Pavlicek, N.; Mistry, A.; Majzik, Z.; Moll, N.; Meyer, G.; Fox, D. J.; Gross, L. Synthesis and Characterization of Triangulene. Nat. Nanotechnol. 2017, 12, 308-311.\n\n31 Kawai, S.; Nishiuchi, T.; Kodama, T.; Spijker, P.; Pawlak, R.; Meier, T.; Tracey, J.; Kubo, T.; Meyer, E.; Foster, A. S. Direct Quantitative Measurement of the $\\mathrm{C}=\\mathrm{O} \\cdots \\mathrm{H}-\\mathrm{C}$ Bond by Atomic Force Microscopy. Sci. Adv. 2017, 3, e1603258.\n\n32 Hanssen, K.; Schuler, B.; Williams, A. J.; Demissie, T. B.; Hansen, E.; Andersen, J. H.; Svenson, J.; Blinov, K.; Repisky, M.; Mohn, F.; Meyer, G.; Svendsen, J.-S.; Ruud, K.; Elyashberg, M.; Gross, L.; Jaspars, M.; Isaksson, J. A Combined Atomic Force Microscopy and Computational Approach for the Structural Elucidation of Breitfussin A and B: Highly Modified Halogenated Dipeptides from Thuiaria breitfussi. Angew. Chem. Int. Ed. 2012, 51, 12238-12241.\n\n33 Moll, N.; Schuler, B.; Kawai, S.; Xu, F.; Peng, L.; Orita, A.; Otera, J.; Curioni, A.; Neu, M.; Repp, J.; Meyer, G.; Gross, L. Image Distortions of a Partially Fluorinated Hydrocarbon Molecule in Atomic Force Microscopy with Carbon Monoxide Terminated Tips. Nano Lett. $\\mathbf{2 0 1 4}, 14,6127-6131$.\n\n34 Kawai, S.; Takahashi, K.; Ito, S.; Pawlak, R.; Meier, T.; Spijker, P.; Canova, F. F.; Tracey, J.; Nozaki, K.; Foster, A. S.; Meyer, E. Competing Annulene and Radialene Structures in a Single Anti-Aromatic Molecule Studied by High-Resolution Atomic Force Microscopy. ACS Nano $\\mathbf{2 0 1 7}, 11,81228130$.\n\n35 Schuler, B.; Liu, W.; Tkatchenko, A.; Moll, N.; Meyer, G.; Mistry, A.; Fox, D.; Gross, L. Adsorption Geometry Determination of Single Molecules by Atomic Force Microscopy. Phys. Rev. Lett. 2013, 111, 106103.\n\n36 Sader, J. E.; Jarvis, S. P. Accurate Formulas for Interaction Force and Energy in Frequency Modulation Force Spectroscopy. Appl. Phys. Lett. 2004, 84, 1801-1803.\n\n37 Sader, J.E.; Hughes, B. D.; Huber, F.; Giessibl, F. J. Interatomic Force Laws that Corrupt Their Own Measurement. 2017, arXiv preprint arXiv:1709.07571.\n\n38 Giessibl, F. J. High-Speed Force Sensor for Force Microscopy and Profilometry Utilizing a Quartz Tuning Fork. Appl. Phys. Lett. 1998, 73, 3956-3958.\n\n39 Giessibl, F. J. Advances in Atomic Force Microscopy. Rev. Mod. Phys. 2003, 75, 949-983.\n\n40 Albrecht, T. R.; Grütter, P.; Horne, D.; Rugar, D. Frequency Modulation Detection Using HighQ Cantilevers for Enhanced Force Microscope Sensitivity. J. Appl. Phys. 1991, 69, 668-673.\n\n41 Bartels, L.; Meyer, G.; K.-H.Rieder Controlled Vertical Manipulation of Single CO Molecules with the Scanning Tunneling Microscope: A Route to Chemical Contrast. Appl. Phys. Lett. 1997, 71, 213-215.\n\n42 Horcas, I.; Fernandez, R.; Gomez-Rodriguez, J.; Colchero, J.; Gomez-Herrero, J.; Baro, A. WSXM: A Software for Scanning Probe Microscopy and a Tool for Nanotechnology. Rev. Sci. Instrum. 2007, 78, 013705.\n\n43 Kresse, G.; Furthmüller, J. Efficiency of ab-Initio Total Energy Calculations for Metals and Semiconductors Using a Plane-Wave Basis Set. Comp. Mat. Sci. 1996, 6, 15-50.\n\n44 Kresse, G.; Furthmüller, J. Efficient Iterative Schemes for ab Initio Total-Energy Calculations Using a Plane-Wave Basis Set. Phys. Rev. B 1996, 54, 11169-11186. 45 Klimeš, J.; Bowler, D. R.; Michaelides, A. Chemical Accuracy for the van der Waals Density Functional. J. Phys.: Condens. Matter. 2010, 22, 022201.\n\n46 Klimeš, J.; Bowler, D. R.; Michaelides, A. Van der Waals Density Functionals Applied to Solids. Phys. Rev. B 2011, 83, 195131.\n\n47 Björkman, T.; Gulans, A.; Krasheninnikov, A. V.; Nieminen, R. M. Van der Waals Bonding in Layered Compounds from Advanced Density-Functional First-Principles Calculations. Phys. Rev. Lett. 2012, 108, 235502.\n\n48 Kawai, S.; Nakatsuka, S.; Hatakeyama, T.; Pawlak, R.; Meier, T.; Tracey, J.; Meyer, E.; Foster, A. S. Multiple Heteroatom Substitution to Graphene Nanoribbon. Sci. Adv. 2018, 4, eaar7181.\n\n49 Grimme, S.; Antony, J.; Ehrlich, S.; Krieg, H. A Consistent and Accurate ab Initio Parametrization of Density Functional Dispersion Correction (DFT-D) for the 94 Elements H-Pu. J. Chem. Phys. 2010, 132, 154104.\n\n50 Tkatchenko, A.; Scheffler, M. Accurate Molecular van der Waals Interactions from Ground-State Electron Density and Free-Atom Reference Data. Phys. Rev. Lett. 2009, 102, 073005.\n\n51 Blöchl, P. E. Projector Augmented-Wave Method. Phys. Rev. B 1994, 50, 17953-17979.\n\n52 Tang, W.; Sanville, E.; Henkelman, G. A Grid-Based Bader Analysis Algorithm without Lattice Bias. J. Phys. Condens. Matt. 2009, 21, 084204.\n\n53 Hapala, P. ProbeParticleModel \\href{https://github.com/ProkopHapala/ProbeParticleModel}{https://github.com/ProkopHapala/ProbeParticleModel} (accessed Jun 30, 2018).\n\n54 Hapala, P.; Kichin, G.; Wagner, C.; Tautz, F. S.; Temirov, R.; Jelínek, P. Mechanism of HighResolution STM/AFM Imaging with Functionalized Tips. Phys. Rev. B 2014, 90, 085421.\n\n55 Hapala, P.; Temirov, R.; Tautz, F. S.; Jelínek, P. Origin of High-Resolution IETS-STM Images of Organic Molecules with Functionalized Tips. Phys. Rev. Lett. 2014, 113, 226101.\n\n56 Jorgensen, W. L.; Tirado-Rives, J. The OPLS [Optimized Potentials for Liquid Simulations] Potential Functions for Proteins, Energy Minimizations for Crystals of Cyclic Peptides and Crambin. J. Am. Chem. Soc. 1988, 110, 1657-1666.\n\n57 C. I. Bayly, P. Cieplak, W. Cornell, and P. A. Kollman, A Well-Behaved Electrostatic Potential Based Method Using Charge Restraints for Deriving Atomic Charges: the RESP Model. J. Phys. Chem. 1993 97, 10269-10280.\n\n58 Di Giovannantonio, M.; Urgel, J. I.; Beser, U.; Yakutovich, A. V.; Wilhelm, J.; Pignedoli, C. A.; Ruffieux, P.; Narita, A.; Müllen, K.; Fasel, R. On-Surface Synthesis of Indenofluorene Polymers by Oxidative Five-Membered Ring Formation. J. Am. Chem. Soc. 2018, 140, 3532-3536.\n\n59 Vanpoucke, D. E. P.; Brocks, G. Formation of Pt-induced Ge Atomic Nanowires on Pt/Ge(001): A Density Functional Theory Study. Phys. Rev. B 2008, 77, 241308(R).\n\n60 Tersoff, J.; Hamann, D. R. Theory of the Scanning Tunneling Microscope. Phys. Rev. B 1985, $31,805-813$.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_910aca2a500d3bf9bf47g-21_236_1990_562_1540}\n\nFigure 5. Two-dimensional force mapping. (a) AFM image and schematic drawing of the anthracene unit. (b) Two dimensional frequency shift map. Non-site dependent contribution was subtracted. (c) Extracted force map via the measured frequency shift. (d) Calculated force map.\n\n\n\\end{document}", "record_id": "2023_09_22_910aca2a500d3bf9bf47g"}