{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{First-Principles Investigation on the Electronic and Mechanical Properties of Cs-Doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ }\n\n\n\\author{Dongyan Liu, Shanshan Li, Fang Bian and Xiangying Meng *\\\\\nCollege of Sciences, Northeastern University, Shenyang 110819, China; dongyanliuNEU@163.com (D.L.);\\\\\nshanshanLiNEU@163.com (S.L.); fangbianNEU@163.com (F.B.)\\\\\n* Correspondence: $x_{-} y$ meng@mail.neu.edu.cn}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nArticle\n\nReceived: 2 June 2018; Accepted: 25 June 2018; Published: 5 July 2018\n\ncheck for updates\n\n\\begin{abstract}\nMethylammonium lead iodide, $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$, is currently a front-runner as light absorber in hybrid solar cells. Despite the high conversion efficiency, the stability of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ is still a major obstacle for commercialization application. In this work, the geometry, electronic structure, thermodynamic, and mechanical property of pure and Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ have been systematically studied by first-principles calculations within the framework of the density functional theory (DFT). Our studies suggest that the $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$organic group takes a random orientation in perovskite lattice due to the minor difference of orientation energy. However, the local ordered arrangement of $\\mathrm{CH}_{3} \\mathrm{NH}_{3}{ }^{+}$is energetic favorable, which causes the formation of electronic dipole domain. The band edge states of pure and Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ are determined by $\\left(\\mathrm{PbI}_{6}\\right)^{-}$ group, while A-site $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$or $\\mathrm{Cs}^{+}$influences the structural stability and electronic level through Jahn-Teller effect. It has been demonstrated that a suitable concentration of Cs can enhance both thermodynamic and mechanical stability of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ without deteriorating the conversion efficiency. Accordingly, this work clarifies the nature of electronic and mechanical properties of Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$, and is conducive to the future design of high efficiency and stable hybrid perovskite photovoltaic materials.\n\\end{abstract}\n\nKeywords: perovskite solar cell; DFT calculations; mechanical property; $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$\n\n\\section{Introduction}\nAs one of the biggest scientific breakthroughs [1], perovskite solar cell technology has been extensively investigated over the last few years. The conversion efficiency of organic-inorganic lead halide perovskite solar cells has been impressively improved from 3.8\\% in 2009 to $22.7 \\%$ recently [2-5]. In particular, methylammonium lead halide perovskites $\\left(\\mathrm{ABX}\\right.$; $\\left.\\mathrm{A}=\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+} ; \\mathrm{B}=\\mathrm{Pb}^{+} ; \\mathrm{X}=\\mathrm{Cl}, \\mathrm{Br}, \\mathrm{I}\\right)$ are regarded as particularly promising light absorbers because of their outstanding photovoltaic properties. With its continuous increase in conversion efficiency, the stability of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ based solar cells has attracted tremendous attentions for the scale-up of industrial applications [6-8]. Enhancing the operational stability of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ without weakening the conversion efficiency is still a major challenge for perovskite-type solar cells [9-11].\n\nPeople attempted to control the composition and proportion of dopants by an alloying method to improve the performance of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$-based perovskites. For halogen doping, it has been found that mixing $\\mathrm{Cl} / \\mathrm{Br}$ in $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ can not only realize the continuous tuning of solar absorption, but also improve the carrier mobility and reduce carrier recombination rates [12,13]. However, due to the thermodynamic instability of the solutions, halogen impurities may cause the segregation of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ into iodide-rich minority and bromide-enriched majority domains under light exposure [14]. Besides the substitution of halogens, B-site doping has also been examined. J. Navas et al. performed experimental and theoretical studies on alloying in $\\mathrm{Pb}^{2+}$ sites with $\\mathrm{Sn}^{2+}, \\mathrm{Sr}^{2+}, \\mathrm{Cd}^{2+}$, and $\\mathrm{Ca}^{2+}$. They pointed out that the $\\mathrm{Sn}^{2+}, \\mathrm{Sr}^{2+}$, and $\\mathrm{Cd}^{2+}$ did not modify the phase structure [15]. Y. Ogom et al. proved that the $\\mathrm{Sn} / \\mathrm{Pb}$ halide-based perovskite solar cells can harvest the light in the area up to $1060 \\mathrm{~nm}$. Nevertheless, the instability caused by the B-site impurities would lead to the reduction of open circuit voltage for $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ solar cell materials [16].\n\nRecently, the substitution for A-site organic group in $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ has drawn lots of attentions [17-20]. It has been reported that $\\left[\\mathrm{CH}\\left(\\mathrm{NH}_{2}\\right)_{2}\\right]_{x}\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)_{1-x} \\mathrm{PbI}_{3}$ has favorable performances in terms of structural stability, and the band gap of the A-site solutions can be tuned between $1.48 \\mathrm{eV}$ and $1.57 \\mathrm{eV}$ [21-23]. Yi et al. demonstrated that a mixed A-site cation $\\mathrm{Cs}_{x}\\left[\\mathrm{CH}\\left(\\mathrm{NH}_{2}\\right)_{2}\\right]_{1-x} \\mathrm{PbI}_{3}$ exemplifies the potential of high efficiency solar cell material [24]. $\\left[\\mathrm{CH}\\left(\\mathrm{NH}_{2}\\right)_{2}\\right]_{0.85} \\mathrm{Cs}_{0.15} \\mathrm{PbI}_{3}$ solution has shown a better performance and device stability than the plain $\\mathrm{CH}\\left(\\mathrm{NH}_{2}\\right)_{2} \\mathrm{PbI}_{3}$. Compared with the organic $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$cation, the inorganic $\\mathrm{Cs}^{+}$is far less volatile [25,26]. At present, it seems that A-site doping is an effective scheme to improve stability without degrading the light conversion efficiency of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$.\n\nIn this work, we first carefully studied the of orientation influence of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group on the total energy and band gap in $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$. After the determination of ground state geometry of pure and Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$, a comprehensive investigation on the electronic and mechanical properties was performed by first principles calculations. The present study is conducive to the design of perovskite solar cell material with high stability and efficiency.\n\n\\section{Calculation Method and Model}\nThe general chemical formula for perovskites is $\\mathrm{ABX}_{3}$. In the cubic unit cell of a perovskite, the A-atom sits at cube corner positions $(0,0,0)$ in 12 -fold coordination, while the B-atom sits at body center position $(1 / 2,1 / 2,1 / 2)$ and is surrounded by six X-atoms to form an octahedron group. A-site traditionally is occupied by the inorganic cations, while in the present hybrid perovskite A-site is inhabited by the organic $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group. The geometry optimization and the electronic structure calculations of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group are investigated by Gaussian 98 code [27], and B3LYP [28,29] method in connection with the 6-311++G basis set $[30,31]$ is chosen as the exchange correlation potential.\n\nAll the bulk geometry optimization, electronic structure, and mechanical property of pure and Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ are calculated with ab initio total energy and molecular dynamics program VASP (VASP 5.4.1, Faculty of Physics, University of Vienna, Austria) [32]. Perdew-Burke-Ernzerhof (PBE) pseudopotential with vdw and spin-orbit coupling (SOC) correction is adopted during the calculation [33]. The plane wave kinetic energy cutoff is set to $550 \\mathrm{eV}$ and Brillouin-zone integration is performed with a $12 \\times 12 \\times 12$ Monkhorst-Pack $k$-point mesh. The convergence tolerance for the total energy and Hellmann-Feynman force during the structural relaxation is set to $10^{-6} \\mathrm{eV}$ and $0.01 \\mathrm{eV} / \\AA$ Å respectively.\n\n\\section{Results and Discussion}\n\\subsection{Intrinsic Properties of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ : Structure and Band}\nDifferent locations of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group in the perovskite lattice would introduce variations in energy and electronic structure due to the intrinsic degree of freedom of the group. Therefore, it is appropriate to start with the study of the nature of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$. The schematic representation of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group is shown in Figure 1a. N and $\\mathrm{C}$ atoms are all tetrahedral coordinated, and the length of C-N bond in $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group is $1.52 \\AA$, the Van Der Waals volume is $81.67 \\AA^{3}$, the density is $0.65 \\mathrm{~g} / \\mathrm{cm}^{3}$, and the effective radius of the group is $2.69 \\AA$. The electronic property calculations show that $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$holds a $2.54$ Debye intrinsic dipole moment with the direction from $\\mathrm{N}$ atom pointing to $\\mathrm{C}$ atom. As can be seen in the following, the direction of spontaneous polarization of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$ will influence the stability and bandgap of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_e06d11a6e698afe5f2d7g-03_300_670_614_1376}\n\n(a) Representation of $\\left(\\mathrm{CH}_{3} \\mathbf{N H}_{3}\\right)^{+}$group (b) Structure of $\\mathrm{CH}_{3} \\mathbf{N H}_{3} \\mathrm{PbI}_{3}$ ground state\n\nFigure 1. Structure model of (a) $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group (the arrow represents the direction of electric dipole moment in the group), and (b) $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ ground state (the $\\mathrm{PbI}_{6}$ octahedral is rendered).\n\nAfter the full relaxation of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group, we construct $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right) \\mathrm{PbI}_{3}$ unit cell based on the cubic $\\mathrm{APbI}_{3}$ inorganic perovskite frame, in which A-site atom is replaced by the $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group. Different from inorganic cation, the organic $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group performs a nonspherical shape and can be displayed along different directions in the perovskite lattice [34,35]. In order to determine the energetic favorable configuration, the energy-orientation relationship is studied by fixing the midpoint but rotating the direction of the C-N bond at the center of the cubic cell. Based on the symmetry analysis, there are two independent rotating modes, namely rotating along [110] and [100] directions, for $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group and the rotation period of each mode is $\\pi / 2$. The rotating angle is set to zero as the C-N bond lies in the $(a b)$ plane.\n\nAs shown in Figure 2a, the lowest energies configuration (at $0 \\mathrm{~K}$ ) appears at the position of $\\pm 20^{\\circ}$ when rotating along [100] direction. However, the maximum rotation barrier caused by the orientation is about $40 \\mathrm{meV}$, which is close to the thermal energy perturbation at room temperature $(26 \\mathrm{meV})$. As a result, $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group will hold a random orientation in the perovskite lattice at RT. Thus, the calculation results explain the disorder arrangement of the $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group observed in experiments [36,37].\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e06d11a6e698afe5f2d7g-03_1645_2313_564_1503}\n\\end{center}\n\nFigure 2. The fluctuation of total energy and bandgap with the orientation of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group in the perovskite lattice.\n\nAlthough the tiny difference in total energy supports the random orientation, we found that the local order location of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group is energetic favorable in configuration. Since G.R. Berdiyorov et al. reported that 48 atoms contained supercell is large enough to negligible the finite size effects [38]. We built supercells containing four unit cells and the orientation of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$ group in the adjacent cells is arranged as $+-+-,++--$, and $++++$. It is found that the all-aligned $++++$ mode is the most stable configuration and $\\sim 110$ meV lower in total energy than the cross $+-+-$ mode. The local ordered location of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$is conducive to the establishment of electric dipole domain in the perovskite lattice, which facilitates the separation of photo-generated carriers and leads to the promotion of photoelectric conversion efficiency. This interesting phenomenon has also been investigated by molecular dynamics simulation and experiment $[39,40]$, and the size of the domains is found to be about $100 \\mathrm{~nm}[39,40]$.\n\nFurthermore, the variation of bandgap with the group orientation is evaluated (As seen in Figure $2 b$ ). According to the results, the fluctuation of bandgap caused by the asymmetry of electronic distribution and the electric dipole moment in $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group is $0.1 \\mathrm{eV}$. It is interesting that the lowest total energy and the minimum bandgap appear at the same point, namely at the position of $\\pm 20^{\\circ}$ when rotating along [100] direction. Since that the bandgap shrinks with the intensity of electronic hybridization, it is reasonable to deduce that the system has the lowest energy when the electronic bonding is the strongest.\n\nThe point with the lowest energy on the energy-orientation curve corresponds to the ground state of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ (Figure 1b). After geometry relaxations, the band structure of ground state in $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$, drawn between high symmetry points of the Brillouin zone, has been illustrated in Figure 3. $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ is found to have a direct bandgap of $1.68 \\mathrm{eV}$ at $\\Gamma$. This result is well consistent with the reported experimental values [41-43]. The partial electronic densities of state (PDOS) indicates that the upper valence bands $(\\mathrm{VB})$ mainly consist of I-5 $p$ orbital with weak hybridization to $\\mathrm{Pb}-5 s$ state, and the lower conduction bands (CB) are dominated by Pb- $6 p$ orbital. While the $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+} \\mathrm{group}^{2}$ has little contribution to the band edge states. The character of band structure in this work is consistent with recent investigations [44-46]. As a result, the band gap of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ will be strongly related to the structure of $\\left(\\mathrm{PbI}_{6}\\right)$ inorganic framework. We can thus infer that the influence of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+} \\mathrm{group}^{\\circ}$ on the electronic structure belongs to Jahn-Teller effect, that is, the change of electronic structure of the system originates from the distortion of $\\left(\\mathrm{PbI}_{6}\\right)$ octahedral caused by the size and orientation of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group, rather than from the direct participation in the electronic structure of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$. According to our \"anion group model\" [47], this feature of the electronic structure helps to improve the stability through the element substitution without losing light response and conversion capability.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_e06d11a6e698afe5f2d7g-04_1699_2567_428_1620}\n\nFigure 3. Band level and $\\mathrm{PDOS}$ of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$.\n\n\\subsection{Cs-Doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ : Stability and Electronic Properties}\nThe structure stability of $\\mathrm{ABX}_{3}$ perovskites can be estimated by Goldschmidt rule [48], and the tolerance factor $t$ of $\\mathrm{ABX}_{3}$ is determined by the expression\n\n\\[\nt=\\frac{R_{A}+R_{X}}{\\sqrt{2}\\left(R_{B}+R_{X}\\right)}\n\\]\n\nwhere $R_{A}, R_{B}, R_{X}$ are the respective effective ionic radii of $A, B$, and $X$ ions. In general, the perovskite structure is considered to be highly stable when the $t$-factor is between the range of 0.90 1.00 [49]. Although the above rule has been developed for the oxide perovskites, but the criterion is still valid for the structural stability analysis of inorganic-organic hybrid halide perovskite materials [50,51].\n\nTo determine the range of doping concentration of Cs, the Goldschmidt's tolerance factors of $\\mathrm{Cs}_{x}\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)_{1-x} \\mathrm{PbI}_{3}(x$ from 0 to 1 at an interval of 0.125) are calculated. In our cases, the effective radii of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}, \\mathrm{Pb}^{2+}, \\mathrm{Cs}^{+}$, and $\\mathrm{I}^{-}$in the perovskite-type lattice is $2.69 \\AA, 1.19 \\AA, 1.88 \\AA$, and $2.20 \\AA$, respectively. As a result, the $t$-factor is $1.02$ for $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ and $0.85$ for $\\mathrm{CsPbI}$. According the criterion of Goldschmidt, the stability of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ and $\\mathrm{CsPbI}_{3}$ is unsatisfactory. For the Cs doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$, we define the average effective ionic radius of A-site cations as $R_{A \\text {-eff }}=x \\times R_{C s}+(1-$ $x) R_{C N H}$. When the concentration $x$ increases from 0 to 1 at an interval of $0.125$, the corresponding $t$-factor at each $x$ is $1.0,0.99,0.96,0.92,0.91,0.89$, and $0.87$ for the Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$. Thus, from the view of Goldschmidt rule, the Cs-concentration of $12.5$ at. $\\%$ to $62.5$ at. $\\%$ is more desirable. In experiments, it has been found that Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ can be successfully synthesized with a high solid solubility [52].\n\nTo evaluate the function of Cs-dopant on the structural stability, the $12.5$ at.\\% Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ has been modeled by a $2 \\times 2 \\times 2 \\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ supercell with one $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group replaced by a Cs atom. In this model we do not consider the disordered orientation of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$ group. The formation energy of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ and $\\mathrm{Cs}_{0.125}\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)_{0.875} \\mathrm{PbI}_{3}$ are calculated according to the formula\n\n\\[\nE_{\\text {formation }}=\\left(E_{\\text {total }}-\\sum_{j} n_{j} E_{\\text {ion }}^{j}\\right) / N_{\\text {total }}\n\\]\n\nwhere $E_{\\text {total }}$ is the total energy of Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}, E_{i o n}^{j}$ is the energy of constituent elements in their respective elemental state, $n_{j}$ is the number of various constituent elements, and $N_{\\text {total }}$ is the total number of atoms in the supercell. The results show that the formation energy of $\\mathrm{Cs}_{0.125}\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)_{0.875} \\mathrm{PbI}_{3}$ is $0.02 \\mathrm{eV} /$ atom lower than that of the pure $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$, indicating that incorporating Cs into $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ lattice is exothermic and helps to stabilize $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$. More interestingly, it is found that the original regular $\\left(\\mathrm{PbI}_{6}\\right)$ octahedral chain has been distorted in the Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$, as shown in Figure 4. Thus the symmetry breaking of perfect octahedral chain would also lead to the energy reduction.\n\nAs the incorporation of Cs will induce a $2.75$ Debye net electric dipole moment, we introduce an electric dipole correction term in the electronic structure calculation of $\\mathrm{Cs}_{0.125}\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)_{0.875} \\mathrm{PbI}_{3}$. In Figure 5, energy band diagram clearly shows that the bandgap of $12.5$ at. $\\%$ Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ is $1.73 \\mathrm{eV}$, being $\\sim 3 \\%$ wider than that of the pure $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$. It can be seen that the Cs dopant does not introduce new states at the band edges. This result is consistent with the \"anoin group model\" in that A-site alkali metal or alkaline earth metal cation in perovskites can hardly influence the electronic state near the Fermi level [47], and this is why the alkali metal doping does not cause the deterioration of photovoltaic performance of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$. As a result, A-site participation of alkali metal or alkaline earth metal is a promising way to stabilize the hybrid perovskite photovoltaic materials with reliable photovoltaic properties.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e06d11a6e698afe5f2d7g-06_300_705_658_964}\n\\end{center}\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e06d11a6e698afe5f2d7g-06_299_707_1091_1399}\n\\end{center}\n\n(b)\n\nFigure 4. Regular ( $\\left.\\mathrm{PbI}_{6}\\right)$ octahedral chain in $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}(\\mathbf{a})$ and distorted chain in $12.5$ at.\\% Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}(\\mathbf{b})$.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_e06d11a6e698afe5f2d7g-06_968_1778_456_1596}\n\nFigure 5. Band level and PDOS of $\\mathrm{Cs}_{0.125}\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)_{0.875} \\mathrm{PbI}_{3}$.\n\n\\subsection{Cs-Doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ : Mechanical Properties}\nIt is believed that the mechanical stability of a material is strongly related to its equilibrium elastic modulus and strength performance [53]. The bulk modulus is a measure of resistance to the volume change due to applied pressure, while the shear strength provides information about the resistance of a material against plastic deformation. Thus, the stability of Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ should be basically understood by these parameters. To obtain elastic moduli, elastic constants were first calculated from the stress-strain relation, then the Voigt-Reuss-Hill (VRH) approximation was applied to the $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ system, and the effective elastic moduli could be approximated by the arithmetic mean of the Voigt and Reuss limits [54].\n\nIn Figure 6, our calculations show that the bulk modulus $(B)$ of pure $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ is $11.0 \\mathrm{GPa}$, and The shear modulus $(G)$ is $4.9 \\mathrm{GPa}$, which is comparable to the reported experimental value [55,56]. When the Cs-concentration is below $37.5$ at. $\\%$, both bulk modulus and shear modulus keep going up and the top value of them is higher than that of pure $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ by $3.5 \\mathrm{GPa}$ and $0.6 \\mathrm{GPa}$, respectively. When the Cs-concentration increases further, the corresponding elastic modulus decreases with fluctuation. Our calculations suggest that the Cs-concentration should be controlled in the range of 20 35 at.\\% if we want to achieve the optimal equilibrium mechanical performance. Due to the limitation of solid solubility, the actual Cs-concentration may be lower than this range. However, the elastic moduli still are higher than that of the pure substance, as shown in Figure 6.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e06d11a6e698afe5f2d7g-07_440_1131_547_1509}\n\\end{center}\n\nFigure 6. The variation of bulk modulus and shear modulus with Cs-concentration in $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$.\n\nAccording to the work of Pugh, the material is deemed to be ductile if its B/G ratio is greater than the critical value of $1.75$ [57]. The B/G ratio of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ is 2.24, while Cs-doped $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right) \\mathrm{PbI}_{3}$ have higher B/G values indicating that those solutions have a better performance in ductility.\n\nThe high value of elastic moduli near the equilibrium does not guarantee the high strength. The fracture feature of $\\mathrm{Cs}$-doped $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right) \\mathrm{PbI}_{3}$ should be basically understood from the ideal shear strength obtained far from the equilibrium. The ideal shear stress-strain curves of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right) \\mathrm{PbI}_{3}$ solutions in the $(111)<11-2>$ typical slip system are shown in Figure 7.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e06d11a6e698afe5f2d7g-07_1623_2351_594_1445}\n\\end{center}\n\nFigure 7. DFT calculated ideal shear stress-strain curves for the $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right) \\mathrm{PbI}_{3}$ solutions.\n\nThe strain of deformation-to-failure $\\varepsilon$ indicates the maximum deformation that the material can bear and thus is the measure of the brittleness. It is found that $\\mathrm{CsPbI}_{3}$ has the highest shear strength (0.78 GPa) but the worst strain capacity, showing a feature of high strength and high brittleness. On the country, $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right) \\mathrm{PbI}_{3}$ possess the lowest shear strength $(0.52 \\mathrm{GPa})$ but the best strain capacity, displaying a feature of low strength and low brittleness. Below 37.5\\% Cs-concentration, the fracture performance of solutions lies between the boundaries determined by the pure substances $\\mathrm{CsPbI}_{3}$ and $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right) \\mathrm{PbI}_{3}$, that is, the ideal shear strength increases but the maximum bearing deformation decreases. It should be noted that the current strength calculations are strictly related to the defect free lattice, and the obtained ideal might overestimate real shear strengths. Along with the analysis on the equilibrium elastic moduli, we can conclude that below $37.5 \\%$ Cs-concentration $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right) \\mathrm{PbI}_{3}$ will possess a desirable performance in mechanical properties including stability, hardness, strength, and ductility.\n\n\\section{Conclusions}\nAiming at developing new efficient and stable perovskite solar cell materials, we report a comprehensive theoretical investigation on the geometry, electronic structure, and mechanical property of pure and A-site Cs-doped $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$. The main conclusions are drawn as follows:\n\n(1) The difference in orientation energy of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$is comparable to the thermal power at room temperature, which causes a random orientation of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$group in the perovskite lattice.\n\n(2) The local ordered arrangement of $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$is energetic favorable that facilitates the formation of the electronic dipole domain, which helps to improve the separation and lifetime of photo-generated carriers.\n\n(3) The band edge states are dominated by $\\left(\\mathrm{PbI}_{6}\\right)$ anion group in $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$. A-site $\\left(\\mathrm{CH}_{3} \\mathrm{NH}_{3}\\right)^{+}$ or $\\mathrm{Cs}^{+}$does not directly participate in the construction of the band edge states, but indirectly influences the structural stability and electronic level through Jahn-Teller effect.\n\n(4) It has been demonstrated that the suitable concentration of Cs can enhance both thermodynamic and mechanical stability of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ without deteriorating the conversion efficiency.\n\n(5) Goldschmidt's tolerance factor suggests that the Cs-concentration should be less than $62.5$ at.\\%, while mechanical performance indicates that the optimal Cs-concentration should be less than 37.5\\%. Below this mark, the mechanical properties including stability, hardness, strength, and ductility will continuously rise with the Cs-concentration.\n\nThe adopted research methods, mechanism cognitions and obtained conclusion in the work might help contributing to the future development of efficient and stable hybrid perovskite solar cell materials.\n\nAuthor Contributions: X.M. and D.L. built the model. D.L., S.L. and B.F. calculated properties of the compounds. All authors contributed to data analysis. X.M. and D.L. wrote the manuscript with input from all authors. X.M. directed the project.\n\nFunding: This work is financially supported by the National Key Research and Development Program of China 2016YFB0701100, the Fundamental Research Funds for the Central Universities (N150502002, N160208001, and N160206002), and National Natural Science Foundation of China (no. 51525101).\n\nAcknowledgments: Dongyan Liu sincerely thanks Haijun Pan at Northeastern University at Qinhuangdao for helpful discussion.\n\nConflicts of Interest: The authors declare no conflict of interest.\n\n\\section{References}\n\\begin{enumerate}\n  \\item Science News. Newcomer Juices up the race to harness sunlight. Science 2013, 342, 1438-1439.\n\n  \\item Kojima, A.; Teshima, K.; Shirai, Y.; Miyasaka, T. Organometal halide perovskites as visible-light sensitizers for photovoltaic cells. J. Am. Chem. Soc. 2009, 131,6050-6051. [CrossRef] [PubMed]\n\n  \\item Lee, M.M.; Teuscher, J.; Miyasaka, T.; Murakami, T.N.; Snaith, H.J. Efficient hybrid solar cells based on meso-superstructured organometal halide perovskites. Science 2012, 338, 643-647. [CrossRef] [PubMed]\n\n  \\item Liu, M.Z.; Johnston, M.B.; Snaith, H.J. Efficient planar heterojunction perovskite solar cells by vapour deposition. Nature 2013, 501, 395-398. [CrossRef] [PubMed] 5. Best Research-Cell Efficiencies (National Renewable Energy Laboratory, 2018). Available online: https: / /www.nrel.gov/pv/assets/images/efficiency-chart.png (accessed on 26 June 2018).\n\n  \\item Conings, B.; Drijkoningen, J.; Gauquelin, N.; Babayigit, A.; D'Haen, J.; D'Olieslaeger, L.; Ethirajan, A.; Verbeeck, J.; Manca, J.; Mosconi, E. Intrinsic thermal instability of methylammonium lead trihalide perovskite. Adv. Energy Mater. 2015, 5. [CrossRef]\n\n  \\item Christians, J.A.; Herrera, P.A.M.; Kamat, P.V. Transformation of the excited state and photovoltaic efficiency of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ perovskite upon controlled exposure to humidified air. J. Am. Chem. Soc. 2015, 137, 1530-1538. [CrossRef] [PubMed]\n\n  \\item Graetzel, M.; Janssen, R.A.J.; Mitzi, D.B.; Sargent, E.H. Materials interface engineering for solution-processed photovoltaics. Nature 2012, 488, 304-312. [CrossRef] [PubMed]\n\n  \\item Pearson, A.J.; Eperon, G.E.; Hopkinson, P.E.; Habisreutinger, S.N.; Wang, J.T.; Snaith, H.J.; Greenham, N.C. Oxygen Degradation in Mesoporous $\\mathrm{Al}_{2} \\mathrm{O}_{3} / \\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3-\\mathrm{x}} \\mathrm{Cl}_{\\mathrm{x}}$ Perovskite Solar Cells: Kinetics and Mechanisms. Adv. Energy Mater. 2016, 6. [CrossRef]\n\n  \\item Alsari, M.; Pearson, A.J.; Wang, J.T.W.; Wang, Z.; Montisci, A.; Greenham, N.C.; Snaith, H.J.; Lilliu, S.; Friend, R.H. Degradation Kinetics of Inverted Perovskite Solar Cells. Sci. Rep. 2018, 8, 5977. [CrossRef] [PubMed]\n\n  \\item Alsari, M.; Bikondoa, O.; Bishop, J.; Abdi-Jalebi, M.; Ozer, L.Y.; Hampton, M.; Thompson, P.; Hörantner, M.T.; Mahesh, S.; Greenland, C.; et al. In situ simultaneous photovoltaic and structural evolution of perovskite solar cells during film formation. Energy Environ. Sci. 2018, 11, 383-393. [CrossRef]\n\n  \\item Mosconi, E.; Quarti, C.; Ivanovska, T.; Ruani, G.; Angelis, F.D. Structural and electronic properties of organo-halide lead perovskites: A combined IR-spectroscopy and ab initio molecular dynamics investigation. Phys. Chem. Chem. Phys. 2014, 16, 16137-16144. [CrossRef] [PubMed]\n\n  \\item Noh, J.H.; Im, S.H.; Heo, J.H.; Mandal, T.N.; Seok, S.I. Chemical management for colorful, efficient, and stable inorganic-organic hybrid nanostructured solar cells. Nano Lett. 2013, 13, 1764-1769. [CrossRef] [PubMed]\n\n  \\item Hoke, E.T.; Slotcavage, D.J.; Dohner, E.R.; Bowring, A.R.; Karunadas, H.I.; McGehee, M.D. Reversible photo-induced trap formation in mixed-halide hybrid perovskites for photovoltaics. Chem. Sci. 2015, 6, 613-617. [CrossRef] [PubMed]\n\n  \\item Navas, J.; Sánchez-Coronilla, A.; Gallardo, J.J.; Hernández, N.C.; Piñero, J.C.; Alcántara, R.; Lorenzo, C.F.; De los Santos, D.M.; Aguilar, T.; Calleja, J.M. New insights into organic-inorganic hybrid perovskite $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ nanoparticles. An experimental and theoretical study of doping in $\\mathrm{Pb}^{2+}$ sites with $\\mathrm{Sn}^{2+}, \\mathrm{Sr}^{2+}$, $\\mathrm{Cd}^{2+}$ and $\\mathrm{Ca}^{2+}$. Nanoscale 2015, 7, 6216-6229. [CrossRef] [PubMed]\n\n  \\item Ogomi, Y.; Morita, A.; Tsukamoto, S.; Saitho, T.; Fujikawa, N.; Shen, Q.; Toyoda, T.; Yoshino, K.; Pandey, S.; Ma, T.; et al. $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{Sn}_{x} \\mathrm{~Pb}_{(1-x)} \\mathrm{I}_{3}$ perovskite solar cells covering up to $1060 \\mathrm{~nm}$. J. Phys. Chem. Lett. 2014, 5, 1004-1011. [CrossRef] [PubMed]\n\n  \\item Eperon, G.E.; Paternò, G.M.; Sutton, R.J.; Zampetti, A.; Haghighirad, A.A.; Cacialli, F.; Snaith, H.J. Inorganic caesium lead iodide perovskite solar cells. J. Mater. Chem. A 2015, 3, 19688-19695. [CrossRef]\n\n  \\item Ahmad, M.; Rehman, G.; Ali, L.; Shafiq, M.; Iqbal, R.; Ahmad, R.; Khan, T.; Asadabad, S.J.; Maqbool, M.; Ahmad, I. Structural, electronic and optical properties of $\\mathrm{CsPb} X_{3}(\\mathrm{X}=\\mathrm{Cl}, \\mathrm{Br}, \\mathrm{I})$ for energy storage and hybrid solar cell applications. J. Alloy Compd. 2017, 705, 828-839. [CrossRef]\n\n  \\item Protesescu, L.; Yakunin, S.; Bodnarchuk, M.I.; Krieg, F.; Caputo, R.; Hendon, C.H.; Yang, R.X.; Walsh, A.; Kovalenko, M.V. Nanocrystals of cesium lead halide perovskites $\\left(\\mathrm{CsPb} X_{3}, \\mathrm{X}=\\mathrm{Cl}, \\mathrm{Br}\\right.$, and $\\left.\\mathrm{I}\\right)$ : Novel optoelectronic materials showing bright emission with wide color gamut. Nano Lett. 2015, 15, 3692-3696. [CrossRef] [PubMed]\n\n  \\item Trots, D.M.; Myagkota, S.V. High-temperature structural evolution of caesium and rubidium triiodoplumbates. J. Phys. Chem. Solids 2008, 69, 2520-2526. [CrossRef]\n\n  \\item Eperon, G.E.; Beck, C.E.; Snaith, H.J. Cation exchange for thin film lead iodide perovskite interconversion. Mater. Horiz. 2016, 3, 63-71. [CrossRef]\n\n  \\item Jeon, N.J.; Noh, J.H.; Yang, W.S.; Kim, Y.C.; Ryu, S.; Seo, J.; Seok, S., II. Compositional engineering of perovskite materials for high-performance solar cells. Nature 2015, 517, 476-480. [CrossRef] [PubMed]\n\n  \\item Binek, A.; Hanusch, F.C.; Docampo, P.; Bein, T. Stabilization of the trigonal high-temperature phase of formamidinium lead iodide. J. Phys. Chem. Lett. 2015, 6, 1249-1253. [CrossRef] [PubMed] 24. Yi, C.; Luo, J.; Meloni, S.; Boziki, A.; Astani, N.A.; Gratzel, C.; Zakeeruddin, S.M.; Rothlisberger, U.; Gratzel, M. Entropic stabilization of mixed A-cation $\\mathrm{ABX}_{3}$ metal halide perovskites for high performance perovskite solar cells. Energy Environ. Sci. 2016, 9, 656-662. [CrossRef]\n\n  \\item Li, Z.; Yang, M.; Park, J.S.; Wei, S.H.; Berry, J.J.; Zhu, K. Stabilizing perovskite structures by tuning tolerance factor: Form ation of formamidinium and cesium lead iodide solid-state alloys. Chem. Mater. 2016, 28, 284-292. [CrossRef]\n\n  \\item Kulbak, M.; Cahen, D.; Hodes, G. How important is the organic part of lead halide perovskite photovoltaic cells? Efficient $\\mathrm{CsPbBr}_{3}$ cells. J. Phys. Chem. Lett. 2015, 6, 2452-2456. [CrossRef] [PubMed]\n\n  \\item Frisch, M.J.; Trucks, G.W.; Schlegel, H.B.; Scuseria, G.E.; Robb, M.A.; Cheeseman, J.R.; Zakrzewski, V.G.; Montgomery, J.A.; Stratmann, R.E.; Burant, J.C.; et al. Gaussian 98; Gaussian Inc.: Pittsburgh, PA, USA, 1998.\n\n  \\item Becke, A.D. Density functional thermochemistry. III. The role of exact exchange. J. Chem. Phys. 1993, 98, 5648-5652. [CrossRef]\n\n  \\item Lee, C.; Yang, W.; Parr, R.G. Development of the Colle-Salvetti correlation-energy formula into a functional of the electron density. Phys. Rev. B 1988, 37, 785. [CrossRef]\n\n  \\item McLean, A.D.; Chandler, G.S. Contracted Gaussian basis sets for molecular calculations. I. Second row atoms, $Z=11-18$. J. Chem. Phys. 1980, 72, 5639-5648. [CrossRef]\n\n  \\item Perdew, J.; Burke, K.; Ernzerhof, M. Generalized gradient approximation made simple. Phys. Rev. Lett. 1996, 77, 3865. [CrossRef] [PubMed]\n\n  \\item Kresse, G.; Furthmuller, J. Efficient iterative schemes for ab initio total-energy calculations using a plane-wave basis set. Phys. Rev. B 1996, 54, 11169. [CrossRef]\n\n  \\item Krishnan, R.; Binkley, J.S.; Seeger, R.; Pople, J.A. Self-consistent molecular orbital methods. XX. A basis set for correlated wave functions. J. Chem. Phys. 1980, 72, 650-654. [CrossRef]\n\n  \\item Bakulin, A.A.; Selig, O.; Bakker, H.J.; Rezus, Y.L.; Muller, C.; Glaser, T.; Lovrincic, R.; Sun, Z.; Chen, Z.; Walsh, A.; et al. Real-time observation of organic cation reorientation in methylammonium lead iodide perovskites. J. Phys. Chem. Lett. 2015, 6, 3663-3669. [CrossRef] [PubMed]\n\n  \\item Frost, J.M.; Butler, K.T.; Brivio, F.; Hendon, C.H.; Schilfgaarde, M.V.; Walsh, A. Atomistic origins of high-performance in hybrid halide perovskite solar cells. Nano Lett. 2014, 14, 2584-2590. [CrossRef] [PubMed]\n\n  \\item La-o-vorakiat, C.; Salim, T.; Kadro, J.; Khuc, M.; Haselsberger, R.; Cheng, L.; Xia, H.; Gurzadyan, G.G.; Su, H.; Lam, Y.M.; et al. Elucidating the role of disorder and free-carrier recombination kinetics in $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ perovskite films. Nat. Commun. 2015, 6, 7903. [CrossRef] [PubMed]\n\n  \\item Stroppa, A.; Quarti, C.; De Angelis, F.; Picozzi, S. Ferroelectric polarization of $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ : $\\mathrm{A}$ detailed study based on density functional theory and symmetry mode analysis. J. Phys. Chem. Lett. 2015, 6, 2223-2231. [CrossRef] [PubMed]\n\n  \\item Berdiyorov, G.R.; Madjet, M.E.; El-Mellouhi, F.; Peeters, F.M. Effect of crystal structure on the electronic transport properties of the organometallic perovskite $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$. Sol. Energy Mater. Sol. Cells 2016, 148, 60-66. [CrossRef]\n\n  \\item Frost, J.M.; Walsh, A. What is moving in hybrid halide Perovskite solar cells? Acc. Chem. Res. 2016, 49, 528-535. [CrossRef] [PubMed]\n\n  \\item Kutes, Y.; Ye, L.; Zhou, Y.; Pang, S.; Huey, B.D.; Padture, N.P. Direct observation of ferroelectric domains in solution-processed $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ Perovskite Thin Films. J. Phys. Chem. Lett. 2014, 5, 3335-3339. [CrossRef] [PubMed]\n\n  \\item Jeng, J.Y.; Chiang, Y.F.; Lee, M.H.; Peng, S.R.; Guo, T.F.; Chen, P.; Wen, T.C. $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ perovskite/fullerene planar heterojunction hybrid solar cells. Adv. Mater. 2013, 25, 3727-3732. [CrossRef] [PubMed]\n\n  \\item Qiu, J.; Qiu, Y.; Yan, K.; Zhong, M.; Mu, C.; Yan, H.; Yang, S. All-solid-state hybrid solar cells based on a new organometal halideperovskite sensitizer and one-dimensional $\\mathrm{TiO}_{2}$ nanowire arrays. Nanoscale 2013 , 5, 3245-3248. [CrossRef] [PubMed]\n\n  \\item Umari, P.; Mosconi, E.; Filippo, D. Relativistic GW calculations on $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ and $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{SnI}_{3}$ perovskites for solar cell applications. Sci. Rep. 2014, 4, 4467. [CrossRef] [PubMed]\n\n  \\item Mosconi, E.; Amat, A.; Nazeeruddin, M.; Gratzel, M.; Angelis, F.D. First-principles modeling of mixed halide organometal perovskites for photovoltaic applications. J. Phys. Chem. C 2013, 117, 13902-13913. [CrossRef]\n\n  \\item Umebayashi, T.; Asai, K.; Kondo, T.; Nakao, A. Electronic structures of lead iodide based low-dimensional crystals. Phys. Rev. B 2003, 67, 155405. [CrossRef] 46. Brivio, F.; Walker, A.B.; Walsh, A. Structural and electronic properties of hybrid perovskites for high-efficiency thin-film photovoltaics from first-principles. APL Mater. 2013, 1, 042111. [CrossRef]\n\n  \\item Meng, X.Y.; Liu, D.Y.; Qin, G.W. Band engineering of multicomponent semiconductors: A general theoretical model on the anion group. Energy Environ. Sci. 2018, 11, 692-701. [CrossRef]\n\n  \\item Goldschmidt, V.M. Crystal structure and chemical correlation. Ber. Dtsch. Chem. Ges. 1927, 60, $1263-1268$. [CrossRef]\n\n  \\item Goldschmidt, V.M. Die Gesetze der Krystallochemie. Naturwissenschaften 1926, 14, 477–485. [CrossRef]\n\n  \\item Kieslich, G.; Sun, S.; Cheetham, A.K. Solid-state principles applied to organic-inorganic perovskites: New tricks for an old dog. Chem. Sci. 2014, 5, 4712-4715. [CrossRef]\n\n  \\item Stoumpos, C.C.; Kanatzidis, M.G. The renaissance of halide perovskites and their evolution as emerging semiconductors. Acc. Chem. Res. 2015, 48, 2791-2802. [CrossRef] [PubMed]\n\n  \\item Niemann, R.G.; Gouda, L.; Hu, J.; Tirosh, S.; Gottesman, R.; Cameron, P.J.; Zaban, A. Cs ${ }^{+}$incorporation into $\\mathrm{CH}_{3} \\mathrm{NH}_{3} \\mathrm{PbI}_{3}$ perovskite: Substitution limit and stability enhancement. J. Mater. Chem. A 2016, 4, 17819-17827. [CrossRef]\n\n  \\item Born, M.; Huang, K. Dynamical Theory of Crystal Lattices; Clarendon Press: Oxford, UK, 1954.\n\n  \\item Hill, R. The elastic behaviour of a crystalline aggregate. Proc. Phys. Soc. A 1952, 65, 349-354. [CrossRef]\n\n  \\item Beecher, A.N.; Semonin, O.E.; Skelton, J.M.; Frost, J.M.; Terban, M.W.; Zhai, H.W.; Alatas, A.; Owen, J.S.; Walsh, A.; Billinge, S.J.L. Direct observation of dynamic symmetry breaking above room temperature in methylammonium lead iodide perovskite. ACS Energy Lett. 2016, 1, 880-887. [CrossRef]\n\n  \\item Rakita, Y.; Cohen, S.R.; Kedem, N.K.; Hodes, G.; Cahen, D. Mechanical properties of $A P b X_{3}(A=C$ s or $\\mathrm{CH}_{3} \\mathrm{NH}_{3} ; \\mathrm{X}=\\mathrm{I}$ or $\\mathrm{Br}$ ) perovskite single crystals. MRS Commun. 2015, 5, 623-629. [CrossRef]\n\n  \\item Pugh, S.F. Relations between the elastic moduli and the plastic properties of polycrystalline pure metals. Philos. Mag. Ser. 1954, 45, 823-843. [CrossRef]\n\n\\end{enumerate}\n\n( 2018 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (http:/ / \\href{http://creativecommons.org/licenses/by/4.0/}{creativecommons.org/licenses/by/4.0/}).\n\n\n\\end{document}", "record_id": "2023_09_22_e06d11a6e698afe5f2d7g"}