{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{multirow}\n\n\\title{Robustness of Surface Activity Electronic Structure- Based Descriptors of Transition Metals }\n\n\n\\author{Lorena Vega, Biel Martínez , Francesc Viñes,* and Francesc Illas\\\\\nDepartament de Ciència de Materials i Química Física \\& Institut de Química Teórica i\\\\\nComputacional (IQTCUB), Universitat de Barcelona, c/Martí i Franquès 1, 08028\\\\\nBarcelona, Spain.}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\n\n\n\\begin{abstract}\nEfficient yet simple electronic structure-based descriptors of transition metal surfaces are key in material design for many scientific fields in research and technology. Density functional theory-based methods provide the framework to systematically explore the performance and transferability of such descriptors. Using appropriate surface models and the Vosko-Wilk-Nussair (VWN), Perdew-Burke-Ernzerhof (PBE), PBE adapted for solids (PBE ${ }_{\\text {sol }}$ ), revised PBE (RPBE), and Tao-Perdew-Staroverov-Scuseria (TPSS) exchange-correlation functionals, we study the transferability of three descriptors: the $d$ band centre, the width-corrected $d$-band centre and the Hilbert transform highest peak among the low-index Miller surfaces for the metals of transition elements. We show that the $d$-band centre and the width-corrected $d$-band centre descriptors are almost independent of the functional used whereas a dependency is seen in the Hilbert transform highest peak. Moreover, it is seen that the differences between the surface descriptor values and predictions from the bulk ones are leaded by the presence of surface states. Interestingly, a direct relation between the surface coordination number and $d$-band centre electronic descriptor is found when surface states are absent.\n\\end{abstract}\n\nKeywords: electronic structure-based descriptors, $d$-band center, transition metals, surfaces, density functional theory.\n\n*Corresponding author: \\href{mailto:francesc.vines@ub.edu}{francesc.vines@ub.edu}\n\n\\section{Introduction}\nThe metals of transition elements, here after named transition metals (TMs) are intensively used in many fields of applied chemistry and material science, e.g. nanotechnology, ${ }^{1}$ gas sensing, ${ }^{2}$ green chemistry, ${ }^{3}$ and heterogeneous catalysis, ${ }^{4}$ to name a few. These materials are used either as pure metals, alloys, ${ }^{5}$ or also bimetallic nanoparticles. ${ }^{6}$ The performance of the TMs in different applications is closely correlated to their surface chemistry and oftentimes interlinked with electronic structure based descriptors. These descriptors have arisen as a powerful tool to predict materials properties. Knowing the relation between these descriptors and targeted materials properties allows for a rapid quantitative screening over a large set of materials based on such validated descriptors saving the effort of actually measuring the desired property, e.g. the adsorption energy of a molecule on the family of TMs can be screened easily without actually carrying out calorimetric experiments. Thus, from an economically point of view, the prediction will be less expensive than either testing or simulating the systems themselves.\n\nFor TM systems, useful and broadly used descriptors such as the $d$-band centre, $\\varepsilon_{d},{ }^{7}$ obtained from the $d$-contribution of a surface atom to the projected density of states (this is, the surface first-layer atom $d$-projected density of states, $d$-PDOS), have been successfully employed in understanding the surface chemistry, physics, and related processes of these TMs ${ }^{8}$ and also in the computational design of novel solid catalysts. ${ }^{9}$ The $d$-band centre is simply defined as the $d$-band DOS gravimetric centre of a surface atom, as in $\\mathrm{Eq}(1)$\n\n\\[\n\\varepsilon_{d}=\\frac{\\int_{E_{i}}^{E_{f}}\\left(E-E_{F e r m i}\\right) \\cdot d \\text { PDOS }}{\\int_{E_{i}}^{E_{f}} d P D O S}\n\\]\n\nwhere the $E_{i}$ limit is the $d$-band onset and $E_{f}$ is considered to be the energy point where the $d$-PDOS integral would belong to a $d^{10}$ electronic configuration. Other improved $d$ band based descriptors have been proposed in the recent times, such as the width corrected $d$-band centre, $\\varepsilon_{d}^{w},^{10}$ calculated as in Eq. 2 by adding half of the band width, W, taken as $E_{f}-E_{i}$ (see Figure 1) to the value obtained from Eq. (1).\n\n\\[\n\\varepsilon_{\\mathrm{d}}^{\\mathrm{W}}=\\varepsilon_{\\mathrm{d}}+\\frac{\\mathrm{W}}{2}\n\\]\n\nFinally, the highest point of the Hilbert transform applied to the $d$-PDOS, $\\varepsilon_{u},{ }^{11}$ has been proposed as a novel and, in principle, more accurate electronic structure-based descriptor, especially when compared to $\\varepsilon_{d}$. These descriptors are not physical observables although they are easily reachable by means of first principles calculations, being those based on density functional theory (DFT) the common choice. The practical easiness of DFT, as well as the agreement of its trends with physicochemical properties, ${ }^{7-11}$ let the above commented parameters as suited to be considered chemical descriptors. A recent study ${ }^{12}$ across the $3 d, 4 d$, and $5 d$ bulk metals thoroughly evaluated whether the value of such descriptors, hereafter globally renamed $\\varepsilon_{X}$ (i.e. $\\varepsilon_{d}, \\varepsilon_{d}^{w}$, and $\\varepsilon_{u}$ ), depends on the choice of the DFT method, revealing that the numerical value of the descriptor was generally rather independent. Note, however, that this conclusion holds for functionals belonging to the so-called Local Density Approximation (LDA), Generalized Gradient Aproximation (GGA) or meta-GGA families of functionals, in increasing order of either complexity and accuracy (see below). Hybrid functionals usually provide better results for the thermochemistry of gas phase molecules of main group elements. However, they were here excluded since in a previous study it was found that they fail in describing the electronic delocalization of metallic systems, causing concomitant wrong deviations in the electronic structure. Nevertheless, in spite of the apparent reported transferability of DFT based descriptors for bulk models, the unavoidable emerging question mark is whether this excellent transferability holds true when applied to TM surfaces. To answer this question, we evaluate here by DFT means the transferability of various commonly used exchange and correlation $(x c)$ functionals on a set of 81 TM surfaces. Such a thorough study will determine whether the prediction of trends of TM physicochemical properties by means of electronic structurebased descriptors is a solid matter or is biased by the employed DFT functional, or even by the selected electronic descriptor.\n\n\\section{Computational Details}\n27 TMs are here studied (the hexagonal close-packed (hcp) Sc, Y, Ti, Zr, Hf, Tc, Re, Ru, Os, Co, Zn, and Cd; the face-centred cubic ( $f c c) \\mathrm{Rh}, \\mathrm{Ir}, \\mathrm{Ni}, \\mathrm{Pd}, \\mathrm{Pt}, \\mathrm{Cu}, \\mathrm{Ag}$, and $\\mathrm{Au}$, and finally V, Nb, Ta, Cr, Mo, W, and Fe being body-centred cubic (bcc) TMs). For these metals, different low-index Miller surfaces, thus featuring in principle their most stable surfaces, have been considered. Specifically, these are the (001), the (011), and\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2d44dda253969d6ce7f6g-03_1571_1628_287_1775}\\\\\nstructures, following Miller-Bravais indices in the latter case. A total of 81 distinct TM surfaces have been studied.\n\nDFT based periodic calculations employing the Vienna ab initio simulation package (VASP) ${ }^{13}$ have been carried out for six-atomic layer slab models. A cutoff energy of the plane-wave basis set of $415 \\mathrm{eV}$ is used in a periodic cell containing $10 \\AA$ of vacuum along the surface direction. The reciprocal space has been sampled using a k-point Monkhorst-Pack ${ }^{14}$ mesh of $7 \\times 7 \\times 1$ dimensions for surfaces. The projector augmented wave ${ }^{15}$ method is used to describe the interaction of core electrons with valence density. Surface structures previously optimized with each of the considered DFT $x c$ functionals are employed, with further details of these described in the literature. Thus, these structures are used to obtain the required DOS for the calculation of the descriptors. ${ }^{16}$\n\nThe $\\varepsilon_{X}$ descriptors have been obtained for five different $x c$ functionals, chosen in concordance with previous systematic studies for bulks and surfaces of the considered TMs. ${ }^{16-18}$ Explicitly, within the local density approximation (LDA) we used the VoskoWilk-Nussair xc (VWN); ${ }^{19}$ from the generalized gradient approximation (GGA) the Perdew-Burke-Ernzerhof (PBE) was chosen, ${ }^{20}$ and last but not least, from meta-GGA family, the Tao-Perdew-Staroverov-Scuseria (TPSS) was selected. ${ }^{21} \\mathrm{PBE}$ is considered one of the most accurate functional for the description of TM bulks and surfaces in general average terms. ${ }^{16-18}$ Nevertheless, the revised PBE (RPBE), ${ }^{22}$ claimed to better describe adsorption energies; and the PBE adapted for solids ( $\\left.\\mathrm{PBE}_{\\text {sol }}\\right),{ }^{23}$ posed as a better functional for bulk materials, were contemplated as well. Note that the usage of periodic boundary conditions constrains, like in here, tend to imply an integration and projection of the DOS on given defined atomic radii, and, therefore, may not fully sample all the systems band space. However, as we deal here with differences of $d$ PDOS and trends, such inaccuracies must cancel each other, and can be disregarded in the forthcoming discussion.\n\n\\section{Results and Discussion}\nAs already commented, for the density functionals mentioned above the numerical values of the $\\varepsilon_{X}$ descriptors extracted from bulk models were found to be almost independent on the choice of the DFT method in a previous study ${ }^{12}$, given the close values they obtained of linear regression slopes and intercepts for VWN and TPSS $x c$ with respect the PBE values for all $\\varepsilon_{X}$. The exception to this rule was found for HeydScuseria-Ernzerhof (HSE06) hybrid functional, ${ }^{24}$ which presented a larger deviation of slopes and intercepts for $\\varepsilon_{d}$ and $\\varepsilon_{u}$ (see Table 1 ). Here, this issue was addressed for the same $\\varepsilon_{X}$ descriptors but for values derived from the surface models, in this case (001), (011) and (111) surfaces for $b c c$ and $f c c$ TMs, and (0001), (10 $\\overline{1} 0)$, and (11 $\\overline{2} 0)$ surfaces for $h c p$ structures. This is an important remaining question since one may wish to combine surface (electronic) descriptors as obtained using different DFT methods for practical applications. Then, the robustness of these methods for calculating the surface electronic descriptors is relevant in order to correctly describe the surface TM trends in chemical or catalytic activities and other related properties, independently of the employed functional. Since the $\\varepsilon_{X}$ descriptors are not observables, the comparison necessarily involves calculated values to be contrasted with one of the set taken as reference. Here, the assessment of the descriptors as predicted by different DFT $x c$ methods is carried out taking the PBE values as reference. This is justified since, among the DFT functionals explored, PBE was found to be one of the most accurate in describing experimental observables for the whole set of TMs including bulk and surface properties. ${ }^{16,18}$ It was pointed as the most accurate by adding all the mean absolute error percentages obtained for each property under inspection, including bulk interatomic distances, bulk moduli, and cohesive energies for bulk properties, and surfaces energies, work functions, and interlayer distances for surface properties.\n\nFigure 2 reports the plots of $\\varepsilon_{X}$ values obtained with each functional, contained in Tables S1-S3 of the ESI, in front of the reference, PBE ones. It evidences that there is an excellent agreement between the different $x c$ functionals for $\\varepsilon_{d}$, following the previously observed trends for this descriptor in bulk models (see Table 1). Slopes are close to unity, intercepts below $0.06 \\mathrm{eV}$, with regression coefficient values larger than 0.98. Consequently, all the inspected functionals provide very similar $d$-band centre descriptors, and, therefore, they describe the very same electronic structure situation, as evaluated through the $d$-PDOS. For the $\\varepsilon_{d}^{W}$ descriptor, in concordance, an excellent agreement is found as well, with slopes again near unity, although with slightly larger intercepts, yet all below $0.23 \\mathrm{eV}$, and a faint reduction of $R$ values being still above 0.97. A larger deviation is found for TPSS, with an intercept value of $0.80 \\mathrm{eV}$ and a regression coefficient below 0.83. Here, these results differ from the bulk ones, see Table 1 , where the obtained intercepts are lower than $0.08$, see e.g. the bulk TPSS case where the intercept is $-0.04$, close to 0 , whereas for surfaces the intercept increases to near 1 . Clearly, despite the fact that the $d$-band centre is equally described by the different functionals, the $d$-band width is slightly more sensible to the DFT method employed, providing then these larger differences in regression slope and intercept values. In the case of $\\varepsilon_{u}$ there are significant deviations of the obtained descriptor values when studied using different functionals, although there is maybe a fortuitous good agreement in between $\\mathrm{PBE}_{\\text {sol }}$ and TPSS. Notice that, despite intercepts can be very small, $0.05$ eV for RPBE, with both the slope and $R$ below $0.73$, apparently, the Hilbert transform based descriptor largely depends on the particular $d$-PDOS gradients. Consequently, subtle changes originated by a given functional, that do not affect the $d$ band gravimetric centre, do affect the $\\varepsilon_{u}$ descriptor. Again, comparing with the $\\varepsilon_{u}$ bulk results, see Table 1 , the linear regression coefficients on surfaces models get worse, but not only due to larger intercepts as happened in $\\varepsilon_{d}^{W}$, but also because the slopes are far from unity and the $\\mathrm{R}$ values range between $0.68$ and 0.79. In light of these results, the transferability among descriptors obtained using the above commented $x c$ functionals decreases as $\\varepsilon_{d}>\\varepsilon_{d}^{W}>>\\varepsilon_{u}$, being the $\\varepsilon_{d}$ the safest one to use when mixing results obtained at different DFT levels for TMs surfaces.\n\nAnother point to inspect is whether the descriptor transferability is biased by a variation on the structural relaxation predicted by the different functionals. A different computed slab relaxation could affect the electronic structure of a surface atom whose $d$-PDOS is under scrutiny, thus modifying the derived $\\varepsilon_{X}$ values. To evaluate this possibility the PBE optimized structures were taken as fixed and the electronic part calculated with the different functionals. The list of values is encompassed in Tables S4-S6 of the ESI. The comparison with respect self-consistent PBE $\\varepsilon_{X}$ values is shown in Figure 3. Except for TPSS $\\varepsilon_{d}$ case, all $\\varepsilon_{d}$ and $\\varepsilon_{d}^{W}$ values are closer to the PBE reference, with slopes nearer to unity, intercepts closer to zero, and regression coefficients slightly increased. The results show that subtle differences on the surface relaxation for each $x c$ functional are behind the $\\varepsilon_{d}$ and $\\varepsilon_{d}^{W}$ dependence with the DFT $x c$ functional. However, $\\varepsilon_{u}$ did improve only in some cases. The VWN $\\varepsilon_{u}$ regression features a worse slope but a better intercept and $R, \\mathrm{PBE}_{\\text {sol }}$ regression improves only its intercept, while TPSS regression improves the slope. In the case of RPBE regression, there is a slight improvement on $R$ and on the slope, although intercept deviates significantly from zero. Then, also here, the transferability among descriptors using PBE optimized geometries remains being $\\varepsilon_{d}>\\varepsilon_{d}^{W}>>\\varepsilon_{u}$.\n\nA further aspect of interest, beyond the variation of the surface electronic structure descriptors calculations caused by the structure relaxations, is the relation between electronic descriptors like the here studied and structural descriptors such as the coordination number (CN, here understood as the number of nearest neighbours to the atom of interest within the solid-state structure of the metal). Apart from previous relationships which unfold that electronic and structural type of descriptors seem to be inseparable factors of TM surface chemical activity, ${ }^{25}$ one would expect that an atom at the surface with a CN closer to the bulk CN than other contemplated surfaces would display a more similar $\\varepsilon_{d}$. Here $\\varepsilon_{d}$ is taken as the representative electronic descriptor due to the independency found of its values with respect to the functionals under scrutiny. This hypothesis is confirmed for TMs with hcp and bcc structures in Figure 4 with the plot of $\\varepsilon_{d}$ with respect $\\mathrm{CN}$, where $\\mathrm{CN}$ values were taken from the literature. ${ }^{26}$ For these TM surfaces, the intercepts are close to zero and slopes closer to the bulk regression slopes as closer to bulk $\\mathrm{CN}$ is to the $\\mathrm{CN}$ of the surface. However, for the (001) and (111) surfaces of bcc metals, their regressions differ despite they have the same CN. For fcc the (011) surface, with $\\mathrm{CN}=7, \\varepsilon_{d}$ results are more similar to bulk ( $\\mathrm{CN}=12)$ than to (001) and (111), with $\\mathrm{CN}=8$ and $\\mathrm{CN}=9$, respectively.\n\nThis different behaviour can be due to variations between the electronic band structure of bulk and surfaces caused by the emergence of surface states. The effect of different structural optimization is discarded since calculations for bulk truncated frozen surfaces display the same trends. So, here, comparing bulk and surface results, the trend seems to be induced by a difference between the electronic structures of the systems. In order to quantify the effect of surface states, the absolute difference between bulk and surface $d$-PDOS was integrated, see Figure 5. With this one finds that only $27.8 \\%$ of the $h c p$ cases exhibit intense surface states above $8 \\cdot \\mathrm{eV}^{-1}$, whereas this become the majority (61.9\\%) for bcc and (83.3\\%) for fcc TM surfaces. Clearly, the presence of surface states dominates the $d$-PDOS of $f c c$ metals and explains the above commented disagreement between the $\\mathrm{CN}$ of the surfaces and the bulk-similarity of the $\\varepsilon_{d}$ regressions for bcc and fcc cases.\n\n\\section{Conclusions}\nTo conclude, we have found that the influence of the exchange-correlation functional used to estimate electronic descriptors of TM surfaces differs from the observed for descriptors extracted from bulk models. ${ }^{12}$ The transferability of surface derived descriptors is worse for all functionals explored and, in addition, the transferability decreases among the descriptors as $\\varepsilon_{d}>\\varepsilon_{d}^{W}>>\\varepsilon_{u}$. Differences are found regarding what was reported for bulk derived descriptors, where good transferability was always observed. Even so, transferability in the surface structures remains excellent for $\\varepsilon_{d}$. Whereas the differences in the descriptor values for each $x c$ functional have a contribution from the different description of the geometry, the different behaviour of each surface and bulk derived descriptor stems mostly from the electronic part, and the different surface relaxation predicted by different DFT method is playing a minor role. The present results also highlight the relationship between electronic descriptors such as $\\varepsilon_{d}$ and structural descriptors such as CN. Structures with similar CN have similar $\\varepsilon_{d}$ values and those with $\\mathrm{CN}$ closer to bulk display also closer to bulk $\\varepsilon_{d}$ values, unless when surface states play an important role, as does happen for fcc TM surfaces.\n\n\\section{Acknowledgements}\nThis work was supported by Spanish MINECO/FEDER Grant CTQ2015-64618$\\mathrm{R}$ and in part by Generalitat de Catalunya Grants 2014SGR97 and XRQTC and by the NOMAD Center of Excellence Project receiving funding from the European Union Horizon 2020 Research and Innovation Programme, Grant Agreement 676580. F.V. thanks the Spanish MINECO for a Ramoń y Cajal research contract (RYC-201210129), F.I. acknowledges additional support through the ICREA Academia Award for Excellence in Research and L.V. thanks Generalitat de Catalunya for a predoctoral grant (B\\_00384).\n\nTable 1. Linear regression parameters of the $\\varepsilon_{X}$ descriptors for the bulk values obtained in Ref. 12 by VWN, TPSS and HSE06, a hybrid $x c$ functional. The slope is $a$, the intercept $b$, and $R$ the linear regression coefficient.\n\n\\begin{center}\n\\begin{tabular}{c|c|c|c|c}\n\\hline\n$\\varepsilon_{X}$ & $\\chi c$ & $a$ & $b$ & $R$ \\\\\n\\hline\n\\multirow{4}{*}{$\\varepsilon_{d}$} & VWN & $1.10$ & $0.03$ & $0.9994$ \\\\\n & TPSS & $1.03$ & $-0.03$ & $0.9977$ \\\\\n & HSE06 & $1.11$ & $-0.43$ & $0.9921$ \\\\\n\\hline\n\\multirow{3}{*}{} & VWN & $1.02$ & $-0.06$ & $0.9977$ \\\\\n & TPSS & $1.01$ & $-0.04$ & $0.9932$ \\\\\n & HSE06 & $1.01$ & $0.07$ & $0.9792$ \\\\\n\\hline\n\\multirow{4}{*}{$\\varepsilon_{u}$} & VWN & $0.99$ & $-0.01$ & $0.9998$ \\\\\n & TPSS & $1.03$ & $0.00$ & $0.9994$ \\\\\n & HSE06 & $1.22$ & $-0.02$ & $0.9934$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nFigure 1. Textbook (a) representation of $d$-PDOS, with the band width, W, in blue, and the $d$-band centre, $\\varepsilon_{d}$, in red. (b) Representation of the imaginary part of Hilbert transform of the previous $d$-PDOS with the highest peak, $\\varepsilon_{u}$, marked in red. The shown case belongs to Nb (001) surface as calculated at PBE level.\\\\\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d44dda253969d6ce7f6g-08_563_1893_475_1663}Figure 2. Variation of the (a) $d$-band centre, $\\varepsilon_{d}$, (b) width-corrected $d$-band centre, $\\varepsilon_{d}^{W}$, and (c) highest Hilbert transform peak, $\\varepsilon_{u}$, energy values, all given in $\\mathrm{eV}$, calculated using different xс functionals with respect to those obtained at the PBE level. Dashed black line represents ideal matching with respect to PBE values. Coloured solid lines belong to regressions of $\\mathrm{xc}$ values, whose slopes $\\mathrm{a}$, intercepts $\\mathrm{b}$, and regression coefficients, $R$, are displayed. The linear regression applied follows the equation $\\varepsilon_{\\mathrm{X}}=$ $\\mathrm{a} \\cdot \\varepsilon_{\\mathrm{X}}^{\\mathrm{PBE}}+\\mathrm{b}$, where $\\varepsilon_{\\mathrm{X}}$ can be $\\varepsilon_{d}, \\varepsilon_{d}^{W}$, or $\\varepsilon_{u}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d44dda253969d6ce7f6g-09_668_2479_634_1394}\n\\end{center}\n\nFigure 3. Variation of the (a) $d$-band centre, $\\varepsilon_{d}$, (b) width-corrected $d$-band centre, $\\varepsilon_{d}^{W}$, and (c) highest Hilbert transform peak, $\\varepsilon_{u}$, energy values, all given in $\\mathrm{eV}$, calculated using different xс functionals with respect to those obtained at the PBE level with the structure obtained with PBE. Dashed black line represents ideal matching with respect to PBE values. Coloured solid lines belong to regressions of xс values, whose slopes a, intercepts $b$, and regression coefficients, $R$, are displayed. The linear regression applied follows the equation $\\varepsilon_{\\mathrm{X}}=\\mathrm{a} \\cdot \\varepsilon_{\\mathrm{X}}^{\\mathrm{PBE}}+\\mathrm{b}$, where $\\varepsilon_{\\mathrm{X}}$ can be $\\varepsilon_{d}, \\varepsilon_{d}^{W}$, or $\\varepsilon_{u}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d44dda253969d6ce7f6g-10_661_2531_652_1415}\n\\end{center}\n\nFigure 4. Comparison between the PBE d-band centre, $\\varepsilon_{d}$, obtained for bulk and the different surfaces for each structure (a) $b c c$, (b) $f c c$ and (c) hcp. The linear regression applied follows the equation $\\varepsilon_{\\mathrm{d}}($ Surface $)=\\mathrm{a} \\cdot \\varepsilon_{\\mathrm{d}}($ Bulk $)+\\mathrm{b}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d44dda253969d6ce7f6g-11_450_2314_655_1401}\n\\end{center}\n\nFigure 5. Representation of the integral values of the absolute difference between the bulk and surface $d$-PDOS in front of the $\\varepsilon_{\\mathrm{d}}$, all data obtained at PBE level. The considered highest integral cases are in the red part and the rest in the green part.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d44dda253969d6ce7f6g-12_440_1051_293_1763}\n\\end{center}\n\n\\section{Notes and references}\n1 B. Nikoobakht and M.A. El-Sayed, Chem. Mater., 2003, 15, 1957.\n\n2 Z. Liu and P.C. Searson, J. Phys. Chem. B, 2006, 110, 4381.\n\n3 M. Favaro, H. Xiao, T. Cheng, W.A. Goddard III, J. Yano and E.J. Crumlin, Proc. Natl. Acad. Sci., 2017, 114, 6706.\n\n4 J. Greeley, J.K. Nørskov and M. Mavrikakis, Annu. Rev. Phys. Chem., 2002, 53, 319.\n\n5 P. Mani, R. Srivastava and P. Strasser, J. Phys. Chem. C, 2008, 112, 2770.\n\n6 M. Turner, V.B. Golovko, O.P.H. Vaughan, P. Abdulkin, A. Berenguer-Murcia, M.S. Tikhov, B.F.G. Johnson and R.M. Lambert, Nature, 2008, 454, 981.\n\n7 B. Hammer and J.K. Nørskov, Surf. Sci., 1995, 343, 211.\n\n8 J.K. Nørskov, T. Bligaard, J. Rossmeisl and C.H. Christensen, Nat. Chem., 2009, $1,37$.\n\n9 V.R. Stamenkovic, B.S. Mun, M. Arenz, K.J.J. Mayrhofer, C.A. Lucas, G.F. Wang, P.N. Ross and N.M. Markovic, Nat. Mater. 2007, 6, 241.\n\n10 A. Vojvodic, J.K. Nørskov and F. Abild-Pedersen, Top. Catal., 2014, 57, 25.\n\n11 H. Xin, A. Vojvodic, J. Voss, J.K. Nørskov and F. Abild-Pedersen, Condens. Matter Mater. Phys., 2014, 89, 115114.\n\n12 A. Notario-Estévez, S.M. Kozlov, F. Viñes and F. Illas, Chem. Commum., 2015, 51, 5602.\n\n13 G. Kresse and J. Furthmüller, Comput. Mater. Sci., 1996, 6, 15.\n\n14 H.J. Monkhorst and J.D. Pack, Phys. Rev. B, 1976, $13,5188$.\n\n15P.E. Blöchl, Phys. Rev. B: Condens. Matter Mater. Phys., 1994, 50, 17953.\n\n16 L. Vega, J. Ruvireta, F. Viñes and F. Illas, J. Chem. Theory Comput., 2018, 14, 395.\n\n17 P. Janthon, S. Lao, S.M. Kozlov, F. Viñes, J. Limtrakul and F. Illas, J. Chem. Theory Comput., 2013, 9, 1631.\n\n18 P. Janthon, S. Lao, S.M. Kozlov, F. Viñes, J. Limtrakul, D.G. Truhlar and F. Illas, J. Chem. Theory Comput., 2014, 10, 3832.\n\n19 S.H. Vosko, L. Wilk and M. Nussair, Can. J. Phys., 1980, 58, 1200.\n\n20 J.P. Perdew, K. Burke and M. Ernzerhof, Phys. Rev. Lett., 1996, 77, 3865. 21 J. Tao, J.P. Perdew, V.N. Statoverov and G.E. Scuseria, Phys. Rev. Lett., 2003, $91,146401$.\n\n22 B. Hammer, L.B. Hansen and J.K. Nørskov, Phys. Rev. B, 1999, 59, 7413.\n\n23 J.P. Perdew, A. Ruzsinszky, G.I. Csonka, O. Vydrov, G.E. Scuseria, L.A. Constantin, X. Zhou and K. Burke, Phys. Rev. Lett., 2008, 100, 136406.\n\n24 A.V. Krukau, O.A. Vydrov, A.F. Izmaylov, G.E. Scuseria, J. Chem. Phys., 2006, $125,224106$.\n\n25 F. Calle-Vallejo, J.I. Martínez, J.M. García-Lastra, P. Sautet and D. Loffreda, Angew. Chem. Int. Ed., 2014, 53, 8316.\n\n26 J. Ruvireta, L. Vega and F. Viñes, Surf. Sci., 2017, 664, 45.\n\n\n\\end{document}", "record_id": "2023_09_22_2d44dda253969d6ce7f6g"}