{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{UC Berkeley }\n\n\n\\author{Yun Xu \", Caleb Stetson b,c, Kevin Wood a, Eric Sivonxay \", Chunsheng Jiang a , Glenn Teeter a,\\\\\nSvitlana Pylypenko ${ }^{c}$, Sang-Don Han ${ }^{b}$, Kristin A. Persson d,e, Anthony Burrell b , Andriy\\\\\nZakutayev a*\\\\\na Materials Science Center, National Renewable Energy Laboratory, Golden, CO, 80401,}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nUC Berkeley Previously Published Works\n\n\\section{Title}\nMechanical Properties and Chemical Reactivity of $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ Thin Films.\n\n\\section{Permalink}\n\\href{https://escholarship.org/uc/item/5z36r40s}{https://escholarship.org/uc/item/5z36r40s}\n\n\\section{Journal}\nACS applied materials \\& interfaces, 10(44)\n\nISSN\n\n1944-8244\n\n\\section{Authors}\nXu, Yun\n\nStetson, Caleb\n\nWood, Kevin\n\net al.\n\n\\section{Publication Date}\n2018-11-01\n\n\\section{DOI}\n10.1021/acsami.8b10895\n\nPeer reviewed\n\n\\section*{Mechanical Properties and Chemical Reactivity of }\n\\section{$\\mathrm{Li}_{\\mathrm{x}} \\mathrm{SiO}_{\\mathrm{y}}$ Thin Films}\n USAb Chemistry and Nanoscience Center, National Renewable Energy Laboratory, Golden, $\\mathrm{CO}, 80401$, USA\n\n' Department of Chemistry, Colorado School of Mines, Golden, CO, 80401, USA\n\nd Lawrence Berkeley National Laboratory, Berkeley, CA 94720, USA\n\ne Department of Materials Science \\& Engineering, University of California, Berkeley, CA 94720-1760, USA\n\nKEYWORDS: mechanical properties, chemical reactivity, solid electrolyte interphases, $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$, lithium ion batteries ABSTRACT: Silicon (Si) is a commonly studied candidate material for next-generation anodes in Li-ion batteries. A native oxide $\\mathrm{SiO}_{2}$ on $\\mathrm{Si}$ is often inevitable. However, it is not clear if this layer has positive or negative effect on the battery performance. This understanding is complicated by the lack of knowledge about the physical properties of the $\\mathrm{SiO}_{2}$ lithiation products, and by convolution of chemical and electrochemical effects during the anode lithiation process. In this study, $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ thin films as model materials for lithiated $\\mathrm{SiO}_{2}$ were deposited by magnetron sputtering at ambient temperature, with the goal of 1) decoupling chemical reactivity from electrochemical reactivity, and 2) evaluating the physical and electrochemical properties of $\\mathrm{Li}_{\\mathrm{x}} \\mathrm{SiO}_{y} . \\mathrm{XPS}$ analysis of the deposited thin films demonstrate that a composition close to previous experimental reports of lithiated native $\\mathrm{SiO}_{2}$, can be achieved through sputtering. Our density functional theory calculations also confirm that possible phases formed by lithiating $\\mathrm{SiO}_{2}$ are very close to the measured film compositions. Scanning probe microscopy measurements show the mechanical properties of the film are strongly dependent on lithium concentration, with ductile behavior and higher Li content, and brittle behavior at lower Li content. Chemical reactivity of the thin films was investigated by measuring AC impedance evolution, suggesting that $\\mathrm{Li}_{\\mathrm{x}} \\mathrm{SiO}_{\\mathrm{y}}$ continuously reacts with electrolyte, in part due to high electronic conductivity of the film determined from solid state impedance measurements. Electrochemical cycling data of sputter deposited $\\mathrm{Li}_{x} \\mathrm{SiO}_{y} / \\mathrm{Si}$ films also suggest that $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ is not beneficial in stabilizing the $\\mathrm{Si}$ anode surface during battery operation, despite its favorable mechanical properties.\n\n\\section{Introduction}\nSilicon (Si) is considered to be one of the leading candidates for the next generation anode materials in Li-ion batteries, as it features a theoretical capacity more than 10 times higher than graphite. ${ }^{1}$ However, one of the major challenges of silicon is the large volume change during the lithiation and delithiation processes. This volume change eventually leads to the breakdown of the solid electrolyte interphase (SEI), and further reactions that cause increased electrolyte consumption, higher interphase resistance, and the ultimate failure of the cell. ${ }^{2}$\n\nThere have been extensive studies on the SEI formation on the surface of silicon. ${ }^{3}$ While various reports on the overall composition of the SEI are reaching some consensus, the understanding of its physical properties and chemical reactivity is still limited. Most work is focused on the SEI composition through characterization by Fourier Transform Infrared Reflectance (FTIR), and X-ray Photoemission Spectroscopy (XPS), ${ }^{4-9}$ while less research has been done to separately study SEI properties independent of the electrode ${ }^{10}$. Theoretically, a good SEI should be flexible or soft enough to accommodate the large volumetric change of the silicon. In addition to the mechanical properties of the SEI, high ionic conductivity and low electronic conductivity are also important factors in determining if a certain phase is beneficial to electrode stability.\n\nIt has been hypothesized, that one of the most important SEI components for $\\mathrm{Si}$ anodes in Li-ion batteries is $\\mathrm{Li}_{\\mathrm{x}} \\mathrm{SiO}_{\\mathrm{y}}$, which originates from the lithiation of the native oxide on $\\mathrm{Si}\\left(\\mathrm{SiO}_{2}\\right)$. The role of $\\mathrm{SiO}_{2}$ on a $\\mathrm{Si}$ anode is controversial: on one hand, it confines the volume expansion of $\\mathrm{Si}$, while on the other hand it induces interfacial reactions that consume lithium in the electrolyte. Lithiation of $\\mathrm{SiO}_{2}$ is a complicated process, and the products depend on the charge state of the battery. ${ }^{11-13}$ General findings are $\\mathrm{SiO}_{2}$ can be reduced to possible products of $\\mathrm{Li}_{2} \\mathrm{Si}_{2} \\mathrm{O}_{5}, \\mathrm{Li}_{4} \\mathrm{SiO}_{4}, \\mathrm{Li}_{2} \\mathrm{O}, \\mathrm{Si}$, and $\\mathrm{Li}_{x} \\mathrm{Si}^{10}{ }^{10}$ Nevertheless, most of the recent model system studies are focused on the fully oxidized lithium silicates such as $\\mathrm{Li}_{4} \\mathrm{SiO}_{4}, \\mathrm{Li}_{2} \\mathrm{SiO}_{3}, \\mathrm{Li}_{2} \\mathrm{Si}_{2} \\mathrm{O}_{5} \\cdot{ }^{7,14-16}$\n\nIn this work, the mechanical and electrochemical properties, as well as the chemical reactivity of the composite $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ film are investigated. For this purpose, a special combinatorial $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ composite film with composition close to the lithiated $\\mathrm{SiO}_{2}$ was synthesized by reactive sputtering, allowing to study its mechanical properties without any effect from electrolyte decomposition products. According to XPS results, both the lithium-rich and silicon-rich areas consist of lithium silicates, some $\\mathrm{Li}_{x} \\mathrm{Si}_{y}$ and very little $\\mathrm{SiO}_{2}$. The film compositions agree well with the phase diagram predicted by DFT calculations. It is found that the composite $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ film exhibits relatively-high electronic conductivity and low hardness, based on scanning probe microscopy results and impedance measurements. Computed bulk moduli shows the same trend as the experimental results, specifically that higher Li content leads to lower moduli. To evaluate the chemical reactivity of these materials, a multilayer thin film $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ on $\\mathrm{Si}$ was measured using impedance spectroscopy in a coin cell followed by electrochemical charge/discharge cycling. The results indicate that the composite film is unable to fully passivate the Si surface, due to its high electronic conductivity, and despite its ductile mechanical properties.\n\n\\section{Methods}\n$\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ thin films were synthesized by RF magnetron sputtering (13.56MHz) using lithium target (Lesker, 99.9\\%,2\" diameter) and silicon target (Lesker, 99.999\\%, 3\" diameter). The lithium target was cleaned with hexane $(99.9 \\%)$ before use to remove residual mineral oil, which protects lithium target from being oxidized during the shipment. Furthermore, oxidized film on top of lithium target was periodically removed by Dremel tool with copper brush. During the deposition, $30 \\mathrm{~W}$ RF power was applied to both lithium and silicon targets. Copper foil and Eagle XG glass were used as substrate for electrochemical measurement and scanning probe microscopy measurement respectively. To generate plasma, Ar ( $99.999 \\%$ purity) was introduced at a constant pressure of 3 mTorr into a vacuum chamber with $3 \\times 10^{-8}$ Torr base pressure. The film was deposited at room temperature, so it is expected to be amorphous (also confirmed by $x$ ray diffraction). After the synthesis, the samples were removed from a chamber to a glovebox. Airless transfer in a vacuum vessel to all characterization instruments was adopted because of the high reactivity of $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$. As a reference for comparison, thin films of $\\mathrm{Li}$-free $\\mathrm{Si}$ and $\\mathrm{Li}_{x} \\mathrm{SiO}_{y} / \\mathrm{Si}$ were made using the same method.\n\nThe XPS measurements were performed using a glovebox-integrated Phi 5600 XPS system. Glovebox conditions were better than $<10 \\mathrm{ppm}$ moisture and $\\mathrm{O}_{2}$. Base pressures for the Phi 5600 XPS system was below $7 \\times 10^{-10}$ Torr. Photoelectrons were generated using monochromatic Al Ka X-ray excitation (1486.7 eV). The spectrometer binding-energy (BE) scale was calibrated by measuring valence-band and core-level spectra from sputtercleaned $\\mathrm{Au}, \\mathrm{Ag}$, and $\\mathrm{Cu}$ foils $(\\mathrm{EF}=0.00 \\mathrm{eV}, \\mathrm{Au} 4 \\mathrm{f} 7 / 2=83.96 \\mathrm{eV}, \\mathrm{Ag} 3 \\mathrm{~d} 5 / 2=368.26 \\mathrm{eV}$, and $\\mathrm{Cu} 2 \\mathrm{p} 3 / 2=932.62 \\mathrm{eV}$ ). ${ }^{17} \\mathrm{Ar}^{+}$sputtering (incident energy $3 \\mathrm{keV}$ ) was used for depth profiling. Curve fitting and data processing were performed using Igor Pro with a custom program adapted from literature. ${ }^{18}$\n\nScanning probe microscopy (SPM) techniques have been used to evaluate mechanical and electrical properties of the thin films. Nanoindentation experiments were performed in an argon-filled glovebox with an atomic force microscope (AFM, Veeco D5000 and Nanoscope V) using Bruker DDESP diamond-coated Si probe in contact mode. Changing deflection set-points applied to the tip allows the force to be controlled based on deflection versus z-distance calibration curves. For these experiments, four sites with different lithium concentration were indented with varied indentation forces. Each indentation duration was held for 10 seconds. After unloading the indentation, tapping mode AFM surface morphology images were taken and the indentation depths were measured.\n\nElectrochemical properties were investigated by making coin cells and performing impedance spectroscopy measurement and galvanostatic cycling. The thin film samples with $14 \\mathrm{~mm}$ diameter were punched out from the silicon-rich region and lithium-rich region. The electrolyte was $1.2 \\mathrm{M} \\mathrm{LiPF}_{6}$ in a 1:1 (volume) ethylene carbonate (EC) and dimethyl carbonate (DMC) mixture. Lithium metal was used as counter/reference electrode. The cells were first charged to $1.5 \\mathrm{~V}$ (vs. $\\mathrm{Li}^{+} / \\mathrm{Li}$ hereafter) and then discharged to $50 \\mathrm{mV}$. Impedance evolution was investigated by collecting spectrums of a fresh electrode and an exposed electrode to an electrolyte for 24 hours, respectively. AC impedance data of a coin cell was collected in a frequency range of $100 \\mathrm{KHz}$ to $10 \\mathrm{mHz}$. The solid-state AC impedance data of thin films deposited on interdigitated platinum electrodes were collected in a frequency range of $1 \\mathrm{MHz}$ to $1 \\mathrm{~Hz}$.\n\nPhase stability was examined computationally by constructing a phase diagram from density functional theory (DFT) calculations. DFT calculations were performed, using the Vienna Ab-initio Simulation Package (VASP) ${ }^{19-20}$, on known crystalline phase in the Li-Si-O system, found on the Materials Project. ${ }^{19}$ Calculations used the Projector Augmented Wave (PAW) method with the Generalized Gradient Approximation(GGA) Perdew-Burke-Ernzerhof (PBE) framework.21-22 Structure optimization calculations allowed all atomic positions and lattice parameters to relax. DFT calculations parameters plane wave cutoff of $520 \\mathrm{eV}$ and a minimum reciprocal lattice k-point density of $64 / \\AA^{3}$. The Python Materials Genomics package (pymatgen) was used to construct phase diagram of the $\\mathrm{Li}_{\\mathrm{x}} \\mathrm{SiO}_{y}$ system.. ${ }^{23-24}$ Additionally, bulk moduli were computed by fitting the Rose-Vinet equation ${ }^{25}$ of state to the calculated energies and volumes of a series of deformed structures for the amorphous materials.\n\n\\section{Results and Discussion}\n\\section{Deposition and characterization}\nHigh-throughput experimental combinatorial methods have been applied in materials science for discovery and optimization of various functional materials ${ }^{26-27}$. These methods are also well suited to electrochemical applications such as fuel cells and lithium ion batteries. ${ }^{28-29}$ In this work, a combinatorial approach was applied to screen properties of lithium silicon compounds with different composition. The combinatorial chamber geometry is depicted in Figure 1 . The lithium target was $8 \\mathrm{~cm}$ away facing the substrate, and silicon target was $12 \\mathrm{~cm}$ at an angle with respect to the substrate. Due to this geometry, the deposited films have higher $\\mathrm{Si} / \\mathrm{Li}$ ratio in the region closer to silicon source, and lower $\\mathrm{Si} / \\mathrm{Li}$ ratio in the region further from the silicon source. From these experiments, we found that the target to substrate distance has strong effect on the oxygen content in the film: the shorter the target-substrate distance is, the lower the oxygen content is. This trend can be explained by the decreased reaction of lithium plasma particles with oxygen contaminants in the chamber resulting from $\\mathrm{H}_{2} \\mathrm{O}$ base pressure. Further, the oxygen content in the film can be minimized by increasing the deposition rate by increasing the power applied to Li and Si targets. However, the power applied to Li target cannot be too high to avoid Li melting.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a007c3865721f379b39g-09_1378_2091_686_1472}\n\\end{center}\n\nFigure 1. Chamber geometry used to deposit $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ thin films\n\nIn Figure 2, depth profiles are shown for Li1s, Si2p and O1s core level spectra, for both lithium-rich and silicon-rich regions of the thin film. From the XPS depth-profile, significant oxidation was observed at the surface, even though the samples were protected from ambient atmosphere during the transfer from the deposition to the characterization instrument. Figure S1 shows the experimental spectra (and the corresponding peak fits) obtained from the bulk of the film. Compositions obtained via peak-fitting these spectra are listed in Table S1. As can be seen from the XPS fitting results in Table S1, for both lithium-rich and silicon-rich side of the film, lithium silicate and lithium silicide are the main components in the film, with some contribution from $\\mathrm{SiO}_{2}$. The average compositions for lithium-rich area and silicon-rich area are $\\mathrm{Li}_{4.88} \\mathrm{Si}_{2.85} \\mathrm{O}_{2.52}$ and $\\mathrm{Li}_{1.58} \\mathrm{Si}_{1.31} \\mathrm{O}_{1.95}$, respectively. Hence, the thin film is subsequently referred to as a $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ composite film. We note that the lithium-rich area has more lithium and more O compared to the silicon-rich area. Higher oxygen content in lithium-rich area results from the higher affinity of lithium to oxygen.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a007c3865721f379b39g-10_1488_2176_454_1687}\n\\end{center}\n\nFigure 2. XPS depth profile analysis of $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ composite thin film on copper foil for (a) Si-rich region, and (b) Li-rich region. The top panels show binding energy depth profile of $\\mathrm{O}$ 1s (green); Si $2 \\mathrm{p}$ (red); Li 1s (blue). The bottom panel shows atomic percentage as a function a sputter depth.\n\nThe ternary phase diagram in Figure 3 shows the stability of crystalline compositions within the Li-Si-O phase space as predicted by DFT calculations. Nodes represent compositions of stable crystalline phases, while lines and triangles depict twophase and 3 phase regions, respectively. The \"phase diagram\" of the amorphous structures is much more difficult to calculate, but it may be expected to be similar. Following the dashed line, the phase diagram predicts the possible lithiation products of $\\mathrm{SiO}_{2}$ to be lithium silicides, lithium silicates and $\\mathrm{Li}_{2} \\mathrm{O}$ depending on the degree of lithiation. For example, fully lithiated $\\mathrm{SiO}_{2}$ is predicted as a mixture of $\\mathrm{Li}_{21} \\mathrm{Si}_{5}$, $\\mathrm{Li}^{\\text {, and }}$ $\\mathrm{Li}_{2} \\mathrm{O}$. The films studied in this work are amorphous according to $\\mathrm{x}$-ray diffraction, and thus can be considered as the lithiation products of the amorphous $\\mathrm{SiO}_{2}$ layer on $\\mathrm{Si}$ surface. Observed lithium-rich and silicon-rich areas represent different lithiation stages of the $\\mathrm{SiO}_{2}$ film.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a007c3865721f379b39g-11_1853_2419_752_1416}\n\\end{center}\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_9a007c3865721f379b39g-12_245_308_240_1885}\\\\\npredicted lithiation trajectory from $\\mathrm{SiO}_{2}$.\n\n\\section{Scanning probe microscopy (SPM)}\nSPM-based nano-indentation measurements were performed on $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ thin films and a reference Si sample. Surface morphology is depicted in Figure S2a, indicating film roughness of $20 \\mathrm{~nm}$ in an area $0.5 \\mu \\mathrm{m}$ by $0.5 \\mu \\mathrm{m}$. Figure S2b shows typical residual indentation imprints of film reflecting the film behavior upon different force loads.\n\nThe mechanical response from the lithium-rich and silicon-rich $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ are shown in Figure 4a. In the lithium-rich area, a linear increase of indentation depth with the load was observed in a force range of 5-55 $\\mu \\mathrm{N}$, indicating ductile behaviour. In contrast, the silicon-rich area of $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ shows a brittle behaviour: here the probe easily broke through the film and the cracks propagated, independent on the load in the force range. Figure $4 \\mathrm{~b}$ shows a scan in AFM height mode of the six indentation points on both silicon-rich and lithium-rich regions. The magnified images in both height and phase AFM modes (Figure S3) also show difference between ductile and brittle behavior.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a007c3865721f379b39g-13_279_946_453_1694}\n\\end{center}\n\nFigure 4. a) Indentation depth at different sites with increasing indentation force aligned with each valley in the curve; b) AFM images of indented film at both silicon-rich and lithium-rich regions.\n\nTo visualize the transition better, the indentation depth is plotted against the changing lithium concentration in the combinatorial sample in Figure S4. An inflection point, Where the indentation depth increases sharply at low Li content, is due to cracking of the film in a brittle manner. Computational results for the different amorphous structure configurations (see Figure 5) confirms this trend: higher lithium concentration both in $\\mathrm{Si}$ and $\\mathrm{SiO}_{2}$ causes a decrease of the bulk moduli. We note that the film is composed of both lithium silicide and lithium silicates and hence it combines the mechanical properties of both materials. Incidentally, the film composition falls close to the critical transition point of Li/Si=1:1. Reference crystalline Si showed a very hard behavior, i.e., the indentation depth is $0 \\mathrm{~nm}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a007c3865721f379b39g-14_249_813_672_1437}\n\\end{center}\n\nFigure 5. Calculated bulk moduli of lithiated silicon and lithiated $\\mathrm{SiO}_{2}$ plotted against the degree of lithiation of these amorphous structures. Error bars correspond to the different configurations of the amorphous structure.\n\n\\section{Electrochemical impedance and cycling}\nTo obtain further insight into the chemical reactivity of $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ composite films, a 50nm thick sample was assembled into a coin cell and investigated by impedance spectroscopy and by galvanostatic charge and discharge measurements (Figure 6). Capacity is not normalized in this work since all the films have the same thickness and area. As shown in Figure $6 a$, a low amount of lithium could be extracted from the film even up to $1.5 \\mathrm{~V}$ during the first charge cycle. This high OCV is due to the lower electrochemical potential of lithium in $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ which has part of lithium bonded with oxygen. To investigate the reaction of the $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ composite film with electrolyte, it was measured by AC impedance at the open circuit voltage, as shown in Figure $6 \\mathrm{~b}$. When the $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ composite film comes into contact with electrolyte, the charge transfer resistance increases with time. In contrast, for the silicon electrode the impedance is not time dependent at open circuit voltage.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_9a007c3865721f379b39g-15_472_1056_360_1776}\n\nFigure 6. a) Voltage profile of lithium-rich $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ composite film and silicon-rich $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ composite film; b) Impedance evolution of lithium-rich $\\mathrm{Li}_{\\mathrm{x}} \\mathrm{SiO}_{\\mathrm{y}}$ composite and siliconrich $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ composite as well as Si film.\n\nThe higher charge transfer resistance of $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$, as compared to $\\mathrm{Si}$, is likely to originate from the resulting $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ surface-electrolyte interface. The higher the lithium concentration in the compound, the lower the potential vs. lithium, which promotes reduction reactions with the electrolyte. During charging, as $\\mathrm{SiO}_{2}$ is lithiated to $\\mathrm{LixSiOy}$, this increased reactivity may lead to further consumption of electrolyte if $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ is exposed and not fully covered with the other chemically stable electrolyte decomposition products. There has been literature ${ }^{30}$ discussing reduction mechanisms of ethylene carbonate on the lithium silicide surface which identify different mechanisms depending on the degree of lithiation. Higher concentration of lithium was found to be more reactive due to the explicit interaction of $\\mathrm{EC}$ molecules with $\\mathrm{Li}^{+}$ions at the surface. In addition, recent experiment work by our group found that both lithium silicide and lithium silicate react with electrolyte, and form fluoride and carbonate species which are commonly seen in the SEI components. ${ }^{31-32}$ Computational work also demonstrate that chemistrydependent interaction happens on the surface of lithium silicide with electrolyte. ${ }^{33} \\mathrm{We}$ note that increased lithiation of $\\mathrm{SiO}_{2}$ leads to increased reactivity with the electrolyte, and consumes lithium inventory.\n\nImpedance of the as-prepared $\\mathrm{Li}_{\\mathrm{x}} \\mathrm{SiO}_{\\mathrm{y}}$ thin film on interdigitated electrode (without any electrolyte exposure) is shown in Figure S5. This thin film behaves like a pure resistor, which is mainly due to the existence of lithium silicide in the film. Total conductivity is dominated by electronic conductivity. The total conductivity of a LixSiOy thin film is calculated as\n\n\\[\n\\sigma=\\mathrm{L} /\\left(\\mathrm{R}^{*} \\mathrm{~A}\\right)\n\\]\n\nwhere $\\sigma$ is the conductivity, $\\mathrm{L}$ is the distance between the $\\mathrm{Pt}$ digits and $\\mathrm{A}$ is the total contacting area. The conductivity $\\sigma$ is calculated to be $2.7 \\mathrm{~S} / \\mathrm{cm}$, which is too high to be a good SEI layer.\n\nTo correlate the measured $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ properties with the electrochemical cycling performance of an electrode with $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ at the surface, a double layer sample was deposited with $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ on top of a silicon thin film, and compared to a Si film. The thickness of $\\mathrm{Li}_{\\mathrm{x}} \\mathrm{SiO}_{\\mathrm{y}}$ was set to $10 \\mathrm{~nm}$ to emulate the native oxide thickness, and the thickness of silicon thin film was set to $50 \\mathrm{~nm}$, as shown in the inset in Figure 7a. As shown in Figure 7a, during the first cycle discharge profile, $\\mathrm{Li}_{x} \\mathrm{SiO}_{y} / \\mathrm{Si}$ exhibited a lower OCV of only $1.5 \\mathrm{~V}$ (comparted to $2.5 \\mathrm{~V}$ for $\\mathrm{Si}$ ), due to the existing lithium on the silicon surface. The difference of the CV profiles above $0.25 \\mathrm{~V}$ (before Si starts lithiating) results from the surface reaction between $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ and electrolyte. Both low potential of $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ and its reaction products make the electrochemical reduction different than that in the silicon case. The lower potential range profiles for both films are very similar, since the same thickness of silicon film was deposited. The cycling of $\\mathrm{Li}_{x} \\mathrm{SiO}_{y} / \\mathrm{Si}$ showed a lower columbic efficiency and less stable performance as compared to the bare silicon (see Figure 7b). We note that the columbic efficiency of silicon is higher than that of the $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ -coated $\\mathrm{Si}$, indicating that the $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ film exhibits a greater reactivity with electrolyte. We hypothesize that the $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ composite film continuously reacts with the electrolyte, preventing the stabilization of the SEI on the silicon electrode. These results suggest that $\\mathrm{SiO}_{2}$ does not help stabilize the surface of the $\\mathrm{Si}$ electrode, as the lithiation products are not stable upon cycling. Previously, there has been study ${ }^{34}$ the effect of $\\mathrm{SiO}_{2}$ with various thickness from $2 \\mathrm{~nm}, 7 \\mathrm{~nm}$ to $10 \\mathrm{~nm}$. Only the $7 \\mathrm{~nm} \\mathrm{SiO}_{2}$ coated $\\mathrm{Si}$ showed the improved performance compared to Si. This is a complimentary result from both mechanical property and reactivity. More studies of the reactant product between $\\mathrm{Li}_{\\mathrm{x}} \\mathrm{SiO}_{y}$ and electrolyte are in progress to clarify the role of $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ in the functionality and SEI stabilization of the Si anode.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_9a007c3865721f379b39g-18_263_843_326_1786}\n\nFigure 7. a) Charge and discharge profile of $\\mathrm{Si}$ and $\\mathrm{Li}_{x} \\mathrm{SiO}_{y} / \\mathrm{Si}$, with inset picture shows the schematic of double layer thin film; b) Cycle performance and Columbic efficiency of double layer thin film and pure silicon.\n\n\\section{Conclusions}\nIn summary, mechanical and electrochemical properties, as well as the chemical reactivity of the $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ composite thin film with $\\mathrm{Li}$ to $\\mathrm{Si}$ ratio between $1.7$ and $1.1$ were investigated. These $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ films with $\\mathrm{Li}$-rich and Si-rich compositions were prepared by combinatorial sputtering, as a model system to study the initial products of lithiation of native oxide $\\mathrm{SiO}_{2}$ layer on a $\\mathrm{Si}$ anode, relevant for next-generation Li-ion batteries. Firstprinciples computational results show that both lithiated silicon and lithiated $\\mathrm{SiO}_{2}$ transition from brittle to ductile behavior as lithiation happens. The as-synthesized composite $\\mathrm{Li}_{x} \\mathrm{SiO}_{y}$ film, which is a mixture of lithium silicides and lithium silicates, shows an equivalent brittle to ductile transition. The intermediate product of lithiated $\\mathrm{SiO}_{2}$, which contains lithium silicates and lithium silicates, is highly reactive with the electrolyte, due to the low potential resulting from high lithium content. These composite $\\mathrm{Li}_{\\mathrm{x}} \\mathrm{SiO}_{\\mathrm{y}}$ with $\\mathrm{Li} / \\mathrm{Si}=1.7$ and $\\mathrm{Li} / \\mathrm{Si}=1.1$ showed low electronic resistance and did not facilitate the passivation and stabilization of the Si films, despite their low resistance to fracture. Thus, a favorable ductile mechanical property is found to be a desirable but insufficient criterion for stable SEI formation; low chemical reactivity and low electronic conductivity are also important for stable electrodes.\n\n\\section{ASSOCIATED CONTENT}\nSupporting Information. XPS spectrum, AFM images and impedance data. The Supporting information is available free of charge.\n\n\\section{AUTHOR INFORMATION}\n\\section{Notes}\nThere are no conflicts to declare.\n\n\\section{Corresponding Author}\n*Andriy Zakutayev. Email: \\href{mailto:Andriy.Zakutayev@nrel.gov}{Andriy.Zakutayev@nrel.gov}. Materials Science Center, National Renewable Energy Laboratory, Golden, CO, 80401, USA\n\n\\section{Author Contributions}\nThe manuscript was written through contributions of all authors. All authors have given approval to the final version of the manuscript.\n\n\\section{ACKNOWLEDGEMENTS}\nThis work was authored by the National Renewable Energy Laboratory, operated by Alliance for Sustainable Energy, LLC, for the U.S. Department of Energy (DOE) under Contract No. DE-AC36-08GO28308. Funding provided by Funding provided by Vehicle Technologies Office, Hybrid Electric Systems Program. David Howell (Manager), Battery R\\&D, Brian Cunningham and Peter Faguy (Technology Managers), at the U.S. Department of Energy, Office of Energy Efficiency and Renewable Energy, are gratefully acknowledged. A portion of the research was performed using computational resources sponsored by the Department of Energy's Office of Energy Efficiency and Renewable Energy and located at the National Renewable Energy Laboratory. Computational resources of the National Energy Research Scientific Computing Center (NERSC), a U.S. Department of Energy Office of Science User Facility operated under Contract No. DEAC02-05CH11231, are gratefully acknowledged. The views expressed in the article do not necessarily represent the views of the DOE or the U.S. Government.\n\n\\section{REFERENCES}\n(1) Franco Gonzalez, A.; Yang, N.-H.; Liu, R.-S. Silicon Anode Design for Lithium-Ion Batteries: Progress and Perspectives. The Journal of Physical Chemistry C 2017, 121, 2777527787, DOI: 10.1021/acs.jpcc.7b07793.\n\n(2) Zhu, J.; Wang, T.; Fan, F.; Mei, L.; Lu, B. Atomic-Scale Control of Silicon Expansion Space as Ultrastable Battery Anodes. ACS Nano 2016, 10, 8243-8251, DOI:\n\n10.1021/acsnano.6b04522.\n\n(3) Cheng, X.-B.; Zhang, R.; Zhao, C.-Z.; Wei, F.; Zhang, J.-G.; Zhang, Q. A Review of Solid Electrolyte Interphases on Lithium Metal Anode. Advanced Science 2016, 3, 1500213-n/ a, DOI: 10.1002/advs. 201500213.\n\n(4) Xu, W.; Wang, J.; Ding, F.; Chen, X.; Nasybulin, E.; Zhang, Y.; Zhang, J.-G. Lithium metal anodes for rechargeable batteries. Energy E Environmental Science 2014, 7, 513-537, DOI: 10.1039/C3EE40795K. (5) Aurbach, D. Review of Selected Electrode-solution Interactions which Determine the Performance of Li and Li ion Batteries. Journal of Power Sources 2000, 89, 206-218, DOI: \\href{https://doi.org/10.1016/S0378-7753(00)00431-6}{https://doi.org/10.1016/S0378-7753(00)00431-6}.\n\n(6) $\\mathrm{Xu}, \\mathrm{K}$. Electrolytes and Interphases in Li-Ion Batteries and Beyond. Chemical Reviews 2014, 114, 11503-11618, DOI: 10.1021/cr500003w.\n\n(7) Yang, C. R.; Wang, Y. Y.; Wan, C. C. Composition Analysis of the Passive Film on the Carbon Electrode of a Lithium-ion Battery with an EC-based Electrolyte. Journal of Power Sources 1998, 72, 66-70, DOI: \\href{https://doi.org/10.1016/S0378-7753(97)02655-4}{https://doi.org/10.1016/S0378-7753(97)02655-4}.\n\n(8) Young, B. T.; Heskett, D. R.; Nguyen, C. C.; Nie, M.; Woicik, J. C.; Lucht, B. L. Hard X-ray Photoelectron Spectroscopy (HAXPES) Investigation of the Silicon Solid Electrolyte Interphase (SEI) in Lithium-Ion Batteries. ACS Applied Materials \\& Interfaces 2015, 7, 20004-20011, DOI: 10.1021/acsami.5b04845.\n\n(9) Lindgren, F.; Xu, C.; Niedzicki, L.; Marcinek, M.; Gustafsson, T.; Björefors, F.;\n\nEdström, K.; Younesi, R. SEI Formation and Interfacial Stability of a Si Electrode in a LiTDI-Salt Based Electrolyte with FEC and VC Additives for Li-Ion Batteries. ACS Applied Materials \\& Interfaces 2016, 8, 15758-15766, DOI: 10.1021/acsami.6b02650.\n\n(10) Weadock, N.; Varongchayakul, N.; Wan, J.; Lee, S.; Seog, J.; Hu, L. Determination of mechanical properties of the SEI in sodium ion batteries via colloidal probe microscopy. Nano Energy 2013, 2, 713-719, DOI: \\href{https://doi.org/10.1016/j.nanoen.2013.08.005}{https://doi.org/10.1016/j.nanoen.2013.08.005}. (11) Dupré, N.; Moreau, P.; De Vito, E.; Quazuguel, L.; Boniface, M.; Bordes, A.; Rudisch, C.; Bayle-Guillemaud, P.; Guyomard, D. Multiprobe Study of the Solid Electrolyte Interphase on Silicon-Based Electrodes in Full-Cell Configuration. Chemistry of Materials 2016, 28, 2557-2572, DOI: 10.1021/acs.chemmater.5b04461.\n\n(12) Zhao, J.; Lee, H.-W.; Sun, J.; Yan, K.; Liu, Y.; Liu, W.; Lu, Z.; Lin, D.; Zhou, G.; Cui, Y. Metallurgically Lithiated $\\mathrm{SiO}<\\mathrm{sub}>\\mathrm{x}<$ /sub $>$ Anode with High Capacity and Ambient Air Compatibility. Proceedings of the National Academy of Sciences 2016, 113, 7408-7413, DOI: 10.1073/pnas.1603810113.\n\n(13) Zhang, Y.; Li, Y.; Wang, Z.; Zhao, K. Lithiation of SiO2 in Li-Ion Batteries: In Situ Transmission Electron Microscopy Experiments and Theoretical Studies. Nano Letters 2014, 14, 7161-7170, DOI: 10.1021/nl503776u.\n\n(14) Radvanyi, E.; De Vito, E.; Porcher, W.; Jouanneau Si Larbi, S. An XPS/AES Comparative Study of the Surface Behaviour of Nano-silicon Anodes for Li-ion Batteries. Journal of Analytical Atomic Spectrometry 2014, 29, 1120-1131, DOI:\n\n10.1039/C3JA50362C.\n\n(15) Philippe, B.; Dedryvère, R.; Gorgoi, M.; Rensmo, H.; Gonbeau, D.; Edström, K. Role of the LiPF6 Salt for the Long-Term Stability of Silicon Electrodes in Li-Ion Batteries - A Photoelectron Spectroscopy Study. Chemistry of Materials 2013, 25, 394-404, DOI: $10.1021 / \\mathrm{cm} 303399 \\mathrm{v}$.\n\n(16) Delpuech, N.; Mazouzi, D.; Dupré, N.; Moreau, P.; Cerbelaud, M.; Bridel, J. S.; Badot, J. C.; De Vito, E.; Guyomard, D.; Lestriez, B.; Humbert, B. Critical Role of Silicon Nanoparticles Surface on Lithium Cell Electrochemical Performance Analyzed by FTIR, Raman, EELS, XPS, NMR, and BDS Spectroscopies. The Journal of Physical Chemistry C 2014, 118, 17318-17331, DOI: 10.1021/jp503949y. (17) Seah, M. P.; Gilmore, I. S.; Beamson, G. XPS: Binding Energy Calibration of Electron Spectrometers 5-Re - evaluation of the Reference Energies. Surface and Interface Analysis 1998, 26, 642-649, DOI: 10.1002/(SICI)1096-9918(199808)26:9<642::AIDSIA408>\\href{http://3.0.CO}{3.0.CO};2-3.\n\n(18) Schmid, M.; Steinrück, H. P.; Gottfried, J. M. A new asymmetric Pseudo - Voigt function for more efficient fitting of XPS lines. Surface and Interface Analysis 2014, 46, 505511, DOI: 10.1002/ sia.5521.\n\n(19) Jain, A.; Ong, S. P.; Hautier, G.; Chen, W.; Richards, W. D.; Dacek, S.; Cholia, S.; Gunter, D.; Skinner, D.; Ceder, G.; Persson, K. A. Commentary: The Materials Project: A materials genome approach to accelerating materials innovation. APL Materials 2013, 1, 011002, DOI: 10.1063/1.4812323.\n\n(20) Kresse, G.; Furthmüller, J. Efficient Iterative Schemes for Ab initio Total-energy Calculations Using a Plane-wave Basis Set. Physical Review B 1996, 54, 11169-11186, DOI: 10.1103/PhysRevB.54.11169.\n\n(21) Blöchl, P. E. Projector Augmented-wave Method. Physical Review B 1994, 50, 1795317979, DOI: 10.1103/PhysRevB.50.17953.\n\n(22) Perdew, J. P.; Burke, K.; Ernzerhof, M. Generalized Gradient Approximation Made Simple. Physical Review Letters 1996, 77 (18), 3865-3868, DOI:\n\n10.1103/PhysRevLett.77.3865.\n\n(23) Ong, S. P.; Wang, L.; Kang, B.; Ceder, G. Li-Fe-P-O2 Phase Diagram from First Principles Calculations. Chemistry of Materials 2008, 20, 1798-1807, DOI:\n\n10.1021/cm702327g.\n\n(24) Ong, S. P.; Richards, W. D.; Jain, A.; Hautier, G.; Kocher, M.; Cholia, S.; Gunter, D.; Chevrier, V. L.; Persson, K. A.; Ceder, G. Python Materials Genomics (pymatgen): A robust, open-source python library for materials analysis. Computational Materials Science 2013, 68, 314-319, DOI: https:// \\href{http://doi.org/10.1016/j.commatsci.2012.10.028}{doi.org/10.1016/j.commatsci.2012.10.028}.\n\n(25) Vinet, P.; Smith, J. R.; Ferrante, J.; Rose, J. H. Temperature Effects on the Universal Equation of State of Solids. Physical Review B 1987, 35, 1945-1953, DOI:\n\n10.1103/PhysRevB.35.1945.\n\n(26) Green, M. L.; Takeuchi, I.; Hattrick-Simpers, J. R. Applications of High-throughput (combinatorial) Methodologies to Electronic, Magnetic, Optical, and Energy-related Materials. Journal of Applied Physics 2013, 113, 231101, DOI: 10.1063/1.4803530. (27) Green, M. L.; Choi, C. L.; Hattrick-Simpers, J. R.; Joshi, A. M.; Takeuchi, I.; Barron, S. C.; Campo, E.; Chiang, T.; Empedocles, S.; Gregoire, J. M.; Kusne, A. G.; Martin, J.; Mehta, A.; Persson, K.; Trautt, Z.; Van Duren, J.; Zakutayev, A. Fulfilling the Promise of the Materials Genome Initiative with High-throughput Experimental Methodologies. Applied Physics Reviews 2017, 4, 011105, DOI: 10.1063/1.4977487.\n\n(28) Muster, T. H.; Trinchi, A.; Markley, T. A.; Lau, D.; Martin, P.; Bradbury, A.; Bendavid, A.; Dligatch, S. A Review of High-throughput and Combinatorial Electrochemistry. Electrochimica Acta 2011, 56, 9679-9699, DOI: \\href{https://doi.org/10.1016/j.electacta.2011.09.003}{https://doi.org/10.1016/j.electacta.2011.09.003}. (29) Carey, G. H.; Dahn, J. R. Combinatorial Synthesis of Mixed Transition Metal Oxides for Lithium-Ion Batteries. ACS Combinatorial Science 2011, 13, 186-189, DOI:\n\n$10.1021 / \\operatorname{co1000597.}$\n\n(30) Martinez de la Hoz, J. M.; Leung, K.; Balbuena, P. B. Reduction Mechanisms of Ethylene Carbonate on $\\mathrm{Si}$ Anodes of Lithium-Ion Batteries: Effects of Degree of Lithiation and Nature of Exposed Surface. ACS Applied Materials $\\mathcal{E}$ Interfaces 2013, 5, 13457-13465, DOI: 10.1021/am404365r.\n\n(31) Jaclyn Coyle, M. B., Christopher Apblett, Conrad Stoldt Investigating Chemical Reactivity of Lithium Silicate Model SEI Layers. in preparation.\n\n(32) Yun Xu, K. W., Jaclyn Coyle, Chaiwat Engtrakul, Glenn Teeter, Conrad Stoldt, Anthony Burrell, Andriy Zakutayev. Early Stage Solid Electrolyte Interphase Formation on Lithium Lilicide. in preparation.\n\n(33) Martinez de la Hoz, J. M.; Soto, F. A.; Balbuena, P. B. Effect of the Electrolyte Composition on SEI Reactions at Si Anodes of Li-Ion Batteries. The Journal of Physical Chemistry C 2015, 119, 7060-7068, DOI: 10.1021/acs.jpcc.5b01228.\n\n(34) Sim, S.; Oh, P.; Park, S.; Cho, J. Critical Thickness of SiO2 Coating Layer on Core@Shell Bulk@Nanowire Si Anode Materials for Li-Ion Batteries. Advanced Materials 2013, 25, 4498-4503, DOI: 10.1002/ adma.201301454. Table of contents\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_9a007c3865721f379b39g-24_371_680_684_1473}\n\\end{center}\n\n\n\\end{document}", "record_id": "2023_09_22_9a007c3865721f379b39g"}