{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{HHS Public Access }\n\n\\author{}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\DeclareUnicodeCharacter{2021}{$\\ddagger$}\n\n\\begin{document}\n\\maketitle\nAuthor manuscript\n\nJ Am Chem Soc. Author manuscript; available in PMC 2018 May 29.\n\nPublished in final edited form as:\n\nJ Am Chem Soc. 2018 April 25; 140(16): 5544–5559. doi:10.1021/jacs.8b01822.\n\n\\section{NRVS Studies of the Peroxide Shunt Intermediate in a Rieske Dioxygenase and Its Relation to the Native $\\mathrm{Fe}^{\\text {\"I }} \\mathrm{O}_{2}$ Reaction}\nKyle D. Sutherlin ${ }^{\\dagger}$, Brent S. Rivard ${ }^{\\ddagger}$, Lars H. Böttger $^{\\dagger}$, Lei V. Liu , Melanie S. Rogers $^{\\dagger}$, Martin Srnec $^{\\dagger}, \\S$, Kiyoung Park ${ }^{\\dagger}, \\|$, Yoshitaka Yoda ${ }^{\\perp}$, Shinji Kitao ${ }^{\\#}$, Yasuhiro Kobayashi , $^{\\#}$, Makina Saito $^{\\#}$, Makoto Seto ${ }^{\\#}$, Michael $\\mathrm{Hu}^{\\otimes}$, Jiyong Zhao ${ }^{\\otimes}$, John D. Lipscomb $^{\\star}, \\ddagger$, and Edward I. Solomon ${ }^{*}, t, \\nabla$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-01_817_869_304_1670}\n\\end{center}\n\n‡ Department of Biochemistry, Molecular Biology, \\& Biophysics, University of Minnesota, Minneapolis, Minnesota 55455, United States\n\n§J. Heyrovskýlnstitute of Physical Chemistry, The Czech Academy of Sciences, Dolejškova 2155/3, 18223 Prague 8, Czech Republic\n\nIIDepartment of Chemistry, KAIST, Daejeon 34141, Republic of Korea\n\n${ }^{\\perp}$ Japan Synchrotron Radiation Research Institute, Hyogo 679-5198, Japan\n\n\\#Research Reactor Institute, Kyoto University, Osaka 590-0494, Japan\n\n${ }^{\\otimes}$ Advanced Photon Source, Argonne National Laboratory, Lemont, Illinois 60439, United States\n\n${ }^{\\nabla}$ SLAC National Accelerator Laboratory, Menlo Park, California 94025, United States\n\n\\begin{abstract}\nThe Rieske dioxygenases are a major subclass of mononuclear nonheme iron enzymes that play an important role in bioremediation. Recently, a high-spin Fe III_-(hydro)-peroxy intermediate (BZDOp) has been trapped in the peroxide shunt reaction of benzoate 1,2-dioxygenase. Defining the structure of this intermediate is essential to understanding the reactivity of these enzymes. \n Nuclear resonance vibrational spectroscopy (NRVS) is a recently developed synchrotron technique\n\\end{abstract}\n\n*Corresponding Authors: \\href{mailto:edward.solomon@stanford.edu}{edward.solomon@stanford.edu}, \\href{mailto:lipsc001@umn.edu}{lipsc001@umn.edu}.\n\nORCID\n\nJohn D. Lipscomb: 0000-0002-8158-5594\n\nEdward I. Solomon: 0000-0003-0291-3199\n\nNotes\n\nThe authors declare no competing financial interest.\n\nASSOCIATED CONTENT\n\nThe Supporting Information is available free of charge on the ACS Publications website at DOI: 10.1021/jacs.8b01822.\n\nMethods for measuring $\\mathrm{pH}$ dependence of native $\\mathrm{O}_{2}$ reaction in BZDO; computational method for calculation of inner-sphere reorganization energy; analysis of PCET using the coordinated water as a proton source; analysis of PCET to a 5C peroxy-bridged intermediate followed by epoxide binding; EPR spectra of BZDO $\\mathrm{OX}$ and BZDOp NRVS samples; ${ }^{16} \\mathrm{O}$ and ${ }^{18} \\mathrm{O}$ BZDOp NRVS data comparison; DFT structures of BZDOp candidates; LUMO of BZDOp; DFT structures of species along the BZDOp reaction coordinate; FMOs of intermediates in the BZDOp reaction coordinate; DFT structures of species along the superoxo attack coordinate; DFT structures of species along the epoxide formation and opening coordinate; 1D transit for direct attack of hydroxide on the epoxide; stopped flow traces of single turnover reactions of reduced BZDO with $\\mathrm{O}_{2}$ in the presence of benzoate at $\\mathrm{pH} 6.8$ and 8.0; DFT structures of 5C peroxy bridge and $\\mathrm{Fe}(\\mathrm{OH})$ epoxide species; 1D transit for epoxide binding to Fe; table of NRVS and DFT vibrational parameters; table of DFT structural parameters for BZDOp candidate species (PDF) that is ideal for obtaining vibrational, and thus structural, information on Fe sites, as it gives complete information on all vibrational normal modes containing Fe displacement. In this study, we present NRVS data on BZDOp and assign its structure using these data coupled to experimentally calibrated density functional theory calculations. From this NRVS structure, we define the mechanism for the peroxide shunt reaction. The relevance of the peroxide shunt to the native $\\mathrm{Fe}^{\\mathrm{II}} / \\mathrm{O}_{2}$ reaction is evaluated. For the native $\\mathrm{Fe}^{\\mathrm{II}} / \\mathrm{O}_{2}$ reaction, an $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo intermediate is found to react directly with substrate. This process, while uphill thermodynamically, is found to be driven by the highly favorable thermodynamics of proton-coupled electron transfer with an electron provided by the Rieske [2Fe-2S] center at a later step in the reaction. These results offer important insight into the relative reactivities of $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo and $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxo species in nonheme Fe biochemistry.\n\n\\section{Graphical Abstract}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-02_857_1138_668_1435}\n\\end{center}\n\n\\section{INTRODUCTION}\nMononuclear nonheme iron (NHFe) enzymes are abundant in nature and catalyze a variety of reactions of $\\mathrm{O}_{2}$ with organic substrates. ${ }^{1-3}$ The majority of these enzymes use an $\\mathrm{Fe}^{\\mathrm{II}}$ site ligated by a facial triad of two His residues and one Glu/Asp carboxylate residue, which remain 6-coordinate (6C) until the substrate and any necessary cofactors are present in the active site. ${ }^{2,4,5}$ When these are all present, the active site becomes 5- coordinate (5C) through loss of a water ligand, allowing $\\mathrm{O}_{2}$ to bind to the $\\mathrm{Fe}^{\\mathrm{II}}$ site and become activated for reactivity. ${ }^{3}$ These $\\mathrm{NHFe}^{\\mathrm{II}}$ enzymes are divided into subclasses based on the source of the electrons used for the multielectron reduction of $\\mathrm{O}_{2}$, the nature of the substrate, and whether a cofactor is required. ${ }^{2}$ There has been much interest in characterizing the activated $\\mathrm{O}_{2}$ intermediates responsible for reacting with substrate. The most well-defined $\\mathrm{O}_{2}$ intermediates are $S=2 \\mathrm{Fe}^{\\mathrm{IV}}=\\mathrm{O}$ intermediates, ${ }^{6}$ which have been trapped in the pterindependent hydroxylases ${ }^{7}$ and the a-ketoglutarate-dependent enzymes. ${ }^{8}$ A low-spin $\\mathrm{Fe}^{\\mathrm{III}}$ $\\mathrm{OOH}$ intermediate that performs $\\mathrm{H}$ atom abstraction (HAA) has been trapped in the anticancer glycopeptide drug bleomycin, ${ }^{9}$ and high-spin $\\mathrm{Fe}^{\\text {III }}$-hydroperoxy model complexes have also been shown to exhibit electrophilic reactivities including HAA and sulfoxidation. ${ }^{10,11}$ An $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo species has been proposed as the reactive intermediate in isopenicillin $\\mathrm{N}$-synthase (IPNS). ${ }^{12}$ The one-electron reduction of $\\mathrm{O}_{2}$ to $\\mathrm{O}_{2}{ }^{\\cdot-}$ is unfavorable $(-0.16 \\mathrm{~V}){ }^{13}$ but in this enzyme, the thiolate substrate binds directly to the Fe, thereby lowering its $\\mathrm{Fe}^{\\mathrm{II}} / \\mathrm{Fe}^{\\mathrm{III}}$ reduction potential and making the formation of an $\\mathrm{Fe}^{\\mathrm{III}}-$ superoxide favorable. ${ }^{14}$ Indeed, recent experimental data coupled to calculations suggest that an $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo intermediate forms in the reaction IPNS with deuterated variants of its native substrate. ${ }^{15}$ An $S=2 \\mathrm{Fe}^{\\mathrm{III}}$-superoxo intermediate has also been trapped in an active site variant of the extradiol dioxygenase homoprotocatechuate 2,3-dioxygenase (HPCD) with a slow substrate; however, in native HPCD, no $\\mathrm{Fe}^{\\mathrm{III}}$ is observed during single turnover reactions, so it remains controversial whether a transient $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo is the catalytically relevant intermediate. ${ }^{16,17}$\n\nAnother important subclass of NHFe ${ }^{\\mathrm{II}}$ enzymes that is the focus of the present study is the Rieske oxygenases. In these enzymes, a high-spin $\\mathrm{Fe}^{\\mathrm{III}}$-peroxy level intermediate has been trapped in a peroxide shunt reaction, ${ }^{18}$ while recent single turnover kinetics data potentially implicate an $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo as an active intermediate in the native $\\mathrm{O}_{2}$ reaction. ${ }^{19}$ The Rieske oxygenases catalyze a range of diverse chemistries ${ }^{20}$ including monooxygenation, ${ }^{21}$ sulfoxidation, ${ }^{21}$ and desaturation. ${ }^{22}$ Most of the well-studied Rieske oxygenases are dioxygenases (RDOs) that catalyze the cis-dihydroxylation of aromatic rings ${ }^{23}$ and are important in bioremediation. ${ }^{24,25}$ In contrast to the $\\mathrm{NHFe}^{\\mathrm{II}}$ enzymes described above, the RDOs require an external source of electrons to activate $\\mathrm{O}_{2}$. As a result, a reductase and sometimes ferredoxin (fd) protein components are required in addition to the oxygenase component. The catalytically active oxygenase component ${ }^{26,27}$ consists of an $(\\alpha \\beta)_{3}$ or $\\alpha_{3}$ trimer, where each a subunit has a mononuclear $\\mathrm{NHFe}^{\\mathrm{II}}$ site and a [2Fe-2S] Rieske center. ${ }^{28}$ The head-to-tail quaternary structure places the $\\mathrm{NHFe}^{\\mathrm{II}}$ site of one subunit adjacent to the Rieske center of another subunit, and this combination forms the reactive unit. The Rieske\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_cb81fee8faa69f4d7078g-03_1111_1171_514_1774}\\\\\nform. $\\mathrm{O}_{2}$ activation and reaction with substrate occur at the catalytic mononuclear $\\mathrm{NHFe}^{\\mathrm{II}}$ site, and the Rieske center in a neighboring a subunit provides one electron to the $\\mathrm{NHFe}^{\\text {II }}$ site during the reaction through a hydrogen bond from a carboxylate residue at the interface of the two subunits. ${ }^{29}$ At the end of a single turnover cycle, both metal centers are oxidized, indicating that 2 electrons are required for the oxygen activation reaction. ${ }^{30}$ In order to start the next reaction cycle, the reductase/fd must provide two electrons to reduce the RDO metal centers. From magnetic circular dichroism (MCD) measurements on the RDO naphthalene dioxygenase (NDO), it is known that the $\\mathrm{NHFe}^{\\mathrm{II}}$ site becomes $5 \\mathrm{C}$ only when substrate is present. This opening of a coordination site on the iron in combination with structural changes occurring upon reduction of the Rieske center prime the site for $\\mathrm{O}_{2}$ reactivity. ${ }^{31,32}$ Crystal structures for many members of the RDO family have been solved, ${ }^{27,28,33-37}$ including some with substrates bound, ${ }^{37-40}$ which show that substrate does not coordinate to the $\\mathrm{Fe}^{\\mathrm{II}}$ but binds in its vicinity in a hydrophobic pocket. Two $\\mathrm{O}_{2}$-bound crystal structures have been solved, one in NDO with the alternative substrate indole bound ${ }^{37}$ and the other in carbazole 1,9a-dioxygenase (CARDO) with carbazole bound. ${ }^{39}$ Both structures show the $\\mathrm{NHFe}^{\\mathrm{II}}$ facial triad with one of the carboxylate side chains bound bidentate and the $\\mathrm{O}_{2}$ bound side-on. In the case of the CARDO, single-crystal optical spectra showed that the Rieske center is oxidized in this complex. The structural studies were complemented by the single turnover studies described above and by peroxide shunt experiments showing that hydrogen peroxide can provide both the oxygen and the two electrons required for turnover. 26,30 Together, these observations led to the proposal that the active intermediate in the RDOs is an $\\mathrm{Fe}^{\\mathrm{III}}$-peroxy or $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy species, where $\\mathrm{O}_{2}$ has been reduced by two electrons, one from the $\\mathrm{NHFe}^{\\mathrm{II}}$ site and one from the Rieske center. ${ }^{41}$ The four-electron reduced $\\mathrm{O}_{2}$ intermediate, an $\\mathrm{Fe}^{\\mathrm{V}}(\\mathrm{O})(\\mathrm{OH})$ species, has also been considered. ${ }^{30}$ As mentioned above, a solution-phase oxygen intermediate has been trapped in the RDO benzoate 1,2-dioxygenase (BZDO) using the peroxide shunt reaction, where $\\mathrm{H}_{2} \\mathrm{O}_{2}$ is reacted with an $\\mathrm{Fe}^{\\mathrm{III}}$ catalytic site and an oxidized Rieske center with the substrate, benzoate, already bound. ${ }^{18}$ This intermediate, BZDOp, forms the correct cis-dihydroxylated product, 1-carboxy-1,2-cis-dihydroxycyclohexa-3,5-diene (benzoate-cis-diol), but at a much slower rate than in the native $\\mathrm{O}_{2}$ reaction with the $\\mathrm{NHFe}^{\\mathrm{II}}$ site $^{18,19}\\left(5.8 \\times 10^{-4} \\mathrm{~s}^{-1}\\right.$ vs $190 \\mathrm{~s}^{-1}$, both pseudo first order single-turnover rates). This intermediate has been tentatively assigned as a high-spin $\\mathrm{Fe}^{\\text {III }}$-peroxy species on the basis of Mössbauer spectroscopy, with the binding mode of $\\mathrm{O}_{2}$, how this relates to the crystallographic intermediates, and protonation state of the $\\mathrm{O}_{2}$ unknown. ${ }^{18}$ The slow reactivity of BZDOp raises the question of whether it is relevant to the native $\\mathrm{O}_{2}$ reaction. Further, recent single-turnover kinetics on the native $\\mathrm{O}_{2}$ reaction in $\\mathrm{BZDO}$ indicate that the $\\mathrm{O}_{2}$-bound $\\mathrm{NHFe}^{\\mathrm{II}}$ site reacts with the substrate prior to Rieske center oxidation, which implicates an $\\mathrm{Fe}^{\\mathrm{III}}$-superoxy as the reactive intermediate, rather than an $\\mathrm{Fe}^{\\mathrm{III}}$-(hydro)peroxy. ${ }^{19}$ If an $\\mathrm{Fe}^{\\mathrm{III}}$-superoxy is the active intermediate, this raises the question of what drives its formation, as substrate is not coordinated to the Fe, and from reference 42, $\\mathrm{O}_{2}$ binding to an $\\mathrm{Fe}^{\\mathrm{II}}$ in a facial triad (without substrate bound) is highly endergonic. Accordingly, $\\mathrm{O}_{2}$ binding in the absence of substrate is not kinetically relevant for either NDO or BZDO based on the single turnover studies. ${ }^{19,30}$\n\nTo address these issues, it is first necessary to define the structure of BZDOp and determine how this relates to the native reaction of active site $\\mathrm{Fe}^{\\mathrm{II}}$ with $\\mathrm{O}_{2}$. Vibrational spectroscopy is ideal for defining the binding mode and protonation state of the $\\mathrm{O}_{2}$. Resonance Raman (rR) would be the traditional method for obtaining vibrational data on the $\\mathrm{NHFe}^{\\mathrm{II}}$ active site; however, due to the chromophoric nature of the Rieske center, ${ }^{43}$ it is not possible to obtain resonance Raman data on the $\\mathrm{NHFe}^{\\mathrm{II}}$ site. ${ }^{44}$ We thus turned to nuclear resonance vibrational spectroscopy (NRVS) to obtain vibrational data on BZDOp. NRVS is a third-generation synchrotron technique where inelastic vibrational sidebands of the $14.4 \\mathrm{keV}{ }^{57} \\mathrm{Fe}$ Mössbauer transition are observed. ${ }^{45,46} \\mathrm{NRVS}$ has the useful property that all normal modes of vibration with ${ }^{57} \\mathrm{Fe}$ displacement show intensity, and that intensity is proportional to the amount of Fe displacement in the mode. NRVS thus gives selective vibrational and, therefore, structural information on the Fe active site. For enzyme intermediates with unknown structures, density functional theory (DFT) simulations, where the functional and basis set have been calibrated on well-defined model systems, are used to assign the NRVS spectrum and define the structure. This methodology has previously been applied to the lowspin $\\mathrm{Fe}^{\\mathrm{III}}$ hydroperoxy intermediate in bleomycin (BLM), ${ }^{47}$ the $\\mathrm{Fe}^{\\mathrm{IV}-}$ oxo intermediate in SyrB2 ${ }^{48}$ and the bridged peroxide intermediate $\\mathrm{P}^{\\prime}$ in the binuclear Fe site of AurF. ${ }^{49}$ To calibrate our DFT method for BZDOp and define the binding mode and protonation state of high-spin $\\mathrm{Fe}^{\\text {III }}$-(hydro)peroxy models, we previously analyzed NRVS data on a side-on $\\mathrm{Fe}^{\\text {III }}$-peroxy model ${ }^{10}$ and an end-on $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy model ${ }^{10}$ (both high-spin and ligated by the 4-coordinate 1,4,8,11-tetramethyl-1,4,8,11-tetraazacyclotetradecane (TMC) ligand). ${ }^{50}$\n\nIn the present study, we first present the NRVS data of BZDOp and assign its structure based on DFT calculations calibrated to the high-spin Fe $\\mathrm{Fe}^{\\mathrm{III}}$ (hydro)peroxy models. We then define its reactivity with substrate, including consideration of whether BZDOp can be in an equilibrium with an $\\mathrm{Fe}^{\\text {III }}$-superoxo reduced Rieske species. We then evaluate the native $\\mathrm{O}_{2}$ reaction in BZDO using DFT, including the timing of the electron transfer (ET) from the Rieske center, and based on these experimentally calibrated calculations offer thoughts on how an $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo can be activated for reactivity in the RDOs and how the reactivity of this species compares with that of an $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy intermediate.\n\n\\section{METHODS}\n\\subsection{Preparation of ${ }^{57} \\mathrm{Fe}$ BZDOp Samples}\n${ }^{57} \\mathrm{Fe}$ enriched BZDO was heterologously overexpressed, purified, and characterized as previously reported, only changing the growth and overexpression media to a modified Hutner's mineral base. ${ }^{19,51}$ The recipe for the defined media was followed as reported except iron was omitted from all media components and $3 \\mathrm{mg} / \\mathrm{L}(\\sim 60 \\mu \\mathrm{M}){ }^{57} \\mathrm{Fe}$ was added to each flask of growth media. Filter sterilized glucose $(0.4 \\% \\mathrm{~W} / \\mathrm{v})$ was used as the carbon source and was added from a $20 \\%$ (w/v) stock. The concentrated ${ }^{57} \\mathrm{Fe}$ stock was made by dissolving an isotopically enriched iron powder (Cambridge Isotope Laboratories, $\\geq 96 \\%$ ${ }^{57} \\mathrm{Fe}$ ) in $4 \\mathrm{M} \\mathrm{HCl}$ overnight. This procedure resulted in ${ }^{57} \\mathrm{Fe}$ being $~ 97 \\%$ of the total iron present in the Rieske center and the mononuclear Fe as assayed by ICP-MS.\n\nNRVS samples were prepared at $23^{\\circ} \\mathrm{C}$ by concentrating ${ }^{57}$ Fe-enriched as-purified BZDO to $5 \\mathrm{mM}$. KCN and benzoate were added to the BZDO solution to respective final concentrations of 20 and $50 \\mathrm{mM}$ from high concentration stocks to minimize dilution. KCN suppresses background catalase activity preventing degradation of the hydrogen peroxide added during the peroxide shunt. ${ }^{18} \\mathrm{KCN}$ was found not to alter the kinetic or spectroscopic features of BZDO. Each NRVS sample was made by mixing 4 parts of the above enzyme solution with 1 part of reaction buffer (50 mM MOPS buffer $\\mathrm{pH}$ 6.8, $100 \\mathrm{mM} \\mathrm{NaCl}$ ) supplemented as described below. $\\mathrm{BZDO}_{\\mathrm{OX}}$ samples were prepared by counter mixing with reaction buffer containing $50 \\mathrm{mM}$ benzoate. ${ }^{16} \\mathrm{O} \\mathrm{BZDO}_{\\mathrm{P}}$ samples were prepared by counter mixing with reaction buffer containing $50 \\mathrm{mM}$ benzoate and $250 \\mathrm{mM} \\mathrm{H}_{2} \\mathrm{O}_{2} \\cdot{ }^{18} \\mathrm{O} \\mathrm{BZDO}_{\\mathrm{P}}$ samples were prepared by counter mixing with reaction buffer containing $50 \\mathrm{mM}$ benzoate and $250 \\mathrm{mM} \\mathrm{H}_{2}{ }^{18} \\mathrm{O}_{2}$ (Cambridge Isotope Laboratories, 2-2.5\\% in water, $\\geq 90 \\% \\mathrm{H}_{2}{ }^{18} \\mathrm{O}_{2}$ ). The mixed reactions were then injected into NRVS cells wrapped in Kapton tape and frozen on a liquid nitrogen cooled aluminum block. $\\mathrm{BZDO}_{\\mathrm{P}}$ samples were frozen $5 \\mathrm{~min}$ after addition of the $\\mathrm{H}_{2} \\mathrm{O}_{2}$-containing buffer. ApoBZDO (without mononuclear iron but with full complement of Rieske center) was prepared by overnight dialysis at $4{ }^{\\circ} \\mathrm{C}$ in reaction buffer containing $10 \\mathrm{mM}$ EDTA. EDTA was removed by an additional dialysis at $4{ }^{\\circ} \\mathrm{C}$ in reaction buffer. A PD-10 desalting column (GE Healthcare) equilibrated in reaction buffer was used as a final step to remove residual EDTA. ApoBZDO NRVS samples were made with reaction buffer containing $50 \\mathrm{mM}$ benzoate.\n\n\\subsection{NRVS Data Collection and Processing}\n${ }^{57}$ Fe NRVS data were collected on BZDO samples at beamline 3-ID-D at the Advanced Photon Source and at BL09XU at SPring-8. The NRVS energy scale was calibrated using $\\left[\\mathrm{Fe}^{\\mathrm{III}}\\left(\\mathrm{Cl}_{4}\\right)\\right]\\left[\\mathrm{NEt}_{4}\\right] .^{52}$ Sample temperatures were maintained at $\\sim 60 \\mathrm{~K}$ in copper sample holders mounted in LHe cryostats. Scans of $1 \\mathrm{~h}$ in measuring time were collected and added together using the PHOENIX software package ${ }^{53}$ until good signal-to-noise was obtained, and PHOENIX was also used to subtract the elastic peak and generate the final vibrational density of states spectra. To obtain data on the $\\nu \\mathrm{Fe}-\\mathrm{O}$ in ${ }^{16} \\mathrm{O} /{ }^{18} \\mathrm{O}$ BZDOp, the counting rate in the region from 460-540 cm $\\mathrm{cm}^{-1}$ was increased 10-fold, with the counting rate in the rest of the spectrum (except in an $80 \\mathrm{~cm}^{-1}$ range around the elastic peak) decreased to maintain the same measuring time per spectrum. All data, including the isotope-sensitive feature, were reproduced on two replicates of each sample.\n\n\\subsection{DFT Calculations and NRVS Simulations}\nDFT calculations were performed using the Gaussian 09 software package, revision D.01. 54 The B3LYP functional ${ }^{55-58}$ and a basis set consisting of 6-311g* on the Fe and 6-311g on all other atoms ${ }^{59-63}$ was used for all calculations, as this basis set and functional combination has previously been found to perform well in calculating NRVS spectra and reactivities of high-spin $\\mathrm{Fe}^{\\mathrm{III}}$-peroxy species. ${ }^{50,64}$ Implicit solvation was included in all calculations using the Polarizable Continuum Model (PCM) ${ }^{65}$ as implemented in Gaussian 09 with $\\varepsilon=4.0$. No crystal structure exists for the oxygenase component of BZDO, but BZDO and NBDO have high sequence similarity (45\\%) and identity (29\\%), ${ }^{66}$ so the crystal structure of nitrobenzene dioxygenase (NBDO) with substrate bound was used as the starting point for the calculations (PDB code 2BMQ). ${ }^{38}$ Nitrobenzene was modeled as benzoate (protonated to eliminate self-interaction effects), and amino acid residues were truncated to the $\\mathrm{a}$-carbons. $\\mathrm{O}_{2}$ was added to these structures computationally to generate the NRVS structural models for BZDOp and the initial $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo intermediate in the native reaction coordinate. Bond constraints for calculating a 2D potential energy surface were included using the modredundant keyword in Gaussian 09. For simulating the NRVS spectra, DFT frequency calculations were initially calculated using natural abundance masses, after which the terminal hydrogen atoms on the truncated a-carbons were increased to $100 \\mathrm{amu}$ and frequencies were recalculated to remove spurious vibrations associated with the truncation scheme. ${ }^{67}$ NRVS spectra were simulated from these heavy mass frequency calculations using the gennrvs script. ${ }^{68}$ Molecular orbital contours were generating using LUMO, ${ }^{69}$ and Mulliken orbital populations were calculated using QMForge. ${ }^{70}$\n\n\\section{RESULTS AND ANALYSIS}\n\\subsection{NRVS Definition of BZDOp}\nNRVS data were collected on four BZDO samples, all of which had ${ }^{57} \\mathrm{Fe}$ loaded into the Rieske center: apo BZDO, where the catalytic site was not loaded with Fe but the oxidized Rieske center is present, ferric resting BZDO (BZDO ${ }_{\\mathrm{OX}}$ ), which is the starting material of the BZDOp formation reaction and has the Rieske center oxidized and ${ }^{57} \\mathrm{Fe}$ loaded and oxidized in the catalytic site, and ${ }^{16} \\mathrm{O}$ - and ${ }^{18} \\mathrm{O}$-labeled BZDOp, where the peroxy intermediate made up $60 \\%$ of the catalytic site ${ }^{57} \\mathrm{Fe}$ (with $30 \\%$ due to $\\mathrm{BZDO}_{\\mathrm{OX}}$ and $10 \\%$ due to product complex from EPR, see Figure S1). These data are shown in Figure 1.\n\nFrom the NRVS data, there are two major spectral features in BZDOp that are distinct from the Rieske and BZDO ${ }_{\\mathrm{OX}}$ features. One is the pair of peaks at 270 and $284 \\mathrm{~cm}^{-1}$ (blue spectrum), and the other is a peak at $510 \\mathrm{~cm}^{-1}$ that shifts to $496 \\mathrm{~cm}^{-1}$ with ${ }^{18} \\mathrm{O}$ substitution (Figure 1, inset. Note that the data in the inset are in the $485-520 \\mathrm{~cm}^{-1}$ range taken with additional scans at $10 \\times$ the measurement time relative to the blue spectrum to improve the S/N; see Figure S2). (The peak at $587 \\mathrm{~cm}^{-1}$ is not isotope sensitive and appears at the same energy in $\\mathrm{BZDO}_{\\mathrm{OX}}$.) Due to its isotope sensitivity, the $510 \\mathrm{~cm}^{-1}$ feature can be assigned as the $\\nu \\mathrm{Fe}-\\mathrm{O}$. Qualitatively, based on a previous NRVS study on high-spin Fe $\\mathrm{IIII}^{\\text {II }}$ (hydro)peroxy models, ${ }^{50}$ the peaks centered at $277 \\mathrm{~cm}^{-1}$ are equatorial $\\mathrm{Fe}-\\mathrm{N}_{\\text {His }}$ stretches. This previous study showed that the energy of the $\\nu \\mathrm{Fe}-\\mathrm{O}$ and the splitting between equatorial $\\mathrm{Fe}-\\mathrm{N}$ stretches are sensitive to the coordination mode of $\\mathrm{O}_{2}$ and its protonation state. From the model study, the side-on $\\mathrm{Fe}^{\\mathrm{III}}$-peroxo has a symmetric $\\nu \\mathrm{Fe}-\\mathrm{O}$ of $430 \\mathrm{~cm}^{-1}$ and an equatorial Fe-N splitting of $23 \\mathrm{~cm}^{-1}$, while for a hypothetical in silico side-on $\\mathrm{Fe}^{\\mathrm{III}}-$ hydroperoxo these are 521 and $14 \\mathrm{~cm}^{-1}$, respectively, and for the end-on $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxo these are 619 and $25 \\mathrm{~cm}^{-1}$. Both the $v \\mathrm{Fe}-\\mathrm{O}$ of $510 \\mathrm{~cm}^{-1}$ and the $14 \\mathrm{~cm}^{-1}$ splitting between the Fe-N peaks are consistent with BZDOp being a side-on $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy.\n\nDFT calculations were used to make a rigorous assignment of the structure of BZDOp via the NRVS spectrum. Three primary candidate structures for BZDOp were considered: sideon $\\mathrm{Fe}^{\\mathrm{III}}$-peroxy, side-on $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy, and end-on $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy shown in Figure 2. Attempts to optimize an end-on unprotonated $\\mathrm{Fe}^{\\mathrm{III}}$-peroxy structure resulted in an end-on $\\mathrm{Fe}^{\\mathrm{II}}$-superoxy electronic structure inconsistent with the Mössbauer data. ${ }^{18}$ The cluster model used for these calculations (derived from NBDO as described in section 2.3) included all first-sphere residues and two conserved second-sphere Asn residues, Asn258 and Asn199 (labeled using the NBDO residue numbers), which are involved in hydrogen bonding to the substrate and to the $\\mathrm{O}_{2}$, respectively. DFT simulations derived from the three possible structures (in insets, with final DFT structures given in Figure S3) are shown in Figure 2.\n\nAs shown in Figure 2, only the side-on hydroperoxy model (Figure $2 \\mathrm{C}$ ) is consistent with the NRVS data of BZDOp (Figure $2 \\mathrm{~A}$ ), as this model predicts an $\\nu \\mathrm{Fe}-\\mathrm{O}$ at $516 \\mathrm{~cm}^{-1}$ (510 $\\mathrm{cm}^{-1}$ in the data) and a pair of intense Fe-His stretches at 285 and $271 \\mathrm{~cm}^{-1}$. These are inequivalent due to the differing Fe- $\\mathrm{N}_{\\mathrm{His}}$ bond lengths of $2.07$ and $2.08 \\AA$, respectively, and consistent with the observed 284 and $270 \\mathrm{~cm}^{-1}$ peaks in the NRVS data. In the side-on peroxy structure, a symmetric $\\nu \\mathrm{Fe}-\\mathrm{O}_{2}$ is calculated at $458 \\mathrm{~cm}^{-1}$, and the intense $\\nu \\mathrm{Fe}-\\mathrm{N}_{\\text {His }}$ appear at 270 and $243 \\mathrm{~cm}^{-1}$, which are all too low in energy to be consistent with the NRVS data, and the $27 \\mathrm{~cm}^{-1}$ splitting between the $\\nu \\mathrm{Fe}-\\mathrm{N}_{\\mathrm{His}}$ is also too large. For the end-on hydroperoxy model (which is $1 \\mathrm{kcal} / \\mathrm{mol}$ higher in free energy than the side-on hydroperoxy), the $v \\mathrm{Fe}-\\mathrm{O}$ is at $553 \\mathrm{~cm}^{-1}$ and the $v \\mathrm{Fe}-\\mathrm{N}_{\\text {His }}$ are at 316 and $296 \\mathrm{~cm}^{-1}$, all too high in energy relative to the NRVS data, with the $20 \\mathrm{~cm}^{-1}$ splitting between the $\\nu \\mathrm{Fe}-\\mathrm{N}_{\\mathrm{His}}$ again too large relative to the data (though it should be noted that this splitting is within the $8 \\mathrm{~cm}^{-1}$ resolution of the experimental value). From the DFT modeling, BZDOp can thus be assigned as a side-on $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy, consistent with the qualitative prediction presented above based on model complexes. The DFT structure of BZDOp is shown in Figure 3, and relevant calculated structural and vibrational parameters for this model, as well as the sideon peroxy and end-on hydroperoxy, are given in Tables S1 and S2.\n\n\\subsection{Reaction Coordinate of BZDOp}\nWith the structure of BZDOp defined using NRVS spectroscopy, its cis-dihydroxylation reactivity was computationally investigated. Two primary reaction pathways for a side-on $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy have been proposed in the literature: (1) initial heterolytic cleavage of the O-O bond to form an $\\mathrm{Fe}^{\\mathrm{V}}(\\mathrm{O})(\\mathrm{OH})$ that then reacts with substrate ${ }^{41,71}$ and (2) direct attack of the unprotonated $\\mathrm{O}$ on the substrate concerted with O-O cleavage, ${ }^{72}$ as shown in Scheme 1.\n\nPrevious computational studies disagree about which of these mechanisms is more feasible. 71-73 To evaluate this reaction coordinate, the NRVS structure of BZDOp was used as a starting point to generate a 2D potential energy surface (PES), where the two coordinates are O-O distance and non-protonated O-substrate (C2) distance, as depicted in Figure 4, left. The results of these calculations are displayed in Figure 4, right.\n\nFrom the PES shown in Figure 4, decreasing the O-substrate distance without increasing the O-O distance is energetically unfavorable and would go through a barrier of $\\sim 27 \\mathrm{kcal} / \\mathrm{mol}$, while cleaving the O-O bond would go through a barrier of $~ 19 \\mathrm{kcal} / \\mathrm{mol}$. No transition state for direct attack could be located. This can be rationalized by considering the frontier molecular orbital (FMO) of BZDOp that would participate in the direct electrophilic attack, which is its LUMO, a hydroperoxo $\\sigma^{*}$ orbital oriented along the O-O vector (Figure S4).\n\nDue to the positioning of Asn258 (Figure 3), the substrate is unable to orient itself along this O-O vector, and the $\\mathrm{O}-\\mathrm{O}$ bond must cleave before attack on the substrate. A recent QM/MM study ${ }^{71}$ similarly found that steric effects arising from residues in the binding pocket of NBDO prevent the substrate from adopting the position necessary for a concerted TS.\n\nThe O-O cleavage mechanism was evaluated on the $S=5 / 2$ and $S=3 / 2$ surfaces. The results of these calculations are shown in Figure 5 and summarized in Table 1.\n\nBZDOp is a high-spin ( $S=5 / 2$ ) $\\mathrm{Fe}^{\\mathrm{III}}$ species. ${ }^{18}$ The initial step in the reaction is cleavage of the peroxy O-O bond, which goes through a barrier of $21.8 \\mathrm{kcal} / \\mathrm{mol}$ on the $S=5 / 2$ surface (TS ${ }^{\\mathbf{1}}$ ). On the $S=5 / 2$ surface, this process is best described as a homolytic cleavage where one alpha electron from the Fe and one beta electron from the protonated $\\mathrm{O}\\left(\\mathrm{O}^{\\mathrm{H}}\\right)$ are used to cleave the O-O $\\sigma$ bond, as evidenced by the buildup of spin density on $\\mathrm{O}^{\\mathrm{H}}$ at $\\mathbf{T S}^{\\mathbf{1 a}}$ (Table 1). This process generates an $\\mathrm{Fe}^{\\mathrm{IV}}(\\mathrm{O})\\left({ }^{++} \\mathrm{OH}\\right)$ product, where the $S=2 \\mathrm{Fe}^{\\mathrm{IV}}$ and the $S=1 / 2$ ${ }^{\\cdot+} \\mathrm{OH}$ are ferromagnetically coupled. However, the $S=3 / 2$ cleavage product is much lower in energy $(-4.6 \\mathrm{kcal} / \\mathrm{mol}$ relative to BZDOp, versus $+5.2 \\mathrm{kcal} / \\mathrm{mol}$ for $S=5 / 2)$, so there is a spin crossover from the $S=5 / 2$ to the $S=3 / 2$ surface along the O-O cleavage coordinate. The $S=3 / 2$ product is an $\\mathrm{Fe}^{\\mathrm{V}}(\\mathrm{O})(\\mathrm{OH})$ species, where there are three $a$ electrons in the Fe d orbitals and the O-O bond has been heterolytically cleaved by two electrons from the Fe, as shown at the bottom of Figure 5. (The $S=1 / 2$ cleavage product was also considered. This is a low-spin $\\mathrm{Fe}^{\\mathrm{V}}(\\mathrm{O})(\\mathrm{OH})$ with an energy of $5.2 \\mathrm{kcal} / \\mathrm{mol}$, higher in energy than the $S=3 / 2$ product. The $S=3 / 2 \\mathrm{Fe}^{\\mathrm{V}}$ being lower in energy here is consistent with computational predictions that an $\\mathrm{Fe}^{\\mathrm{V}}(\\mathrm{O})$ with a cis $\\mathrm{OH}$ group would have its high-spin configuration lowest in energy. ${ }^{74}$ ) This $\\mathrm{Fe}^{\\mathrm{V}}(\\mathrm{O})(\\mathrm{OH})$ intermediate is shown as $\\mathbf{I}^{\\mathbf{1 a}}$ in Figure 5 and Table 1 , and the DFT structure is given in Figure S5. The next step in the reaction involves attack on the substrate by the oxo group, as the $\\mathrm{OH}$ group is not oriented well for attack on the substrate (see Figure S5, upper right). On the $S=3 / 2$ surface, the oxo group attacks C1 of the substrate with a barrier of $13.2 \\mathrm{kcal} / \\mathrm{mol}$ relative to BZDOp, much lower than the barrier for O-O cleavage. At the transition state, TS ${ }^{2 \\mathbf{a}}$ (from the spin densities in Table 1 and the FMOs in Figure S6), one $a$ electron from the substrate $\\pi$ HOMO has been transferred to the Fe, as shown schematically in Figure 5 , bottom. The intrinsic reaction coordinate (IRC) product of this transition state, $\\mathbf{I}^{2 \\mathbf{a}}$, is best described as an $\\mathrm{Fe}^{\\text {III }-O \\text { O-benzoate }}{ }^{+}$bridged species, where the second substrate $\\pi$ HOMO electron has been mostly transferred to the Fe (though there is still a small amount of $\\mathrm{Fe}^{\\mathrm{IV}}$ benzoate character, as evidenced by the spin densities in Table 1 and FMOs in Figure S6). This species does not correspond to a local energy minimum, and upon geometry optimization, $\\mathbf{I}^{\\mathbf{2 a}}$ goes directly to the final product $\\mathbf{P}^{\\mathbf{a}}$, where the $\\mathrm{OH}$ group on the Fe has transferred to the substrate and there has been a spin crossover back to the $S=5 / 2$ surface to generate an $S=5 / 2 \\mathrm{Fe}^{\\mathrm{III}}$ product bound complex at $-37.2 \\mathrm{kcal} / \\mathrm{mol}$. From these calculations, the rate limiting step of the BZDOp reaction with substrate is O-O cleavage with a barrier of $21.8 \\mathrm{kcal} / \\mathrm{mol}$, which is consistent with the experimental slow rate of product formation in the peroxide shunt reaction $\\left(5.8 \\times 10^{-4} \\mathrm{~s}^{-1}\\right)$. ${ }^{18}$ Note that the slow rate of product formation could also be due to slow peroxide binding; however, there is an immediate shift in the EPR signal of $\\mathrm{BZDO}_{\\mathrm{OX}}$ upon addition of $\\mathrm{H}_{2} \\mathrm{O}_{2},{ }^{18}$ and its binding is thus likely not rate limiting.\n\nSince literature results indicate that an end-on high-spin $\\mathrm{Fe}^{\\mathrm{III}}$ hydroperoxide should be capable of electrophilic reactivity, ${ }^{10,11,64}$ the possibility that BZDOp can isomerize to endon hydroperoxide to electrophilically attack the substrate through its protonated $\\mathrm{O}$ was also evaluated. The end-on hydroperoxo is only $1 \\mathrm{kcal} / \\mathrm{mol}$ higher in free energy than the side-on structure and can attack benzoate at C1, but with a barrier of $30.1 \\mathrm{kcal} / \\mathrm{mol}$, to form an $\\mathrm{Fe}^{\\mathrm{IV}}(\\mathrm{O})$ and (benzoate $)-(\\mathrm{OH})$ at $22.4 \\mathrm{kcal} / \\mathrm{mol}$. Interestingly, this barrier is much higher than the $18.8 \\mathrm{kcal} / \\mathrm{mol}$ barrier found for a high-spin end-on $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy-TMC model complex performing $\\mathrm{H}$ atom abstraction from xanthene. ${ }^{64}$ This can be attributed to the thermodynamics of the products: if the thermodynamics of the products are removed from the barrier to obtain an approximate estimate of the intrinsic $\\Delta G^{\\ddagger},{ }^{75,76}$ the barriers become closer (19.0 $\\mathrm{kcal} / \\mathrm{mol}$ for BZDOp, $23.4 \\mathrm{kcal} / \\mathrm{mol}$ for the TMC hydroperoxo model). The high barrier for end-on hydroperoxo attack on benzoate rules out this mechanism for the peroxide shunt reaction relative to the heterolytic O-O cleavage mechanism presented in Figure 5.\n\n\\subsection{Thermodynamic Correlation of BZDOp with a $\\mathrm{Fe}^{\\text {III }}-\\mathrm{O}_{2}{ }^{\\circ-}$ Rieske ${ }^{\\text {red }}$ Species}\nThe barrier of $21.8 \\mathrm{kcal} / \\mathrm{mol}$ for cis-dihydroxylation via O-O heterolysis of the hydroperoxo in BZDOp determined above is consistent with the observed slow rate in the peroxide shunt reaction. However, there also exists the possibility that BZDOp could be in an equilibrium with a $\\mathrm{Fe}^{\\mathrm{III}}-\\mathrm{O}_{2}{ }^{\\cdot-}$ Rieske ${ }^{\\text {red }}$ species (generated by deprotonation and electron transfer back to the Rieske center), which could itself be the reactive intermediate and has recently been invoked as a potential intermediate in the native $\\mathrm{O}_{2}$ reaction of BZDO (vide infra). ${ }^{19}$ To investigate this possibility, the thermodynamics of reducing the Rieske center by one electron and deprotonating and oxidizing BZDOp by one electron were calculated, as shown in Scheme 2.\n\nReducing the Rieske ${ }^{0 x}$ site by one electron is worth $-86.1 \\mathrm{kcal} / \\mathrm{mol}$. Converting this to a potential relative to the SHE${ }^{77}$ gives a value of $-0.54 \\mathrm{~V}$. This is more negative than the measured value for naphthalene dioxygenase $(-0.15 \\mathrm{~V})$, but the $0.39 \\mathrm{~V}(9 \\mathrm{kcal} / \\mathrm{mol})$ discrepancy is typical of calculations on Rieske centers. ${ }^{78}$ For BZDOp, conversion to a superoxo species necessitates deprotonation, and it is important to consider the proton acceptor. One potential proton acceptor is bulk solvent, which has a proton solvation free energy of $-265 \\mathrm{kcal} / \\mathrm{mol}^{79}$ For BZDO, the other reasonable proton source is Arg312, which is $7.9 \\AA$ away from the active site in the crystal structure of NBDO and conserved in BZDO. ${ }^{38}$ The Gibbs free energy of protonating the guanidine group of Arg312 is $-275 \\mathrm{kcal} / \\mathrm{mol}, 10$ $\\mathrm{kcal} / \\mathrm{mol}$ more favorable than bulk solvent. ${ }^{80}$ It was found that deprotonating BZDOp and oxidizing it by one electron to an $S=2 \\mathrm{Fe}^{\\mathrm{III}}-\\mathrm{O}_{2}{ }^{--}$species (the lowest energy superoxo, vide infra) is unfavorable by $129.3 \\mathrm{kcal} / \\mathrm{mol}$ if the proton goes to solvent, or $119.3 \\mathrm{kcal} / \\mathrm{mol}$ if the proton goes to the guanidine group. The net thermodynamics of converting BZDOp to a superoxo Rieske ${ }^{\\text {red }}$ species are thus $+43.2 \\mathrm{kcal} / \\mathrm{mol}\\left(\\mathrm{H}^{+}\\right.$from solvent) or $+33.2 \\mathrm{kcal} / \\mathrm{mol}$ ( $\\mathrm{H}$ ${ }^{+}$from $\\mathrm{Arg}^{+}$). If the experimental reduction potential of the Rieske center in NDO ferredoxin $\\left(-95.2 \\mathrm{kcal} / \\mathrm{mol}^{81}\\right)$ is used instead of the calculated value, the thermodynamics become $+24.1 \\mathrm{kcal} / \\mathrm{mol}$ with $\\mathrm{H}^{+}$from $\\mathrm{Arg}^{+}$. Even this lowest value is too large to enable any equilibrium between BZDOp and a superoxo species. Thus, the side-on hydroperoxyheterolytic cleavage mechanism presented in section $3.2$ describes the peroxide shunt reaction in the Rieske dioxygenases but, as shown below, is not relevant to the $\\mathrm{O}_{2}$ reaction of the reduced enzyme.\n\n\\subsection{Reaction Coordinate of $\\mathrm{Fe}^{\\mathrm{II}} \\mathrm{BZDO}$ with $\\mathrm{O}_{2}$}\nWith the peroxide shunt mechanism in the Rieske dioxygenases evaluated based on the structure of BZDOp elucidated by NRVS, it is now important to consider the native $\\mathrm{Fe}^{\\mathrm{II}} / \\mathrm{O}_{2} /$ reduced Rieske center/benzoate reaction and understand whether this relates to peroxide shunt reactivity. From single-turnover kinetics measurements of the native reaction of BZDO and $\\mathrm{O}_{2}$ with benzoate and several fluorinated derivatives, ${ }^{19}$ it was determined that the pseudo-first-order rate constant of Rieske oxidation ( $\\left.k_{\\text {obs }}=190 \\mathrm{~s}^{-1}, \\Delta G^{\\ddagger} \\sim 13 \\mathrm{kcal} / \\mathrm{mol}\\right)$ is equal to the pseudo first order rate constant of product formation, meaning that the ratelimiting step either occurs before or is concerted with the electron transfer from the Rieske center. Further, the rate constant of Rieske oxidation was dependent on substrate type. This mechanism would involve an initial $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo intermediate that attacks the substrate before accepting an electron from the Rieske center. To evaluate this hypothesis, a reaction coordinate for BZDO with $\\mathrm{O}_{2}$ and a reduced Rieske center was evaluated, as shown in Figure 6 and summarized in Table 2.\n\nThe first step in the reaction is binding $\\mathrm{O}_{2}$ to the $\\mathrm{Fe}^{\\mathrm{II}}$, which has gone 5C upon binding substrate. ${ }^{31}$ This is an $S=2 \\mathrm{Fe}^{\\mathrm{III}}-\\mathrm{O}_{2}{ }^{\\cdot-}$ species that is uphill in free energy by $9.9 \\mathrm{kcal} / \\mathrm{mol}$, consistent with previous calculations on naphthalene dioxygenase and on $\\mathrm{O}_{2}$ binding to the 5C facial triad in the extradiol dioxygenases. ${ }^{42,82}$ This species, $\\mathbf{1}^{\\mathbf{b}}$ (Figure 6), is best described as an $S=5 / 2 \\mathrm{Fe}^{\\mathrm{III}}$ site antiferromagnetically coupled to an $S=1 / 2 \\mathrm{O}_{2}{ }^{-}$radical, giving the $S=2$ lowest energy spin state. The superoxide structure would be 6C with a bidentate carboxylate, two His, and a water ligand (consistent with pulsed EPR data on the $\\{\\text { FeNO }\\}^{7}$ substrate bound species in NDO). ${ }^{32}$ The superoxo, $\\mathbf{1}^{\\mathbf{b}}$, can attack carbon 2 of benzoate with a total barrier of $13.7 \\mathrm{kcal} / \\mathrm{mol}$ (TS ${ }^{\\mathbf{1 b}}$ ) on the $S=2$ surface, still consistent with the single-turnover rate, to generate an $\\mathrm{Fe}^{\\mathrm{III}}$-peroxobenzoate radical bridged species, $\\mathbf{I}^{\\mathbf{1 b}}$, at $11.9 \\mathrm{kcal} / \\mathrm{mol}$. This process involves electrophilic attack by the superoxo $\\pi_{\\mathrm{v}}^{*} \\mathrm{a}-$ LUMO, perpendicular to the Fe-O-O plane, on the substrate $\\pi$ HOMO, as shown in Figure 7, left.\n\nAs the superoxo species attacks benzoate, the radical character shifts from the benzoate $\\pi$ HOMO onto the $\\mathrm{O}_{2}^{\\cdot-}$, with the transfer largely complete at the transition state $\\mathbf{T S}^{\\mathbf{1}} \\mathbf{b}$. This can be seen from the LUMO in Figure 7 , middle, which is predominantly benzoate $\\pi$ in character, and from the O-O bond length at the TS (Table 2) of $1.45 \\AA$, significantly lengthened from the $1.37 \\AA$ distance of the superoxo reactant. This produces species $\\mathbf{I}^{\\mathbf{1 b}}$, which has an $\\mathrm{Fe}^{\\mathrm{III}}$ peroxide bridging a benzoate that has been oxidized by one electron. The next step in the reaction would involve homolytic cleavage of the peroxo $\\mathrm{O}-\\mathrm{O}$ bond to generate an $\\mathrm{Fe}^{\\mathrm{IV}}$-oxo benzoate epoxide species $\\mathbf{I}^{\\mathbf{2 b}}$, with the $S=1$ and $S=2 \\mathrm{Fe}^{\\mathrm{IV}}$ species nearly isoenergetic (Figure 6). While either of these species could plausibly complete the cis-dihydroxylation reaction, the barrier for cleaving the $\\mathrm{O}-\\mathrm{O}$ bond $\\left(\\mathbf{T S}^{2 \\mathbf{b}}\\right)$ is too high; this barrier is $29.1 \\mathrm{kcal} / \\mathrm{mol}$ on the lowest-energy $S=2$ surface, relative to the $13 \\mathrm{kcal} / \\mathrm{mol}$ barrier estimated from the single turnover kinetics. Thus, the Rieske center must provide an electron to drive the reaction at a stage prior to this O-O cleavage step, and this could occur at either the superoxo species $\\mathbf{1}^{\\mathbf{b}}$ or the bridged species $\\mathbf{I}^{\\mathbf{1}}$ in Figure 6. These possibilities are evaluated below.\n\n\\subsection{Proton-Coupled Electron Transfer to Drive Reactivity}\nSince the native $\\mathrm{O}_{2}$ reaction in BZDO cannot proceed past the $\\mathrm{Fe}^{\\mathrm{III}}$-peroxoaryl radical species $\\mathbf{I}^{\\mathbf{2 b}}$ without electron transfer from the Rieske center, the kinetics of both an electron transfer (ET) and proton-coupled electron transfer (PCET) to the catalytic site along the reaction coordinate were evaluated at both the peroxo bridged $\\mathbf{I}^{\\mathbf{1 b}}$ step and the earlier superoxo $\\mathbf{1}^{\\mathbf{b}}$ step. The rate of electron transfer between a donor and acceptor, $k_{\\mathrm{ET}}$, is given in Marcus theory, ${ }^{83}$ eq 1.\n\n\\[\nk_{\\mathrm{ET}}=\\frac{2 \\pi}{\\hbar}\\left|H_{\\mathrm{DA}}\\right|^{2} \\frac{1}{\\sqrt{4 \\pi \\lambda k_{\\mathrm{b}} T}} \\exp \\left(-\\frac{\\left(\\lambda+\\Delta G^{\\circ}\\right)^{2}}{4 \\lambda k_{\\mathrm{b}} T}\\right)\n\\]\n\n$k_{\\mathrm{ET}}$ is dependent on $\\mathrm{H}_{\\mathrm{DA}}$, the electronic coupling between the donor and acceptor, $\\Delta G^{\\circ}$, the driving force of the reaction, $\\lambda$, the reorganization energy, and temperature $(T) . k_{\\mathrm{b}}$ is the Boltzmann constant, and $\\hbar$ is the reduced Planck's constant. $\\lambda$ is further divided into innersphere $\\left(\\lambda_{\\mathrm{i}}\\right)$ and outer-sphere $\\left(\\lambda_{\\mathrm{o}}\\right)$ components, which reflect the change in the geometry of the ligands and solvent, respectively, upon electron transfer. $\\lambda_{0}$ is assumed to be $0.4 \\mathrm{eV}$ for both the catalytic Fe and Rieske sites, ${ }^{84} H_{\\mathrm{DA}}$ is assumed to be $0.05 \\mathrm{~cm}^{-1}$, consistent with previous work, ${ }^{82} \\Delta G^{\\circ}$ and $\\lambda_{\\mathrm{i}}$ for the catalytic Fe site were both obtained from DFT calculations ${ }^{85}$ (see the SI for details on the $\\lambda_{\\mathrm{i}}$ calculation), $\\Delta G^{\\circ}$ for oxidizing the Rieske center is $+95.2 \\mathrm{kcal} / \\mathrm{mol}$ as discussed in section $3.3$, and $\\lambda_{\\mathrm{i}}$ for the Rieske center is $0.56 \\mathrm{eV}$ as calculated previously. ${ }^{86}$ The calculated $\\Delta G^{\\circ}$ and $\\lambda_{\\mathrm{i}}$ values for PCET, as well as uncoupled ET and proton transfer (PT), to the superoxo species $\\mathbf{1}^{\\mathbf{b}}$ and the peroxo bridged species $\\mathbf{I}^{\\mathbf{1}}$ are shown in parts A and B, respectively, of Figure 8.\n\nFor these calculations, Asp203, which bridges between the catalytic and Rieske sites to facilitate ET, was included in the cluster model to neutralize the charge on the site for the uncoupled ET and PT calculations. Both Arg312 (vide supra) and the water coordinated to the Fe were considered as potential proton sources, with the main text focusing on the Arg312 calculations and the coordinated water results, which are similar but give lower rates for both processes as presented in the SI. Note that the solvent cannot be the source of the proton, as the rate of Rieske oxidation in single turnover is $\\mathrm{pH}$ independent from $6.8$ to $8.0$ (see the supporting methods, Table S3, and Figure S9 in the SI for details), eliminating PCET to the superoxo as the rate-determining step (vide infra). As shown in Figure 8B, bottom, PCET to the peroxy-bridged species $\\mathbf{I}^{\\mathbf{1} \\mathbf{b}}$, protonating the oxygen proximal to the $\\mathrm{Fe}$, leads to spontaneous heterolytic cleavage of the $\\mathrm{O}-\\mathrm{O}$ bond to generate an $\\mathrm{Fe}^{\\mathrm{III}}-\\mathrm{OH}$ benzoate epoxide $\\left(\\mathbf{I}^{2 \\mathrm{c}}\\right)$. This process is highly favorable, with a $\\Delta G^{\\circ}$ of $-47.3 \\mathrm{kcal} / \\mathrm{mol}$, though it also has a fairly large $\\lambda_{\\mathrm{i}}$ of $1.39 \\mathrm{eV}$. Adding the $\\lambda_{\\mathrm{i}}$ and the $\\lambda_{\\mathrm{o}}$ for the catalytic and Rieske sites, the total $\\lambda$ for this process is $2.75 \\mathrm{eV}$, and eq 1 gives a $k_{\\mathrm{ET}}$ for this process of $5600 \\mathrm{~s}^{-1}$ at $277 \\mathrm{~K}$ (the temperature at which single turnover kinetics were measured ${ }^{19}$ ). This PCET process is thus driven by the highly favorable thermodynamics associated with reductive cleavage of the $\\mathrm{O}-\\mathrm{O}$ bond, which compensates for the large reorganization energy. The $k_{\\mathrm{ET}}$ of $5600 \\mathrm{~s}^{-1}$ is faster than the $190 \\mathrm{~s}^{-1}$ rate limiting step of product formation in single turnover, ${ }^{19}$ making this step catalytically feasible. As shown in the diagram in Figure 8B, top, PT to $\\mathbf{I}^{\\mathbf{1 b}}$ prior to ET is unfavorable thermodynamically ( $\\left.\\Delta G=+20.0 \\mathrm{kcal} / \\mathrm{mol}\\right)$, and performing ET prior to PT is slow relative to the coupled PCET process $\\left(k_{\\mathrm{ET}}=9.6 \\mathrm{~s}^{-1}\\right.$ versus $5600 \\mathrm{~s}^{-1}$ ).\n\nFigure 8A evaluates the alternative of PCET/ET to the $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo $S=2$ species $\\mathbf{1}^{\\mathbf{b}}$ to generate an $S=5 / 2 \\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy or peroxy species. The PCET process has a relatively small $\\lambda_{\\mathrm{i}}$ of $0.57 \\mathrm{eV}\\left(\\lambda_{\\text {total }}=2.03 \\mathrm{eV}\\right)$ but is less thermodynamically favorable with $\\Delta G^{\\circ}=$ $-22.8 \\mathrm{kcal} / \\mathrm{mol}$ (consistent with the results in section 3.3). Using eq 1 , these parameters give a $k_{\\mathrm{ET}}$ of $31 \\mathrm{~s}^{-1}$. This is slow relative to the $190 \\mathrm{~s}^{-1}$ rate-limiting step in single turnover, and PCET at this step can be eliminated. To estimate the error in these calculated $k_{\\mathrm{ET}}$, we assume an error in $\\lambda$ of $\\pm 0.2 \\mathrm{eV}$, an error in $\\Delta G^{\\circ}$ of $\\pm 5 \\mathrm{kcal} / \\mathrm{mol}$, and an error in $\\mathrm{H}_{\\mathrm{DA}}$ of $\\pm 0.03 \\mathrm{~cm}^{-1}$. These give a wide range of possible rates (22.8-2.4 $\\times 10^{5} \\mathrm{~s}^{-1}$ for the $\\mathrm{k}_{\\mathrm{ET}}$ to the peroxo and $\\left(1.9 \\times 10^{-2}\\right)-\\left(9.2 \\times 10^{3}\\right) \\mathrm{s}^{-1}$ for $k_{\\mathrm{ET}}$ to the superoxo). However, the calculated PCET rate to the superoxo is always at least 2 orders of magnitude slower than that to the peroxo bridge, as any errors in the calculated values would trend in the same direction. Uncoupling the $\\mathrm{ET}$ and $\\mathrm{PT}$ at the $\\mathrm{Fe}^{\\mathrm{III}}$-superoxide step further slows this process, with $k_{\\mathrm{ET}}$ $=0.045 \\mathrm{~s}^{-1}$ calculated for ET from the values shown in Figure 8A, and PT prior to ET is also disfavored due to highly unfavorable thermodynamics ( $+28.0 \\mathrm{kcal} / \\mathrm{mol})$. The slow calculated rate of PCET to the superoxo species and the fast calculated rate of PCET to the peroxy bridged species indicate that the native $\\mathrm{O}_{2}$ reaction proceeds through an initial $S=2$ $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo intermediate $\\left(\\mathbf{1}^{\\mathbf{b}}\\right)$ that attacks benzoate with a total barrier of $13.7 \\mathrm{kcal} / \\mathrm{mol}$ (Figure 6) that is consistent with the experimental rate-limiting step $\\left(k=190 \\mathrm{~s}^{-1}\\right)$. This generates an $S=2 \\mathrm{Fe}^{\\mathrm{III}}$-peroxobenzoate radical bridged species $\\left(\\mathbf{I}^{\\mathbf{1}} \\mathbf{b}\\right)$, which accepts an electron from the Rieske center and a proton from guanidinium (or another proton source) to generate an $S=5 / 2 \\mathrm{Fe}^{\\mathrm{III}}-\\mathrm{OH}$ benzoate epoxide species $\\left(\\mathbf{I}^{2 \\mathrm{c}}\\right)$ with a rate of $5600 \\mathrm{~s}^{-1}$. Thus, the reaction up to this point would be rate limited by superoxo attack on benzoate, consistent with the substrate dependence of the rate of Rieske oxidation. It should be noted that using bulk solvent as the proton source accelerates both PCET rates, making PCET to the superoxo competitive with the rate of its attack on the substrate. This is inconsistent with the experimental observations that the rate of Rieske oxidation is $\\mathrm{pH}$ independent and substrate dependent, eliminating bulk solvent as the proton source for PCET. Importantly, the rate of PCET to the peroxo bridge is always calculated to be 2 orders of magnitude greater than the rate of PCET to the superoxo due to the much more favorable $\\Delta G^{0}$ for the former process, independent of any assumptions made about proton source, $\\mathrm{H}_{\\mathrm{DA}}$, and $\\lambda$. Completion of the native $\\mathrm{O}_{2}$ cis-dihydroxylation reaction coordinate is evaluated below.\n\n\\subsection{Completion of the Native $\\mathrm{O}_{2}$ Reaction Coordinate}\nThe calculated reaction coordinate for completing cis-dihydroxylation following PCET to $\\mathbf{I}^{\\mathbf{1 b}}$ is shown in Figure 9.\n\nPCET to the peroxy-bridged species $\\mathbf{I}^{\\mathbf{1 b}}$ generates the $\\mathrm{Fe}^{\\mathrm{III}}(\\mathrm{OH})$ epoxide species $\\mathbf{I}^{\\mathbf{2 c}}$ at $-35.4$ $\\mathrm{kcal} / \\mathrm{mol}$ relative to the resting $\\mathrm{Fe}^{\\mathrm{II}}+\\mathrm{O}_{2}$ system. In $\\mathbf{I}^{2 \\mathrm{c}}$, the epoxide $\\mathrm{O}$ is oriented toward the Fe and is hydrogen bonded to the hydroxy $\\mathrm{H}$, and thus, it is primed for formation of a cisdiol as rotation of the substrate for formation of a trans-diol would be precluded by the hydrophobic residues lining the substrate cleft. ${ }^{38}$ We evaluated the possibility of direct attack of the epoxide by the hydroxy. A 1D linear transit calculation found that, while this process would generate the correct cis-dihydroxylated product, it would involve a large barrier of at least $19 \\mathrm{kcal} / \\mathrm{mol}$ (see Figure S10). We thus investigated the alternative of the epoxide first binding to the Fe. From $\\mathbf{I}^{\\mathbf{2 c}}$, binding the epoxide with displacement of the water ligand is uphill by $2.2 \\mathrm{kcal} / \\mathrm{mol}\\left(\\mathbf{(}^{3 \\mathbf{c}}\\right)$. It is also possible that the solvent water dissociates prior to this step, as this water is labilized by $21.9 \\mathrm{kcal} / \\mathrm{mol}$ in enthalpy $(22.7 \\mathrm{kcal} / \\mathrm{mol}$ in free energy) in going from the superoxo species $\\mathbf{1}^{\\mathbf{b}}$ to the peroxo bridge species $\\mathbf{I}^{\\mathbf{1 b}}$ due to a stronger Fe-O donor bond (1.89 $\\AA$ in the peroxo vs $1.99 \\AA$ in the superoxo). Water dissociation prior to PCET is consistent with the minimal solvent exchange observed in the native $\\mathrm{O}_{2}$ reaction of NDO. ${ }^{87} \\mathrm{PCET}$ to this peroxo bridged intermediate without a coordinated water occurs at a rate of $1.54 \\times 10^{4} \\mathrm{~s}^{-1}$, generating a $5 \\mathrm{C} \\mathrm{Fe}^{\\mathrm{III}}-\\mathrm{OH}$ epoxide species similar to $\\mathbf{I}^{2 \\mathbf{c}}$; binding of this epoxide to the Fe generates $\\mathbf{I}^{3 \\mathbf{c}}$ (details on this PCET and subsequent epoxide binding are given in the SI). Note that an ENDOR study ${ }^{32}$ on NDO found that the substrate moves closer to the Fe (by $0.5 \\AA$ ) upon oxidation of the Rieske center; this would facilitate binding of the epoxide to the Fe. From the epoxide-bound intermediate, opening of the epoxide occurs with a barrier of $7.5 \\mathrm{kcal} / \\mathrm{mol}\\left(\\mathbf{T S}^{2 \\mathbf{c}}\\right)$. The IRC for this transition state goes to an $\\mathrm{Fe}^{\\mathrm{III}}-\\mathrm{O}-\\left(\\right.$ benzoate ${ }^{+}$) bridged species $\\left(\\mathbf{I}^{4 \\mathbf{c}}\\right)$ at $-30.4$ $\\mathrm{kcal} / \\mathrm{mol}$ relative to $\\mathrm{Fe}^{\\mathrm{II}}+\\mathrm{O}_{2}$. Geometry optimization of this species leads to spontaneous transfer of the $\\mathrm{OH}$ bound to the Fe to $\\mathrm{C} 2$ of the substrate, generating the final, highly thermodynamically favorable $(-63.0 \\mathrm{kcal} / \\mathrm{mol})$ cis-dihydroxylated product $\\left(\\mathbf{P}^{\\mathbf{c}}\\right)$. The $\\mathrm{Fe}$ remains high-spin $\\mathrm{Fe}^{\\mathrm{III}}$ throughout the reaction coordinate. All steps after the PCET have negative free energy relative to the starting system, indicating that these steps should be rapid and that the PCET mechanism described in section $3.5$ is capable of giving the correct final product.\n\n\\section{DISCUSSION}\nThe results presented above give important insights into the reactivity of the RDOs. First, the peroxide shunt reaction, which from NRVS has the side-on $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxo BZDOp as an intermediate, uses a different mechanism than the native $\\mathrm{Fe}^{\\mathrm{II}} \\mathrm{O}_{2}$ reaction, as shown in Scheme 3, bottom.\n\nIn the peroxide shunt, $\\mathrm{H}_{2} \\mathrm{O}_{2}$ binds to the $\\mathrm{Fe}^{\\mathrm{III}}$ catalytic site with an oxidized Rieske center to form BZDOp. The O-O bond then undergoes heterolytic cleavage with a barrier of $21.8$ $\\mathrm{kcal} / \\mathrm{mol}$, generating an $\\mathrm{Fe}^{\\mathrm{V}}(\\mathrm{O})(\\mathrm{OH})$ species that completes the cis-dihydroxylation reaction through electrophilic attack on the substrate. The calculated barrier is consistent with the slow product formation in the peroxide shunt reaction, and this mechanism is consistent with observations that a small amount of ${ }^{16} \\mathrm{O}$ exchanged product (10\\%) is formed when the peroxide shunt reaction is carried out with $\\mathrm{H}_{2}{ }^{18} \\mathrm{O}_{2}$ in NDO. ${ }^{41}$ In contrast, the native $\\mathrm{Fe}^{\\mathrm{II}} \\mathrm{O}_{2}$ reaction (Scheme 3 , top) is calculated to proceed through an $S=2 \\mathrm{Fe}^{\\mathrm{III}}$-superoxo intermediate formed upon binding of $\\mathrm{O}_{2}$ to the $\\mathrm{Fe}^{\\mathrm{II}}$ site, which attacks the substrate to form an $\\mathrm{Fe}^{\\mathrm{III}}$-peroxo bridgedaryl radical intermediate through a barrier of $13.7 \\mathrm{kcal} / \\mathrm{mol}$. At this point, the reaction is driven by a PCET process, with the electron coming from the Rieske center and the proton from a nearby source. The $\\mathrm{Fe}^{\\mathrm{III}}-\\mathrm{OH}$ epoxide species formed by the PCET process then completes the reaction coordinate. BZDOp and the $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo intermediate are not in an equilibrium with each other, as BZDOp is significantly more stable thermodynamically, and conversion of the $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo to BZDOp is slow; thus, the reaction mechanisms for the peroxide shunt and native $\\mathrm{O}_{2}$ reactions are not connected to each other. It should be noted that, as mentioned in the Introduction, side-on $\\mathrm{O}_{2}$ intermediates have been trapped in crystals of $\\mathrm{NDO}^{37}$ and $\\mathrm{CARDO}^{39}$ upon addition of $\\mathrm{O}_{2}$ to enzyme with reduced $\\mathrm{NHFe}^{\\mathrm{II}}$ and Rieske sites, and that these intermediates have oxidized Rieske centers and structures similar to that defined by NRVS for BZDOp. ${ }^{37,39}$ If proton transfer is more facile in the crystals, then PCET could occur at the superoxo stage to form a side-on $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy intermediate in the crystal similar to BZDOp; at the crystallographic temperatures ( $100 \\mathrm{~K})$, the barrier for O-O cleavage for this intermediate to react with substrate would be too high, as it is already high ( $21.8 \\mathrm{kcal} / \\mathrm{mol})$ at $277 \\mathrm{~K}$. The rate of superoxo attack on the substrate could also be slower in the crystal: in $\\mathrm{NDO}, \\mathrm{O}_{2}$ was added at $-17{ }^{\\circ} \\mathrm{C}$ (versus $4{ }^{\\circ} \\mathrm{C}$ for the BZDO single turnover experiments). An alternative, and more likely, possibility is that proton transfer is more restricted in the crystal state. From Figures 6 and 8, the only thermodynamically favorable process after forming the $\\mathrm{Fe}^{\\mathrm{III}}$ superoxo is ET from the Rieske to generate an unprotonated $\\mathrm{Fe}^{\\mathrm{III}}$-peroxo species. From section 3.1, such a side-on $\\mathrm{Fe}^{\\mathrm{III}}$-peroxo is also stable in BZDO, and from model studies a side-on $\\mathrm{Fe}^{\\mathrm{III}}$-peroxo species is unreactive in electrophilic attack. ${ }^{10}$\n\nSuperoxide intermediates such as the one proposed here in the native $\\mathrm{O}_{2}$ mechanism have been observed in two other mononuclear nonheme Fe enzyme classes: in IPNS ${ }^{15}$ and in an active site variant of the extradiol dioxygenase homoprotocatechuate 2,3-dioxygenase (HPCD). ${ }^{16}$ This provides some support for this intermediate in the RDOs; however, there are important differences between the RDOs and these other enzymes. The fact that a superoxo intermediate has been observed in IPNS and HPCD indicates that formation of this intermediate is thermodynamically favorable in those systems, while it is uphill by $\\sim 10$ $\\mathrm{kcal} / \\mathrm{mol}$ in BZDO. Previous computational studies have indeed found superoxo formation to be favorable in IPNS with its substrate bound to the $\\mathrm{Fe}^{\\mathrm{II}}$ site and attributed this to substrate binding tuning down the $\\mathrm{Fe}^{\\mathrm{II}} / \\mathrm{Fe}^{\\mathrm{III}}$ reduction potential. ${ }^{14}$ In BZDO, the substrate does not bind directly to the Fe, making superoxo formation unfavorable. The transient formation of the superoxide intermediate in BZDO is therefore driven by the favorable thermodynamics of the PCET step that occurs upon formation of the peroxo bridge intermediate.\n\nAn $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo intermediate as the reactive intermediate in the native $\\mathrm{O}_{2}$ reaction in the RDOs is consistent with the single turnover kinetics of BZDO, as discussed above. In addition to electrophilic attack on an aromatic ring, $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo complexes are also capable of performing $\\mathrm{HAA},{ }^{88}$ consistent with other observed reactivities of the Rieske oxygenases that include monooxygenation, ${ }^{21}$ the radical clock reaction in NDO with norcarane, ${ }^{89}$ and the oxidative carbocyclization reactions catalyzed by the Rieske enzymes RedG and McpG. ${ }^{22,90}$ Further, the mechanism developed here for the native $\\mathrm{BZDO} \\mathrm{O}_{2}$ reaction involves $\\mathrm{O}-\\mathrm{O}$ cleavage that is not concerted with attack of the second $\\mathrm{O}$ on the substrate, which is consistent with labeling experiments performed in the native $\\mathrm{O}_{2}$ reaction of NDO, which show only a very small amount $(\\sim 3 \\%)$ of ${ }^{16} \\mathrm{O}$ exchange in the product when the reaction is carried out with ${ }^{18} \\mathrm{O}_{2} \\cdot{ }^{87}$\n\nFinally, as described above, the barrier for the peroxide shunt reaction ( $21.8 \\mathrm{kcal} / \\mathrm{mol}$, Table 1 ) is much higher than that of the native $\\mathrm{O}_{2}$ reaction (13.7 $\\mathrm{kcal} / \\mathrm{mol}$, Table 2). The hydroperoxy intermediate BZDOp is thus less reactive than the $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo intermediate. However, if PCET were to occur at the $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo stage in the native $\\mathrm{O}_{2}$ reaction, this would generate an $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy intermediate at $-12.9 \\mathrm{kcal} / \\mathrm{mol}$ (from Figure 8 and Table 2). This species can rearrange to form BZDOp by losing a water ligand with an additional $1 \\mathrm{kcal} / \\mathrm{mol}$ of free energy; the rate limiting O-O cleavage TS for BZDOp would then be at $+9.9 \\mathrm{kcal} / \\mathrm{mol}$ relative to the $\\mathrm{Fe}^{\\mathrm{II}}+\\mathrm{O}_{2}$ initial state $(-12.9 \\mathrm{kcal} / \\mathrm{mol}+1 \\mathrm{kcal} / \\mathrm{mol}$ $+21.8 \\mathrm{kcal} / \\mathrm{mol}$ ). Thus, PCET to the superoxo species would be capable of giving the correct final product by going through the BZDOp mechanism without an additional barrier; however, this process would be rate limited by the PCET process. While there is a significant thermodynamic driving force for forming a hydroperoxo from a superoxo via PCET that would enable this reactivity, it is not sufficient to overcome the also significant reorganization energy associated with the catalytic and Rieske sites, leading to a slow rate of PCET. In contrast, the superoxo is highly reactive in electrophilic attack on the benzoate substrate, requiring only an additional $3.8 \\mathrm{kcal} / \\mathrm{mol}$ to reach the TS, with the total barrier of $13.7 \\mathrm{kcal} / \\mathrm{mol}$ (Table 2) consistent with the $190 \\mathrm{~s}^{-1}$ rate-limiting step in single turnover. The high electrophilic reactivity of the superoxo therefore dominates over its PCET reactivity, which is slowed by the large superoxo to hydroperoxo reorganization energy. PCET later in the reaction coordinate is not rate limiting, as the large reorganization energy for PCET to the peroxo bridge is overcome by the highly favorable thermodynamics associated with reduction and cleavage of the peroxo $\\mathrm{O}-\\mathrm{O}$ bond.\n\n\\section{CONCLUSION}\nIn summary, we have used NRVS spectroscopy to define the structure of the peroxide shunt intermediate in the RDOs and found this to be a high-spin side-on $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxy species. This intermediate performs cis-dihydroxylation through an initial heterolytic $\\mathrm{O}-\\mathrm{O}$ cleavage through a large barrier, generating an $\\mathrm{Fe}^{\\mathrm{V}}(\\mathrm{O})(\\mathrm{OH})$ species that then reacts with substrate. This peroxide shunt intermediate is not in equilibrium with a superoxo species on the native $\\mathrm{Fe}^{\\mathrm{II}} / \\mathrm{O}_{2}$ reaction pathway, and the native pathway instead proceeds through an initial $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo intermediate that directly attacks the substrate through a relatively low total barrier. This process is uphill thermodynamically but driven by a highly favorable, fast PCET process that occurs after superoxo attack on the substrate. We have thus established separate mechanisms for the native $\\mathrm{O}_{2}$ and peroxide shunt reactions in the RDOs and demonstrated the high reactivity of $\\mathrm{Fe}^{\\mathrm{III}}$-superoxo relative to $\\mathrm{Fe}^{\\mathrm{III}}$-hydroperoxo species in catalysis.\n\n\\section{Supplementary Material}\nRefer to Web version on PubMed Central for supplementary material.\n\n\\section{Acknowledgments}\nFunding for this work was provided by the National Institutes of Health (GM-40392 to E.I.S. and GM 118030 to J.D.L.) and JSPS KAKENHI (Grant No. 24221005 to M.S.). Synchrotron experiments at SPring-8 were performed with the approval of the Japan Synchrotron Radiation Research Institute (JASRI; proposal no. 2013B0105) and use of the Advanced Photon Source was supported by the Department of Energy, Office of Science, contract DEAC-02-06CH11357.\n\n\\section{References}\n\\begin{enumerate}\n  \\item Solomon EI, Brunold TC, Davis MI, Kemsley JN, Lee SK, Lehnert N, Neese F, Skulan AJ, Yang YS, Zhou J. Chem Rev. 2000; 100:235–349. [PubMed: 11749238]\n\n  \\item Solomon EI, Light KM, Liu LV, Srnec M, Wong SD. Acc Chem Res. 2013; 46:2725-2739. [PubMed: 24070107]\n\n  \\item Solomon EI, Goudarzi S, Sutherlin KD. Biochemistry. 2016; 55:6363. [PubMed: 27792301]\n\n  \\item Chow MS, Eser BE, Wilson SA, Hodgson KO, Hedman B, Fitzpatrick PF, Solomon EI. J Am Chem Soc. 2009; 131:7685–7698. [PubMed: 19489646]\n\n  \\item Kovaleva EG, Lipscomb JD. Nat Chem Biol. 2008; 4:186–193. [PubMed: 18277980]\n\n  \\item McDonald AR, Que L. Coord Chem Rev. 2013; 257:414-428.\n\n  \\item Eser BE, Barr EW, Frantom PA, Saleh L, Bollinger JM Jr, Krebs C, Fitzpatrick PF. J Am Chem Soc. 2007; 129:11334–11335. [PubMed: 17715926]\n\n  \\item Sinnecker S, Svensen N, Barr EW, Ye S, Bollinger JM Jr, Neese F, Krebs C. J Am Chem Soc. 2007; 129:6168-6179. [PubMed: 17451240]\n\n  \\item Burger RM, Peisach J, Horwitz SB. J Biol Chem. 1981; 256:1636-1644. [PubMed: 6257682]\n\n  \\item Cho J, Jeon S, Wilson SA, Liu LV, Kang EA, Braymer JJ, Lim MH, Hedman B, Hodgson KO, Valentine JS, Solomon EI, Nam W. Nature. 2011; 478:502-505. [PubMed: 22031443]\n\n  \\item Kim YM, Cho K, Cho J, Wang B, Li C, Shaik S, Nam W. J Am Chem Soc. 2013; 135:8838-8841. [PubMed: 23721290]\n\n  \\item Roach PL, Clifton IJ, Hensgens CMH, Shibata N, Schofield CJ, Hajdu J, Baldwin JE. Nature. 1997; 387:827-830. [PubMed: 9194566]\n\n  \\item Wood PM. Biochem J. 1988; 253:287–289. [PubMed: 2844170] 14. Brown CD, Neidig ML, Neibergall MB, Lipscomb JD, Solomon EI. J Am Chem Soc. 2007; 129:7427-7438. [PubMed: 17506560]\n\n  \\item Tamanaha E, Zhang B, Guo Y, Chang WC, Barr EW, Xing G, StClair J, Ye S, Neese F, Bollinger JM Jr, Krebs C. J Am Chem Soc. 2016; 138:8862–8874. [PubMed: 27193226]\n\n  \\item Mbughuni MM, Chakrabarti M, Hayden JA, Bominaar EL, Hendrich MP, Muenck E, Lipscomb JD. Proc Natl Acad Sci U S A. 2010; 107:16788-16793. [PubMed: 20837547]\n\n  \\item Christian GJ, Ye S, Neese F. Chem Sci. 2012; 3:1600-1611.\n\n  \\item Neibergall MB, Stubna A, Mekmouche Y, Munck E, Lipscomb JD. Biochemistry. 2007; 46:80048016. [PubMed: 17567152]\n\n  \\item Rivard BS, Rogers MS, Marell DJ, Neibergall MB, Chakrabarty S, Cramer CJ, Lipscomb JD. Biochemistry. 2015; 54:4652–4664. [PubMed: 26154836]\n\n  \\item Barry SM, Challis GL. ACS Catal. 2013; 3:2362-2370.\n\n  \\item Resnick S, Lee K, Gibson D. J Ind Microbiol. 1996; 17:438-457.\n\n  \\item Sydor PK, Barry SM, Odulate OM, Barona-Gomez F, Haynes SW, Corre C, Song LJ, Challis GL. Nat Chem. 2011; 3:388-392. [PubMed: 21505498]\n\n  \\item Ferraro DJ, Gakhar L, Ramaswamy S. Biochem Biophys Res Commun. 2005; 338:175–190. [PubMed: 16168954]\n\n  \\item Gibson DT, Parales RE. Curr Opin Biotechnol. 2000; 11:236–243. [PubMed: 10851146]\n\n  \\item Furukawa K. Curr Opin Biotechnol. 2000; 11:244–249. [PubMed: 10851151]\n\n  \\item Wolfe MD, Altier DJ, Stubna A, Popescu CV, Munck E, Lipscomb JD. Biochemistry. 2002; 41:9611–9626. [PubMed: 12135383]\n\n  \\item Martins BM, Svetlitchnaia T, Dobbek H. Structure. 2005; 13:817–824. [PubMed: 15893671]\n\n  \\item Kauppi B, Lee K, Carredano E, Parales RE, Gibson DT, Eklund H, Ramaswamy S. Structure. 1998; 6:571-586. [PubMed: 9634695]\n\n  \\item Parales RE, Parales JV, Gibson DT. J Bacteriol. 1999; 181:1831–1837. [PubMed: 10074076]\n\n  \\item Wolfe MD, Parales JV, Gibson DT, Lipscomb JD. J Biol Chem. 2001; 276:1945-1953. [PubMed: 11056161]\n\n  \\item Ohta T, Chakrabarty S, Lipscomb JD, Solomon EI. J Am Chem Soc. 2008; 130:1601-1610. [PubMed: 18189388]\n\n  \\item Yang TC, Wolfe MD, Neibergall MB, Mekmouche Y, Lipscomb JD, Hoffman BM. J Am Chem Soc. 2003; 125:7056-7066. [PubMed: 12783560]\n\n  \\item Friemann R, Lee K, Brown EN, Gibson DT, Eklund H, Ramaswamy S. Acta Crystallogr, Sect D: Biol Crystallogr. 2009; 65:24-33. [PubMed: 19153463]\n\n  \\item Inoue K, Ashikawa Y, Umeda T, Abo M, Katsuki J, Usami Y, Noguchi H, Fujimoto Z, Terada T, Yamane H, Nojiri H. J Mol Biol. 2009; 392:436–451. [PubMed: 19616558]\n\n  \\item Jakoncic J, Jouanneau Y, Meyer C, Stojanoff V. Biochem Biophys Res Commun. 2007; 352:861866. [PubMed: 17157819]\n\n  \\item (JCSG), Joint Center for Structural Genomics. To be published.\n\n  \\item Karlsson A, Parales JV, Parales RE, Gibson DT, Eklund H, Ramaswamy S. Science (Washington, DC, U S). 2003; 299:1039-1042.\n\n  \\item Friemann R, Ivkovic-Jensen MM, Lessner DJ, Yu C, Gibson DT, Parales RE, Eklund H, Ramaswamy S. J Mol Biol. 2005; 348:1139–1151. [PubMed: 15854650]\n\n  \\item Ashikawa Y, Fujimoto Z, Usami Y, Inoue K, Noguchi H, Yamane H, Nojiri H. BMC Struct Biol. 2012; 12:15. [PubMed: 22727022]\n\n  \\item Ferraro DJ, Okerlund A, Brown E, Ramaswamy S. IUCrJ. 2017; 4:648-656.\n\n  \\item Wolfe MD, Lipscomb JD. J Biol Chem. 2003; 278:829–835. [PubMed: 12403773]\n\n  \\item Davis MI, Wasinger EC, Decker A, Pau MYM, Vaillancourt FH, Bolin JT, Eltis LD, Hedman B, Hodgson KO, Solomon EI. J Am Chem Soc. 2003; 125:11214–11227. [PubMed: 16220940]\n\n  \\item Rieske JS, MacLennan DH, Coleman R. Biochem Biophys Res Commun. 1964; 15:338-344.\n\n  \\item Ohta T, Lipscomb JD, Solomon EI. Unpublished results.\n\n  \\item Seto M, Yoda Y, Kikuta S, Zhang XW, Ando M. Phys Rev Lett. 1995; 74:3828–3831. [PubMed: 10058307] 46. Sturhahn W, Toellner TS, Alp EE, Zhang X, Ando M, Yoda Y, Kikuta S, Seto M, Kimball CW, Dabrowski B. Phys Rev Lett. 1995; 74:3832-3835. [PubMed: 10058308]\n\n  \\item Liu LV, Bell CB III, Wong SD, Wilson SA, Kwak Y, Chow MS, Zhao J, Hodgson KO, Hedman B, Solomon EI. Proc Natl Acad Sci U S A. 2010; 107:22419–22424. [PubMed: 21149675]\n\n  \\item Wong SD, Srnec M, Matthews ML, Liu LV, Kwak Y, Park K, Bell CB III, Alp EE, Zhao J, Yoda Y, Kitao S, Seto M, Krebs C, Bollinger JM Jr, Solomon EI. Nature. 2013; 499:320-323. [PubMed: 23868262]\n\n  \\item Park K, Li N, Kwak Y, Srnec M, Bell CB III, Liu LV, Wong SD, Yoda Y, Kitao S, Seto M, Hu M, Zhao J, Krebs C, Bollinger JM Jr, Solomon EI. J Am Chem Soc. 2017; 139:7062–7070. [PubMed: 28457126]\n\n  \\item Sutherlin KD, Liu LV, Lee YM, Kwak Y, Yoda Y, Saito M, Kurokuzu M, Kobayashi Y, Seto M, Que L, Nam W, Solomon EI. J Am Chem Soc. 2016; 138:14294. [PubMed: 27726349]\n\n  \\item Cohen-Bazire G, Sistrom WR, Stanier RY. J Cell Comp Physiol. 1957; 49:25-68. [PubMed: $13416343]$\n\n  \\item Smith MC, Xiao Y, Wang H, George SJ, Coucouvanis D, Koutmos M, Sturhahn W, Alp EE, Zhao J, Cramer SP. Inorg Chem. 2005; 44:5562–5570. [PubMed: 16060605]\n\n  \\item Sturhahn W. Hyperfine Interact. 2000; 125:149-172.\n\n  \\item Frisch, MJ., Trucks, GW., Schlegel, HB., Scuseria, GE., Robb, MA., Cheeseman, JR., Scalmani, G., Barone, V., Mennucci, B., Petersson, GA., Nakatsuji, H., Caricato, M., Li, X., Hratchian, HP., Izmaylov, AF., Bloino, J., Zheng, G., Sonnenberg, JL., Hada, M., Ehara, M., Toyota, K., Fukuda, R., Hasegawa, J., Ishida, M., Nakajima, T., Honda, Y., Kitao, O., Nakai, H., Vreven, T., Montgomery, JA., Jr, Peralta, JE., Ogliaro, F., Bearpark, M., Heyd, JJ., Brothers, E., Kudin, KN., Staroverov, VN., Kobayashi, R., Normand, J., Raghavachari, K., Rendell, A., Burant, JC., Iyengar, SS., Tomasi, J., Cossi, M., Rega, N., Millam, NJ., Klene, M., Knox, JE., Cross, JB., Bakken, V., Adamo, C., Jaramillo, J., Gomperts, R., Stratmann, RE., Yazyev, O., Austin, AJ., Cammi, R., Pomelli, C., Ochterski, JW., Martin, RL., Morokuma, K., Zakrzewski, VG., Voth, GA., Salvador, P., Dannenberg, JJ., Dapprich, S., Daniels, AD., Farkas, Ö., Foresman, JB., Ortiz, JV., Cioslowski, J., Fox, DJ. Gaussian 09, Revision D. 01. Gaussian, Inc; Wallingford, CT: 2009.\n\n  \\item Becke AD. J Chem Phys. 1993; 98:5648-5652.\n\n  \\item Lee CT, Yang WT, Parr RG. Phys Rev B: Condens Matter Mater Phys. 1988; 37:785–789.\n\n  \\item Vosko SH, Wilk L, Nusair M. Can J Phys. 1980; 58:1200-1211.\n\n  \\item Stephens PJ, Devlin FJ, Chabalowski CF, Frisch MJ. J Phys Chem. 1994; 98:11623–11627.\n\n  \\item McLean AD, Chandler GS. J Chem Phys. 1980; 72:5639-5648.\n\n  \\item Krishnan R, Binkley JS, Seeger R, Pople JA. J Chem Phys. 1980; 72:650-654.\n\n  \\item Hay JP. J Chem Phys. 1977; 66:4377-4384.\n\n  \\item Roos B, Veillard A, Vinot G. Theor Chim Acta. 1971; 20:1-11.\n\n  \\item Raghavachari K, Trucks GW, Pople JA, Headgordon M. Chem Phys Lett. 1989; 157:479–483.\n\n  \\item Liu LV, Hong S, Cho J, Nam W, Solomon EI. J Am Chem Soc. 2013; 135:3286-3299. [PubMed: 23368958]\n\n  \\item Cramer CJ, Truhlar DG. Chem Rev. 1999; 99:2161–2200. [PubMed: 11849023]\n\n  \\item Johnson M, Zaretskaya I, Raytselis Y, Merezhuk Y, McGinnis S, Madden TL. Nucleic Acids Res. 2008; 36:5-9.\n\n  \\item Park K, Solomon EI. Can J Chem. 2014; 92:975. [PubMed: 28943644]\n\n  \\item Tenderholt, A. gennrvs, Python script Version 28. 2009. Available at \\href{http://www.stanford.edu/}{http://www.stanford.edu/} group/solomon/gennrvs/gennrvs.py.txt\n\n  \\item Kieber-Emmons, MT. Lumo, Version 1.0.1. 2012.\n\n  \\item Tenderholt, AT. QMForge, Version 2.1. 2007.\n\n  \\item Geronimo I, Paneth P. Phys Chem Chem Phys. 2014; 16:13889–13899. [PubMed: 24898662]\n\n  \\item Bassan A, Blomberg MRA, Siegbahn PEM. JBIC, J Biol Inorg Chem. 2004; 9:439-452. [PubMed: 15042436]\n\n  \\item Pabis A, Geronimo I, Paneth P. J Phys Chem B. 2014; 118:3245-3256. [PubMed: 24624972] 74. Chen H, Lai W, Yao J, Shaik S. J Chem Theory Comput. 2011; 7:3049–3053. [PubMed: 26598148]\n\n  \\item Marcus RA. J Phys Chem. 1968; 72:891-899.\n\n  \\item Gilmore K, Alabugin IV. Chem Rev. 2011; 111:6513–6556. [PubMed: 21861478]\n\n  \\item Kuznetsov AM, Zueva EM, Masliy AN, Krishtalik LI. Biochim Biophys Acta, Bioenerg. 2010; 1797:347-359.\n\n  \\item Ullmann GM, Noodleman L, Case DA. JBIC, J Biol Inorg Chem. 2002; 7:632-639. [PubMed: 12072969]\n\n  \\item Donald WA, Leib RD, O'Brien JT, Williams ER. Chem - Eur J. 2009; 15:5926-5934. [PubMed: 19440999]\n\n  \\item Schaefer AW, Kieber-Emmons MT, Adam SM, Karlin KD, Solomon EI. J Am Chem Soc. 2017; 139:7958-7973. [PubMed: 28521498]\n\n  \\item Brown EN, Friemann R, Karlsson A, Parales JV, Couture MMJ, Eltis LD, Ramaswamy S. JBIC, J Biol Inorg Chem. 2008; 13:1301-1313. [PubMed: 18719951]\n\n  \\item Bassan A, Blomberg MRA, Borowski T, Siegbahn PEM. J Phys Chem B. 2004; 108:13031-13041.\n\n  \\item Marcus RA. J Chem Phys. 1956; 24:966-978.\n\n  \\item Cowley RE, Tian L, Solomon EI. Proc Natl Acad Sci U S A. 2016; 113:12035-12040. [PubMed: 27790986]\n\n  \\item Auer B, Fernandez LE, Hammes-Schiffer S. J Am Chem Soc. 2011; 133:8282-8292. [PubMed: 21524104]\n\n  \\item Sigfridsson E, Olsson MHM, Ryde U. Inorg Chem. 2001; 40:2509–2519. [PubMed: 11350228]\n\n  \\item Jeffrey AM, Yeh HJC, Jerina DM, Patel TR, Davey JF, Gibson DT. Biochemistry. 1975; 14:575584. [PubMed: 234247]\n\n  \\item Chiang CW, Kleespies ST, Stout HD, Meier KK, Li PY, Bominaar EL, Que L, Münck E, Lee WZ. J Am Chem Soc. 2014; 136:10846–10849. [PubMed: 25036460]\n\n  \\item Chakrabarty S, Austin RN, Deng D, Groves JT, Lipscomb JD. J Am Chem Soc. 2007; 129:35143515. [PubMed: 17341076]\n\n  \\item Zhou J, Kelly WL, Bachmann BO, Gunsior M, Townsend CA, Solomon EI. J Am Chem Soc. 2001; 123:7388-7398. [PubMed: 11472170]\n\n\\end{enumerate}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-20_210_1226_641_1690}\n\\end{center}\n\nFigure 1.\n\nNRVS spectra of BZDO. The Rieske center is loaded with ${ }^{57} \\mathrm{Fe}$ in all spectra. Black: NRVS of the Rieske center (apo BZDO, catalytic site not loaded with ${ }^{57} \\mathrm{Fe}$ ). Red: $\\mathrm{BDO}_{\\mathrm{OX}}$ (catalytic site loaded with ${ }^{57} \\mathrm{Fe}$ ). Blue: BZDOp generated with $\\mathrm{H}_{2}{ }^{16} \\mathrm{O}_{2}$ (catalytic site loaded with ${ }^{57} \\mathrm{Fe}$ ). Inset: NRVS of BZDOp generated with $\\mathrm{H}_{2}{ }^{16} \\mathrm{O}_{2}$ (blue solid line) and $\\mathrm{H}_{2}{ }^{18} \\mathrm{O}_{2}$ (blue dashed line) in the region between 485 and $520 \\mathrm{~cm}^{-1}$ showing a low-intensity isotopesensitive feature. These data were collected with a $10 \\times$ longer measurement time between 460 and $540 \\mathrm{~cm}^{-1}$ than the spectrum shown in blue at the bottom of this figure (see the Methods). Error bars (gray) are calculated based on the number of counts in the raw spectrum and were propagated upon baseline subtraction (see Figure S2 for the PVDOS spectra for ${ }^{16} \\mathrm{O}$ and ${ }^{18} \\mathrm{O}$ BZDOp between 460 and $540 \\mathrm{~cm}^{-1}$ ).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-21_206_1502_781_1545}\n\\end{center}\n\nFigure 2.\n\nNRVS spectrum of BZDOp (A) compared with three DFT-simulated spectra of possible structures: side-on peroxy (B, green), side-on hydroperoxy (C, blue), and end-on hydroperoxy (D, red). Intensity in the region between 480 and $540 \\mathrm{~cm}^{-1}$ (between the cyan lines) has been multiplied by 10 in the $\\operatorname{BZDOp}(\\mathrm{A})$ data to show the Fe-O stretch on the same scale as the rest of the NRVS spectrum. The intensities in the simulations have not been adjusted. The right axis of the simulations depicts the calculated amount of Fe displacement in each normal mode, represented by the vertical sticks, in A. Regions where BZDOp has features distinct from the Rieske center, and $\\mathrm{BZDO}_{\\mathrm{OX}}$ are highlighted between purple and cyan vertical dotted lines. Schematic depictions of the DFT structures are included as insets.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-22_210_1080_641_1690}\n\\end{center}\n\nFigure 3.\n\nDFT-optimized structure of BZDOp that is consistent with the NRVS data. Protein carbons are shown in green, benzoate carbons in purple, nitrogens in blue, oxygens in red, hydrogens in white, and iron in orange.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_cb81fee8faa69f4d7078g-23_207_725_600_1736}\n\nFigure 4.\n\nLeft: Schematic of BZDOp with the O-substrate (carbon 2) coordinate shown in blue and the O-O coordinate shown in red. Right: 2D potential energy surface for BZDOp reacting with substrate, with O-O elongation on the $x$-axis and O-substrate contraction on the $y$-axis. The starting point of the surface is at the upper-left corner marked by an R, and the ending point is at the lower-right and marked by a P. Electronic energies are given on the contours in 2 $\\mathrm{kcal} / \\mathrm{mol}$ increments, with colors closer to the blue end of the spectrum corresponding to higher energies.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-24_206_1003_538_1782}\n\\end{center}\n\nFigure 5.\n\nCalculated mechanism of cis-dihydroxylation by BZDOp. All energies given are Gibbs free energy. The reaction was calculated on the $S=5 / 2$ surface (red lines) and $S=3 / 2$ surface (green lines). Schematics of the structures along the reaction coordinate are given and labeled at the bottom, with the DFT structures shown in Figure S5 and FMOs given in Figure S6. The electronic structure schemes for the Fe d orbitals, the substrate $\\pi$ orbital involved in the reaction, and the $\\mathrm{OH}$ group are given at the bottom for the final four structures corresponding to the lowest energy spin state.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-25_215_1058_533_1739}\n\\end{center}\n\nFigure 6.\n\nReaction coordinate for BZDO with $\\mathrm{O}_{2}$ without transferring an electron from the Rieske center. The displayed energies are Gibbs free energies. Red lines are the $S=2$ surface, green are $S=3$, and purple are $S=1$. Schematics of the structures are shown at the bottom, with the lowest energy DFT structures shown in Figure S7. The rate-limiting step for this reaction, $\\mathbf{T S}^{2 \\mathbf{b}}$, corresponds to cleavage of the peroxo O-O bond and has a barrier of $29.1$ $\\mathrm{kcal} / \\mathrm{mol}$, too high to be involved in catalysis; therefore, ET must occur prior to this step.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-26_218_953_494_1821}\n\\end{center}\n\nFigure 7.\n\na LUMO FMO of species along the $S=2$ superoxo attack on benzoate coordinate, with labels corresponding to Figure 6 at the top and Mulliken populations given at the bottom. The initial attacking superoxo species $\\mathbf{1}^{\\mathbf{b}}$ primarily has a hole in the $\\mathrm{O}_{2}{ }^{\\cdot-} \\pi_{\\mathrm{v}}^{*} \\mathrm{FMO}$ (perpendicular to the O-O plane), and at $\\mathbf{T S}^{\\mathbf{1 b}}$ this hole character is predominantly shifted to the substrate, generating the $\\mathrm{Fe}^{\\mathrm{III}}-\\mathrm{O}_{2}$-(benzoate*) intermediate $\\mathbf{I}^{\\mathbf{1 b}}$. (Note that these FMOs are taken from calculations where Asn203 has been added to the model, vide infra; this has no significant effect on energetics or orbital populations.).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-27_207_1159_533_1798}\n\\end{center}\n\nFigure 8.\n\n(Top) Diagrams schematically depicting PCET to the superoxo species (A) and the peroxybridged species (B), as well as the uncoupled PT $\\rightarrow$ ET and ET $\\rightarrow$ PT processes. The fastest kinetic step (PCET in both cases) is highlighted in green. $\\Delta G^{\\circ}$ in $\\mathrm{kcal} / \\mathrm{mol}$ are shown for all steps in red, with steps involving protonation using guanidinium as the proton source, and $\\lambda_{\\mathrm{i}}$ in $\\mathrm{eV}$ are given for PCET and ET steps. The bottom of both sides shows the DFT structures for the reactants and products of the PCET process with second-sphere residues hidden for clarity. Substrate carbons are in purple, protein carbons in green, oxygen in red, nitrogen in blue, iron in orange, and hydrogen in white.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-28_206_1155_535_1807}\n\\end{center}\n\nFigure 9.\n\nReaction coordinate for completing the native $\\mathrm{O}_{2}$ mechanism in $\\mathrm{BZDO}$. Oxygen atoms from $\\mathrm{O}_{2}$ are shown in red. All energies are in Gibbs free energy relative to the $\\mathrm{Fe}^{\\mathrm{II}}$ resting starting material (Figure 6), with PCET energetics as in Figure 8. After PCET to the $S=2$ peroxybridged intermediate (brown line and text), all structures considered were on the $S=5 / 2$ surface (red lines and text). Structural schemes for all species on the reaction coordinate are shown at the bottom, with DFT structures given in the SI (Figure S8). All calculated structures here included Asp303 in the cluster model.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-29_209_740_642_1689}\n\\end{center}\n\nScheme 1. Two Possible Reaction Mechanisms for BZDOp Involving an O-O Cleavage Prior to Reaction with Substrate (1) or Direct Attack on the Substrate Concerted with O-O Cleavage (2) a The Rieske center remains oxidized throughout and does not participate in the shunt reaction.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-30_220_393_516_958}\n\\end{center}\n\n$S=0$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_cb81fee8faa69f4d7078g-30_503_969_558_912}\n\n\\[\nS=5 / 2\n\\]\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-30_217_352_1034_1264}\n\\end{center}\n\n$-86.1 \\mathrm{kcal} / \\mathrm{mol}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-30_652_952_997_1323}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-30_221_386_1380_1819}\n\\end{center}\n\n$S=1 / 2$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-30_518_973_1431_1756}\n\\end{center}\n\n$S=2$\n\nScheme 2. Thermodynamics of Conversion between BZDOp (Left) and an $S=2 \\mathrm{Fe}^{\\mathrm{III}} \\mathrm{O}_{2}{ }^{\\bullet-}$ Rieske $^{\\text {red }}$ Species (Right) ${ }^{\\mathbf{a}}$\n\na The numbers given reflect bulk solvent as the proton acceptor. The net reaction favors BZDOp by $43.2 \\mathrm{kcal} / \\mathrm{mol}$.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_cb81fee8faa69f4d7078g-31_218_640_534_1804}\n\nScheme 3. Mechanisms As Developed in Section 3 for the Native $\\mathbf{O}_{2}$ Reaction (Top) and the Peroxide Shunt Reaction (Bottom) in BZDO B $^{\\mathbf{a}}$\n\na In catalysis on the native $\\mathrm{O}_{2}$ coordinate, the $\\mathrm{Fe}^{\\mathrm{II}}$ resting state is regenerated by reduction of the Rieske and mononuclear sites, which leads to dissociation of the product. See Figure S8 for the stereochemistry of the epoxide species.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-32_659_2372_173_1198}\n\\end{center}\n\nJAm Chem Soc. Author manuscript; available in PMC 2018 May 29.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_cb81fee8faa69f4d7078g-33_736_2365_187_1255}\n\\end{center}\n\nJ Am Chem Soc. Author manuscript; available in PMC 2018 May 29.\n\n\n\\end{document}", "record_id": "2023_09_22_cb81fee8faa69f4d7078g"}