{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{APS physics }\n\n\n\\author{Konstantin Klyukin ${ }^{1 \\S}$, L. L. Tao ${ }^{2 \\S}$, Evgeny Y. Tsymbal ${ }^{2,3}$, and Vitaly Alexandrov ${ }^{1,3 *}$\\\\\n${ }^{1}$ Department of Chemical and Biomolecular Engineering, University of Nebraska, Lincoln, NE 68588, USA\\\\\n${ }^{2}$ Department of Physics and Astronomy, University of Nebraska, Lincoln, NE 68588, USA\\\\\n${ }^{3}$ Nebraska Center for Materials and Nanoscience, University of Nebraska, Lincoln, NE 68588, USA and\\\\\n$\\S$ These authors contributed equally to this work}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nThis is the accepted manuscript made available via CHORUS. The article has been published as:\n\n\\section{Defect-Assisted Tunneling Electroresistance in Ferroelectric Tunnel Junctions}\nKonstantin Klyukin, L. L. Tao, Evgeny Y. Tsymbal, and Vitaly Alexandrov Phys. Rev. Lett. 121, 056601 - Published 3 August 2018\n\nDOI: 10.1103/PhysRevLett.121.056601\n\n\\section*{Defect-Assisted Tunneling Electroresistance in Ferroelectric Tunnel Junctions }\n\n\n\\begin{abstract}\nRecent experimental results have demonstrated ferroelectricity in thin films of $\\mathrm{SrTiO}_{3}$ induced by antisite $\\mathrm{Ti}_{\\mathrm{Sr}}$ defects. This opens a possibility to use $\\mathrm{SrTiO}_{3}$ as a barrier layer in ferroelectric tunnel junctions (FTJs) emerging electronic devices promising for applications in nanoelectronics. Here using density functional theory combined with quantum-transport calculations applied to a prototypical $\\mathrm{Pt} / \\mathrm{SrTiO}_{3} / \\mathrm{Pt} \\mathrm{FTJ}$, we demonstrate that the localized in-gap energy states produced by the antisite $\\mathrm{Ti}_{\\mathrm{Sr}}$ defects are responsible for the enhanced electron tunneling conductance which can be controlled by ferroelectric polarization. Our tight-binding modeling, which takes into account multiple defects, shows that the predicted defect-assisted tunneling electroresistance effect is greatly amplified when the defect energy levels are brought to the Fermi energy by one of the polarization states. Our results have implications for FTJs based on conventional ferroelectric barriers with defects and can be employed for the design of new types of FTJs with enhanced performance.\n\\end{abstract}\n\nFerroelectric tunnel junctions (FTJs) have recently attracted significant interest due to their non-trivial fundamental properties promising for application in nanoelectronic devices [1, 2]. FTJs consist of two metal electrodes separated by a nanometer-thick ferroelectric barrier layer. The key functional property of a FTJ is the tunneling electroresistance (TER) effect - a large resistance change produced by electricallydriven reversal of ferroelectric polarization [3, 4]. Following the proof of principle based on scanning probe microscopy techniques applied to ferroelectric films without top electrodes $[5,6]$, there have been a number of successful experimental demonstrations of the TER effect in trilayer device structures [7-10], showing the potential of FTJs for nonvolatile memory applications [11].\n\nFrom the point of view of these applications, it is desirable to obtain a larger TER contrast at room temperature. Motivated by this goal, efforts have been invested to elucidate factors controlling the TER in FTJs. A number of physical mechanisms responsible for TER have been identified [12]. It was found that the structural and/or electronic asymmetry of the FTJ plays a decisive role for the appearance and magnitude of the TER effect. Such asymmetry can be achieved using dissimilar electrodes [3,13-16], interface engineering [17-22], or applied bias [23].\n\nIt is known, on the other hand, that ferroelectric thin-film structures are prone to a variety of structural defects (e.g., $[24,25])$. Their appearance and response to an applied electric field affect properties of FTJs. For example, an electron gas stabilized by oxygen vacancies and confined within the headto-head ferroelectric domain wall was shown to be responsible for resonant tunneling [26]. Moreover, point defects can play the central role in the emergence of ferroelectricity itself. It was predicted that antisite $\\mathrm{Ti}_{\\mathrm{Sr}}$ defects, where Ti substitutes $\\mathrm{Sr}$ in the $\\mathrm{Sr}$-deficient $\\mathrm{SrTiO}_{3}$, are prone to Ti off-centering displacement, producing a local dipole moment and polarizing the surrounding region [27]. The electrically-induced alignment of these polar nanoregions leads to a stable and switchable ferroelectric polarization in $\\mathrm{SrTiO}_{3}$ films [28]. Recently, it was demonstrated that such defects are not only responsible for ferroelectricity, but may propel the highly conductive channels in ultrathin $\\mathrm{SrTiO}_{3}$ films [29].\n\nIn this Letter, we predict a defect-assisted mechanism of the TER effect in FTJs with a ferroelectric $\\mathrm{SrTiO}_{3}$ barrier layer. It is known that the antisite $\\mathrm{Ti}_{\\mathrm{Sr}}$ defects form localized energy levels in the energy band gap of $\\mathrm{SrTiO}_{3}[27,30]$. Such defect states can assist tunneling conductance through resonant tunneling, where the transmission coefficient is peaked at the energy of the localized state $[31,32]$. In bulk $\\mathrm{SrTiO}_{3}$, the energy levels of the antisite $\\mathrm{Ti}_{\\mathrm{Sr}}$ defect by symmetry do not depend on the dipole moment orientation. In $\\mathrm{SrTiO}_{3}$-based FTJs, however, the symmetry is broken either by position of the defect with respect to the electrodes or asymmetric structure of the FTJ (e.g., different electrodes, interface terminations, etc.). In this case, the defect level energy does depend on the orientation of the dipole moment, producing a sizable change in the conductance with reversal of ferroelectric polarization. This manifests a defect-assisted TER, which we explore using a $\\mathrm{Pt} / \\mathrm{SrTiO}_{3} / \\mathrm{Pt} \\mathrm{FTJ}$ as a representative example. Based on first-principles density functional theory (DFT) calculations, we demonstrate a sizable effect of ferroelectric polarization on transmission across the FTJ driven by the localized states of the antisite $\\mathrm{Ti}_{\\mathrm{Sr}}$ defects. Our results enable design of new FTJs via appropriate defect engineering to exploit the defect-assisted TER effect in practice.\n\nDFT calculations are performed as described in Supplemental Material [33] for a $\\mathrm{Pt} / \\mathrm{SrTiO}_{3} / \\mathrm{Pt}$ FTJ with symmetric interfaces and an antisite $\\mathrm{Ti}_{\\mathrm{Sr}}$ defect placed in $\\mathrm{SrTiO}_{3}$ (Figs. 1(c) and 1(e)). Consistent with the previous results [27, 30], we find that the antisite $\\mathrm{Ti}_{\\mathrm{Sr}}$ defect produces a localized energy level in the band gap of bulk $\\mathrm{SrTiO}_{3}$ (Figs. 1(a) and 1(b)). This defect level accommodates two electrons in the spin-up component (due to the difference in valence between $\\mathrm{Sr}^{+2}$ and $\\mathrm{Ti}^{+4}$ ), resulting in the magnetic moment of $2 \\mu_{B}$, and consists of two sub-levels with the $e_{g}$ and $t_{2 g}$ orbital character. Due to being comprised of a negatively charged $\\mathrm{Sr}$ vacancy and a positively charged $\\mathrm{Ti}$ interstitial, the $\\mathrm{Ti}_{\\mathrm{Sr}}$ defect produces an\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_109a6cd5d015ce89e7f3g-3_191_340_279_518}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_109a6cd5d015ce89e7f3g-3_194_337_584_1194}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_109a6cd5d015ce89e7f3g-3_367_706_302_522}\n\\end{center}\n\n(d)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_109a6cd5d015ce89e7f3g-3_369_705_576_1170}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_109a6cd5d015ce89e7f3g-3_195_236_1217_1859}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_109a6cd5d015ce89e7f3g-3_217_255_1241_1857}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_109a6cd5d015ce89e7f3g-3_247_285_1260_1857}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_109a6cd5d015ce89e7f3g-3_271_309_1262_1861}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_109a6cd5d015ce89e7f3g-3_290_333_1256_1866}\n\\end{center}\n\n(f)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_109a6cd5d015ce89e7f3g-3_366_702_1225_1827}\n\\end{center}\n\nFIG. 1. Atomic structure of bulk $\\mathrm{SrTiO}_{3}$ (a) and $\\mathrm{Pt}^{2} \\mathrm{SrTiO}_{3} / \\mathrm{Pt} \\mathrm{FTJ}^{\\text {with a Tisr }}$ antisite defect for right $\\mathrm{P}_{\\rightarrow}$ (c) and left $\\mathrm{P}_{\\leftarrow}$ (e) polarization states. Grey spheres denote Pt, blue - Ti, green - Sr, red - O, and black - $\\mathrm{Ti}_{\\mathrm{Sr}}$. Density of states (DOS) of bulk $\\mathrm{SrTiO}_{3}$ (b) and layer-resolved local DOS (LDOS) of $\\mathrm{Pt}^{\\mathrm{SrTiO}} \\mathrm{Si}_{3} / \\mathrm{Pt}$ for $\\mathrm{P}_{\\rightarrow}$ (d) and $\\mathrm{P}_{\\leftarrow}$ (f) states for spin up (left panels) and spin down (right panels). The Fermi level ( $E_{F}$ ) is shown by dashed lines. Orange lines indicate the conduction band minimum (CBM) and valence band maximum (VBM) across SrTiO 3 .\n\nelectric dipole polarizing the surrounding region. By symmetry, the defect level energy and the electric polarization of an isolated defect in bulk $\\mathrm{SrTiO}_{3}$ do not depend on the orientation of its dipole moment.\n\nThis behavior changes in a FTJ (Figs. 1(c) and 1(e)), where the energetics and electronic properties of the antisite defect depend of the defect position in the $\\mathrm{SrTiO}_{3}$ layer. We find that the $\\mathrm{Ti}_{\\mathrm{Sr}}$ defect located at the interface has $0.11 \\mathrm{eV}$ lower energy than that placed in the middle of the junction. Due to the depolarizing field associated with the interface, $\\mathrm{Ti}_{\\mathrm{Sr}}$ offcentering is larger for polarization pointing to the interface $\\left(\\mathrm{P}_{\\rightarrow}\\right.$ state) than for polarization pointing towards the center of the junction $\\left(\\mathrm{P}_{\\leftarrow}\\right.$ state). Specifically, for $\\mathrm{Ti}_{\\text {Sr }}$ placed in the second layer from the interface (Figs. 1(c) and 1(e)) the offcentering is $0.78 \\AA$ for the $\\mathrm{P}_{\\rightarrow}$ state and $0.72 \\AA$ for the $\\mathrm{P}_{\\leftarrow}$ state. This difference is reduced as the defect is placed closer to the central layer.\n\nThese results indicate that in experimental conditions the defect distribution will be inhomogeneous with the preference of defects to be located closer to the interface. In addition, for FTJs with different metal electrodes or different interface terminations, there will be certain asymmetry in the energy and polarization state of the defect level due to the intrinsic electric field across the FTJ. To qualitatively reflect this asymmetry, we analyze the electronic and transport properties of the $\\mathrm{Pt} / \\mathrm{SrTiO}_{3} / \\mathrm{Pt} \\mathrm{FTJ}$ with a single $\\mathrm{Ti}_{\\mathrm{Sr}}$ defect placed in the second layer from the interface as shown in Figs. 1(c) and 1(e).\n\nFigures 1(d) and 1(f) show the local density of states (LDOS) across the $\\mathrm{SrTiO}_{3}$ layer for right $\\mathrm{P}_{\\rightarrow}$ (Fig. 1(c)) and left $\\mathrm{P}_{\\leftarrow}$ (Fig. 1(e)) polarization states, respectively. It is seen that the LDOS projected onto the layer with the $\\mathrm{Ti}_{\\text {Sr }}$ defect exhibits a localized state in the energy gap of $\\mathrm{SrTiO}_{3}$ similar to that for bulk $\\mathrm{SrTiO}_{3}$ (Fig. 1(b)). The energy position of this state depends on polarization orientation: for the $\\mathrm{P}_{\\leftarrow}$ polarization state the defect level appears deeper in energy (Fig. 1(f)) as compared to the $\\mathrm{P}_{\\rightarrow}$ polarization state where the defect level moves closer to the Fermi energy (Fig. 1(d)) . This behavior is explained by the asymmetric position of the defect in the FTJ and proximity to the metal electrode. The $\\mathrm{Ti}_{S r}$ defect produces an electric dipole polarizing the surrounding region. The electrostatic potential energy associated with this dipole increases in the direction opposite to the dipole orientation. Due to the proximity of the Pt electrode where the electric field is screened, the potential energy increases (decreases) when moving away from the interface into $\\mathrm{SrTiO}_{3}$ for the $\\mathrm{P}_{\\rightarrow}\\left(\\mathrm{P}_{\\leftarrow}\\right)$ state. This behavior is seen from the variation in the conduction band minimum (CBM) and the valence band maximum (VBM) depending on polarization direction (orange lines in Figs. 1(d) and 1(f)). The increase (decrease) in the potential energy with respect to that in $\\mathrm{Pt}$ pushes the defect level up (down) in energy for the $\\mathrm{P}_{\\rightarrow}\\left(\\mathrm{P}_{\\leftarrow}\\right)$ state. We find that the shift in the defect level energy with polarization reversal is $0.16 \\mathrm{eV}$ when it is located in the second layer from the $\\mathrm{SrTiO}_{3} / \\mathrm{Pt}$ interface. This value increases up to $0.26 \\mathrm{eV}$ for the defect placed in the first layer and drops down to $0.06 \\mathrm{eV}$ for the defect in the third layer.\n\nThe polarization-controlled localized states in the band gap of $\\mathrm{SrTiO}_{3}$ affect tunneling conductance. Fig. 2(a) shows the calculated total transmission $T=T_{\\uparrow}+T_{\\downarrow}$ across the $\\mathrm{Pt} / \\mathrm{SrTiO}_{3} / \\mathrm{Pt}$ FTJ as a function of energy $E$. The overall trend for the transmission being enhanced for energies approaching the CBM and VBM and reduced for midgap energies is consistent with the energy-dependent decay rate of the evanescent states in $\\mathrm{SrTiO}_{3}$ (see, e.g., ref. [12]). On top of this trend, however, there is a dramatic variation in the transmission probability for energies crossing the $\\mathrm{Ti}_{\\mathrm{Sr}}$ defect levels indicated in Fig. 2(a) by the background LDOS. The observed variation is correlated with the polarization dependent LDOS, revealing tendency for $T(E)$ to be enhanced in regions where LDOS is high and resulting in crossover between $\\mathrm{P}_{\\rightarrow}$ and $\\mathrm{P}_{\\leftarrow}$ dominated transmission depending on energy.\n\nThis correlation becomes especially evident when we consider the spin polarization of transmission defined by ratio $\\left(T_{\\uparrow}-T_{\\downarrow}\\right) /\\left(T_{\\uparrow}+T_{\\downarrow}\\right)$. Since the localized defect states appear\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_109a6cd5d015ce89e7f3g-4_194_922_215_1003}\n\nFIG. 2. (a) Total transmission $T=T_{\\uparrow}+T_{\\downarrow}$ and (b) spin polarization of the transmission $\\left(T_{\\uparrow}-T_{\\downarrow}\\right) /\\left(T_{\\uparrow}+T_{\\downarrow}\\right)$ calculated for the $\\mathrm{Pt} / \\mathrm{SrTiO}_{3} / \\mathrm{Pt}$ FTJ in $\\mathrm{P}_{\\rightarrow}$ and $\\mathrm{P}_{\\leftarrow}$ ferroelectric states as a function of energy (left-side axis, logarithmic scale). LDOS on the $\\mathrm{Ti}_{\\mathrm{Sr}}$ site is plotted in background (right-side axis) for $\\mathrm{P}_{\\rightarrow}$ (red) and $\\mathrm{P}_{\\leftarrow}$ (blue) states.\n\nonly in the spin-up channel, this ratio is expected to reflect the effect of defect states on $T(E)$. We find, for both $\\mathrm{P}_{\\rightarrow}$ and $\\mathrm{P}_{\\leftarrow}$ states, that the spin polarization has sharp peaks at around defect state energies (Fig. 2(b)). At these energies $T_{\\uparrow}$ is an order of magnitude higher than $T_{\\downarrow}$ demonstrating that the localized defect states are resonant states which dramatically enhance the transmission [34].\n\nThe resonant mechanism of electron transport is evident from the calculated transmission probability as a function of the transverse wave vector $\\mathbf{k}_{\\|}$(which is conserved in the process of tunneling). Figure S1 [33] shows the $\\mathbf{k}_{\\|}$-resolved transmission in the $2 \\mathrm{D}$ Brillouin zone for up- and downspin states and two ferroelectric polarization orientations at $E=-1.1 \\mathrm{eV}$ (which corresponds to the enhanced transmission and spin polarization in Figs. $2(\\mathrm{a}, \\mathrm{b})$ ). It is seen that $T($ $\\left.\\mathbf{k}_{\\|}\\right)$is non zero in a broad range of $\\mathbf{k}_{\\|}$with enhanced contribution around the $\\bar{\\Gamma}$ point. There are, however, additional noticeable peaks in $T\\left(\\mathbf{k}_{\\|}\\right)$which appear in the spin-up channel for both $\\mathrm{P}_{\\rightarrow}$ and $\\mathrm{P}_{\\leftarrow}$ states, but not in the spin-down channel. These hot spots are much more pronounced for the $\\mathrm{P}_{\\leftarrow}$ state and are responsible for the enhanced transmission and spin polarization at this energy (Figs. $2(\\mathrm{a}, \\mathrm{b})$ ).\n\nThe nature of the hot spots in the $\\mathbf{k}_{\\|}$-resolved transmission spectrum can be understood by considering the scattering states - the eigenstates of the Hamiltonian for an open system $[35,36]$. In Figure 3, we plot the scattering states in real space at $\\mathbf{k}_{\\|}=(0.25,0.4)$ corresponding to a hot spot in Fig. S1 (a). It is seen that for $P_{\\rightarrow}$, this scattering state represents an evanescent state which amplitude decreases exponentially across the $\\mathrm{SrTiO}_{3}$ barrier. On the contrary, for $P_{\\leftarrow}$, the am-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_109a6cd5d015ce89e7f3g-4_173_564_1122_1935}\n\\end{center}\n\nFIG. 3. Up-spin scattering state (a squared wave-function of the right-moving state) across the $\\mathrm{Pt} / \\mathrm{SrTiO}_{3} / \\mathrm{Pt} \\mathrm{FTJ}^{2}$ for $\\mathrm{P}_{\\leftarrow}$ (a) and $\\mathrm{P}_{\\rightarrow}$ (b) polarization states at $\\mathbf{k}_{\\|}=(0.25,0.4)$ [37].\n\nplitude of the scattering state is significantly larger across the whole junction and it is strongly enhanced at the $\\mathrm{Ti}_{\\mathrm{Sr}}$ defect site. The shape of the scattering state around the defect indicates that this state is composed of the Ti- $d_{z^{2}}$ orbital. These results confirm the fact that the defect states determine the tunneling mechanism in the FTJ and the effect of ferroelectric polarization on transmission (i.e., TER).\n\nRealistic FTJs contain many defects in the barrier layer rather than a single $\\mathrm{Ti}_{\\mathrm{Sr}}$ antisite defect considered in our DFT calculations. In order to investigate how the presence of multiple defects affects transmission and TER, we employ a realistic tight-binding model which captures the essential physics of the phenomenon [33]. Within this model, we assume a uniform distribution of defects in the tunnel barrier with a representative defect concentration of a few percents [28]. The required asymmetry in the FTJ is introduced by assuming electrodes with different screening lengths.\n\nAs a reference, Figure 4(b) shows the calculated transmission as a function of energy $E$ for a single defect placed in the second monolayer from the right interface (Fig. 4(a)). It is seen that the transmission has a distinct peak around $E-E_{F}=-0.5 t$ (where $t$ is the nearest-neighbor hopping parameter) associated with the defect-assisted resonant tunneling. The peak lies deeper in energy for the left pointing polarization $P_{\\leftarrow}$ than for the right pointing polarization $P_{\\rightarrow}$, which is consistent with our first-principles results.\n\nFirst, we examine transmission and TER for a defect-free FTJ. Figure 4(c) shows the calculated transmission at $E=$ $E_{F}$ as a function of dimensionless parameter $p \\equiv \\Delta V_{P} / 2 t$, where $\\Delta V_{P}$ is a change in the electrostatic potential energy at the left interface (Fig. 4(a)). Parameter $p$ serves as a measure of ferroelectric polarization [33]. It is seen that under conditions of direct tunneling, the transmission is higher for the $P_{\\leftarrow}$ state, corresponding to the lower barrier height in Figure 4(a). As expected, the transmission increases (decreases) exponentially with increasing $p$ for the $P_{\\leftarrow}\\left(P_{\\rightarrow}\\right)$ state, which in turn results in an exponential increase of the TER ratio $T_{\\leftarrow} / T_{\\rightarrow}$, as shown in Figure 4(d).\n\nNext, we explore the effect of multiple defects randomly distributed in the barrier region. Figure 4(e) shows the averaged transmission as a function of $p$ for different polar-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_109a6cd5d015ce89e7f3g-5_172_906_320_1818}\n\nFIG. 4. (a) FTJ model used for the tight-binding calculations. $P_{\\leftarrow}\\left(P_{\\rightarrow}\\right)$ is the left (right) polarization. $\\triangle V_{P}$ is the electrostatic potential energy change at the left interface. (b) Transmission $T$ as a function of energy $E$ for one defect state placed in the second layer from the right interface, as schematically shown by the filled black circle in (a), for $p \\equiv \\triangle V_{P} / 2 t=0.8$. (c) Transmission $T$ at $E=E_{F}$ as a function of $p$ for FTJ without defects. (d) TER ratio $T_{\\leftarrow} / T_{\\rightarrow}$ as a function of $p$ for FTJ without defects. $T_{\\leftarrow}\\left(T_{\\rightarrow}\\right)$ denotes transmission for $P_{\\leftarrow}\\left(P_{\\rightarrow}\\right)$ state. (e) Averaged transmission $\\langle T\\rangle$ at $E=E_{F}$ as a function of $p$ for FTJ with $1 \\%$ and $5 \\%$ defects. (f) TER ratio $\\left\\langle T_{\\rightarrow}\\right\\rangle /\\left\\langle T_{\\leftarrow}\\right\\rangle$ as a function of $p$. $\\left\\langle T_{\\leftarrow}\\right\\rangle\\left(\\left\\langle T_{\\rightarrow}\\right\\rangle\\right)$ denotes averaged transmission for $P_{\\leftarrow}\\left(P_{\\rightarrow}\\right)$ state.\n\nization states and defect concentrations. Overall, it is seen that the transmission is significantly enhanced as compared to the defect-free FTJ (Fig. 4(c)). This enhancement indicates that defect-assisted resonant tunneling overcomes direct tunneling and becomes the dominant mechanism for transmission. Furthermore, we observe that low and high transmission values are reversed between the $P_{\\rightarrow}$ and $P_{\\leftarrow}$ polarization states in comparison to the defect-free FTJ. This is due to the fact that $P_{\\rightarrow}$ pushes the localized levels up closer to the $E_{F}$ which enhances transmission for this polarization state. On the contrary, $P_{\\leftarrow}$ pushes the localized energy levels down which makes this polarization state less conductive.\n\nFigure 4(f) shows that the TER ratio $\\left\\langle T_{\\rightarrow}\\right\\rangle /\\left\\langle T_{\\leftarrow}\\right\\rangle$ is reversed in comparison to the defect-free FTJ (Fig. 4(d)). TER remains sizable over the whole range of $p$ values. There is a maximum in $\\left\\langle T_{\\rightarrow}\\right\\rangle /\\left\\langle T_{\\leftarrow}\\right\\rangle$ at $p=0.7$, which corresponds to the largest number of defect states appearing around the Fermi energy for the $P_{\\rightarrow}$ state. Under these conditions, the TER ratio exceeds two orders in magnitude both for $1 \\%$ and $5 \\%$ defect concentrations. Overall, we see that under the realistic conditions of different electrodes and random distribution of defects in a FTJ, the TER effect is sizable and controlled by the localized defect states in the barrier.\n\nWe want to emphasize that the defect-assisted TER effect may occur not only in FTJs based on Sr-deficient $\\mathrm{SrTiO}_{3}$ but also in tunnel junctions with conventional ferroelectric barriers. In fact, our tight-binding modeling indicates that independent of the nature of defects, as long as their localized states are positioned not too far from the Fermi energy, the polarization induced band bending in the ferroelectric barrier layer can shift these states in energy and produce resonant tunneling. If the defect density is sufficiently large, resonant tunneling dominates and controls TER. In this regard, the defectassisted TER effect in FTJs has broader significance than just purely an effect associated with the $\\mathrm{SrTiO}_{3}$ barrier.\n\nWe conclude that the tunneling transmission across a $\\mathrm{SrTiO}_{3}$ ferroelectric barrier layer is largely controlled by the in-gap antisite $\\mathrm{Ti}_{\\mathrm{Sr}}$ defect states. Due to their energy being dependent on ferroelectric polarization, they produce a defectassisted TER effect which can be very large under conditions of resonant tunneling.\n\nThese conditions can be achieved though interface engineering or using electrodes with different screening lengths and/or work functions. The defect-assisted TER may also occur in FTJs based conventional ferroelectric barriers with defects producing localized states. In FTJs with ferromagnetic electrodes resonant tunneling can be exploited to control the tunneling magnetoresistance (TMR) effect [38]. We hope that our theoretical insights revealing the defect-assisted mechanism of the TER effect can stimulate experimental efforts in this field.\n\nThis work was supported by the National Science Foundation (NSF) through the Nebraska Materials Research Science and Engineering Center (MRSEC) (Grant No. DMR1420645). Computations were performed at the Holland Computing Center of the University of Nebraska.\n\n*valexandrov2@unl.edu [1] E. Y. Tsymbal and H. Kohlstedt, Science 313, 181 (2006).\n\n[2] V. Garcia and M. Bibes, Nat. Comm. 5, 4289 (2014).\n\n[3] M. Y. Zhuravlev, R. F. Sabirianov, S. Jaswal, and E. Y. Tsymbal, Phys. Rev. Lett. 94, 246802 (2005).\n\n[4] H. Kohlstedt, N. A. Pertsev, J. R. Contreras, and R. Waser, Phys. Rev. B 72, 125341 (2005).\n\n[5] V. Garcia, S. Fusil, K. Bouzehouane, S. Enouz-Vedrenne, N. D. Mathur, A. Barthelemy, and M. Bibes, Nature 460, 81 (2009).\n\n[6] A. Gruverman, D. Wu, H. Lu, Y. Wang, H. W. Jang, C. M. Folkman, M. Ye. Zhuravlev, D. Felker, M. Rzchowski, C.-B. Eom and E. Y. Tsymbal, Nano Lett., 9, 3539 (2009).\n\n[7] A. Chanthbouala, A. Crassous, V. Garcia, K. Bouzehouane, S. Fusil, X. Moya, J. Allibe, B. Dlubak, J. Grollier, S. Xavier, C. Deranlot, A. Moshar, R. Proksch, N. D. Mathur, M. Bibes, and A. Barthelemy, Nat. Nanotech. 7, 101 (2012).\n\n[8] D. J. Kim, H. Lu, S. Ryu, C.-W. Bark, C.-B. Eom, E. Y. Tsymbal, and A. Gruverman, Nano Lett. 12, 5697 (2012).\n\n[9] Z. Wen, C. Li, D. Wu, A. Li, and N. B. Ming, Nat. Mater. 12, 617 (2013).\n\n[10] Z. Xi, J. Ruan, C. Li, C. Zheng, Z. Wen, J. Dai, A. Li, and D. Wu, Nat. Comm. 8, 15217 (2017).\n\n[11] S. Boyn, S. Girod, V. Garcia, S. Fusil, S. Xavier, C. Deranlot, H. Yamada, C. Carretero, E. Jacquet, M. Bibes, A. Barthelemy, and J. Grollier, Appl. Phys. Lett. 104, 052909 (2014).\n\n[12] J. P. Velev, J. D. Burton, M. Y. Zhuravlev, and E. Y. Tsymbal, npj Computational Materials 2, 16009 (2016).\n\n[13] A. Zenkevich, M. Minnekaev, Y. Matveyev, Y. Lebedinskii, K. Bulakh, A. Chouprik, A. Baturin, K. Maksimova, S. Thiess, and W. Drube, Appl. Phys. Lett. 102, 062907 (2013).\n\n[14] X. Liu, J. D. Burton, and E. Y. Tsymbal, Phys. Rev. Lett. 116, 197602 (2016).\n\n[15] R. Soni, A. Petraru, P. Meuffels, O. Vavra, M. Ziegler, S. K. Kim, D. S. Jeong, N. A. Pertsev, and H. Kohlstedt, Nat. Comm. 5, 5414 (2014);\n\n[16] L. L. Tao and J. Wang, J. Appl. Phys. 119, 224104 (2016).\n\n[17] J. P. Velev, C.-G. Duan, J. D. Burton, A. Smogunov, M. K. Niranjan, E. Tosatti, S. S. Jaswal, and E. Y. Tsymbal, Nano Lett. 9, 427 (2009).\n\n[18] Y. W. Yin, J. D. Burton, Y.-M. Kim, A. Y. Borisevich, S. J. Pennycook, S. M. Yang, T. W. Noh, A. Gruverman, X. G. Li, E. Y. Tsymbal, and Q. Li, Nat. Mater. 12, 397 (2013).\n\n[19] A. Tsurumaki-Fukuchi, H. Yamada, and A. Sawa, Appl. Phys. Lett. 103, 152903 (2013).\n\n[20] H. Lu, A. Lipatov, S. Ryu, D. J. Kim, H. Lee, M. Y. Zhuravlev, C. B. Eom, E.Y. Tsymbal, A. Sinitskii, and A. Gruverman, Nat. Comm. 5, 5518 (2014).\n\n[21] V. S. Borisov, S. Ostanin, S. Achilles, J. Henk, and I. Mertig, Phys. Rev. B 92, 075137 (2015).\n\n[22] L. L. Tao and J. Wang, Appl. Phys. Lett. 108, 062903 (2016).\n\n[23] D. I. Bilc, F. D. Novaes, J. Iniguez, P. Ordejon, and P. Ghosez, ACS Nano 6, $1473(2012)$\n\n[24] P. Gao, C. T. Nelson, J. R. Jokisaari, S. H. Baek, C. W. Bark, Y. Zhang, E. Wang, D. G. Schlom, C. B. Eom, and X. Pan, Nat. Comm. 2, 591 (2011).\n\n[25] Y. M. Kim, A. Morozovska, E. Eliseev, M. P. Oxley, R. Mishra, S. M. Selbach, T. Grande, S. T. Pantelides, S. V. Kalinin, and A. Y. Borisevich, Nat. Mater. 13, 1019 (2014).\n\n[26] G. Sanchez-Santolino, J. Tornos, D. Hernandez-Martin, J. I. Beltran, C. Munuera, M. Cabero, A. Perez-Munoz, J. Ricote, F. Mompean, M. Garcia-Hernandez, et al., Nat. Nanotech. 12, 655 (2017).\n\n[27] M. Choi, F. Oba, and I. Tanaka, Phys. Rev. Lett. 103, 185502 (2009).\n\n[28] D. Lee, H. Lu, Y. Gu, S.-Y. Choi, S.-D. Li, S. Ryu, T. Paudel, K. Song, E. Mikheev, S. Lee, et al., Science 349, 1314 (2015).\n\n[29] H. Lu, D. Lee, K. Klyukin, L. Tao, B. Wang, H. Lee, J.-W. Lee, T. R. Paudel, L.-Q. Chen, E. Y. Tsymbal, et al., Nano Lett. 18, 491 (2018).\n\n[30] K. Klyukin and V. Alexandrov, Phys. Rev. B 95, 035301 (2017).\n\n[31] A. I. Larkin and K. A. Matveev, Zh. Eksp. Teor. Fiz. 93, 1030 (1987).\n\n[32] E. Y. Tsymbal and D. G. Pettifor, Phys. Rev. B 58, 432 (1998).\n\n[33] See Supplemental Material for more details on first principles calculations and tight-binding modeling, which includes Refs. [39-43]\n\n[34] We note that due to resonant tunneling the calculated $T(E)$ is extremely sensitive to the choice of the k-point mesh and energy resulting in non-monotonic behavior at a finer energy scale.\n\n[35] H. J. Choi and J. Ihm, Phys. Rev. B 59, 2267 (1999).\n\n[36] A. Smogunov, A. Dal Corso, and E. Tosatti, Phys. Rev. B 70 , 045417 (2004).\n\n[37] In total, there are 13 channels for scattering states at this $\\mathbf{k}_{\\|}$ point due to the band folding of the $2 \\times 2$ Pt unit cell. Here we only plot the state that decays slowest.\n\n[38] M. Y. Zhuravlev, S. Maekawa, and E. Y. Tsymbal, Phys. Rev. B $81,104419(2010)$.\n\n[39] P. Giannozzi, S. Baroni, N. Bonini, M. Calandra, R. Car, C. Cavazzoni, D. Ceresoli, G. L. Chiarotti, M. Cococcioni, I. Dabo et al., J. Phys.: Condens. Matter 21, 395502 (2009).\n\n[40] J. P. Perdew, A. Ruzsinszky, G. I. Csonka, O. A. Vydrov, G. E. Scuseria, L. A. Constantin, X. Zhou, and K. Burke, Phys. Rev. Lett. 100, 136406 (2008).\n\n[41] M. Youssef, B. Yildiz, and K J. van Vliet, Phys. Rev. B 95, $161110(\\mathrm{R})(2017)$\n\n[42] C. Lenser, A. Koehl, I. Slipukhina, H. Du, M. Patt, V. Feyer, C. M. Schneider, M. Lezaic, R. Waser, R. Dittmann, Adv. Funct. Mater. 25, 6360 (2015).\n\n[43] S. Datta, Electronic Transport in Mesoscopic Systems (Cambridge University Press, 1995).\n\n\n\\end{document}", "record_id": "2023_09_22_109a6cd5d015ce89e7f3g"}