{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Third-Order Nonlinear Optical Properties of a Carboxylic Acid Derivative }\n\n\n\\author{Clodoaldo Valverde, ${ }^{1,2,3,{ }^{*}}$ Sizelizio Alves de Lima e Castro, ${ }^{4,2}$\\\\\nGabriela Rodrigues Vaz, ${ }^{1}$ Jorge Luiz de Almeida Ferreira, ${ }^{4}$ Basílio Baseia, ${ }^{5,7}$\\\\\nand Francisco A. P. Osório ${ }^{5,6}$\\\\\n${ }^{1}$ Campus de Ciências Exatas e Tecnológicas, Universidade Estadual de Goiás, 75001-970, Anápolis, GO, Brazil.\\\\\n${ }^{2}$ Universidade Paulista, 74845-090, Goiânia, GO, Brazil.\\\\\n${ }^{3}$ Centro Universitário de Anápolis, 75083-515, Anápolis, GO, Brazil.\\\\\n${ }^{4}$ Engenharia Mecânica - Universidade de Brasília, Brasilia, DF, Brazil\\\\\n${ }^{5}$ Instituto de Física, Universidade Federal de Goiás, 74.690-900, Goiânia, GO, Brazil.\\\\\n${ }^{6}$ Escola de Ciências Exatas e da Computação, Pontifícia Universidade Católica de Goiás, 74605-10, Goiânia, GO, Brazil.\\\\\n${ }^{7}$ Departamento de Física, Universidade Federal da Paraíba, 58.051-970, João Pessoa, PB, Brazil.\\\\\n* Corresponding author: E-mail: valverde@ueg.br}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\newcommand\\varangle{\\mathop{\\sphericalangle}}\n\n\\DeclareUnicodeCharacter{0131}{$\\imath$}\n\n\\begin{document}\n\\maketitle\nReceived: 14-05-2018\n\n\\begin{abstract}\nWe report a study of the structural and electrical properties of a carboxylic acid derivative (CAD) with structural formula $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ ((E)-pent-2-enoic acid). Using the Møller-Plesset Perturbation Theory (MP2) and the Density Functional Theory (DFT/CAM-B3LYP) with the 6-311++G $G(d, p)$ basis set the dipole moment, the linear polarizability and the first and second hyperpolarizabilities are calculated in presence of static and dynamic electric field. Through the supermolecule approach the crystalline phase of the carboxylic acid derivative is simulated and the environment polarization effects on the electrical parameters are studied. Static and dynamic estimation of the linear refractive index and the third-order nonlinear susceptibility of the crystal are obtained and compared with available experimental results. The characteristic vibrational modes and functional groups present in CAD were analyzed by Fourier Transform Infrared Spectrum (FTIR) in the region of 400-4000 $\\mathrm{cm}^{-1}$. Through the Hirshfeld surface analysis the molecular structure and the vibrational modes properties of the CAD crystal are explored. The effects of solvent medium on the molecular properties are taken into account through the Polarizable Continuum Model (PCM). Also, the frontiers molecular orbitals, the band gap energy, and the global chemical reactivity descriptors are discussed. All the properties studied suggest that the present material may be considered for nonlinear optical material.\n\\end{abstract}\n\nKeywords: First and second hyperpolarizabilities; Hirshfeld surface analysis; third-order susceptibility\n\n\\section{Introduction}\nIn recent decades, organic compounds have attracted great attention motivated by their potential applications in chemistry of materials such as nonlinear optical materials (NLO), ${ }^{1}$ solar cell materials, ${ }^{2}$ photonic materials, ${ }^{3}$ photonic devices, ${ }^{4}$ optical devices, ${ }^{5}$ electrochemical sensors, ${ }^{6}$ in ultra-fast optical signal processing. ${ }^{7-11}$ Due to architectural flexibility and ease of manufacturing the NLO devic- es, organic materials with extensively delocalized $\\pi$ electrons have attracted significant attention due to their large NLO susceptibility. ${ }^{12-15}$ The advantage of the organic compounds over the inorganic materials is that NLO properties can be manipulated, by changing the substituents and the functional groups on the starting reactants. The NLO response of the organic compounds to the action of an applied electric field is related to the relocation of the $\\pi$-electron. Finding new organic crystals that present efficient NLO properties is the challenge of the present days and a great number of experimental and theoretical works has been addressed to this end. In this context, here we present an investigation of the electric and optical properties of a carboxylic acid derivative. Carboxylic acid derivatives have various applications in textile treatment, in the production of cellulose plastics and ester; as an example the ester of salicylic acid is prepared from acetic acid. The use of unsaturated fatty acids and fatty acids in general have been used with great interest in nutrition and health sciences, ${ }^{16,17}$ due to their great role in biological processes, especially as an antibiotic against many bacteria and fungi. ${ }^{18,19}$ Fatty acids and their derivatives act as a receptor ligand in the cerebral cortex and hippocampus and elevated concentrations can be found in patients with Alzheimer's and Parkinson's disease. ${ }^{20}$ Determinations of the crystal structure of $\\alpha, \\beta$-unsaturated carboxylic acids are still scarce in the literature, but in recent years it has been gaining great interest from researchers. ${ }^{21-25}$ Our motivation for the study of $\\alpha, \\beta$-unsaturated carboxylic acid crystal came from the fact that we not found works in the literature that treat of the NLO properties of this material.\n\nThe constituent units of an organic crystal may possess (or not) a center of symmetry, which is responsible for nonlinear optical effects, as well as by the generation of the second and third susceptibility governed respectively by the first and second hyperpolarizabilities. Density functional theory (DFT) and other methods in quantum chemistry have proved to be highly successful in describing structural and electronic properties, as the molecular polarizabilities and hyperpolarizabilities, static and dynamic in a vast class of materials from atoms and molecules to simple crystals. ${ }^{10,11,26-37}$\n\nThe carboxylic acid derivative (CAD) studied in this work is the $(E)$-pent-2-enoic acid with structural formula $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ (Figure 1); it was synthesized and structurally characterized by Tim Peppel et al..23 Through an ab initio approach the dipole moment, the linear polarizability and the first and second hyperpolarizabilities have been calculated. The effect of an applied electric field (static and dynamic) was considered in our calculation. Also, the influence of the crystalline environment on the electric and optical properties was studied. Moreover the highest occupied molecular orbital (HOMO) and the lowest unoccupied molecular orbital (LUMO) were calculated including the gap energies calculated in presence of several solvent media.\n\n\\section{1. Hirshfeld Surface}\n\\section{Methodology}\nThe CAD compound was crystallized, ${ }^{23}$ in a triclinic centrosymmetric space group P1 with the following crystallographic data: $a=6.7336$ (13) $\\AA, b=6.7821$ (13) $\\AA, c=$ $7.2349$ (14) $\\AA, \\alpha=67.743(2)^{\\circ}, \\beta=75.518(2)^{\\circ}, \\gamma=64.401$ $(2)^{\\circ}$, unit cell volume $V=274.29(9) \\AA^{3}$ with 2 molecules in the unit cell. The $(E)$-pent-2-enoic acid is essentially planar.\n\nThe intermolecular interactions and their quantitative contributions to the stability of supramolecular assemble in organic crystals of CAD can be explored by Hirshfeld surface analysis and the associated 2D-fingerprint plots was calculated using Crystal Explorer software..$^{38,39}$ These tools allow us to examine the context of the whole system through the color mapping identifying specific regions where the intermolecular interactions occur; these tools also allow to quantify percentage of areas related to each contact. Fingerprint plots can summarize all contact distances to the Hirshfeld surface and express their contributions in terms of a percentage share.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-02_902_1321_1036_1851}\n\\end{center}\n\nFigure 1: A view of the asymmetric unit of the compound $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ with the atom-numbering scheme\n\n\\section{2. Computational Details}\nThe theoretical method used to calculate the static linear polarizability and the dipole moment was the Møller-Plesset Perturbation Theory (MP2). The other parameters as the hyperpolarizabilities were calculated via the Density Functional Theory (DFT) with CAM-B3LYP functional. In all calculations the $6-311++G(d, p)$ basis set was used took. The SM approach taken into account the crystallographic geometry obtained by X-ray by Tim Peppel et al..2 Previous studies have shown that this basis set provide a realistic description of the electrical properties. ${ }^{40}$\n\nThe crystalline environment polarization was simulated by the supermolecule (SM) approach, where the atoms of the surrounding molecules are considered as point charge. The approach operates with a bulk consisting of a set of $11 \\times 11 \\times 11$ unit cells, with 2 asymmetric units in each unit cell, totalizing 1331 unit cells generating a bulk with 39,930 atoms. A schematic representation of this bulk is shown in Figure 2, where the CAD isolated molecule is highlighted in blue in the center of the image.\n\nThe SM approach have been used in several works, in Ref. ${ }^{41}$ the authors showed that this method can represent the dipole moment and the first hyperpolarizability with results close to those of the experimental ones. In Ref. ${ }^{42}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-03_195_824_165_976}\n\\end{center}\n\nFigure 2: A schematic of the bulk is displayed.\n\nthe authors have shown that the SM can represent macroscopic properties of the crystal as the linear susceptibility, $\\chi^{(1)}$, and for the nonlinear second-order susceptibility, $\\chi^{(2)}$, in this case they worked with urea and thiurea and their theoretical results were close to those of experiments, after using a scale factor. In Ref. ${ }^{40}$ the authors also simulated the properties of $\\chi^{(1)}$ and $\\chi^{(2)}$ of the molecule 3-methyl-4-nitropyridine-1-oxyde with results again close to the experimental ones.\n\nThe iterative process of the SM approach is carried out in several steps: first we determined the electric charge of the isolated molecule, by adjusting the molecular electrostatic potential (ChelpG), considering the electric charges distribution in vacuum, through the MP2 method. The partial atomic charges of the single isolated molecule of an asymmetric unit are calculated (ChelpG). Then we replace each corresponding atom in the generated unit cells by the partial atomic charge, previously obtained, and the static electric properties (dipole moment $(\\mu)$, linear polarizability $(\\alpha)$ and first $(\\beta)$ second $(\\gamma)$ hyperpolarizabilities) and the new partial atomic charges of the asymmetric unit were calculated. The iterative process continues with the substitution of the partial atomic charges in each calculation step, until the convergence of the electric dipole moment be reached.\n\nThe applicability of the supermolecule approach and the scheme of electrostatic polarization is advantageous due to the rapid convergence of the dipole moment of CAD throughout the process, in which six iterations were considered. The convergence of iterative series for this electrical property can be seen in Figure 3 .\n\nIn the present study the electronic dipole moment, molecular mean polarizability $(\\nless \\alpha\\rangle)$, anisotropy of polarizability $(\\Delta \\alpha)$ and first $\\left(\\beta_{\\text {total }}\\right)$, and second molecular hyperpolarizabilities $(\\langle\\gamma)$ of the title compounds has been calculated using the following expressions,\n\n\\[\n\\mu=\\left(\\mu_{x}^{2}+\\mu_{y}^{2}+\\mu_{z}^{2}\\right)^{\\frac{1}{2}},\n\\]\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-03_194_788_1037_1849}\n\\end{center}\n\nFigure 3: Evolution of values of the dipole moment of the CAD with the respective iteration numbers. A $11 \\times 11 \\times 11$ unit cell assembly was considered (step 0 indicates the isolated molecule and the other steps indicate the embedded molecule).\n\n\\[\n\\begin{aligned}\n& \\langle\\alpha\\rangle=\\frac{\\alpha_{x x}+\\alpha_{y y}+\\alpha_{z z}}{3}, \\\\\n& \\Delta \\alpha=2^{-1 / 2}\\left[\\left(\\alpha_{x x}-\\alpha_{y y}\\right)^{2}+\\left(\\alpha_{y y}-\\alpha_{z z}\\right)^{2}+\\right. \\\\\n& \\left.\\left(\\alpha_{z z}-\\alpha_{x x}\\right)^{2}+6{\\alpha_{x z}}^{2}+6 \\alpha_{x y}^{2}+6 \\alpha_{y z}^{2}\\right]^{1 / 2},\n\\end{aligned}\n\\]\n\nand,\n\n\\[\n\\langle\\gamma\\rangle=\\frac{1}{15} \\sum_{i, j=x, y, z}\\left(\\gamma_{i i j j}+\\gamma_{i j i j}+\\gamma_{i j j i}\\right) .\n\\]\n\nIn the present work as the optical dispersion in the medium was not taken into account, the average (or absolute value) of static second hyperpolarizability can be simplified via the Kleinmann, ${ }^{43}$ approach and calculated through the expression,\n\n\\[\n\\langle\\gamma\\rangle=\\frac{1}{5}\\left[\\begin{array}{c}\n\\gamma_{x x x x}+\\gamma_{y y y y}+\\gamma_{z z z z} \\\\\n+2\\left(\\gamma_{x x y y}+\\gamma_{x x z z}+\\gamma_{y y z z}\\right)\n\\end{array}\\right] .\n\\]\n\nThe average linear polarizability « $\\alpha$ c can be related with the linear refractive index $(n)$ of the crystal by the Clausius-Mossotti relation, which is given by, ${ }^{44}$\n\n\\[\n\\frac{n^{2}-1}{n^{2}+2}=\\frac{4 \\pi N}{3}\\langle\\alpha\\rangle,\n\\]\n\nwhere $N$ is the number of molecules per unit cell volume. The experimental quantity, the third-order electric susceptibility $\\chi^{(3)}$, is related to the second hyperpolarizability by the expression, ${ }^{44,45}$\n\n\\[\n\\chi^{(3)}=f^{4} N\\langle\\gamma\\rangle,\n\\]\n\nwhere $f$ is the Lorentz local field correction factor given by,\n\n\\[\nf=\\frac{\\left(n^{2}+2\\right)}{3} \\text {. }\n\\]\n\nAll the numerical results for the tensors polarizability and hyperpolarizabilities were obtained from the Gaussian-09 output file and converted by the electronic units (esu), where the molecular environment were taken into account through the SM method.\n\n\\section{Results and Discussion}\n\\section{1. FT-IR Computational Studies}\nThe characteristic vibrational modes and functional groups present in CAD were analyzed by Fourier Transform Infrared Spectrum (FT-IR). The spectrum was recorded in the range of $400-4000 \\mathrm{~cm}^{-1}$. From Figure4 we observed that a transmittance peak appears at $3806 \\mathrm{~cm}^{-1}$ which is due to $\\mathrm{OH}$ stretching vibration. The $\\mathrm{C}-\\mathrm{H}$ stretching vibration is observed at 3128 and $3055 \\mathrm{~cm}^{-1}$. The stretching vibration O-C occurs in 1829, 1387 and 1178 $\\mathrm{cm}^{-1}$ respectively. The peak $1301 \\mathrm{~cm}^{-1}$ is attributed to $\\mathrm{H}-\\mathrm{C}-\\mathrm{C}$ stretching vibration; peak $702 \\mathrm{~cm}^{-1}$ is the $\\mathrm{H}-\\mathrm{C}-\\mathrm{C}$ bending, and the $586 \\mathrm{~cm}^{-1}$ peak is attributed to the $\\mathrm{H}-\\mathrm{O}-$ C-C torsion movements. Thus, all functional groups present in the crystalline structure of CAD were confirmed.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-04_1199_1810_161_975}\n\\end{center}\n\nFigure 4: CAM-B3LYP/6-311++G(d,p) used to calculate FT-IR spectrum of $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$.\n\n\\section{2. Hirshfeld Surface Analysis}\nThe molecular structure $\\mathrm{CAD}, \\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$, previously studied by Tim Peppel et al., ${ }^{23}$ was analyzed in this work using the Hirshfeld surface (HS) and its associated 2D-fingerprint plot. The calculate were made using in Density Functional Theory (DFT) at level Becke88/LYP/6$311 \\mathrm{G}(\\mathrm{d}, \\mathrm{p})$ to experimental X-ray diffraction data via Tonto. ${ }^{46,47}$ The HS and its 2D-fingerprint figures allow us visualizing, exploring and quantifying the intermolecular interactions in the crystalline network of the compound CAD. The surface was generated on the basis of the normalized contact distances, which are defined in terms of $d_{i}$ (the distance to the nearest nucleus within the surface) and $d_{e}$ (the distance from the point to the nearest nucleus external to the surface)related to van der Waals radii, ${ }^{48,49}$ of the atoms. The high resolution default of $d_{\\text {norm }}$ surface was mapped over the colour scale, ranging from $-0.369$ (red) to $1.201 \\AA$ (blue), with the fingerprint plots using the expanded $0.6-2.8 \\AA$ view of $d_{e v s}$. $d_{i}$. Figure 5 , where a surface with a blue-white-red scheme is showed. The blue spots are devoid of close contacts, the white areas represent contacts around the van der Waals radius and the red regions evidence shorter contacts. The Hirshfeld surface analysis of CAD confirms that the molecules are linked into centrosymmetric dimers via pairs of $\\mathrm{O}-\\mathrm{H}$...O hydrogen bonds in the crystals. The distance $\\mathrm{O} \\ldots \\mathrm{H}$ is $1.635 \\AA$ (see Figure 5). The 2D-fingerprint plots (Figure 6) derived from $\\mathrm{d}_{\\mathrm{i}}$ and $\\mathrm{d}_{\\mathrm{e}}$ from pairs measured on each individual point of the calculated HS summarize the contributions of intermolecular contacts to the total surface area of Hirshfeld. The intermolecular contacts that can be explored in CAD are as follows: C...C, C...H, C...O, H...H and H...O. The intercontacts H...O the figure 6 (fingerprint) presents characteristic peaks that provide evidence of non-classical hydrogen bonding, including reciprocal contacts with $34.3 \\%$ of the total surface. The contacts of type $\\mathrm{H} . . \\mathrm{H}$ show the highest contributions with a total of $52.5 \\%$ followed by C...H (8.7\\%), C...C (2.5\\%) and C...O (1.6\\%).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-04_1324_1749_1037_1855}\n\\end{center}\n\nFigure 5: The Hirshfeld surface $d_{\\text {norm }}$ mapped of $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ for visualizing the intercontacts, showing molecules are linked into centrosymmetric dimers via pairs of $\\mathrm{O}-\\mathrm{H} \\ldots \\mathrm{O}$ hydrogen bonds.\n\n\\section{3. Static Electrical Parameters}\n\\section{Computational Calculation}\nIn Table 1 our results for the components and average values of the dipole moment and the linear polarizability for the isolated molecule and embedded molecule of the CAD are presented.\n\nFrom Table 1 can be seen that the value of the average dipole moment is found to be 2.03D and 2.99D for the isolated and embedded molecule respectively, showing that the environment polarization effect in this case is substantial and causes an increases of $47.29 \\%$ in the average dipole moment. The major contribution to the average di-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_7433a6c7542334063731g-05_216_1366_162_976}\n\nFigure 6: The Fingerprint plot for $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ a) $100 \\%$ of contacts; b)\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_7433a6c7542334063731g-05_1438_1470_190_935}\\\\\nand $\\mathrm{d}_{\\mathrm{i}}$ function mapped in color showing the percentage contribution of each type of interaction in total interactions verified; $d_{e}$ is the distance from the surface to the nearest atom exterior to the surface and $\\mathrm{d}_{\\mathrm{i}}$ is the distance from the surface to the nearest atom interior to the surface.\n\nTable 1: MP2/6-311++G(d,p) results for the components and the average values of the dipole moment (in D) and the linear polarizability (in $10^{-24} \\mathrm{esu}$ ).\n\n\\begin{center}\n\\begin{tabular}{lrrrrr}\n\\hline\n & Isolated & Embedded &  & Isolated & Embedded \\\\\n\\hline\n$\\alpha_{x x}$ & $9.28$ & $9.36$ & $\\mu_{x}$ & $-1.82$ & $-2.76$ \\\\\n$\\alpha_{x y}$ & $1.81$ & $1.91$ & $\\mu_{y}$ & $-0.88$ & $-1.10$ \\\\\n$\\alpha_{y y}$ & $8.78$ & $8.80$ & $\\mu_{z}$ & $-0.21$ & $-0.36$ \\\\\n$\\alpha_{x z}$ & $-0.25$ & $-0.29$ & $\\langle\\mu\\rangle$ & $2.03$ & $2.99$ \\\\\n$\\alpha_{y z}$ & $-2.18$ & $-2.18$ &  &  &  \\\\\n$\\alpha_{z z}$ & $9.11$ & $9.10$ &  &  &  \\\\\n$\\langle\\alpha\\rangle$ & $9.06$ & $9.09$ &  &  &  \\\\\n$\\Delta \\alpha$ & $3.21$ & $2.62$ &  &  &  \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\npole moment is given by the $\\mu_{x}$ component, mainly for the embedded molecule. However the values of the average linear polarizability and the linear polarizability components are practically insensible to the crystalline environment polarization. As consequence of this fact a small value of the linear polarizability anisotropy can be observed in Table 1, and $\\Delta$ value are smaller for the embedded molecule $\\left(2.6 \\times 10^{-24} e s u\\right)$ than for the isolated molecule $(3.2 \\times$ $\\left.10^{-24} \\mathrm{esu}\\right)$. And as can be seen the diagonal component dominates the polarizability and are the elements responsible by the calculation of the average linear polarizability (equation 2).\n\nIn Table 2 the CAM-B3LYP/6-311++G(d,p) results for the second hyperpolarizability (in units of $10^{-36}$ esu) for the static case are presented for CAD isolated and embedded molecules. As shown in the Table 2 the values of the average second hyperpolarizability (in units of $10^{-36}$ esu) are $5.39$ and $4.77$ for isolated molecule and embedded molecule respectively. Although the values of the average dipole moment and average linear polarizability for the CAD were two and three times the urea values respectively, ${ }^{50-52}$ the values of average second hyperpolarizability are found almost similar to urea $\\left(4.16 \\times 10^{-36} \\mathrm{esu}\\right)$ and smaller than the value for the L-arginine phosphate monohydrate crystal $\\left(14.16 \\times 10^{-36} \\mathrm{esu}\\right)^{34}{ }^{34}$\n\nThe calculations for the linear refractive index (n) via Eq. (6) and $\\chi^{(3)}$ through Eq. (7) were calculated using the DFT/CAM-B3LYP functional and 6-311++G $(\\mathrm{d}, \\mathrm{p})$ basis set. In these calculations we have used the static value of the electric parameters (Table 2). In a more recent work the SM approach was used to simulate the linear refractive index and the third-order electric susceptibility of the (2E)-3-(3-methylphenyl)-1-(4-nitrophenyl)prop-2-en-1one (3MPNP) crystal ${ }^{53}$ with results close to the experimental ones. The CAM-B3LYP results for the linear refractive index and the static third-order non-linear susceptibility, $n=1.47$ and $\\chi^{(3)}=17.84 \\times 10^{-22}\\left(\\frac{\\mathrm{m}}{\\mathrm{v}}\\right)$. It is worth noting that this approach is an approximation to estimate the NLO properties and other factors can also affect the NLO responses. Also, in Table 2 the percentage variation of the second hyperpolarizabilities tensor components is shown: note that all values are reduced due to the influence of the environment polarization.\n\nThe Table 3 shows the influence of environment polarization on the electron density of the CAD molecule due to the field of punctual charges of neighboring molecules that can also be qualitatively analyzed in terms of partial atomic charges. The results of the charges fit via\n\nTable 2: CAM-B3LYP/6-311++G(d,p) results for the second hyperpolarizability (in $\\left.10^{-36} \\mathrm{esu}\\right)$ in the static case.\n\n\\begin{center}\n\\begin{tabular}{lrrrrrrr}\n\\hline\n$\\mathrm{C}_{5} \\mathbf{H}_{8} \\mathbf{O}_{2}$ & $\\gamma_{\\text {xxxx }}$ & $\\gamma_{\\text {yyyy }}$ & $\\gamma_{\\text {zzzz }}$ & $\\gamma_{\\text {xxyy }}$ & $\\gamma_{\\mathrm{yyzz}}$ & $\\gamma_{\\text {xxzz }}$ & $\\langle\\gamma\\rangle$ \\\\\n\\hline\nIsolated & $4.80$ & $5.04$ & $4.52$ & $2.71$ & $1.87$ & $1.70$ & $5.39$ \\\\\nEmbedded & $4.50$ & $4.44$ & $3.69$ & $2.56$ & $1.50$ & $1.56$ & $4.77$ \\\\\n$\\Delta \\%$ & $-6.25$ & $-11.90$ & $-18.36$ & $-5.54$ & $-19.79$ & $-8.24$ & $-11.50$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nCHELPG for the isolated and embedded molecules show a small charge transfer between H1-O1-C1-O2 of the isolated molecule $(0.026 \\mathrm{e})$ for the embedded molecule $(-0.022 \\mathrm{e})$. The compound methyl (C5-H5A-H5B-H5C) reduced its charge by around $161 \\%$.\n\nTable 3: MP2/6-311++G(d,p) results for the CHELPG atomic charges of isolated and embedded CAD.\n\n\\begin{center}\n\\begin{tabular}{lcrrr}\n\\hline\nNumber & Atom & Isolated & Charge (e) Converged & $\\Delta \\%$ \\\\\n\\hline\n1 & C1 & $0.821$ & $0.886$ & $7.88$ \\\\\n2 & C2 & $-0.348$ & $-0.345$ & $-0.71$ \\\\\n3 & H2 & $0.176$ & $0.168$ & $-4.30$ \\\\\n4 & C3 & $-0.103$ & $-0.099$ & $-3.25$ \\\\\n5 & H3 & $0.115$ & $0.155$ & $34.89$ \\\\\n6 & C4 & $0.229$ & $0.178$ & $-22.62$ \\\\\n7 & H4A & $-0.024$ & $-0.008$ & $-66.43$ \\\\\n8 & H4B & $-0.038$ & $-0.014$ & $-63.54$ \\\\\n9 & C5 & $-0.054$ & $-0.032$ & $-41.75$ \\\\\n10 & H5A & $0.010$ & $0.019$ & $100.00$ \\\\\n11 & H5B & $0.015$ & $0.010$ & $-29.69$ \\\\\n12 & H5C & $-0.005$ & $-0.010$ & $118.39$ \\\\\n13 & O1 & $-0.644$ & $-0.641$ & $-0.55$ \\\\\n14 & O2 & $-0.587$ & $-0.747$ & $27.30$ \\\\\n15 & H1 & $0.436$ & $0.480$ & $9.94$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\n\\section{Dynamic Effects}\nIn this section the dynamic effects of an applied electric field with frequency $\\omega$ is taken into account in the calculation of the dynamic properties of the carboxylic acid derivative (CAD). Using the CAM-B3LYP/6-311+G(d) we calculate the second hyperpolarizability $\\gamma\\left(-\\omega ; \\omega_{1}, \\omega_{2}, \\omega_{3}\\right)$, where by convection the first frequency in the parenthesis denoted by the negative signal, is the emitted radiation frequency; the other frequencies (positive) concern the absorbed radiation, where $\\omega=\\omega_{1}+\\omega_{2}+\\omega_{3}$. Figure 7 shows the calculated values for the average linear polarizability $\\alpha \\alpha(-\\omega ; \\omega) 〉$ and for the average second hyperpolarizabilities $\\iota \\gamma(-\\omega ; \\omega, 0,0)>$ (Kerr effect) and $\\iota(-$ $2 \\omega ; \\omega, \\omega, 0)>(\\mathrm{dc}$-second harmonic generation (SHG)) as function of the applied electric field frequencies for both cases, isolated and embedded molecules. The results in Figure $7(\\mathrm{a}, \\mathrm{b}, \\mathrm{c})$ show that the dispersion relations are practically insensible to the environment polarization, and present a similar behavior, i.e., all curves increase smoothly and continuously.\n\nIn order to make a more accurate estimative of the dynamic third-order susceptibility $\\left(\\chi^{(3)}\\right)$ we have used two different models for the $\\gamma$ ' -dynamic: (1) the frequency-dependent second hyperpolarizability $(\\iota(-\\omega ; \\omega, \\omega,-\\omega) \\iota)$ associated to the nonlinear optical process of the intensity dependent refractive index (IDRI) from dc-Kerr result, and (2) the third harmonic generation hyperpolarizability $(\\nless \\gamma(-3 \\omega ; \\omega, \\omega, \\omega) \\diamond)$. Following a previous work $^{54}$, for small frequencies ${ }^{55}$ average hyperpolarizabilities can be written as,\n\n\\[\n\\begin{aligned}\n& \\langle\\gamma(-\\omega ; \\omega, \\omega,-\\omega)\\rangle \\cong 2\\langle\\gamma(-\\omega ; \\omega, 0,0)\\rangle-\\langle\\gamma(0 ; 0,0,0)\\rangle . \\\\\n& \\langle\\gamma(-3 \\omega ; \\omega, \\omega, \\omega)\\rangle \\cong 6\\langle\\gamma(-\\omega ; \\omega, 0,0)\\rangle-5\\langle\\gamma(0 ; 0,0,0)\\rangle .\n\\end{aligned}\n\\]\n\nTable 4 shows the results for the linear refractive index, the second hyperpolarizabilities IDRI ( $\\gamma$ (IDRI)) and THG $(\\gamma(\\mathrm{THG}))$, defined by equations (9) and (10) respectively and the respective third-order nonlinear susceptibilities $\\chi^{(3)}$ (IDRI) and $\\chi^{(3)}$ (THG), for two values of the electric field frequencies $\\omega=0.0428$ a.u. and $\\omega=0.06$ a.u..\n\nTable 4: CAD embedded molecules linear refractive index and the IDRI and THG results for $\\gamma\\left(10^{-36} e s u\\right)$ and the $\\chi^{(3)}\\left(10^{-22} \\mathrm{~m}^{2} / \\mathrm{V}^{2}\\right)$.\n\n\\begin{center}\n\\begin{tabular}{lccccc}\n\\hline\n$\\boldsymbol{\\omega}(\\mathbf{a . u})$ & $\\boldsymbol{n}$ & $\\boldsymbol{\\gamma}(\\mathbf{I D R I})$ & $\\chi^{(\\mathbf{3})}($ IDRI $)$ & $\\boldsymbol{\\gamma}(\\mathbf{T H G})$ & $\\chi^{(\\mathbf{3})}(\\mathbf{T H G})$ \\\\\n\\hline\n$0.0428$ & $1.48$ & $5.31$ & $20.54$ & $6.39$ & $24.72$ \\\\\n$0.06$ & $1.49$ & 5,81 & $22.86$ & $7.89$ & $31.05$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\n\\section{Isolated Molecule}\n\\section{Embedded Molecule}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-06_1921_2421_168_1848}\n\\end{center}\n\nFigure 7: Dynamic evolution of the calculated values for: a) average linear polarizability $\\alpha \\alpha(-\\omega ; \\omega)>\\left(10^{-24}\\right.$ esu $)$; b) average second hyperpolarizability $\\left.\\langle\\gamma(-\\omega ; \\omega, 0,0)\\rangle\\left(10^{-36} e s u\\right) ; c\\right)$ average second hyperpolarizability $\\left\\langle\\gamma(-2 \\omega ; \\omega, \\omega, 0)>\\left(10^{-36} e s u\\right)\\right.$ for the compound $\\mathrm{CAD}^{2}\\left(\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}\\right)$. The values of the $\\chi^{(3)}$ for the CAD embedded molecule (Table 4) in both frequencies are high when compared with the results obtained for chalcone derivatives studied by the Z-scan technique by D'Silva et al. (2012). ${ }^{56}$ The value of the third-order electric susceptibility (in units of $\\left(10^{-22} \\mathrm{~m}^{2} / V^{-2}\\right)$ of the chalcone derivatives 4Br4MSP, $3 \\mathrm{Br} 4 \\mathrm{MSP}$ and $4 \\mathrm{~N} 4 \\mathrm{MSP}$ are $2.30,1.99$ and $2.37$ respectively, ${ }^{56}$ the $\\mathrm{CAD} \\chi^{(3)}$-value is $22.86(\\omega=0.06$ a.u, $\\lambda=759 \\mathrm{~nm})$, therefore $9.94,11.49$ and $9.65$ times higher than these values respectively. The typical $\\chi^{(3)}$-value reported in the literature is of order of $10^{-22}\\left(\\frac{\\mathrm{m}}{\\mathrm{v}}\\right){ }^{57}$\n\n\\section{Solvent Media}\nThe solvent media may change the properties of the molecules, as the displacements of electronic absorption bands, the reaction rates, the NLO properties, among others. Thus an adequate description of the solvent medium is necessary. There are two models that simulate the solvent medium: the continuous model and the discrete model. In this work we use the method of Polarizable Continuum Model (PCM), in which the dielectric properties of the solvent medium are used for the solvation of the system. A PCM advantage is the possibility of making a purely quantum treatment of the solute-solvent interaction. The calculations were performed numerically based on finite field method, include the optimization of the structure using the PCM-CAM-B3LYP/6-311++G $(\\mathrm{d}, \\mathrm{p})$ level of theory. We selected Chloroform, Dichloromethane, Acetone, Ethanol, Methanol, Dimethyl Sulfoxide (DMSO), and Water as the solvent media, and the gas-phase results are included by comparison.\n\nWhen in a solvent medium the electrical properties of the organic compounds change, one of the changes is the loss of the centrosymmetry conformation which causes a not null value for the first hyperpolarizability. Here we consider the first hyperpolarizability component parallel to the dipole moment (taken as z-direction) given by,\n\n\\[\n\\beta_{\\| z}=\\frac{1}{5} \\sum_{i=1}^{3}\\left(\\beta_{z i i}+\\beta_{i z i}+\\beta_{i i z}\\right)\n\\]\n\nTable 5: PCM-CAM-B3LYP/6-311++G(d,p) results for the dynamic linear polarizability (in $10^{-24}$ esu), first hyperpolarizability (in 10-30 esu) and second hyperpolarizability (in $10^{-36}$ esu) of $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ in various solvent media for the frequency $\\omega=0.0428$ a.u.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-07_2086_2521_145_1851}\n\\end{center}\n\nThe dynamical electric parameter $\\beta_{\\|} z\\left(-\\omega ; \\omega_{1}, \\omega_{2}\\right)$ is an experimentally relevant quantity because it is closely related to the direction of the ground state charge transfer. In the specific cases we consider $\\beta_{\\|} z(-\\omega ; \\omega, 0)$ and $\\beta_{\\|} z(-$ $2 \\omega ; \\omega, \\omega)$ that correspond to the Pockels effect and to the SHG respectively.\n\nTable 5, shows the values for average linear polarizability, first hyperpolarizability and second hyperpolarizability for various solvent media. Figure 8 shows that the average linear polarizability increases to a value close to $26.3 \\%$ when comparing the DMSO medium with the gas-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-07_764_1184_1052_1856}\n\\end{center}\n\nFigure 8: PCM-CAM-B3LYP/6-311++G $(\\mathrm{d}, \\mathrm{p})$ results for average linear polarizability $\\iota \\alpha(-\\omega ; \\omega) 〉\\left(10^{-24} e s u\\right)$ for $\\omega=0.04282$ of compound $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ in a solvent medium.\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_7433a6c7542334063731g-07_1349_1803_1051_1846}\\\\\nfor $\\omega=0.04282$ a. u. of compound $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ in a solvent medium. Figure 9: PCM-CAM-B3LYP/6-311++G(d,p) results for first hyperpolarizabilities $\\left(10^{-30} e s u\\right) \\wedge \\beta_{\\|} z(-\\omega ; \\omega, 0)>$, and $\\varangle \\beta_{\\|} z(-2 \\omega ; \\omega$, $\\omega)>$ phase. The first hyperpolarizability $\\iota \\beta_{\\|} z(-\\omega ; \\omega, 0)>\\left[<\\beta_{\\|} z(-\\right.$ $2 \\omega ; \\omega, \\omega)$ >] increases around $86.3 \\%[65.5 \\%]$ when comparing the gas-phase with water, see Figure 9, and the second hyperpolarizability $\\langle\\gamma(-\\omega ; \\omega, 0,0)\\rangle[\\langle\\gamma(-2 \\omega ; \\omega, \\omega, 0) 〉$ increases around $59.5 \\%$ [43.6\\%] when comparing the DMSO medium with the gas-phase, see Figure 10. The choice of the solvent medium allows us to control the NLO properties; in other words, the first hyperpolarizability is more sensitive in water whereas the second hyperpolarizability is more sensitive in DMSO solvent medium.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-08_689_1137_186_976}\n\\end{center}\n\nFigure 10: PCM-CAM-B3LYP/6-311++G $(\\mathrm{d}, \\mathrm{p})$ results for second hyperpolarizabilities $\\left(10^{-36} e s u\\right)\\langle\\gamma(-\\omega ; \\omega, 0,0)>$ and $\\iota \\gamma(-2 \\omega ; \\omega, \\omega, 0)$, for $\\omega=0.04282 \\mathrm{a}$. u. of compound $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ in a solvent medium.\n\nFigure 11 shows the overlap of the structure of the crystal molecule with the molecule in the gas phase of the compound $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$; the anchorage point occurs in the $\\mathrm{O} 2$ C1-O1-H1 geometry (see Figure 1). The X-ray geometry of the theoretical structure was analyzed in terms of root mean square deviation (RMSD) calculated for non $\\mathrm{H}$-atoms. The $\\mathrm{H}$-atoms were neglected in view of their uncertainties in X-ray position refinement. The compound $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ presents in $\\mathrm{RMSD}=0.0328$ max. $\\mathrm{d}=0.0571 \\AA$. The RMSD parameter indicates no significant deviation between the theoretical and experimental data.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-08_1795_2127_233_897}\n\\end{center}\n\nFigure 11: Compound $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ overlap of compound yellow (crystal), red (gas-phase). The anchorage point occurs in the $\\mathrm{O}_{2}-\\mathrm{C}_{1}-\\mathrm{O}_{1}-\\mathrm{H}_{1}$ geometry.\n\n\\section{HOMO and LUMO Analysis}\nThe PCM-CAM-B3LYP/6-311+G(d) level of theory has been used to obtain the energies of the highest occu- pied molecular orbital (HOMO) and lowest unoccupied molecular orbital (LUMO). These quantum chemical parameters, HOMO and LUMO energies, play the same role of electron donor and electron acceptor, respectively; therefore they determine the molecular reactivity and the ability of a molecule to absorb light. Also they can be used for predicting the most reactive position in $\\pi$-electron systems and explain several types of reactions in conjugated systems. The HOMO-LUMO separation energy is called the gap energy, and a small value of this parameter implies a charge transfer interaction within the molecule, which influences the NLO activity of the molecule. In Table 5 the HOMO and LUMO energies for the CAD in several solvent media are presented, showing that the values present a small variation in different solvent media.\n\nTable 6: PCM-CAM-B3LYP/6-311+G(d) results for the energy HOMO-LUMO (in eV) of compound $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ in a solvent medium.\n\n\\begin{center}\n\\begin{tabular}{lcc}\n\\hline\n$\\mathrm{C}_{5} \\mathbf{H}_{8} \\mathbf{O}_{2}$ & HOMO & LUMO \\\\\n\\hline\nAcetone & $-9.22$ & $-0.27$ \\\\\nChloroform & $-9.22$ & $-0.25$ \\\\\nDichloromethane & $-9.23$ & $-0.26$ \\\\\nDiMethylSulfoxide & $-9.23$ & $-0.28$ \\\\\nthhanol & $-9.23$ & $-0.28$ \\\\\nGas-Phase & $-9.23$ & $-0.17$ \\\\\nMethanol & $-9.23$ & $-0.28$ \\\\\nWater & $-9.23$ & $-0.28$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nIt is clear from Figure 12that the HOMO is largely located on C2-C3 atoms and moderately on H4A-C4-H4B atoms whereas the LUMO is mainly present on C2-C3 atoms and moderately on C3 atom. Also the band gap energies in different solvent media are presented in Figure 12, where we notea small variation ofthis parameter is, of order of $0.1 \\mathrm{eV}$. Through the $\\mathrm{HOMO}$ and LUMO energies the global chemical reactivity descriptors (GCRD) such the electronic chemical potential $\\left(\\mu_{\\mathrm{cp}}\\right)$, the chemical hardness $(\\eta)$, softness (S), and the global electrophilicity index ( () can be calculated through the equations\n\n\\[\n\\begin{aligned}\n& \\mu_{c p}=\\frac{1}{2}\\left(E_{\\text {HOMO }}+E_{\\text {LUMO }}\\right), \\\\\n& \\eta=\\frac{1}{2}\\left(E_{\\text {LUMO }}-E_{\\text {HOMO }}\\right) \\\\\n& S=\\frac{-E_{\\text {HOMO }}}{2 \\eta}\n\\end{aligned}\n\\]\n\n\\[\n\\varpi=\\frac{\\mu_{c p}^{2}}{2 \\eta} .\n\\]\n\nCalculations fo the GCRD can be seen in Table 6 for various solvent media. The obtained GCRD results reveal that the CAD molecule offers good chemical strength and stability.\n\nTable 7: PCM-CAM-B3LYP/6-311+G(d) results for the electronic chemical potential $\\left(\\mu_{\\mathrm{cp}}\\right)$, the chemical hardness $(\\eta)$, softness (S), and the global electrophilicity index ( $\\left(\\right.$ ) (in $\\mathrm{eV}$ ) of compound $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ in a solvent medium.\n\n\\begin{center}\n\\begin{tabular}{lllll}\n\\hline\n$\\mathbf{C}_{\\mathbf{5}} \\mathbf{H}_{\\mathbf{8}} \\mathbf{O}_{\\mathbf{2}}$ & $\\boldsymbol{\\mu}_{\\text {cp }}$ & $\\boldsymbol{\\eta}$ & $\\boldsymbol{S}$ & $\\boldsymbol{\\omega}$ \\\\\n\\hline\nAcetone & $-4.75$ & $4.48$ & $1.03$ & $2.52$ \\\\\nChloroform & $-4.74$ & $4.49$ & $1.03$ & $2.50$ \\\\\nDichloromethane & $-4.75$ & $4.49$ & $1.03$ & $2.51$ \\\\\nDiMethylSulfoxide & $-4.76$ & $4.48$ & $1.03$ & $2.53$ \\\\\nEthanol & $-4.76$ & $4.48$ & $1.03$ & $2.53$ \\\\\nGas-Phase & $-4.70$ & $4.53$ & $1.02$ & $2.44$ \\\\\nMethanol & $-4.76$ & $4.48$ & $1.03$ & $2.53$ \\\\\nWater & $-4.76$ & $4.48$ & $1.03$ & $2.53$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nThe effect of the solvent on the GCRD is not significant.\n\nWhen we observed the effect of the transition between non-polar solvents (Chloroform) and polar solvents (DMSO) the Band-Gap between Chloroform-DMSO does not exceed $0.03 \\mathrm{eV}$, indicating that this property is not significantly affected by the solvent.\n\n\\section{Conclusion}\nStudies of the structural and electrical properties of (E)-pent-2-enoic acid (CAD) with structural formula $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ have been performed by the Hirshfeld surface analysis and the DFT/CAM-B3LYP and MP2 theory both with the $6-311++G(d, p)$ basis set. The SM approach was used to simulate crystalline environment of the CAD crystal. The dipole moment, linear polarizability and second hyperpolarizabilities were calculated for CAD isolated and\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-09_1044_1418_190_532}\n\\end{center}\n\nBand-Gap $=9.05 \\mathrm{eV}$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_7433a6c7542334063731g-09_1490_2448_182_620}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-09_1044_1418_825_1170}\n\\end{center}\n\nBand-Gap $=8.95 \\mathrm{eV}$ LUMO\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-09_1532_1758_870_1194}\n\\end{center}\n\nDichloromethane HOMO\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-09_1913_2125_849_1189}\n\\end{center}\n\nBand-Gap $=8.96 \\mathrm{eV}$ LUMO\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-09_2222_2437_872_1209}\n\\end{center}\n\nChloroform\n\nHOMO\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-09_1177_1402_1461_1787}\n\\end{center}\n\nBand-Gap $=8.98 \\mathrm{eV}$\n\nLUMO\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-09_1528_1757_1477_1813}\n\\end{center}\n\nWater\n\nHOMO\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-09_1906_2127_1476_1804}\n\\end{center}\n\nBand-Gap $=8.95 \\mathrm{eV}$\n\nLUMO\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7433a6c7542334063731g-09_2223_2436_1485_1806}\n\\end{center}\n\nFigure 12: The HOMO-LUMO frontier orbital for the compound $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}$ in different solvent media. embedded molecules. For CAD embedded molecule an estimation of the linear refractive index and the third-order nonlinear susceptibility, both static and dynamic, are performed and the results compared with available experimental results. Also the effects of solvent medium on the molecular properties were considered through the PCM method, and the HOMO and LUMO energies were calculated. The band gap energies ranged from $8.95 \\mathrm{eV}$ (DMSO) to $9.05 \\mathrm{eV}$ (gas-phase). In addition, the global chemical reactivity descriptors were calculated and the results reveal that the CAD molecule possesses good chemical strength and stability.\n\nThe molecular structure of the CAD crystal were explored by Hirshfeld surface analysis and the associated 2D-fingerprint plots calculated using Crystal Explorer software. ${ }^{38,39}$ The intermolecular contacts that were explored are as follows: C...C, C...H, C...O, H...H and H...O. The intercontacts H...O shown in figure 6 (fingerprint) presents characteristic peaks that provide evidence of non-classical hydrogen bonding, including reciprocal contacts with $34.3 \\%$ of the total surface. The contacts of type H...H show the highest contributions with a total of $52.5 \\%$ followed by C...H (8.7\\%), C...C (2.5\\%) and C...O (1.6\\%). The vibrational modes behavior and the functional groups present in CAD were studied by FT-IR.\n\nOur theoretical results show that the crystalline environment polarization effect on the average linear polarizability and average second hyperpolarizability is small, in the static and dynamic situation, but the third-order electric susceptibility (IDRI) of the CAD crystal is 9.94, $11.49$, and $9.65$ times greater than the chalcone derivatives 4Br4MSP, 3Br4MSP and 4N4MSP respectively, ${ }^{56}$ and near 10 times larger than the fused silica, ${ }^{45}$ this latter usually being taken as reference. As consequence, the CAD exhibits a good nonlinear optical effect.\n\n\\section{References}\n\\begin{enumerate}\n  \\item I. SHEIKHSHOAIE and W. FABIAN, Dye. Pigment., 2006, 70, 91-98. DOI: 10.1016/j.dyepig.2005.04.011.\n\n  \\item V. Jeux, O. Segut, D. Demeter, T. Rousseau, M. Allain, C. Dalinot, L. Sanguinet, P. Leriche and J. Roncali, Dye. Pigment., 2015, 113, 402-408. DOI: 10.1016/j.dyepig.2014.09.012.\n\n  \\item A. Iwan and D. Sek, Prog. Polym. Sci., 2011, 36, 1277-1325. DOI: 10.1016/j.progpolymsci.2011.05.001.\n\n  \\item H.-J. Niu, Y.-D. Huang, X.-D. Bai and X. Li, Mater. Lett., 2004, 58, 2979-2983. DOI: 10.1016/j.matlet.2004.05.007.\n\n  \\item L.-Y. Kong, Z.-W. Li, T. Okamura, G.-H. Ma, Q. Chu, H.-F. Zhu, S.-H. Tang, W.-Y. Sun and N. Ueyama, Chem. Phys. Lett., 2005, 416, 176-181. DOI: 10.1016/j.cplett.2005.09.074.\n\n  \\item İ. Kaya, M. Ylldırım and A. Avc1, Synth. Met., 2010, 160, 911920. DOI: 10.1016/j.synthmet.2010.01.044.\n\n  \\item A. L. Briseno, S. C. B. Mannsfeld, C. Reese, J. M. Hancock, Y. Xiong, S. A. Jenekhe, Z. Bao and Y. Xia, Nano Lett., 2007, 7, 2847-2853. DOI: $10.1021 / n 1071495$ u. 8. L. Tan, W. Jiang, L. Jiang, S. Jiang, Z. Wang, S. Yan and W. Hu, Appl. Phys. Lett., 2009, 94, 153306. DOI: 10.1063/1.3120769.\n\n  \\item M. Jazbinsek, L. Mutter and P. Gunter, IEEE J. Sel. Top. Quantum Electron., 2008, 14, 1298-1311.\n\n\\end{enumerate}\n\nDOI: 10.1109/JSTQE.2008.921407.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{9}\n  \\item C. Polisseni, K. D. Major, S. Boissier, S. Grandi, A. S. Clark and E. A. Hinds, Opt. Express, 2016, 24, 5615.\n\\end{enumerate}\n\nDOI: 10.1364/OE.24.005615.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{10}\n  \\item L. Zhang, E. Pavlica, X. Zhong, F. Liscio, S. Li, G. Bratina, E. Orgiu and P. Samorì, Adv. Mater., 2017, 29, 1605760.\n\\end{enumerate}\n\nDOI: 10.1002/adma.201605760.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{11}\n  \\item W. Sun, M. M. McKerns, C. M. Lawson, G. M. Gray, C.-L. Zhan and D.-Y. Wang, 2000, p. 280 DOI: 10.1117/12.408515.\n\n  \\item A. Ronchi, T. Cassano, R. Tommasi, F. Babudri, A. Cardone, G. M. Farinola and F. Naso, Synth. Met., 2003, 139, 831-834. DOI: 10.1016/S0379-6779(03)00274-1.\n\n  \\item A. J. Kiran, D. Udayakumar, K. Chandrasekharan, A. V Adhikari and H. D. Shashikala, J. Phys. B At. Mol. Opt. Phys., 2006, 39, 3747-3756. DOI: 10.1088/0953-4075/39/18/005.\n\n  \\item Y. Gao, Q. Chang, H. Ye, W. Jiao, Y. Song, Y. Wang and J. Qin, Appl. Phys. B, 2007, 88, 255-258.\n\n\\end{enumerate}\n\nDOI: 10.1007/s00340-007-2687-6.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{15}\n  \\item B. Lands, Nutrients, 2012, 4, 1338-1357. DOI: $10.3390 / \\mathrm{nu} 4091338$.\n\n  \\item A. A. Spector, H. Kim and E. Century, J. Lipid Res., 2015, 56, 11-21. DOI: 10.1194/jr.R055095.\n\n  \\item M. S. BLUM, A. F. NOVAK and S. TABER, Science (80-. )., 1959, 130, 452-453. DOI: 10.1126/science.130.3373.452.\n\n  \\item S. R. TOWNSEND GF, MORGAN JF, TOLNAI S, HAZLETT B, MORTON HJ, Cancer Res., 1960, 20, 503-510.\n\n  \\item T. C. Murphy, C. Poppe, J. E. Porter, T. J. Montine and M. J. Picklo Sr, J. Neurochem., 2004, 89, 1462-1470.\n\n\\end{enumerate}\n\nDOI: 10.1111/j.1471-4159.2004.02442.x.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{20}\n  \\item M. Sonneck, T. Peppel, A. Spannenberg and S. Wohlrab, Crystals, 2015, 5, 466-474. DOI: 10.3390/cryst5040466.\n\n  \\item T. Peppel, M. Sonneck, A. Spannenberg and S. Wohlrab, Acta Crystallogr. Sect. E Crystallogr. Commun., 2015, 71, o323o323. DOI: $10.1107 / \\mathrm{S} 2056989015007380$.\n\n  \\item T. Peppel, M. Sonneck, A. Spannenberg and S. Wohlrab, Acta Crystallogr. Sect. E Crystallogr. Commun., 2015, 71, o316o316. DOI: $10.1107 / \\mathrm{S} 2056989015007203$.\n\n  \\item M. Sonneck, T. Peppel, A. Spannenberg and S. Wohlrab, Acta Crystallogr. Sect. E Crystallogr. Commun., 2015, 71, o426o427. DOI: $10.1107 /$ S2056989015009469.\n\n  \\item M. Sonneck, T. Peppel, A. Spannenberg and S. Wohlrab, Acta Crystallogr. Sect. E Crystallogr. Commun., 2015, 71, o528o529. DOI: $10.1107 / \\mathrm{S} 2056989015011937$.\n\n  \\item A. N. Castro, L. R. Almeida, M. M. Anjos, G. R. Oliveira, H. B. Napolitano, C. Valverde and B. Baseia, Chem. Phys. Lett., 2016, 653, 122-130. DOI: 10.1016/j.cplett.2016.04.070.\n\n  \\item T. L. Fonseca, M. A. Castro, H. C. B. de Oliveira and S. Cunha, Chem. Phys. Lett., 2007, 442, 259-264. DOI: 10.1016/j. cplett.2007.06.020.\n\n  \\item T. L. Fonseca, H. C. B. de Oliveira, O. A. V. Amaral and M. A. Castro, Chem. Phys. Lett., 2005, 413, 356-361.\n\n\\end{enumerate}\n\nDOI: 10.1016/j.cplett.2005.08.007. 29. H. C. B. de Oliveira, T. L. Fonseca, M. A. Castro, O. A. V. Amaral and S. Cunha, J. Chem. Phys., 2003, 119, 8417-8423. DOI: $10.1063 / 1.1612474$.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{29}\n  \\item L. R. Almeida, M. M. Anjos, G. C. Ribeiro, C. Valverde, D. F. S. Machado, G. R. Oliveira, H. B. Napolitano and H. C. B. de Oliveira, New J. Chem., 2017, 41, 1744-1754.\n\\end{enumerate}\n\nDOI: $10.1039 / \\mathrm{C} 5 \\mathrm{NJ} 03214 \\mathrm{H}$.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{30}\n  \\item D. F. S. Machado, T. O. Lopes, I. T. Lima, D. A. da Silva Filho and H. C. B. de Oliveira, J. Phys. Chem. C, 2016, 120, 1766017669. DOI: 10.1021/acs.jpcc.6b01567.\n\n  \\item B. Baseia, F. Osório, L. Lima and C. Valverde, Crystals, 2017, 7, 158. DOI: $10.3390 /$ cryst7060158.\n\n  \\item A. N. Castro, F. A. P. Osório, R. R. Ternavisk, H. B. Napolitano, C. Valverde and B. Baseia, Chem. Phys. Lett., 2017, 681, 110-123. DOI: 10.1016/j.cplett.2017.05.066.\n\n  \\item C. Valverde, R. F. N. Rodrigues, D. F. S. Machado, B. Baseia and H. C. B. de Oliveira, J. Mol. Model., 2017, 23, 122. DOI: 10.1007/s00894-017-3274-3.\n\n  \\item R. F. N. Rodrigues, L. R. Almeida, F. G. dos Santos, P. S. Carvalho Jr, W. C. de Souza, K. S. Moreira, G. L. B. de Aquino, C. Valverde, H. B. Napolitano and B. Baseia, PLoS One, 2017, 12, e0175859. DOI: 10.1371/journal.pone.0175859.\n\n  \\item G. C. Ribeiro, L. R. Almeida, H. B. Napolitano, C. Valverde and B. Baseia, Theor. Chem. Acc., 2016, 135, 244.\n\n\\end{enumerate}\n\nDOI: 10.1007/s00214-016-1999-1.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{36}\n  \\item W. F. Vaz, J. M. F. Custodio, R. G. Silveira, A. N. Castro, C. E. M. Campos, M. M. Anjos, G. R. Oliveira, C. Valverde, B. Baseia and H. B. Napolitano, RSC Adv., 2016, 6, 79215-79227. DOI: 10.1039/C6RA14961H.\n\n  \\item S. K. Wolff, D. J. Grimwood, J. J. McKinnon, M. J. Turner, D. Jayatilaka and M. A. Spackman, 2012.\n\n  \\item D. Jayatilaka, S. K. Wolff, D. J. Grimwood, J. J. McKinnon and M. A. Spackman, Acta Crystallogr. Sect. A, 2006, 62, s90.\n\n  \\item O. L. Santos, J. R. Sabino, H. C. Georg, T. L. Fonseca and M. A. Castro, Chem. Phys. Lett., 2017, 669, 176-180.\n\n\\end{enumerate}\n\nDOI: 10.1016/j.cplett.2016.12.042.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{40}\n  \\item T. L. Fonseca, J. R. Sabino, M. A. Castro and H. C. Georg, J. Chem. Phys., 2010, 133, 144103. DOI: 10.1063/1.3501237.\n\n  \\item O. L. Santos, T. L. Fonseca, J. R. Sabino, H. C. Georg and M. A. Castro, J. Chem. Phys., 2015, 143, 234503. DOI: $10.1063 / 1.4937481$.\n\n  \\item D. A. Kleinman, Phys. Rev., 1962, 126, 1977-1979. DOI: 10.1103/PhysRev.126.1977.\n\n  \\item K. Senthil, S. Kalainathan, A. R. Kumar and P. G. Aravindan, RSC Adv., 2014, 4, 56112-56127.\n\n\\end{enumerate}\n\nDOI: 10.1039/C4RA09112D.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{44}\n  \\item U. Gubler and C. Bosshard, Phys. Rev. B, 2000, 61, 1070210710. DOI: 10.1103/PhysRevB.61.10702.\n\n  \\item D. Jayatilaka, D. J. Grimwood, J. J. McKinnon, A. Lee, A. Lemay, A. J. Russel, C. Taylo, S. K. Wolff, Cassam-Chenai and A. Whitton, 2005.\n\n  \\item D. Jayatilaka and D. J. Grimwood, eds. P. M. A. Sloot, D. Abramson, A. V Bogdanov, Y. E. Gorbachev, J. J. Dongarra and A. Y. Zomaya, Springer Berlin Heidelberg, Berlin, Heidelberg, 2003, pp. 142-151\n\n\\end{enumerate}\n\nDOI: 10.1007/3-540-44864-0\\_15.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{47}\n  \\item S. S. Batsanov, Inorg. Mater., 2001, 37, 871-885. DOI: $10.1023 / \\mathrm{A}: 1011625728803$.\n\n  \\item A. Bondi, J. Phys. Chem., 1964, 68, 441-451. DOI: 10.1021/j100785a001.\n\n  \\item N. K. Nkungli and J. N. Ghogomu, J. Theor. Chem., 2016, 2016, 1-19. DOI: 10.1155/2016/7909576.\n\n  \\item T. Pluta and A. J. Sadlej, J. Chem. Phys., 2001, 114, 136. DOI: $10.1063 / 1.1328398$.\n\n  \\item X. Song and S. O. Farwell, J. Anal. Appl. Pyrolysis, 2004, 71, 901–915. DOI: 10.1016/j.jaap.2003.12.002.\n\n  \\item C. Valverde, F. A. P. Osório, T. L. Fonseca and B. Baseia, Chem. Phys. Lett., 2018, 706, 170-174.\n\n\\end{enumerate}\n\nDOI: 10.1016/j.cplett.2018.06.001.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{53}\n  \\item S. Marques, M. A. Castro, S. A. Leão and T. L. Fonseca, Chem. Phys. Lett., 2016, 659, 76-79.\n\\end{enumerate}\n\nDOI: $10.1016 /$ j.cplett.2016.07.009.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{54}\n  \\item D. M. Bishop and D. W. De Kee, J. Chem. Phys., 1996, 104, 9876-9887. DOI: 10.1063/1.471752.\n\n  \\item E. D. D'silva, G. K. Podagatlapalli, S. Venugopal Rao and S. M. Dharmaprakash, Mater. Res. Bull., 2012, 47, 3552-3557.\n\n\\end{enumerate}\n\nDOI: 10.1016/j.materresbull.2012.06.063.\n\n\\begin{enumerate}\n  \\setcounter{enumi}{56}\n  \\item P. Günter, Nonlinear Optical Effects and Materials, Springer Berlin Heidelberg, Berlin, Heidelberg, 2000, vol. 72 DOI: 10.1007/978-3-540-49713-4.\n\\end{enumerate}\n\n\\section{Povzetek}\nV tem prispevku poročamo o strukturnih in električnih lastnostih derivata karboksilne kisline (CAD) s strukturno formulo $\\mathrm{C}_{5} \\mathrm{H}_{8} \\mathrm{O}_{2}((E)$-pent-2-enojske kisline). $\\mathrm{Z}$ uporabo perturbacijske teorije Møller-Plesset (MP2) in teorije gostotnega funkcionala (DFT/CAM-B3LYP) z baznim setom 6-311++G $(d, p)$ smo izračunali dipolni moment, linearno polarizabilnost ter prvo in drugo hiper-polarizabilnost v prisotnosti statičnega in dinamičnega električnega polja. S super-molekularnim pristopom smo simulirali kristalno fazo CAD in vplive polarizacije okolja na njene električne parametre. Dobili smo statično in dinamično oceno linearnega lomnega količnika in nelinearne susceptibilnosti tretjega reda za kristal in jih primerjali z razpoložljivimi eksperimentalnimi rezultati. Značilni vibracijski načini in funkcionalne skupine, ki so prisotne v CAD, so bili analizirani s Fourier Transform infrardečo spektroskopijo (FT-IR) v območju $400-4000$ cm $^{-1}$. S Hirshfeldovo analizo površine smo raziskali molekularno strukturo in lastnosti vibracijskih načinov kristala CAD. Vpliv topila na molekularne lastnosti je upoštevan s pomočjo modela polarizabilnega kontinuuma (PCM). Hkrati smo obravnavali mejne molekularne orbitale, energije in globalno kemijsko reaktivnost deskriptorjev. Vse študirane lastnosti kažejo, da lahko predstavljeni material smatramo za nelinearen optičen material.\n\n\n\\end{document}", "record_id": "2023_09_22_7433a6c7542334063731g"}