{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{PAPER }\n\n\\author{}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nView Article Online\n\nView Journal | View Issue\n\nCheck for updates\n\nCite this: RSC Adv., 2018, 8, 14676\n\nReceived 19th January 2018\n\nAccepted 5th April 2018\n\nDOI: $10.1039 / c 8 \\mathrm{ra00560e}$\n\n\\href{http://rsc.li/rsc-advances}{rsc.li/rsc-advances}\n\n\\section{Enhancing the ambient stability of few-layer black phosphorus by surface modification}\n\\begin{abstract}\nShuang-Ying Lei, ${ }^{* a}$ Hai-Yun Shen, (D) ${ }^{a}$ Yi-Yang Sun, ${ }^{b}$ Neng Wan, ${ }^{a}$ Hong $Y^{a}$ and Shengbai Zhang ${ }^{\\mathrm{C}}$ \n Based on high-throughput density functional theory calculations, we investigated the adsorption characteristics of various elements across the Periodic Table on few-layer black phosphorus (BP). Using the criterion that the ratio of adsorption energy $\\left(E_{\\text {ads }}\\right)$ to bulk cohesive energy $\\left(E_{\\text {con }}\\right)$ is greater than one $\\left(E_{\\text {ads }} / E_{\\text {coh }}>1\\right)$, we selected fifteen elements. The adsorption of these elements on few-layer BPs could significantly shift their conduction-band minimum (CBM) downward, suggesting the possibility of preventing the few-layer BPs from oxidation if the CBM can be shifted below the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential. Our study offers an efficient approach to overcoming the technical barrier in the practical application of few-layer BPs by enhancing its ambient stability via surface modification.\n\\end{abstract}\n\n\\section{Introduction}\nDuring the last decade, two-dimensional (2D) nanomaterials such as graphene and transition metal dichalcogenides (TMDCs) have attracted intensive research as promising materials for future electronics applications. ${ }^{1}$ Such $2 \\mathrm{D}$ materials exhibit excellent electronic and optical properties that are not found in their bulk counterparts. ${ }^{2,3}$ Graphene $^{4}$ and TMDCs, ${ }^{5-7}$ as alternative materials to silicon, have been studied extensively for nanoelectronics (or microelectronics) applications. Both of these materials exhibit advantages and disadvantages. Graphene has a high carrier mobility and is well suited for fabrication of fieldeffect transistors (FETs), but the on-off ratio is low because of its gapless nature. ${ }^{8}$ The on-off ratio of FETs made from TMDCs has increased significantly, ${ }^{8}$ whereas its carrier mobility is still low. Recently, another exciting 2D material, few-layer black phosphorus (BP), has been fabricated from bulk BP by mechanical exfoliation, ${ }^{9-16}$ suite electrochemical exfoliation, ${ }^{17}$ liquid exfoliation, ${ }^{18}$ and laser irradiation methods. ${ }^{19}$ The few-layer BP-based FETs possess a large on-off ratio of up to $\\sim 10^{4}$ to $10^{5}$ and\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7c76b066edb1f6f53739g-1_1960_2005_141_884}\n\\end{center}\n\nAlthough promising for high-performance electronic devices, few-layer BPs also have inherent drawbacks. They degrade readily in the presence of oxygen and water. ${ }^{21-24}$ The development of robust native protective methods is challenging. Many efforts have focused on the use of dielectric\n\n${ }^{a}$ Key Laboratory of Microelectromechanical Systems of the Ministry of Education, Southeast University, Nanjing 210096, China. E-mail: \\href{mailto:lsy@seu.edu.cn}{lsy@seu.edu.cn}\n\n${ }^{b}$ State Key Laboratory of High Performance Ceramics and Superfine Microstructure, Shanghai Institute of Ceramics, Chinese Academy of Sciences, Shanghai 201899, China\n\n'Department of Physics, Applied Physics, and Astronomy, Rensselaer Polytechnic Institute, Troy, New York 12180, USA capping layers, such as graphene, aluminum-oxide and h-BN, to prevent few-layer BPs from contact with moisture. For example, although $\\mathrm{Al}_{2} \\mathrm{O}_{3}$ encapsulated BP-based FETs can be stable at room temperature for 17 months. ${ }^{25}$ However, such protection is too challenging to consider potential damage and contamination during the deposition. ${ }^{25-31}$\n\nWang et al. suggested that doping with tellurium (Tе) can enhance the ambient stability and transport performance of few-layer BP devices. Te-doped few-layer BPs exhibit a high mobility of up to $1850 \\mathrm{~cm}^{2} \\mathrm{~V}^{-1} \\mathrm{~s}^{-1}$ at room temperature and maintain a high mobility of over $200 \\mathrm{~cm}^{2} \\mathrm{~V}^{-1} \\mathrm{~s}^{-1}(30 \\%$ of the initial value) after several weeks under ambient conditions. ${ }^{33}$ This is in marked contrast to the undoped devices that decrease rapidly to $2 \\%$ of the initial value. ${ }^{33}$ This work has inspired us to study the effect of other elements on the stability of BP in order to further improve its properties, such as mobility, and replace the rare element Te.\n\nIn this paper, we perform a high-throughput computational study by scanning the Periodic Table with an aim of finding suitable elements for stabilizing few-layer BPs in ambient environment. Our search was based on the criteria that (1) the adsorption should be thermodynamically stable against clustering of adatoms and (2) the CBM of adatom-decorated fewlayer BPs should be below the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential so that oxidation can be prohibited. Several elements have been proposed to serve the purpose. The electronic structures of the decorated BPs were analyzed to understand the underlying mechanisms.\n\n\\section{Computational methods}\nOur first-principles calculations were performed within the framework of density functional theory (DFT) implemented in the Vienna Ab initio Simulation Package (VASP). ${ }^{34}$ The generalized gradient approximation (GGA) with the parameterization of Perdew-Burke-Ernzerhof (PBE) was used. ${ }^{35}$ Van der Waals interactions were considered by using the vdW-DF method with the optB88 exchange functional (optB88-vdW) ${ }^{36,37}$ for geometry optimization. In all calculations, the plane-wave energy cutoff was set to $400 \\mathrm{eV}$. The Brillouin zone was sampled with a $3 \\times 3$ $\\times 1$ Monkhorst-Pack grid for $3 \\times 4$ orthorhombic supercells (containing $48 \\mathrm{P}$ atoms per monolayer BP). Spin polarization was considered in our calculations. All structures were fully relaxed until the forces on each atom were less than $0.01 \\mathrm{eV}^{-1}$. A vacuum layer of $15 \\AA$ was introduced along the direction perpendicular to the BP layers.\n\n\\section{Results and discussion}\n\\section{Degradation mechanism of few-layer BP}\nAs revealed in recent study, ${ }^{38}$ light illumination triggers fewlayer BP degradation. Light absorption produces excitons in few-layer BPs. If the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential is below the CBM, $\\mathrm{O}_{2}$ molecules can capture the photogenerated electrons from the conduction band and become $\\mathrm{O}_{2}{ }^{-}$anions. The presence of $\\mathrm{O}_{2}{ }^{-}$anions on the $\\mathrm{BP}$ surface initiates the formation of $\\mathrm{P}_{x} \\mathrm{O}_{y}$, which readily reacts with ambient moisture to form phosphoric acid. ${ }^{39}$ This reaction results in a rapid degradation of few-layer BPs in air under light illumination. To suppress the degradation, it is critical to prevent the BPs from the initial oxidation, preferably with their $\\mathrm{CBM}$ lower than the $\\mathrm{O}_{2} / \\mathrm{O}_{2}^{-}$redox potential.\n\nWe calculated the band structures of pristine BP from monolayer up to five-layer and determined their valence and conduction band edges with respect to the vacuum level. The $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential, reported to be $-4.11 \\mathrm{eV},^{40,41}$ is also with respect to the vacuum level. So, our calculated band edge positions can be compared with the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential. According to hybrid HSE functional calculation, $-4.11 \\mathrm{eV}$ is located between the CBM of trilayer and four-layer BPs. ${ }^{40}$ Considering that we are performing a high-throughput study and that the hybrid functional calculation is computationally highly demanding, we have used the PBE functional in this work. We followed the previous work, ${ }^{34,39}$ which corrected the value for the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential to be $-4.67 \\mathrm{eV}$ in $\\mathrm{PBE}$ calculations. Fig. 1 shows that the CBM of few-layer BP lowers as the thickness increases and the corrected $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential is located between the CBMs of trilayer and four-layer BPs, consistent with the result from HSE calculation. ${ }^{40}$ It is worth of noting that the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential may be subject to environmental parameters, such as temperature and oxygen concentration. However, experiment suggests that the variation is relatively small. ${ }^{42}$ In this work, our focus is on the trend of the CBM versus the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential. We have therefore ignored the small environment dependence.\n\n\\section{Structural properties and adsorption energy}\nFig. 2(a) shows the structure of monolayer BP and three possible adsorption sites, namely, hollow $(\\mathrm{H})$, bridge $(\\mathrm{B})$ and on-top $(\\mathrm{T})$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7c76b066edb1f6f53739g-2_168_784_1073_1903}\n\\end{center}\n\nFig. 1 VBM and CBM of few-layer $\\mathrm{BP}$ with respect to vacuum level. The dashed line indicates the position of the $\\mathrm{O}_{2} \\mathrm{OO}_{2}{ }^{-}$redox potential, as discussed in the text.\n\nsites. The calculated lattice constants along the zigzag and armchair directions are $3.32$ and $4.58 \\AA$, respectively, which agree with previous study. ${ }^{43}$ Fig. 2 (b) and (c) show the band structure and density of states (DOS) of pristine monolayer BP, respectively. Monolayer BP has a direct band gap of $0.85 \\mathrm{eV}$ from PBE calculation, which agrees well with that reported in the literature. ${ }^{33}$\n\nTo investigate the most stable adsorption position, we calculated the adsorption energy $\\left(E_{\\text {ads }}\\right)$ for various adatoms on monolayer BP using:\n\n\\[\nE_{\\mathrm{ads}}=E_{\\mathrm{A}}+E_{\\mathrm{P}}-E_{\\mathrm{A}-\\mathrm{P}}\n\\]\n\nwhere $E_{\\mathrm{A}-\\mathrm{P}}$ is the total energy of the adatom-decorated few-layer $\\mathrm{BP}$ and $E_{\\mathrm{A}}$ and $E_{\\mathrm{P}}$ are the total energy per atom in the bulk phase of the adsorbed element and pristine few-layer BP, respectively. A large absolute value of $E_{\\text {ads }}$ indicates strong interaction between few-layer BP and the adatom. Our calculation covered most main group and transition metal elements and several nonmetal elements. Almost all metal atoms prefer the $\\mathrm{H}$ site, except for a few main group elements (such as $\\mathrm{Sn}, \\mathrm{Pb}$ and $\\mathrm{Bi}$ ), which prefer the B site, and nonmetal elements (such as $O, S, F$, and $\\mathrm{Cl}$ ), which prefer the $\\mathrm{T}$ site.\n\nThe adatoms could exhibit either two-dimensional (2D) or three-dimensional (3D) growth modes on a substrate. Various factors can affect the growth modes in a vapor-deposition process, such as kinetics, energetic and experimental conditions. ${ }^{44}$ Theoretically, the ratio of adsorption energy $\\left(E_{\\text {ads }}\\right)$ and bulk cohesive energy $\\left(E_{\\text {coh }}\\right)$ generally serves as a criterion to describe the growth morphology. ${ }^{45}$ Thus, we used the ratio of calculated $E_{\\text {ads }}$ to cohesive energy $\\left(E_{\\text {coh }}\\right)^{46}$ as the criterion. A ratio of $E_{\\text {ads }} / E_{\\text {coh }}$ greater than 1 suggests that the adatom has stronger interaction with the substrate than that with a neighboring adatom preventing the formation of adatom clusters. In this case, the deposition usually proceeds in a $2 \\mathrm{D}$ growth mode, which is preferred for our purpose. Otherwise, the adatoms tend to cluster and the growth proceeds in a 3D (or island) growth (a)\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_7c76b066edb1f6f53739g-3_172_632_340_738}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7c76b066edb1f6f53739g-3_171_633_740_1380}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7c76b066edb1f6f53739g-3_167_648_1376_1733}\n\\end{center}\n\nFig. 2 (a) Side and top views of monolayer BP and three possible adsorption sites: hollow (H), bridge (B) and top (T). The blue and grey balls represent $\\mathrm{P}$ atoms in the top and bottom sublayers, respectively. (b) Band structure and (c) density of states (DOS) of pristine monolayer BP.\n\nmode. ${ }^{44}$ Our calculated $E_{\\text {ads }} / E_{\\text {coh }}$ ratios are shown in Fig. 3, which suggests that fifteen elements (Li, Na, K, Rb, Cs, Ca, Sr, Ba, Ni, Tl, La, O, S, F, and Cl) could form strong bonds with BP and prefer the 2D growth. In the following, our discussion will only focus on the decoration of few-layer BPs by the fifteen elements.\n\n\\section{Effect of adatoms on the CBM position of few-layer BPs}\nMonolayer BP. We calculated the valence and conduction band edges of pristine and adatom-decorated monolayer BP with respect to the vacuum level. As shown in Fig. 4, the CBM of monolayer BP decorated by the adatoms, Li, $\\mathrm{Na}, \\mathrm{K}, \\mathrm{Rb}, \\mathrm{Cs}$, $\\mathrm{Ca}$, $\\mathrm{Sr}, \\mathrm{Ba}, \\mathrm{Ni}, \\mathrm{Tl}$, La, O, S, F, and $\\mathrm{Cl}$, is shifted significantly towards the $\\mathrm{O}_{2} / \\mathrm{O}_{2}^{-}$redox potential. Six of the adatoms, namely, $\\mathrm{Ca}, \\mathrm{Sr}$, $\\mathrm{Ba}$, Cs, La and $\\mathrm{Cl}$, shift the $\\mathrm{CBM}$ below the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential. In these cases, the adatom-decorated monolayer BP could be less prone to be oxidized according to the discussion above.\n\nFig. 5 shows the band structures of monolayer BP decorated by $\\mathrm{Ca}, \\mathrm{Sr}, \\mathrm{Ba}, \\mathrm{Cs}$, $\\mathrm{La}$, and $\\mathrm{Cl}$, respectively. The group IIA adatoms\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7c76b066edb1f6f53739g-3_1751_2235_160_993}\n\\end{center}\n\nFig. 3 Ratio of adatom adsorption energy $\\left(E_{\\text {ads }}\\right)$ to bulk cohesive energy $\\left(E_{\\text {coh }}\\right)$. Different groups of atoms are shown in different colors: red for alkali (Li, $\\mathrm{Na}, \\mathrm{K}, \\mathrm{Rb}$, Cs), blue for alkaline earth (Be, Mg, $\\mathrm{Ca}, \\mathrm{Sr}$, Ba), magenta for $3 d \\mathrm{TM}$ (Sc, Ti, V, Cr, Mn, Fe, Co, Ni, Cu, Zn), green for 4d TM (Y, Zr, Nb, Mo, Tc, Ru, Rh, Pd, Ag, Cd), black for $5 d$ TM (La, Hf, Ta, W, Re, Os, Ir, Pt, Au, Hg), orange for group IIIA (B, Al, Ga, In, Tl), yellow for group IVA (C, Si, Ge, $\\mathrm{Sn}, \\mathrm{Pb})$, purple for group VA (N, Sb, Bi), and cyan and pink for nonmetals (O, S, F, Cl). (Ca, Sr and Ba) show similar effects on the band structure of pristine monolayer BP by shifting the bottom conduction band down, while leaving the top valence band nearly intact. The group IIA adatoms do not introduce spin polarization, while the electronic structure of the monolayer BP decorated by the other three adatoms, i.e., $\\mathrm{Cs}$, $\\mathrm{La}$, and $\\mathrm{Cl}$, is spin-polarized. For the case of Cs, the change in band structure is mainly on the spinpolarized bottom conduction bands, which are shifted down with respect to that of the pristine monolayer BP. Different from Group IIA adatoms, decoration by Cs also induces a sizable downshift of the top valence band. Among the six elements, La adatom induces the largest reduction of band gap, which is mainly resulted from the downshift of the bottom conduction band. The $\\mathrm{Cl}$ adatom is different from the metal adatoms, which introduces two midgap levels (one spin-up and one spindown). In this case, the band gap of the pristine monolayer BP is even increased because the downshift of top valence band is larger than the bottom conduction band. Overall, the effect induced by the six adatoms on the electronic structure of monolayer BP is sufficiently large so that the CBM has been shifted below the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential.\n\nBilayer BP. The six adatoms that can shift the CBM of monolayer BP below the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$potential can function similarly\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7c76b066edb1f6f53739g-3_1858_2440_1069_1902}\n\\end{center}\n\nFig. 4 Alignment of band edges of pristine and adatom-decorated monolayer BP with the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_7c76b066edb1f6f53739g-4_170_2054_226_1824}\n\nFig. 5 Band structures of adatom-decorated monolayer BPs, where the energy zero was set to be the vacuum level. Spin-up and -down energy bands are shown in red and blue colors, respectively, for the cases of $\\mathrm{Cs}$, La and $\\mathrm{Cl}$. For comparison, the band structure of pristine monolayer $\\mathrm{BP}$ are shown in gray color.\n\nfor thicker BPs. In the following we will only discuss the effect of other adatoms, namely, $\\mathrm{Ni}, \\mathrm{Tl}, \\mathrm{Rb}, \\mathrm{Na}, \\mathrm{K}, \\mathrm{Li}, \\mathrm{O}, \\mathrm{S}$ and $\\mathrm{F}$, on the thicker BPs. In these studies, we still use a $3 \\times 4$ supercell. Fig. 6 shows the valence and conduction band edges of pristine and decorated bilayer BP. The CBM of bilayer BP decorated by all these adatoms are shifted below the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential, except for F. Fig. 7 shows the corresponding band structures for the eight working cases. All these adatoms do not induce spin polarization. Except for the case of $\\mathrm{Rb}$, the effect on shifting the top valence band and bottom conduction band by all the other seven adatoms are similar, i.e., a significant downshift of the\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7c76b066edb1f6f53739g-5_230_801_165_998}\n\\end{center}\n\nFig. 6 Band alignment of pristine and adatom-decorated bilayer BP.\n\ntop valence band and a relatively smaller downshift of the bottom conduction band.\n\nInterestingly, in the case of Li, Na, K, Tl, O, and S, an indirect gap has been induced, as a result of a bump on the top valence band along the $\\Gamma-X$ direction. Similar bump can also be observed in the case of $\\mathrm{Ni}$, but a defect band forms the top valence band covering the bump so that the band gap is still direct. In the case of $\\mathrm{Rb}$, the band structure is significantly different from the other group IA elements, the top valence band is shifted up, resulting in significantly reduced band gap.\n\nTrilayer BP. So far, F is the only case that does not work for either monolayer or bilayer BP. We studied F-decorated trilayer BP. Our results show that F-decoration can shift the CBM of trilayer BP below the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential. Similar to the case of $\\mathrm{Cl}$ on monolayer BP, $\\mathrm{F}$ adatom also introduces two midgap states inside the band gap of pristine trilayer BP and results in spin polarization. From the band structure and DOS in Fig. 8, it\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_7c76b066edb1f6f53739g-5_972_2436_228_1824}\n\nFig. 7 Band structures of adatom-decorated bilayer BPs, where the energy zero was set to be the vacuum level. For comparison, the band structure of pristine bilayer BP are shown in gray color.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_7c76b066edb1f6f53739g-6_162_1190_422_1630}\n\nFig. 8 Band structure (left) and DOS (right) of F-decorated trilayer BP. Spin-up and -down bands are shown in red and blue colors, respectively.\n\ncan be seen that the spin polarization is mainly localized on the $\\mathrm{F}$ atom, i.e., mainly exists in the two defect bands inside the band gap.\n\nDiscussion. The band edge position tuning, especially the shifting of CBM position, as discussed above, is a result of the coupling of the adatom orbitals with the band edge states of pristine few-layer BPs. It is worth of mentioning that band edge tuning is not achieved by simply introducing defect states. From the band structure plots in Fig. 5, 7 and 8, as compared with the band structure of pristine monolayer BP in Fig. 2 , it can be seen that (1) the band edge states is highly dispersive suggesting that they are not simply defect states and (2) the bottom conduction bands show similar dispersion to the pristine cases suggesting that they are originated from the pristine few-layer BP bands. Selected calculations of the effective masses show that the adatoms could preserve the effective masses of pristine fewlayer BPs except several cases where direct-to-indirect transition occurs on the top valence band.\n\n\\section{Summary}\nBased on first-principles DFT calculation, we studied the effect of adatom decoration on shifting the CBM of few-layer BPs, which is potentially able to enhance their stability against oxidization. A screening of most elements across the Periodic Table shows that fifteen adatoms (Li, Na, K, Rb, Cs, Ca, Sr, Ba, $\\mathrm{Ni}, \\mathrm{Tl}, \\mathrm{La}, \\mathrm{O}, \\mathrm{S}, \\mathrm{F}, \\mathrm{Cl}$ ) satisfy the criterion that the decorating atoms do not tend to form clusters. Adsorption of the selected fifteen adatoms shifts the CBM of pristine few-layer BPs significantly downward. Based on our results, all of these adatoms are expected to shift the CBM of trilayer BP to below the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential. Except for $\\mathrm{F}$, all the other 14 adatoms would serve the same purpose for bilayer BP. Due to the relatively large band gap of monolayer BP, only $\\mathrm{Ca}, \\mathrm{Sr}, \\mathrm{Ba}, \\mathrm{Cs}, \\mathrm{La}$ and $\\mathrm{Cl}$ are expected to shift its CBM below the $\\mathrm{O}_{2} / \\mathrm{O}_{2}{ }^{-}$redox potential. Following the previous theoretical and experimental demonstration of the effect of Te on stabilizing few-layer BPs, this study provides a useful guidance if other elements are to be explored by experiment.\n\n\\section{Author contributions}\nH. S. performed the calculations. S. L. and H. S. analyzed the data and wrote the manuscript. S. L., H. S., Y. S., N. W., H. Y. and S. Z. discussed and edited the manuscript.\n\n\\section{Conflicts of interest}\nThe authors declare no competing financial interest.\n\n\\section{Acknowledgements}\nThis work was supported by the National Science Foundation of Jiangsu Province of China (No. BK20151409), the National Basic Research Program of China (No. 2015CB352100), and the National Natural Science Foundation of China (No. 11774052, 61771137, 61370042, 11674053). The authors would like to acknowledge Shanghai Supercomputer Center.\n\n\\section{References}\n1 V. V. Kulish, O. I. Malyi, C. Perssoncd and P. Wu, Adsorption of Metal Adatoms on Single-Layer Phosphorene, J. Phys. Chem. Phys., 2015, 17, 992-1000.\n\n2 K. S. Novoselov, A. K. Geim, S. V. Morozov, D. Jiang, M. I. Katsnelson, I. V. Grigorieva, S. V. Dubonos and A. A. Firsov, Two-Dimensional Gas of Massless Dirac Fermions in Graphene, Nature, 2005, 438, 197-200.\n\n3 Y. Zhang, Y.-W. Tan, H. L. Stormer and P. Kim, Experimental Observation of the Quantum Hall Effect and Berry's Phase in Graphene, Nature, 2005, 438, 201-204.\n\n4 F. Schwierz, Graphene Transistors. Nat, Nanotechnol., 2010, 5, 487-496.\n\n5 Q. H. Wang, K. Kalantar-Zadeh, A. Kis, J. N. Coleman and M. S. Strano, Electronics and Optoelectronics of TwoDimensional Transition Metal Dichalcogenides. Nat, Nanotechnol., 2012, 7, 699-712.\n\n6 S. Z. Butler, S. M. Hollen, L. Cao, Y. Cui, J. A. Gupta, H. R. Gutierrez, T. F. Heinz, S. S. Hong, J. Huang, et al., Progress, Challenges, and Opportunities in TwoDimensional Materials Beyond Graphene, ACS Nano, 2013, 7, 2898-2926.\n\n7 D. Jariwala, V. K. Sangwan, L. J. Lauhon and T. J. Marks, Hersam, M. C. Emerging Device Applications for Semiconducting Two-Dimensional Transition Metal Dichalcogenides, ACS Nano, 2014, 8, 1102-1120.\n\n8 X. Ling, H. Wang, S. Huang, F. Xia and M. S. Dresselhaus, The Renaissance of Black Phosphorus, Proc. Natl. Acad. Sci. U. S. A., 2015, 112, 4523-4530.\n\n9 L. Li, Y. Yu, G. J. Ye, Q. Ge, X. Ou, H. Wu, D. Feng, X. H. Chen and Y. Zhang, Black Phosphorus Field-Effect Transistors. Nat, Nanotechnol., 2014, 9, 372-377.\n\n10 H. Liu, A. T. Neal, Z. Zhu, Z. Luo, X. Xu, D. Tomanek and P. D. Ye, Phosphorene: an Unexplored 2D Semiconductor with a High Hole Mobility, ACS Nano, 2014, 8, 4033-4041.\n\n11 F. Xia, H. Wang and Y. Jia, Rediscovering Black Phosphorus: A Unique Anisotropic 2D Material for Optoelectronics and Electronics, Nat. Commun., 2014, 5, 4458.\n\n12 W. Zhu, M. N. Yogeesh, S. Yang, S. H. Aldave, J.-S. Kim, S. Sonde, L. Tao, N. Lu and D. Akinwande, Flexible Black Phosphorus Ambipolar Transistors, Circuits and AM Demodulator, Nano Lett., 2015, 15, 1883-1890.\n\n13 H. Wang, X. Wang, F. Xia, L. Wang, H. Jiang, Q. Xia, M. L. Chin, M. Dubey and S.-J. Han, Black Phosphorus Radio-Frequency Transistors, Nano Lett., 2014, 14, 64246429.\n\n14 S. Das, M. Demarteau and A. Roelofs, Ambipolar Phosphorene Field Effect Transistor, ACS Nano, 2014, 8, 11730-11738.\n\n15 D. Xiang, C. Han, J. Wu, S. Zhong, Y. Liu, J. Lin, X.-A. Zhang, A. H. Castro Neto, A. T. S. Wee and W. Chen, Surface Transfer Doping Induced Effective Modulation on Ambipolar Characteristics of Few-Layer Black Phosphorus, Nat. Commun., $2015,6,6485$.\n\n16 D. J. Late, Temperature Dependent Phonon Shifts in FewLayer Black Phosphorus, ACS Appl. Mater. Interfaces, 2015, 7, 5857-5862.\n\n17 B. E. Manisha, M. S. Pawar and D. J. Late, Humidity Sensing and Photodetection Behavior of Electrochemically Exfoliated Atomically Thin-Layered Black Phosphorus Nanosheets, ACS Appl. Mater. Interfaces, 2016, 8, 11548-11556.\n\n18 D. J. Late, Liquid exfoliation of black phosphorus nanosheets and its application as humidity sensor, Microporous Mesoporous Mater., 2016, 225, 494-503.\n\n19 S. R. Suryawanshi, M. A. More and D. J. Late, Laser exfoliation of $2 \\mathrm{D}$ black phosphorus nanosheets and their application as a field emitter, $R S C A d v ., 2016,6,112103-$ 112108.\n\n20 S. P. Koenig, R. A. Doganov, H. Schmidt and A. H. Castro Neto, Electric Field Effect in Ultrathin Black Phosphorus, Appl. Phys. Lett., 2014, 104, 103106.\n\n21 A. Ziletti, A. Carvalho, D. K. Campbell, D. F. Coker and N. A. H. Castro, Oxygen Defects in Phosphorene, Phys. Rev. Lett., 2014, 114, 046801.\n\n22 J. Kang, J. D. Wood, S. A. Wells, J.-H. Lee, X. Liu, K.-S. Chen and M. C. Hersam, Solvent Exfoliation of Electronic-Grade, Two-Dimensional Black Phosphorus, ACS Nano, 2015, 9, 3596-3604.\n\n23 G. X. Wang, W. J. Slough, R. Pandey and S. P. Karna, Degradation of Phosphorene in Air: Understanding at Atomic Level, 2D Mater., 2016, 3, 025011.\n\n24 D. Hanlon, C. Backes, E. Doherty, C. S. Cucinotta, N. C. Berner, C. Boland, K. Lee, A. Harvey, P. Lynch, Z. Gholamvand, et al., Liquid Exfoliation of SolventStabilized Few-Layer Black Phosphorus For Applications Beyond Electronics, Nat. Commun., 2015, 6, 8563.\n\n25 Y. Y. Illarionov, M. Waltl, G. Rzepa, T. Knobloch, J. S. Kim, D. Akinwande and T. Grasser, Highly-stable black phosphorus field-effect transistors with low density of oxide traps, NPJ 2 D Mater. Appl., 2017, 1, 23.\n\n26 J. S. Kim, Y. N. Liu, W. N. Zhu, S. Kim, D. Wu, L. Tao, A. Dodabalapur, K. Lai and D. Akinwande, Toward AirStable Multilayer Phosphorene Thin-Films and Transistors, Sci. Rep., 2015, 5, 8989.\n\n27 J. D. Wood, S. A. Wells, D. Jariwala, K. S. Chen, E. Cho, V. K. Sangwan, X. L. Liu, L. J. Lauhon, et al., Effective Passivation of Exfoliated Black Phosphorus Transistors against Ambient Degradation, Nano Lett., 2014, 14, 6964.\n\n28 A. Avsar, I. J. Vera-Marun, J. Y. Tan, K. Watanabe, T. Taniguchi, A. H. C. Neto and B. Ozyilmaz, Air-Stable Transport in Graphene-Contacted, Fully Encapsulated Ultrathin Black Phosphorus-Based Field-Effect Transistors, ACS Nano, 2015, 9, 4138.\n\n29 X. L. Chen, Y. Y. Wu, Z. F. Wu, Y. Han, S. G. Xu, L. Wang, W. G. Ye, T. Y. Han, Y. H. He, Y. Cai and N. Wang, HighQuality Sandwiched Black Phosphorus Heterostructure and its Quantum Oscillations, Nat. Commun., 2015, 6, 7315.\n\n30 R. A. Doganov, E. C. QFarrell, P. Koenig, T. Yeo, A. Ziletti, A. Carvalho, D. K. Campbell, D. F. Coker, K. Watanabe, T. Taniguchi, et al., Transport Properties of Pristine FewLayer Black Phosphorus by Van Der Waals Passivation in an Inert Atmosphere, Nat. Commun., 2015, 6, 6647.\n\n31 Y. Zhao, H. Wang, H. Huang, Q. Xiao, Y. Xu, Z. Guo, H. Xie, J. Shao, Z. Sun, W. Han, et al., Surface Coordination of Black Phosphorus for Robust Air and Water Stability, Angew. Chem., 2016, 55, 5003-5007.\n\n32 C. R. Ryder, J. D. Wood, S. A. Wells, Y. Yang, D. Jariwala, T. J. Marks, G. C. Schatz and M. C. Hersam, Covalent Functionalization and Passivation of Exfoliated Black Phosphorus via Aryl Diazonium Chemistry, Nat. Chem., 2016, 8, 597.\n\n33 B. C. Yang, B. S. Wan, Q. H. Zhou, Y. Wang, W. T. Hu, W. M. Lv, Q. Chen, Z. M. Zeng, F. S. Wen, J. Y. Xiang, et al., Te-Doped Black Phosphorus Field-Effect Transistors, Adv. Mater., 2016, 28, 9408-9415.\n\n34 G. Kresse and J. Furth, Efficiency of Ab-Initio Total Energy Calculations for Metals and Semiconductors Using a PlaneWave Basis Set, Comput. Mater. Sci., 1996, 6, 15-50.\n\n35 J. P. Perdew, K. Burke and M. Ernzerhof, Generalized Gradient Approximation Made Simple, Phys. Rev. Lett., 1996, 77, 3865-3868.\n\n36 J. Klimes, D. R. Bowler and A. Michaelides, Van Der Waals Density Functionals Applied to Solids, Phys. Rev. B, 2011, 83, 195131.\n\n37 J. Klimes, D. R. Bowler and A. Michaelides, Chemical Accuracy for the Van Der Waals Density Functional, $J$. Phys.: Condens. Matter, 2010, 22, 022201.\n\n38 A. Favron, E. Gaufres, F. Fossard, A. L. Phaneuf-Lqheureux, N. Y. Tang, W. P. L. Levesque, A. Loiseau, R. Leonelli, S. Francoeur and R. Martel, Photooxidation and Quantum Confinement Effects in Exfoliated Black Phosphorus, Nat. Mater., 2015, 14, 826.\n\n39 Q. H. Zhou, Q. Chen, Y. L. Tong and J. L. Wang, LightInduced Ambient Degradation of Few-Layer Black Phosphorus: Mechanism and Protection, Angew. Chem., $2016,55,11437-11441$.\n\n40 L. L. Pierre, S. S. Sabri, C. M. Aguirre, J. Guillemette, M. Siaj, P. Desjardins, T. Szkopek and R. Martel, Probing Charge Transfer at Surfaces Using Graphene Transistors, Nano Lett., 2011, 11(1), 132.\n\n41 K. M. Ervin, I. Anusiewicz, P. Skurski, J. Simons and W. C. Lineberger, The Only Stable State of $\\mathrm{O}_{2}$-Is the $\\mathrm{X} 2 \\Pi \\mathrm{g}$ Ground State and It (Still!) Has an Adiabatic Electron Detachment Energy of $0.45 \\mathrm{eV}, J$. Phys. Chem. A, 2003, 107, 8521-8529.\n\n42 A. Favron, E. Gaufres, F. Fossard, A. L. Phaneuf-LQHeureux, N. Y. W. Tang, P. L. Levesque, A. Loiseau, R. Leonelli, S. Francoeur and R. Martel, Exfoliating black phosphorus down to the monolayer: photo-induced oxidation and electronic confinement effects, Nat. Mater., 2015, 14, 826.\n\n43 H. Liu, A. T. Neal, Z. Zhu, Z. Luo, X. Xu, D. Tománek and P. D. Ye, Phosphorene: an Unexplored 2D Semiconductor With a High Hole Mobility, ACS Nano, 2014, 8, 4033.\n\n44 T. Hu and J. S. Hong, First-Principles Study of Metal Adatom Adsorption on Black Phosphorene, J. Phys. Chem. C, 2015, 119, 8199-8207.\n\n45 X. Liu, C. Z. Wang, M. Hupalo, W. C. Lu, M. C. Tringides, Y. X. Yao and K. M. Ho, Metals on Graphene: Correlation between Adatom Adsorption Behavior and Growth Morphology, Phys. Chem. Chem. Phys., 2012, 14(25), 9157.\n\n46 C. Kittel, Introduction to Solid State Physics, Wiley, Hoboken, NJ, 8th edn, 2005.\n\n\n\\end{document}", "record_id": "2023_09_22_7c76b066edb1f6f53739g"}