{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{molecules }\n\n\n\\author{Kai Zhang, Peng Zhang * (I), Ze-Ren Wang, Xu-Liang Zhu, Ying-Bo Lu, Cheng-Bo Guan\\\\\nand Yanhui Li}\n\\date{}\n\n\n\\begin{document}\n\\maketitle\n\\section{Article \n DFT Simulations of the Vibrational Spectrum and Hydrogen Bonds of Ice XIV}\nSchool of Space Science and Physics, Shandong University, Weihai 264209, China; \\href{mailto:17862711589@163.com}{17862711589@163.com} (K.Z.); \\href{mailto:wangzeren96@163.com}{wangzeren96@163.com} (Z.-R.W.); \\href{mailto:zhuxuliang@outlook.com}{zhuxuliang@outlook.com} (X.-L.Z.); \\href{mailto:lyb@sdu.edu.cn}{lyb@sdu.edu.cn} (Y.-B.L.); \\href{mailto:guancb@sdu.edu.cn}{guancb@sdu.edu.cn} (C.-B.G.); \\href{mailto:yhuili@sdu.edu.cn}{yhuili@sdu.edu.cn} (Y.L.)\n\n\\begin{itemize}\n  \\item Correspondence: \\href{mailto:zhangpeng@sdu.edu.cn}{zhangpeng@sdu.edu.cn}; Tel.: +86-631-568-8751\n\\end{itemize}\n\nAcademic Editor: Margarida Castell Escuer\n\nReceived: 25 June 2018; Accepted: 18 July 2018; Published: 19 July 2018\n\ncheck for updates\n\n\\begin{abstract}\nIt is always a difficult task to assign the peaks recorded from a vibrational spectrum. Herein, we explored a new pathway of density functional theory (DFT) simulation to present three kinds of spectra of ice XIV that can be referenced as inelastic neutron scattering (INS), infrared (IR), and Raman experimental spectrum. The INS spectrum is proportional to the phonon density of states (PDOS) while the photon scattering signals reflect the normal vibration frequencies near the Brillouin zone (BZ) center. Based on good agreements with the experimental data, we identified the relative frequency and made scientific assignments through normal vibration modes analysis. The two hydrogen bond (H-bond) peaks among the ice phases from INS were discussed and the dynamic process of the $\\mathrm{H}$-bond vibrations was found to be classified into two basic modes. We deduced that two $\\mathrm{H}$-bond modes are a general rule among the ice family and more studies are ongoing to investigate this subject.\n\\end{abstract}\n\nKeywords: ice XIV; vibrational spectrum; hydrogen bond; CASTEP; first-principles; DFT\n\n\\section{Introduction}\nWater is not only an essential resource for the survival of all life, but also the most important part of living organisms. The solid state of water, ice, has been discovered in more than 19 different crystal phases and amorphous structures under certain pressure and temperature [1-11]. Usually, they are paired of hydrogen-ordered and hydrogen-disordered and can transform each other at a specific ambient condition. To facilitate the study of the normal vibration modes of ice, a hydrogen-ordered structure is beneficial to calculation and present the main physical features due to its simple primitive cell [12].\n\nIn 1998, Lobban et al. first reported the identification of a new ice phase named ice XII that crystallized at $260 \\mathrm{~K}$ and $0.55 \\mathrm{GPa}$ [7]. In 2006, Salzmann et al. found that ice XII doped with $\\mathrm{HCl}$ transformed into a new hydrogen-ordered phase upon cooling under pressure, which was called ice XIV with space group $P 2_{1} 2_{1} 2_{1}$ symmetry $[8,13]$. Since then, the Raman spectrum and inelastic neutron scattering of ice XIV/XII have been reported. Using the Raman spectrum, Salzmann et al. demonstrated the reversibility of the hydrogen order to disorder phase transition [14]. It also indicated that the new phase reported by Chou et al. [15] is in fact ice XII [16]. Yoshimura et al. measured in situ Raman spectrum of ice XII transformed from high density amorphous (HDA) to improve the understanding of the stability limits of ice XII [17]. Koza et al. studied the formation of ice XII under different conditions with a combined elastic and inelastic neutron scattering technique [18]. Later, Koza and coworkers presented the vibrational spectrum and identified the characteristic features compared with ice Ic [19]. Despite the many references presenting experimental vibrational spectra of ice XIV/XII, a theoretical method to assign the peaks was still lacking in reports until now. Herein, we calculated the most stable XIV structure using the first-principles density functional theory (DFT) to manifest the vibrational spectrum assisted by normal vibrational modes analysis.\n\n\\section{Computational Methodology}\nBased on the DFT method of quantum mechanics, the CASTEP [20] code was used to perform geometric optimization and phonons calculation on the structure of ice XIV with the exchange-correlation (XC) function of generalized gradient approximation (GGA) RPBE [21]. It was reported by Brandenburg et al. that the geometric optimization of ice phases with PBE is better than that of RPBE [22], which was consistent with our test. However, the comparison between phonons calculation of PBE and experiment was very poor, far worse than the result of RPBE. Furthermore, the simulated vibration modes are constant regardless of the XC function. Thus, we preferred XC function of RPBE for this work.\n\nThe order of magnitude of energy and self-consistent field (SCF) tolerance were set as $1 \\times 10^{-9}$ for energy calculation. The energy cutoff was $750 \\mathrm{eV}$, and the $\\mathrm{K}$-point grid was $2 \\times 2 \\times 3$ in the reduced Brillouin zone (BZ). The norm-conserving pseudopotentials were used to calculate the PDOS and polarizability. The environmental pressure was set as $0.55 \\mathrm{GPa}$. The phonons were calculated including LO-TO splitting. In addition, the option of Raman intensities was selected for the IR, Raman spectra calculation.\n\n\\section{Results and Discussion}\nThe computational spectra of Raman, IR, and PDOS are ranked in Figure 1 by four separate bands. As the spectrum intensities of Raman and IR have quite a large scale, the relative proportions of two spectra in each band were adjusted for comparisons. The PDOS spectrum as well as normal vibration frequencies were calculated after precise geometry optimization. In theory, the spectrum by inelastic neutron scattering (INS), is proportional to PDOS, whilst the photon scattering can only collect signals near the BZ center. Table 1 presents the comparisons of the PDOS against neutron scattering, and the normal vibration frequencies against Raman scattering. Since ice XIV is a hydrogen-ordered phase of ice XII, the spectrum of XIV showed more pronounced features than XII. Both of the Raman spectra of ice XIV and XII could then be used for peaks assignment. There are 12 molecules in a primitive cell of ice XIV. Thus, the number of optic normal modes was $12 \\times 3 \\times 3-3=105$. Each band of the spectrum is discussed in detail as follows.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_22c19cfc32d2575f9a52g-03_300_1750_426_1648}\n\nFigure 1. The simulated spectrum of ice XIV. The four images correspond to four vibration bands: translation, libration, bending, and stretching. Each image from top to bottom is Raman, IR, and the PDOS spectrum, respectively. Weak peaks were amplified reasonably.\n\nTable 1. Comparison of calculated results with Raman and INS data. The main peaks of PDOS in the first column are compared against INS spectrum. The frequencies of 105 normal vibration modes with Raman intensities are compared against the experimental Raman peaks.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_22c19cfc32d2575f9a52g-03_2117_2657_320_1742}\n\\end{center}\n\nTable 1. Cont.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_22c19cfc32d2575f9a52g-04_369_2641_311_1745}\n\\end{center}\n\nTable 1. Cont.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_22c19cfc32d2575f9a52g-05_368_1893_310_1746}\n\\end{center}\n\nThe stretching band is the region of $\\mathrm{O}-\\mathrm{H}$ covalent bond stretching. There are 24 normal vibration modes and the frequencies of mode range from $3234 \\mathrm{~cm}^{-1}$ to $3478 \\mathrm{~cm}^{-1}$. Each molecule has two kinds of vibration: symmetric stretching and asymmetric stretching. As shown in Figure 2, there are two molecular vibration images corresponding to the minimum and maximum vibration frequencies, respectively. This is a top view and the green arrows represent the vibration direction in sizes proportional to the vibration amplitude. For the minimum mode at $3234 \\mathrm{~cm}^{-1}$, four molecules presented symmetric stretching vibration; two examples are illustrated in gold. It has been found for ice XV that some modes include the isolated vibration of only one $\\mathrm{O}-\\mathrm{H}$ bond while the other one does not vibrate [23]. This was a similar case in ice XIV such as the mode at $3234 \\mathrm{~cm}^{-1}$ illustrated in Figure 1. We attributed this exotic phenomenon to geometry deformation of the local tetrahedron structure under pressure. Almost all molecules showed asymmetric stretching at $3478 \\mathrm{~cm}^{-1}$, which was consistent with the literature where energy increases from symmetric stretching to asymmetric stretching. To maintain a static center of mass, the vibrations of the molecule are correlated in a primitive cell. An obvious phenomenon was that the Raman and IR spectrum were more sensitive to symmetric stretching. From the spectrum of Figure 1, one can see several distinct peaks in the symmetric stretching region due to the restrictions of selection rules.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_22c19cfc32d2575f9a52g-06_306_1596_334_1739}\n\\end{center}\n\nFigure 2. A top view of four normal vibration modes in the stretching band $\\left(3234 \\mathrm{~cm}^{-1}, 3478 \\mathrm{~cm}^{-1}\\right)$ and bending band $\\left(1647 \\mathrm{~cm}^{-1}, 1705 \\mathrm{~cm}^{-1}\\right)$, respectively. Typical vibrations are represented in gold. The green arrows represent the vibration direction in sizes proportional to the vibration amplitude.\n\nSalzmann et al. recorded the Raman spectrum of recovered hydrogen-ordered ice XIV and identified the vibration modes by the deuterated method [14]. By comparison, they detected six Raman peaks at $3214 \\mathrm{~cm}^{-1}, 3317 \\mathrm{~cm}^{-1}, 3326 \\mathrm{~cm}^{-1}, 3346 \\mathrm{~cm}^{-1}, 3368 \\mathrm{~cm}^{-1}$, and $\\sim 3407 \\mathrm{~cm}^{-1}$, which had good agreement with this study at $3234 \\mathrm{~cm}^{-1}, 3269 \\mathrm{~cm}^{-1}, 3343 \\mathrm{~cm}^{-1}, 3375 \\mathrm{~cm}^{-1}, 3395 \\mathrm{~cm}^{-1}$, and $3451 \\mathrm{~cm}^{-1}$ (Table 1). They reported that the peak at $2480 \\mathrm{~cm}^{-1}$ of $\\mathrm{D}_{2} \\mathrm{O}$ was not observed at $2480 \\times 1.35=3348 \\mathrm{~cm}^{-1}$ in $\\mathrm{H}_{2} \\mathrm{O}$ of ice XIV. According to Figure 1, we found that the peak should be at $3377 \\mathrm{~cm}^{-1}$ (normal mode). Salzmann et al. also performed a Raman spectrum of ice XII [16], where peaks at $3209 \\mathrm{~cm}^{-1}, 3310 \\mathrm{~cm}^{-1}, 3340 \\mathrm{~cm}^{-1}$, and $3415 \\mathrm{~cm}^{-1}$ were consistent with normal mode at $3234 \\mathrm{~cm}^{-1}, 3269 \\mathrm{~cm}^{-1}, 3375 \\mathrm{~cm}^{-1}, 3451 \\mathrm{~cm}^{-1}$, respectively.\n\nIn the intramolecular bending vibration band, there were 12 normal vibration modes ranging from $1647 \\mathrm{~cm}^{-1}$ to $1735 \\mathrm{~cm}^{-1}$. Considering a collective vibration, all the bending modes can be classified as in-phase and out-of-phase vibrations. Figure 2 shows two bending vibration images at frequencies of $1647 \\mathrm{~cm}^{-1}$ and $1705 \\mathrm{~cm}^{-1}$. The molecules in gold at $1647 \\mathrm{~cm}^{-1}$ showed a pair of out-of-phase modes. According to our previous work, we found that the energy increasing trend was from in-phase bending to out-of-phase bending. However, for the case of ice XIV, the lowest mode at $1647 \\mathrm{~cm}^{-1}$ showed four pairs of out-of-phase vibrations. The vibration mode at $1705 \\mathrm{~cm}^{-1}$ showed the in-phase vibrating of all molecules. Although the simulated Raman and IR spectrum both contained a peak at $1663 \\mathrm{~cm}^{-1}$, the intensity was too weak to be detected in IR. As for the intermolecular librational band, there were 36 normal modes and the frequencies ranged from $502 \\mathrm{~cm}^{-1}$ to $933 \\mathrm{~cm}^{-1}$. In this region, all the molecular vibration modes could be classified into three types: rocking, twisting, and wagging. A rocking mode is oscillating in plane while a wagging is oscillating perpendicular to the molecular plane. A twisting mode is a rotation around the bisector of angle. For the mode at $656 \\mathrm{~cm}^{-1}$ in Figure 3 , the highlighted molecule showed wagging vibration while the $695 \\mathrm{~cm}^{-1}$ mode presented combinations of rocking and twisting. Interestingly, we found that all molecules were rocking at $523 \\mathrm{~cm}^{-1}$ and all molecules were wagging at $933 \\mathrm{~cm}^{-1}$, which meant that the energy of rocking was lower than wagging. From the simulated Raman spectrum, we could only see four weak peaks and the IR spectrum had three sharp peaks at $671 \\mathrm{~cm}^{-1}, 701 \\mathrm{~cm}^{-1}$, and $890 \\mathrm{~cm}^{-1}$, which were combinations of the three vibration types.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_22c19cfc32d2575f9a52g-07_812_2100_334_1733}\n\\end{center}\n\nFigure 3. A top view of the four normal vibration modes in the libration band $\\left(656 \\mathrm{~cm}^{-1}, 695 \\mathrm{~cm}^{-1}\\right)$ and translation band $\\left(194 \\mathrm{~cm}^{-1}, 291 \\mathrm{~cm}^{-1}\\right)$, respectively. For the dynamic process of weak and strong H-bond, please see the Supplementary Videos S1 and S2 (194.mp4 and 292.mp4).\n\nCompared with the experimental data, six vibration peaks $\\left(462 \\mathrm{~cm}^{-1}, 488 \\mathrm{~cm}^{-1}, 527 \\mathrm{~cm}^{-1}\\right.$, $562 \\mathrm{~cm}^{-1}, 790 \\mathrm{~cm}^{-1}$, and $867 \\mathrm{~cm}^{-1}$ ) from Raman scattering [14] were in agreement with normal mode calculations $\\left(518 \\mathrm{~cm}^{-1}, 524 \\mathrm{~cm}^{-1}, 583 \\mathrm{~cm}^{-1}, 585 \\mathrm{~cm}^{-1}, 798 \\mathrm{~cm}^{-1}\\right.$, and $\\left.891 \\mathrm{~cm}^{-1}\\right)$. However, a peak recorded at $413 \\mathrm{~cm}^{-1}$ could not be assigned from the simulations. We suspected that this was a false peak according to the DFT simulations. The peak at $490 \\mathrm{~cm}^{-1}$ (Reference [15]) $/ 470 \\mathrm{~cm}^{-1}$ (Reference [16]) should be the frequency at $518 \\mathrm{~cm}^{-1}$ (normal mode in Table 1). As for the INS spectrum, we could roughly match the peaks of $464 \\mathrm{~cm}^{-1}, \\sim 560 \\mathrm{~cm}^{-1}, \\sim 632 \\mathrm{~cm}^{-1}, \\sim 760 \\mathrm{~cm}^{-1}$, $\\sim 904 \\mathrm{~cm}^{-1}$ (Reference [18]) to $504 \\mathrm{~cm}^{-1}, 563 \\mathrm{~cm}^{-1}, 639 \\mathrm{~cm}^{-1}, 757 \\mathrm{~cm}^{-1}$, and $903 \\mathrm{~cm}^{-1}$ (PDOS).\n\nIn the intermolecular translational band, there were 33 normal vibration modes ranging from $62 \\mathrm{~cm}^{-1}$ to $292 \\mathrm{~cm}^{-1}$. For one molecule, there existed three vibration modes: stretching, wagging, and rocking. Note that, rocking in the translational band is a monolithic movement while rocking in the librational band is only hydrogen vibration within one molecule. To date, the physical mechanism of the H-bond interaction is still in question [23-26]. Li et al. proposed a two-strength model based on electrostatic interactions to explain the two main peaks from the INS spectrum [27,28]. The model has not been widely accepted so is still a controversial topic [29-32]. He et al. disagreed with this model and asserted that these two peaks originated from the different directionalities of motion manifested in the distinct polarizations of the absorbed photons [32]. In our previous study, we found that the two $\\mathrm{H}$-bond peaks in the hydrogen-ordered ice Ic originated from two different $\\mathrm{H}$-bond vibration modes. There are four $\\mathrm{H}$-bonds linked with one molecule to form a tetrahedral structure in ice crystals. For ice Ic, there are two kinds of vibration modes for one molecule: two $\\mathrm{H}$-bonds vibrating mode and four $\\mathrm{H}$-bonds vibrating mode with a strength ratio of $\\sqrt{2}$ [33]. These two types of modes were also observed in the ice XIV crystal lattice. In the translational band of Figure 1, the peak of maximum strength observed at $288 \\mathrm{~cm}^{-1}$ was very distinct. Phonons at above $\\sim 200 \\mathrm{~cm}^{-1}$ were the main four $\\mathrm{H}$-bond vibrations analyzed by normal vibration modes. The example of the strong mode at $292 \\mathrm{~cm}^{-1}$ in Figure 3 shows that molecules were stretched along its angle bisector. This is a typical four $\\mathrm{H}$-bonds vibration mode where four linked $\\mathrm{H}$-bond are oscillating together. The two $\\mathrm{H}$-bonds mode means that one molecule vibrates towards two connected neighbors where there are two effective H-bonds oscillating for this mode. Subject to the local tetrahedral structure, the collective vibrations are combinations of wagging and rocking as illustrated in Figure 3 of the weak mode at $194 \\mathrm{~cm}^{-1}$. To show the dynamic process of these two modes, please see the videos from the Supplementary Files. For ice XIV, the local structure could not maintain a regular tetrahedron due to lattice deformation under pressure. Thus, deviation strength ratios from $\\sqrt{2}$ were reasonable. From Figure 1 , it can be seen that there were two main peaks at $166 \\mathrm{~cm}^{-1}$ and $199 \\mathrm{~cm}^{-1}$. Phonons around this region were mainly two H-bond modes. Other vibration modes were associated with cluster vibration or skeleton deformation below $166 \\mathrm{~cm}^{-1}$. These optic phonons were merged with acoustic phonons.\n\nIn the simulated Raman spectrum of Figure 1, there was a small peak at $176 \\mathrm{~cm}^{-1}$, which should correspond to experimental observations at 192/195/214 $\\mathrm{cm}^{-1}$ [14-16]. The red-shift was mainly due to the RPBE function underestimating for the $\\mathrm{H}$-bond [13]. As for the INS spectrum, Koza et al. mentioned several peaks in the far-IR region such as $7 \\mathrm{meV}, 10 \\mathrm{meV}, 12 \\mathrm{meV}$, and $24 \\mathrm{meV}$ $\\left(56 \\mathrm{~cm}^{-1}, 80 \\mathrm{~cm}^{-1}, 96 \\mathrm{~cm}^{-1}\\right.$, and $\\left.192 \\mathrm{~cm}^{-1}\\right)$ [18] and could be matched with $53 \\mathrm{~cm}^{-1}, 75 \\mathrm{~cm}^{-1}$, $88 \\mathrm{~cm}^{-1}$, and $188 \\mathrm{~cm}^{-1}$ (PDOS in Table 1). Two distinct peaks at $26 \\mathrm{meV}$ and $36 \\mathrm{meV}\\left(208 \\mathrm{~cm}^{-1}\\right.$ and $288 \\mathrm{~cm}^{-1}$ ) [19] were in agreement with $204 \\mathrm{~cm}^{-1}$ and $288 \\mathrm{~cm}^{-1}$ (PDOS).\n\n\\section{Conclusions}\nIn summary, using the first-principles DFT method, we presented the Raman scattering, IR absorption, and the INS spectrum (PDOS) of ice XIV, theoretically. The PDOS spectrum was used to assign the characteristic peaks in the INS spectrum as the INS collects signals throughout the whole BZ without selection so that the simulated PDOS spectrum is proportional to the INS. The 105 optic normal vibration modes in the BZ center could be compared with the Raman and IR spectra. Under this condition, the peaks recorded from photon scattering could be assigned according to normal vibration mode individually.\n\nThe most valuable result was the identification of two types of $\\mathrm{H}$-bond vibration modes. The thermodynamic nature of the $\\mathrm{H}$-bond is a fascinating, but still ambiguous topic. Subject to molecular conformation, there are two types of O-H stretching modes, i.e., symmetry and asymmetry stretching and one bending mode in the intramolecular vibrational region. In the librational band, the vibration mode for a molecule is one of rocking, wagging, and twisting. As for the translational band, it is hard to analyze the H-bond vibration due to the complexity of lattice collective motion. Inspired by previous study on ice Ic, we found that there were also two basic $\\mathrm{H}$-bond vibration modes for one molecule in ice XIV. Deviations mainly resulted from structural deformation of the local regular tetrahedron under pressure. Considering the local structure symmetry, we deduced that two H-bond modes were a general rule among the ice family and more studies are ongoing to investigate this subject.\n\nSupplementary Materials: The following are available online, Video S1: Dynamic process of $\\mathrm{H}$-bond vibration at $292 \\mathrm{~cm}^{-1}$. Video S2: Dynamic process of $\\mathrm{H}$-bond vibration at $194 \\mathrm{~cm}^{-1}$.\n\nAuthor Contributions: K.Z. performed the simulations and drafted the manuscript. P.Z. conducted the simulations, data analysis, and edited the manuscript. Z.-R.W. and X.-L.Z. assisted with the structure modeling and data processing. Y.-B.L., C.-B.G., and Y.L. participated in the results discussion. All authors gave final approval for publication.\n\nFunding: This research was funded by the National Natural Science Foundation of China Grant Number 11504202.\n\nAcknowledgments: The numerical calculations were done using the supercomputing system at the Supercomputing Center, Shandong University, Weihai.\n\n\\section{References}\n\\begin{enumerate}\n  \\item Bertie, J.E.; Whalley, E. Optical Spectra of Orientationally Disordered Crystals. II. Infrared Spectrum of Ice Ih and Ice Ic from 360 to $50 \\mathrm{~cm}^{-1}$. J. Chem. Phys. 1967, 46, 1271-1284. [CrossRef]\n\n  \\item Bertie, J.E.; Calvert, L.D.; Whalley, E. Transformations of Ice II, Ice III, and Ice V at Atmospheric Pressure. J. Chem. Phys. 1963, 38, 840-846. [CrossRef]\n\n  \\item Kuhs, W.F.; Finney, J.L.; Vettier, C.; Bliss, D.V. Structure and hydrogen ordering in ices VI, VII, and VIII by neutron powder diffraction. J. Chem. Phys. 1984, 81, 3612-3623. [CrossRef]\n\n  \\item Whalley, E.; Heath, J.B.R.; Davidson, D.W. Ice IX: An Antiferroelectric Phase Related to Ice III. J. Chem. Phys. $1968,48,2362-2370$. [CrossRef]\n\n  \\item Tajima, Y.; Matsuo, T.; Suga, H. Phase transition in KOH-doped hexagonal ice. Nature 1982, $299,810-812$. [CrossRef]\n\n  \\item Hirsch, K.R.; Holzapfel, W.B. Effect of high pressure on the Raman spectra of ice VIII and evidence for ice X. J. Chem. Phys. 1986, 84, 2771-2775. [CrossRef]\n\n  \\item Lobban, C.; Finney, J.L.; Kuhs, W.F. The structure of a new phase of ice. Nature 1998, 391, 268-270. [CrossRef]\n\n  \\item Salzmann, C.G.; Radaelli, P.G.; Mayer, A.E.; Finney, J.L. The Preparation and Structures of Hydrogen Ordered Phases of Ice. Science 2006, 311, 1758-1761. [CrossRef] [PubMed]\n\n  \\item Salzmann, C.G.; Radaelli, P.G.; Mayer, E.; Finney, J.L. Ice XV: A new thermodynamically stable phase of ice. Phys. Rev. Lett. 2009, 103, 105701. [CrossRef] [PubMed]\n\n  \\item Falenty, A.; Hansen, T.C.; Kuhs, W.F. Formation and properties of ice XVI obtained by emptying a type sII clathrate hydrate. Nature 2014, 516, 213-233. [CrossRef] [PubMed]\n\n  \\item Del Rosso, L.; Celli, M.; Ulivi, L. New porous water ice metastable at atmospheric pressure obtained by emptying a hydrogen-filled ice. Nat. Commun. 2016, 7, 13394-13400. [CrossRef] [PubMed]\n\n  \\item Zhang, P.; Wang, Z.; Lu, Y.B.; Ding, Z.W. The normal modes of lattice vibrations of ice XI. Sci. Rep. 2016, 6, 29273-29281. [CrossRef] [PubMed]\n\n  \\item Tribello, G.A.; Slater, B.; Salzmann, C.G. A Blind Structure Prediction of Ice XIV. J. Am. Chem. Soc. 2006, 128, 12594-12595. [CrossRef] [PubMed]\n\n  \\item Salzmann, C.G.; Hallbrucker, A.; Finney, J.L.; Mayer, E. Raman spectroscopic features of hydrogen-ordering in ice XII. Chem. Phys. Lett. 2006, 429, 469-473. [CrossRef]\n\n  \\item Chou, I.-M.; Blank, J.G.; Goncharov, A.F.; Mao, H.-K.; Hemley, R.J. In Situ Observations of a High-Pressure Phase of $\\mathrm{H}_{2} \\mathrm{O}$ Ice. Science 1998, 281, 809-812. [CrossRef] [PubMed]\n\n  \\item Salzmann, C.G.; Kohl, I.; Loerting, T.; Mayer, E.; Hallbrucker, A. The Raman Spectrum of Ice XII and Its Relation to that of a New \"High-Pressure Phase of $\\mathrm{H}_{2} \\mathrm{O}$ Ice\". J. Phys. Chem. B 2002, 106, 1-6. [CrossRef]\n\n  \\item Yoshimura, Y.; Stewart, S.T.; Mao, H.-K.; Hemley, R.J. In situ Raman spectroscopy of low-temperature/ high-pressure transformations of $\\mathrm{H}_{2} \\mathrm{O}$. J. Chem. Phys. 2007, 126, 174505. [CrossRef] [PubMed] 18. Koza, M.M.; Schober, H.; Tölle, A.; Fujara, F.; Hansen, T. Formation of ice XII at different conditions. Nature 1999, 397, 660-661. [CrossRef]\n\n  \\item Koza, M.M.; Schober, H.; Parker, S.F.; Peters, J. Vibrational dynamics and phonon dispersion of polycrystalline ice XII and of high-density amorphous ice. Phys. Rev. B 2008, 77, 104306. [CrossRef]\n\n  \\item Clark, S.J.; Segall, M.D.; Pickard, C.J.; Hasnip, P.J.; Probert, M.I.J.; Refson, K.; Payne, M.C. First principles methods using CASTEP. Z. Kristallogr.-Cryst. Mater. 2005, 220, 567-570. [CrossRef]\n\n  \\item Hammer, B.; Hansen, L.B.; Norskov, J.K. Improved adsorption energetics within density-functional theory using revised Perdew-Burke-Ernzerhof functionals. Phys. Rev. B 1999, 59, 7413-7421. [CrossRef]\n\n  \\item Brandenburg, J.G.; Maas, T.; Grimme, S. Benchmarking DFT and Semiempirical Methods on Structures and Lattice Energies for Ten Ice Polymorphs. J. Chem. Phys. 2015, 142, 124104. [CrossRef] [PubMed]\n\n  \\item Whale, T.F.; Clark, S.J.; Finney, J.L.; Salzmann, C.G. DFT-assisted interpretation of the Raman spectra of hydrogen-ordered ice XV. J. Raman Spectrosc. 2013, 44, 290-298. [CrossRef]\n\n  \\item Klug, D.D.; Whalley, E. Origin of the High-Frequency Translational Bands of Ice I. J. Glaciol. 1978, $21,55-63$. [CrossRef]\n\n  \\item Marchi, M.; Tse, J.S.; Klein, M.L. Lattice vibrations and infrared absorption of ice Ih. J. Chem. Phys. 1986, 85, 2414-2418. [CrossRef]\n\n  \\item Tse, J.S.; Klug, D.D. Comments on \"Further evidence for the existence of two kinds of H-bonds in ice Ih\" by Li et al. Phys. Lett. A 1995, 198, 464-466. [CrossRef]\n\n  \\item Li, J.C.; Ross, D.K. Evidence for two kinds of hydrogen bond in ice. Nature 1993, 365, 327-329. [CrossRef]\n\n  \\item Li, J.C. Inelastic neutron scattering studies of hydrogen bonding in ices. J. Chem. Phys. 1996, 105, $6733-6755$. [CrossRef]\n\n  \\item Klotz, S.; Strassle, T.; Salzmann, C.G.; Philippe, J.; Parker, S.F. Incoherent inelastic neutron scattering measurements on ice VII: Are there two kinds of hydrogen bonds in ice? Europhys. Lett. 2005, 72, 576-582. [CrossRef]\n\n  \\item Zhang, P.; Tian, L.; Zhang, Z.P.; Shao, G.; Li, J.C. Investigation of the hydrogen bonding in ice Ih by first-principles density function methods. J. Chem. Phys. 2012, 137, 044504. [CrossRef] [PubMed]\n\n  \\item Zhang, P.; Han, S.H.; Yu, H.; Liu, Y. A calculating proof on hydrogen bonding in ordinary ice by the first-principles density functional theory. RSC Adv. 2013, 3, 6646-6649. [CrossRef]\n\n  \\item He, X.; Sode, O.; Xantheas, S.S.; Hirata, S. Second-order many-body perturbation study of ice Ih. J. Chem. Phys. 2012, 11, 204505. [CrossRef] [PubMed]\n\n  \\item Yuan, Z.Y.; Zhang, P.; Yao, S.K.; Lu, Y.B.; Yang, H.Z.; Luo, H.W.; Zhao, Z.J. Computational assignments of lattice vibrations of ice Ic. RSC Adv. 2017, 7, 36801-36806. [CrossRef]\n\n\\end{enumerate}\n\nSample Availability: Samples of the compounds are not available from the authors.\n\n(C) 2018 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (http:/ / \\href{http://creativecommons.org/licenses/by/4.0/}{creativecommons.org/licenses/by/4.0/}).\n\n\n\\end{document}", "record_id": "2023_09_22_22c19cfc32d2575f9a52g"}