{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{PAPER }\n\n\n\\author{Joohwi Lee, iD * Nobuko Ohba (iD) and Ryoji Asahi}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nView Article Online\n\nView Journal | View Issue\n\nCheck for updates\n\nCite this: RSC Adv., 2018, 8, 25534\n\n\\section{Discovery of zirconium dioxides for the design of better oxygen-ion conductors using efficient algorithms beyond data mining $\\dot{\\dagger}$}\nIt is important to find crystal structures with low formation $\\left(E_{\\mathrm{v}}\\right)$ and migration-barrier $\\left(E_{\\mathrm{m}}\\right)$ energies for oxygen vacancies for the development of fast oxygen-ion conductors. To identify crystal structures with lower $E_{v}$ and $E_{m}$ than those of ground-state $\\mathrm{ZrO}_{2}$, we first reoptimize the crystal structures of various oxides reported in the database, and then directly construct them using an evolutionary algorithm. For efficient searching, we employ the linearized ridge regression model for $E_{v}$ using descriptors obtained from density functional theory calculations of the unit cells and apply the predicted $E_{\\mathrm{v}}$ as a fitness value in the evolutionary algorithm. We also find a correlation between the $E_{\\mathrm{v}}$ and $E_{\\mathrm{m}}$ for the crystal structures of $\\mathrm{ZrO}_{2}$. On the basis of this correlation, we confirm that the newly constructed crystal structures, as well as certain reoptimized structures from the database, that possess low $E_{\\mathrm{v}}$ also have $E_{\\mathrm{m}}$ lower than that of ground-state $\\mathrm{ZrO}_{2}$. Our successful strategy consisting of a combination of the evolutionary algorithm, first-principles calculations, and machine-learning techniques may be applicable to other oxide systems in finding crystal structures with low $E_{\\mathrm{v}}$ and $E_{\\mathrm{m}}$. Received 6th April 2018\n\nAccepted 29th June 2018\n\nDOI: $10.1039 / c 8 r a 02958 j$\n\n\\href{http://rsc.li/rsc-advances}{rsc.li/rsc-advances} $\\mathrm{Bi}_{2} \\mathrm{O}_{3}$ in the defective fluorite structure (its high-temperature phase) is known to have a high $\\sigma_{\\mathrm{O}}$, whereas its $\\alpha$-phase counterpart is a low-temperature phase with a low $\\sigma_{\\mathrm{O}}{ }^{6}$ Reported crystal structures with high $\\sigma_{\\mathrm{O}}$ are mainly fluorites, perovskites, ${ }^{5}$ and their derivatives, such as the defective fluorite and melilite $^{10}$ structures. However, we expect that other undiscovered crystal structures may have high $\\sigma_{\\mathrm{O}}$ values.\n\nThe evolutionary algorithm is useful for the construction and search of crystal structures. ${ }^{11}$ This has been applied in combination with first-principles calculations for determining crystal structures with maximized or minimized functional properties (fitness values) such as enthalpy at high pressure, ${ }^{12-14}$ hardness, ${ }^{15}$ and dielectric constant. ${ }^{16}$ This algorithm is especially powerful for easily obtained fitness values, because it requires many individual crystal structures. From this perspective, the direct usage of the $E_{\\mathrm{v}}$ or $E_{\\mathrm{m}}$ as a fitness value may be inefficient because these properties should be obtained from supercell calculations. ${ }^{17}$ In this case, one useful method is machinelearning techniques.\n\nA regression analysis, one of the machine-learning techniques, is used to predict a target variable on the basis of already accumulated data, which can be used for descriptors (also called \"predictor variables\" or \"representations\"). If the descriptors are composed of \"density functional theory (DFT)unit-cell descriptors\" that contain information regarding the unit-cells obtained only from DFT calculations, ${ }^{18,19}$ the prediction model can be constructed with the advantage of computational efficiency. Some regression models have employed descriptors obtained from DFT calculations of the unit-cells to predict target variables such as the melting temperatures of binary metals, ${ }^{20}$ GW-level band gaps for inorganic compounds, ${ }^{21}$ and interatomic potentials. ${ }^{22}$ In addition, Deml et al. ${ }^{23}$ constructed a prediction equation for $E_{\\mathrm{v}}$ using ordinary least-square regression (OLSR) with four unit-cell descriptors and 45 oxides. However, it is not yet guaranteed whether this prediction model maintains accuracy in predicting $E_{\\mathrm{v}}$ for various types of crystal structures.\n\nThe purpose of the present study is to propose an efficient method to find various crystal structures with lower $E_{\\mathrm{v}}$ and $E_{\\mathrm{m}}$ values than those of ground-state $\\mathrm{ZrO}_{2}$. To this end, we reoptimized the reported crystal structures of various oxides in the Materials Project Database (MPD), ${ }^{24}$ one of the inorganic materials databases based on first-principles calculations, and reconsidered their $E_{\\mathrm{v}}$ and $E_{\\mathrm{m}}$. We constructed a prediction model for $E_{\\mathrm{v}}$ based on linearized regression analyses using DFTunit-cell descriptors and subsequently constructed crystal structures based on the predicted $E_{\\mathrm{v}}$ using the evolutionary algorithm. We also investigated the relationship between $E_{\\mathrm{v}}$ and $E_{\\mathrm{m}}$ for the crystal structures of $\\mathrm{ZrO}_{2}$. Finally, we found crystal structures having $E_{\\mathrm{v}}$ and $E_{\\mathrm{m}}$ values lower than those of groundstate $\\mathrm{ZrO}_{2}$.\n\n\\section{Methodology}\n\\subsection{Overview}\nFirst, we reoptimized the crystal structures of several oxides from the $\\mathrm{MPD}^{24}$ for $\\mathrm{ZrO}_{2}$. The computed $E_{\\mathrm{v}}$ and other properties of the unit-cells are used as the target variable and descriptors, respectively, for the regression analyses.\n\nFig. 1 shows the workflow for the construction of the crystal structures and prediction of the $E_{\\mathrm{v}}$. New structures were\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-02_1603_2373_165_977}\n\\end{center}\n\nFig. 1 Flowchart of screening for crystal structures of $\\mathrm{ZrO}_{2}$ with low $E_{\\mathrm{v}}$ constructed by evolutionary algorithm and the regression analysis. The procedures in the large rectangular box are repeated to construct 462 crystal structures of $\\mathrm{ZrO}_{2}$. constructed using the evolutionary algorithm. First-principles calculations were performed to optimize the constructed crystal structures and extract the DFT-unit-cell descriptors. The regression analyses were then applied to obtain the predicted $E_{\\mathrm{v}}$. In total, 462 crystal structures were constructed through the repetition of cycles comprising the construction of crystal structures, calculation of DFT-unit-cell descriptors from the constructed structures, and application of regression analysis to predict $E_{\\mathrm{v}}$.\n\nWe identified crystal structures with predicted $E_{\\mathrm{v}}$ in the target range and performed structural optimization again under tighter conditions. The accurate $E_{\\mathrm{v}}$ of the remaining crystal structures were computed from their supercells. Finally, we obtained 14 newly constructed crystal structures that have both the predicted and computed $E_{\\mathrm{v}}$.\n\nMore details regarding each method are found in the next subsection.\n\n\\subsection{Crystal structures for the training set in regression analysis}\nAs mentioned in the previous subsection, we collected various crystal structures of oxides with cation-to-O ratios of $1: 2$ in the $\\mathrm{MPD}^{24}$ for use as training data in regression analysis and for considering their $E_{\\mathrm{v}}$ and $E_{\\mathrm{m}}$. We set the number of atoms in the unit-cells to $\\leq 30$. We performed first-principles calculations for structural optimization and computation of the $E_{\\mathrm{v}}$. To identify crystal structures with reliable $E_{\\mathrm{v}}$, we adopted several filters. Firstly, the crystal structures must satisfy the convergence of electronic and ionic relaxations. Secondly, they should be nonmetallic. Thirdly, they should maintain a displacement of the center of the $V_{\\mathrm{O}}$ site of $0.1 \\AA$ at most after structural relaxations; this is for avoiding the convergence of crystal structures into other crystal structures. On the basis of these filters, we collected 16 crystal structures of $\\mathrm{ZrO}_{2}$ with the computed $E_{\\mathrm{v}}$, as summarized in Table 1 . Henceforth, this set of 16 crystal structures is called \"reoptimized- $\\mathrm{ZrO}_{2}$ \" and each structure in the set is called by its space group type. Excluded crystal structures are summarized in Table S1 in ESI. $\\dagger$ All the crystal structures in this study are displayed using the VESTA program. ${ }^{25}$\n\n\\subsection{Regression analysis}\nThe linearized ridge regression (RR) $)^{26}$ model uses a minimization function of the OLSR with a L2-norm penalty term that is given by\n\n\\[\nL(\\boldsymbol{\\beta})=\\|\\boldsymbol{y}-X \\boldsymbol{\\beta}\\|_{2}^{2}+\\lambda\\|\\boldsymbol{\\beta}\\|_{2}^{2},\n\\]\n\nwhere $\\beta$ is an $n$-dimensional vector of the regression coefficients of the descriptors, $\\boldsymbol{X}$ is an $(n \\times p)$ descriptor matrix, $\\boldsymbol{y}$ is an $n$ dimensional vector of the target property for the training set, and $\\lambda$ is a coefficient of the penalty term. Here, the penalty term is used for controlling the coefficients to avoid overfitting.\n\nTable 2 shows the list of the DFT-unit-cell descriptors. To predict $E_{\\mathrm{v}}$ of the crystal structures of $\\mathrm{ZrO}_{2}$, RR was employed with all 11 descriptors. The OLSR with three descriptors $\\left(x_{01^{-}}\\right.$ $\\left.x_{03}\\right)$, suggested by Deml et al., ${ }^{23}$ was also used for comparison. Table 1 Computed properties, including $E_{\\mathrm{v}}$, for the 16 crystal structures of reoptimized- $\\mathrm{ZrO}_{2}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-03_203_981_125_1932}\n\\end{center}\n\nHenceforth, the former and latter prediction models are referred to as RR-11-descriptors and OLSR-3-descriptors, respectively.\n\nThe training and test data were randomly divided in the ratio of $75 \\%$ to $25 \\%$. To avoid overfitting, three-fold cross-validation (CV) was also used. The prediction errors were defined as rootmean-square-errors (RMSE) that were averaged for 30 different random samplings of the training set.\n\n\\subsection{Structure construction using an evolutionary algorithm}\nWe used the USPEX $^{11,27,28}$ code to generate crystal structures based on an evolutionary algorithm. Here, the predicted $E_{\\mathrm{v}}$ was used as a fitness value for minimizing the quantity $\\mid$ predicted $E_{\\mathrm{v}}$ $-5 \\mathrm{eV} \\mid$. This form was applied to focus on the search for crystal structures with $E_{\\mathrm{v}}$ values moderately lower than that $(6.15 \\mathrm{eV})$ of the ground-state $P 2_{1} / c$ structure.\n\nEach newly constructed unit-cell of $\\mathrm{ZrO}_{2}$ was set to have four $\\mathrm{Zr}$ and eight $\\mathrm{O}$ atoms. Sixty first-generation crystal structures were produced using randomly selected space group types. The fitness value was obtained after structural relaxation based on the first-principles calculations. From the second generation onwards, new crystal structures were produced by genetic operators, namely, heredity $(30 \\%)$, random symmetric algorithm $(30 \\%)$, and mutation (40\\%). Each generation consisted of 40 crystal structures. The evolutionary algorithm was terminated if the best-ranked crystal structure was not changed over eight generations or after the number of generations reached 30.\n\n\\subsection{First-principles calculations}\nAll first-principles calculations were performed using the projector augmented-wave (PAW) ${ }^{29,30}$ method implemented in the Vienna Ab-initio Simulation Package (VASP) ${ }^{31,32}$ within the framework of the Generalized Gradient Approximation (GGA) of Perdew-Burke-Ernzerhof (PBE) form, ${ }^{33}$ including on-site Coulomb interaction ${ }^{34}$ with an effective $\\mathrm{U}-\\mathrm{J}$ of $3 \\mathrm{eV}$ (ref. 35) $(\\mathrm{GGA}+\\mathrm{U})$ for the d-orbitals of Zr. Here, we employed the GGA+U rather than the GGA to decrease the number of metallic crystal structures constructed by the evolutionary algorithm (See\n\nTable 2 DFT-unit-cell descriptors used for regression analyses\n\n\\begin{center}\n\\begin{tabular}{lll}\n\\hline\nName & Unit-cell-descriptor & Note \\\\\n\\hline\n$x_{01}$ & Formation energy $\\left(\\Delta E_{\\mathrm{f}}\\right)$ & Relative energy from the Zr metal and the half-energy of $\\mathrm{O}_{2}$ gas molecule \\\\\n$x_{02}$ & Band-gap $\\left(E_{\\mathrm{g}} \\mathrm{GGA}+\\mathrm{U}\\right)$ & From the electronic DOS \\\\\n$x_{03}$ & Center of $\\mathrm{O} 2 \\mathrm{p}$-band $\\left(E_{\\mathrm{O} 2 \\mathrm{p}}\\right)$ & From the minimum energy of the electronic DOS to the VBM \\\\\n$x_{04}$ & Volume per atom &  \\\\\n$x_{05}$ & Average bond length $\\left(r_{\\mathrm{Zr}-\\mathrm{O}}\\right)$ & Cutoff radius of $2.4 \\AA$ \\\\\n$x_{06}$ & Coordination number of $\\mathrm{O}\\left(\\mathrm{CN}_{\\mathrm{O}}\\right)$ & Cutoff radius of $2.4 \\AA$ \\\\\n$x_{07}$ & Mean of $\\mid x_{02}-x_{02}$ (ground-state) $\\mid$ &  \\\\\n$x_{08}$ & Mean of $\\mid x_{03}-x_{03}$ (ground-state) $\\mid$ &  \\\\\n$x_{09}$ & Mean of $\\mid x_{04}-x_{04}$ (ground-state) $\\mid$ &  \\\\\n$x_{10}$ & Mean of $\\mid x_{05}-x_{05}$ (ground-state) $\\mid$ &  \\\\\n$x_{11}$ & Mean of $\\mid x_{06}-x_{06}$ (ground-state $) \\mid$ &  \\\\\n\\end{tabular}\n\\end{center}\n\nFig. S1 in ESI $\\dagger$ ). The valence electrons occupied the $4 \\mathrm{~s}, 4 \\mathrm{p}, 5 \\mathrm{~s}$, and $4 \\mathrm{~d}$ orbitals for $\\mathrm{Zr}$, and the $2 \\mathrm{~s}$ and $2 \\mathrm{p}$ orbitals for $\\mathrm{O}$.\n\nDuring the construction of crystal structures by the evolutionary algorithm, structural relaxations of the unit-cells (with the associated changes in lattice constants and atomic coordinates) were modeled until the interatomic force on each atom was reduced to within $0.01 \\mathrm{eV}^{-1}$. To avoid bad convergence, we constrained the number of ionic iteration cycles to the maximum of 120 . The cutoff energy was set to $400 \\mathrm{eV}$. The Brillouin zone was sampled by $\\Gamma$-centered meshes with the density of $2 \\pi \\times 0.12 \\AA^{-1}$ for structural optimization such as fast screening. The calculations for the total energy and electronic density of states (DOS) of the optimized unit-cells were performed with a finer sampling of $2 \\pi \\times 0.08 \\AA^{-1}$ of the Brillouin zone. Subsequently, structural optimizations were performed for the survivors of the evolutionary algorithm again, but in tighter computational conditions: the cutoff energy was increased to $500 \\mathrm{eV}$, and the Brillouin zone was sampled using $\\Gamma$-centered $8 \\times 8 \\times 8$ meshes.\n\nThe computed $E_{\\mathrm{v}}$ were obtained using the supercell $\\operatorname{method}^{17}$ as follows,\n\n\\[\n\\begin{aligned}\nE_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{q}\\right) & =E\\left(\\mathrm{ZrO}_{2}: V_{\\mathrm{O}}^{q}\\right)-E\\left(\\mathrm{ZrO}_{2}\\right)+1 / 2 E\\left(\\mathrm{O}_{2}\\right) \\\\\n& +q\\left(E_{\\mathrm{VBM}}+E_{\\mathrm{Fermi}}\\right),\n\\end{aligned}\n\\]\n\nwhere $E\\left(\\mathrm{ZrO}_{2}: V_{\\mathrm{O}}^{q}\\right)$ is the energy of a supercell including a $V_{\\mathrm{O}}$, $E\\left(\\mathrm{ZrO}_{2}\\right)$ is the energy of a supercell of pure $\\mathrm{ZrO}_{2}, 1 / 2 E\\left(\\mathrm{O}_{2}\\right)$ is the half-energy of an $\\mathrm{O}_{2}$ gas molecule (used as the chemical potential of $\\mathrm{O}$ for the O-rich condition), $q$ is the unit charge, $E_{\\mathrm{VBM}}$ is the energy of the valence band maximum (VBM), and $E_{\\text {Fermi }}$ is the Fermi level, that is a variable changes between the VBM and the conduction band minimum (CBM). The chemical potential of $\\mathrm{O}$ depends on the processing condition, but it provides a constant shift to the $E_{\\mathrm{v}}$ of all of the crystal structures of $\\mathrm{ZrO}_{2}$ and the general consequence related to the ranks of the $E_{\\mathrm{v}}$ are unchanged. Therefore, we only considered the O-rich condition in this study (See other O-rich conditions in Table $\\mathrm{S} 2$ in $\\mathrm{ESI} \\dagger)$. We calculated both of the $E_{\\mathrm{v}}$ for a neutral oxygen vacancy $\\left[E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{0}\\right)\\right]$ and a doubly charged oxygen vacancy $\\left[E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{2+}\\right)\\right]$. For a prediction model based on the evolutionary algorithm and regression analysis, $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{0}\\right)$ was used as the computed $E_{\\mathrm{v}}$. The calculations for the supercell with a $V_{\\mathrm{O}}$ were performed until the interatomic forces on each atom were reduced to within $0.02 \\mathrm{eV}$ $\\AA^{-1}$ with fixed lattice constants. The sizes of the supercells were set such that the lengths of the three lattice constants were $\\sim 10$ Å. $\\Gamma$-centered $2 \\times 2 \\times 2$ meshes were used to describe the $k$ space. The types of $\\mathrm{O}$ sites were confirmed by SPGLIB implemented in PHONOPY. ${ }^{36,37}$ For a crystal structure containing more than two types of $\\mathrm{O}$ sites, the computed $E_{\\mathrm{v}}$ values were averaged.\n\nThe minimum energy path (MEP) for a $V_{\\mathrm{O}}$ migration was obtained by the climbing-images nudged-elastic-band (CI-NEB) method. ${ }^{38,39}$ The $E_{\\mathrm{m}}$ of a $V_{\\mathrm{O}}$ can be defined as the energy difference between the transition state and the initial or final state from the obtained MEP, as shown in Fig. 2. The CI-NEB calculations were performed with three intermediate images (states) until the forces decreased below $0.03 \\mathrm{eV} \\AA^{-1}$ with\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-04_167_738_1073_1903}\n\\end{center}\n\nFig. 2 Energy differences of the intermediate states (images) of the $\\mathrm{P}_{2} / \\mathrm{nmc}$ structure of $\\mathrm{ZrO}_{2}$, which were obtained by the $\\mathrm{Cl}-\\mathrm{NEB}$ method. The atomic coordinates in the figure were shown from the normal direction to the (001) plane. Green and light gray spheres denote $\\mathrm{Zr}$ and $\\mathrm{O}$ atoms, respectively. A brown sphere is used to emphasize the migrating $O$ atom along the $\\langle 110\\rangle$ path. A pink circle denotes a $V_{O}$ site. The $V_{O}$ at the initial or final state is formed by removing an $O$ atom and breaking four $O-Z r$ bonds. The $E_{m}$ is defined as the energy difference between the transition state and the initial or final state. The migrating $\\mathrm{O}$ atom has four $\\mathrm{O}-\\mathrm{Zr}$ bonds at the initial state, while it maintains only two $\\mathrm{O}-\\mathrm{Zr}$ bonds at the transition state and breaks the other two $\\mathrm{O}-\\mathrm{Zr}$ bonds.\n\na spring constant of $5 \\mathrm{eV} \\AA^{-2}$ between images. Here, the climbing images with even numbers were used to increase the probability of finding the transition state. We employed a $\\left(V_{\\mathrm{O}}^{2+}\\right)$ for $E_{\\mathrm{m}}$, assuming that $V_{\\mathrm{O}}$ were formed by the reduction of cation valency upon doping. The supercells with a $\\left(V_{\\mathrm{O}}^{2+}\\right)$ were described by decreasing two electrons of the background charge for compensation. The internal coordinates for the supercells with a $\\left(V_{\\mathrm{O}}^{2+}\\right)$ were relaxed in the same computational conditions as those for $\\left(V_{\\mathrm{O}}^{0}\\right)$.\n\n\\section{Results and discussion}\n3.1. Construction of a prediction model for $E_{\\mathbf{v}}$ using DFTunit-cell descriptors\n\nAs mentioned in the Introduction, Deml et al. ${ }^{23}$ constructed a linear prediction model for the $E_{\\mathrm{v}}$ with four unit-cell descriptors, namely, the formation energy of oxides $\\left(\\Delta E_{\\mathrm{f}}\\right)$ obtained as the fitted elemental-phase reference energy (FERE), ${ }^{35}$ the computed band-gaps obtained by GGA+U $\\left(E_{\\mathrm{g}}{ }^{\\mathrm{GGA}+\\mathrm{U}}\\right)$ or $\\mathrm{GW}^{40}$ calculations, the $\\mathrm{O} 2 \\mathrm{p}$ band center $\\left(E_{\\mathrm{O} 2 \\mathrm{p}}\\right)$, and the differences in electronegativity between the cations and $\\mathrm{O}$, for 45 different oxides in six crystal structures. Their prediction error was reported as $\\sim 0.20 \\mathrm{eV}$ as the mean absolute error (MAE). To evaluate whether this model is well-fitted for the different crystal structures upon fixing the substituted chemical elements and composition ratio as listed in Table 1, we employed the OLSR-3descriptors model with the descriptors $x_{1}-x_{3}$ listed in Table 2 . For the RR-11 descriptor, the average difference in electronegativity between the cations and $\\mathrm{O}$ is not used because it does not vary among the different types of crystal structures. The 16\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f8875eb68affb0a6cb2bg-05_163_835_379_1675}\n\nFig. 3 Relationship between the computed and predicted $E_{v}$ by using regression analyses with the $16 \\mathrm{cr}^{2}$ stal structures of reoptimized-ZrO ${ }_{2}$ with (a) 3-OLSR-descriptors and (b) 11-RR-descriptors. One snapshot is drawn from thirty repeated random samples for training and test data. The RMSE of test data averaged from thirty samplings from the prediction models using (a) the 3-OLSR-descriptors and (b) the 11-RR-descriptors are $0.51$ and $0.16 \\mathrm{eV}$, respectively.\n\ncrystal structures of the reoptimized-ZrO ${ }_{2}$ in Table 1 were used to construct the prediction model.\n\nFig. 3(a) shows the relationship between the predicted and computed $E_{\\mathrm{v}}$ obtained by using the OLSR-3-descriptors model. The distribution of data is largely scattered from the diagonal line that indicates equality between the predicted and computed $E_{\\mathrm{v}}$. As arranged in Table 3 , the CV-score and RMSE of the test set are $0.76$ and $0.51 \\mathrm{eV}$, respectively, which are much larger errors than the MAE of $0.20 \\mathrm{eV}$ for the 45 oxides. $^{23}$ The large difference between the CV-score and RMSE of the test set also indicates that the prediction model has a large dependence on the type of training set. Therefore, it implies that the prediction model using the OLSR-3-descriptors is not good enough to predict the $E_{\\mathrm{v}}$ of the various crystal structures of $\\mathrm{ZrO}_{2}$.\n\nTo improve the prediction accuracy, we constructed RR-11descriptors by adding more DFT-unit-cell descriptors on top of the three descriptors; these DFT descriptors are intuitively thought to be related to the forming and breaking of chemical bonds. We employed the RR model, which can control the coefficients of various descriptors through a penalty term and thereby minimize overfitting. Fig. 3(b) shows the relationship between the predicted and computed $E_{\\mathrm{v}}$ obtained by using the RR-11-descriptors model. The scattering of points from the diagonal line is significantly decreased. The CV-score and RMSE of the test sets are $0.17$ and $0.16 \\mathrm{eV}$, respectively, which are much smaller than those obtained from the OLSR-3-descriptors model. The similarity in the two values suggests the absence of any serious overfitting.\n\nFurthermore, we applied the RR-11-descriptor model with a training set consisting of all 16 crystal structures of reoptimized-ZrO ${ }_{2}$. In the results, the $\\mathrm{CV}$-score slightly decreased to $0.14 \\mathrm{eV}$. This improvement can be attributed to the increased number of training data points. This value is also only $0.02 \\mathrm{eV}$ different from that of the RMSE of the test set of the prediction model with a $75 \\%$ training set, which suggests the absence of any serious overfitting. Finally, we identified the coefficients for a linear fitting function applied as the fitness value in the evolutionary algorithm by using the RR-11-descriptors model with all 16 crystal structures of the reoptimized-ZrO ${ }_{2}$.\n\n\\subsection{Crystal structures with low $E_{\\mathbf{v}}$}\nAs Fig. 1 shows, we generated 462 crystal structures through combinations of the regression analysis for the $E_{\\mathrm{v}}$ and evolutionary algorithm, and screened out 71 crystal structures based on the criterion $\\mid$ predicted $E_{\\mathrm{v}}-5 \\mid<0.5 \\mathrm{eV}$. After crystal relaxation once again under tighter conditions, we obtained 14 remaining crystal structures with the predicted and computed $E_{\\mathrm{v}}$, excluding those that were metallic or could not satisfy the criteria for structural optimization. The detailed properties of\n\nTable 3 Errors between the predicted and computed $E_{\\mathrm{v}}$ of two regression analyses using the $16 \\mathrm{crystal} \\mathrm{structures} \\mathrm{of} \\mathrm{reoptimized-ZrO}_{2}$. The prediction error values are obtained as RMSE in eV. The parentheses denote the standard deviation of values averaged over thirty readings\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-05_2292_2535_140_1927}\n\\end{center}\n\nTable 4 Computed properties of the 14 crystal structures of generated- $\\mathrm{ZrO}_{2}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-06_205_831_123_1928}\n\\end{center}\n\n${ }^{a}$ The space group in parentheses is identified using looser tolerance in SPGLIB in PHONOPY code ${ }^{36,37}$ to determine similar higher-symmetry crystal structures. ${ }^{b}$ Values in the parentheses are the minimum and the maximum values in sequence, which depend on the kinds of $\\mathrm{O}$ sites.\n\nthe 14 crystal structures are listed in Table 4 . Henceforth, this set of crystal structures is referred to as \"generated- $\\mathrm{ZrO}_{2}$ \", and the name of each such structure is prefixed with \"Gen-\" (\"generated or constructed\"); these structures are numbered in the order of the computed $E_{\\mathrm{v}}$. These crystal structures have very low symmetry; most of them are $P 1$. To identify similar crystal structures with higher symmetry, a looser tolerance for finding the space group was also applied.\n\nFig. 4 shows the relationship between the computed and predicted $E_{\\mathrm{v}}$ of the crystal structures of reoptimized-ZrO ${ }_{2}$ and generated-ZrO $\\mathrm{Zr}_{2}$, which are used as the training and test data, respectively. The $E_{\\mathrm{v}}$ of the ground-state $P 2_{1} / c$ structure is emphasized with a star-shaped mark for easier viewing. Note that the distribution of the predicted $E_{\\mathrm{v}}$ for the 14 test-data crystal structures is in the range 5.11-6.53 $\\mathrm{eV}$, which is wider than the screening criteria. This is because some crystal structures are relaxed into more stable structures, with changes in the predicted $E_{\\mathrm{v}}$.\n\nThe distribution of the test data is close to the diagonal line. The prediction error is only $0.11 \\mathrm{eV}$, which is almost the same as the CV-score of the RR-11-descriptors model with the 16 training data $(0.14 \\mathrm{eV})$. This means that the $E_{\\mathrm{v}}$ of the 14 crystal structures of generated-ZrO $\\mathrm{Zr}_{2}$ have been successfully predicted using only DFT-unit-cell descriptors. Note that the distribution of the 16 training data points is very close to the diagonal line in Fig. 3(b), because their predicted $E_{\\mathrm{v}}$ are obtained as the training data, and not as the test data.\n\nFig. 5 shows Pearson's linear correlation coefficient $\\left(r_{\\mathrm{p}}\\right)$ for each DFT-unit-cell descriptor with respect to the computed $E_{\\mathrm{v}}$. The absolute value of $r_{\\mathrm{p}}$ is larger than $0.7$, which indicates a strong correlation between the two properties for a given data point. ${ }^{41}$ For the 16 crystal structures of reoptimized-ZrO ${ }_{2}$, the $\\left|r_{\\mathrm{p}}\\right|$ for the volume per atom, average bond lengths $\\left(r_{\\mathrm{Zr}-\\mathrm{O}}\\right)$, and $\\mathrm{O}$ coordination number $\\left(\\mathrm{CN}_{\\mathrm{O}}\\right)$ are $0.82,0.85$, and $0.73$ (high), respectively, while the $\\left|r_{\\mathrm{p}}\\right|$ for the formation energy $\\left(\\Delta E_{\\mathrm{f}}\\right)$ and $E_{\\mathrm{g}}{ }^{\\mathrm{GGA}+\\mathrm{U}}$ are $0.22$ and $0.42$ (low), respectively. This observation differs from that of Deml's model ${ }^{23}$ for 45 various oxides, which showed strong correlations between the FERE and $E_{\\mathrm{v}}$, and between the $E_{\\mathrm{g}}{ }^{\\mathrm{GGA}+\\mathrm{U}}$ and $E_{\\mathrm{v}}$, with $\\left|r_{\\mathrm{p}}\\right|$ values of $0.84$ and $0.89$, respectively. The different accuracies of the prediction models between this study and ref. 23 can arise from several factors. Firstly, the 45 training-data oxides used in ref. 23 included six types of crystal structures with high symmetries, namely, antifluorite, fluorite, rocksalt, rutile, perovskite, and spinel. Most\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-06_1459_2268_1069_1902}\n\\end{center}\n\nFig. 4 Relationship between the computed and predicted $E_{\\mathrm{v}}$ of the training- and test-data crystal structures. The crystal structures for the training and test data are from reoptimized $-\\mathrm{ZrO}_{2}$ and generated $-\\mathrm{ZrO}_{2}$, respectively. The predicted $E_{\\mathrm{v}}$ is predicted by the 11-RR-descriptors model. The RMSE of the 14 test-data crystal structures is $0.11 \\mathrm{eV}$. Considering that the three-fold CV-score for the 16 training data is almost the same as $0.14 \\mathrm{eV}$, overfitting is avoided.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-07_167_785_161_997}\n\\end{center}\n\nFig. 5 Pearson's linear correlation coefficients $\\left(r_{p}\\right)$ between the computed $E_{\\mathrm{v}}$ and the $11 \\mathrm{DFT}$-unit-cell descriptors for the 16 training data points (reoptimized- $\\mathrm{ZrO}_{2}$ ) and the 30 total data points (the crystal structures of reoptimized $-\\mathrm{ZrO}_{2}$ and generated $\\mathrm{ZrO}_{2}$ ).\n\nof these oxides are energetically stable for various combinations of constituent elements. However, the crystal structures of $\\mathrm{ZrO}_{2}$ in this study all have different types of metastable lowersymmetry crystal structures. The contribution of each descriptor in the regression analysis may differ. Secondly, the range of training data can also affect the accuracy of prediction model. The $E_{\\mathrm{v}}$ of the 45 training-data structures in ref. 23 are widely distributed between $2.6$ and $7.0 \\mathrm{eV}$, whereas the $E_{\\mathrm{v}}$ of $\\mathrm{ZrO}_{2}$ in this study are distributed between only $5.1$ and $6.7 \\mathrm{eV}$.\n\nThe $r_{\\mathrm{p}}$ changes for all 30 crystal structures of the reoptimized-ZrO ${ }_{2}$ and generated-ZrO ${ }_{2}$. The values of $\\left|r_{\\mathrm{p}}\\right|$ for the volume per atom and $r_{\\mathrm{zr}-\\mathrm{O}}$ are similarly large as $0.88$ and $0.82$ respectively, while $\\left|r_{\\mathrm{p}}\\right|$ for $\\mathrm{CN}_{\\mathrm{O}}$ decreases to $0.49$. The $\\left|r_{\\mathrm{p}}\\right|$ for $\\Delta E_{\\mathrm{f}}$ and $E_{\\mathrm{g}}^{\\mathrm{GGA}+\\mathrm{U}}$ changed to $0.51$ and $0.69$, respectively. When the RR-11-descriptors model is applied to all 30 crystal structures, the prediction accuracy is improved, with the RMSE of the test data of $0.08 \\mathrm{eV}$ compared with that of the same prediction model $(0.16 \\mathrm{eV})$ with the 16 training data crystal structures. Because the descriptors also maintain their correlations with each other in the regression analysis, the important unit-cell descriptors for the prediction of $E_{\\mathrm{v}}$ can be changed according to the target materials and training data. Therefore, we suggest employing more types of unit-cell descriptors but with regression analysis using a penalty term; this is a useful way to construct the prediction model of the $E_{\\mathrm{v}}$.\n\nWe identify many crystal structures having $E_{\\mathrm{v}}$ lower than that of the ground-state $P 2_{1} / c$ structure. As shown in Table 1 and Fig. 4, eight crystal structures, including the $P 4_{2} / \\mathrm{nmc}$ and $F m \\overline{3} m$ structures that are well-known high-temperature structures of $\\mathrm{ZrO}_{2}$ and that can be stabilized by extrinsic doping, ${ }^{5}$ reveal lower $E_{\\mathrm{v}}$ than that of the ground-state $P 2_{1} / c$ structure. In particular, the $\\operatorname{Pna2}_{1}$ structure, which is obtained from the structural data of $\\mathrm{SiO}_{2}$, shows the lowest $E_{\\mathrm{v}}$ of $5.14 \\mathrm{eV}$, which is almost $1 \\mathrm{eV}$ less than that of the ground-state $P 2_{1} / c$ structure. This implies that exchanging the substituting elements in the crystal structures of other oxides can be an efficient way to\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-07_165_966_1073_1903}\n\\end{center}\n\nFig. 6 Relationship of the computed $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{0}\\right)$ and $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{2+}\\right)$ of the 14 crystal structures of reoptimized $-\\mathrm{ZrO}_{2}$. The $r_{\\mathrm{p}}$ between the $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{0}\\right)$ and $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{2+}\\right)$ is $0.86$, which implies a very strong correlation between the two properties.\n\nreconsider a functional property. Additionally, we obtain 14 crystal structures based on the evolutionary algorithm that have lower $E_{\\mathrm{v}}$ than that of the ground-state $P 2_{1} / c$ structure. This suggests that the discovery of a crystal structure with a special functional property can be accelerated by a combination of the machine-learning technique and the direct construction of crystal structures based on the evolutionary algorithm.\n\nMeanwhile, we reveal why the neutral oxygen vacancy $\\left(V_{\\mathrm{O}}^{0}\\right)$ is mainly employed in the calculations of the $E_{\\mathrm{v}}$ for the prediction model. The $V_{\\mathrm{O}}$ in the crystal structures of $\\mathrm{ZrO}_{2}$ has been widely investigated. The $P 2_{1} / c$ and $P 4_{2} / n m c$ structures are known to form a deep level inside the $E_{\\mathrm{g}}$ based on the $\\mathrm{GGA}^{42-44}$ and HSE06 (ref. 45 and 46) calculations. Additionally, the $E_{\\mathrm{v}}$ of the $\\left(V_{\\mathrm{O}}^{0}\\right)$ in the dilute limit is physically well defined regardless of the doping level of the cation sites, and quickly converged with respect to the supercell size.\n\nHowever, it is also worth investigating the relationship between $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{0}\\right)$ and $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{2+}\\right)$ considering the cases of extrinsic doping by aliovalent ions. Here, for $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{2+}\\right)$, we fixed the $E_{\\text {Fermi }}$ at the center of the $E_{g}$ because the crystal structures of reoptimized- $\\mathrm{ZrO}_{2}$ are all insulators $\\left(E_{\\mathrm{g}}{ }^{\\mathrm{GGA}+\\mathrm{U}}>\\sim 3 \\mathrm{eV}\\right)$. Among the 16 crystal structures of the reoptimized-ZrO ${ }_{2}$ in Table 1, the Pnma and the $P 6_{3} m c$ structures were excluded from the computation of $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{2+}\\right)$ because crystal structures with a $\\left(V_{\\mathrm{O}}^{2+}\\right)$ are considered too unstable for convergence. Fig. 6 shows the relationship between the computed $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{0}\\right)$ and $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{2+}\\right)$ of the 14 crystal structures of the reoptimized-ZrO . It is noticeable that the $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{0}\\right)$ and $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{2+}\\right)$ have a very strong correlation with the $r_{\\mathrm{p}}$ of $0.86$. This suggests that the crystal structures with low $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{0}\\right)$ also have low $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{2+}\\right)$, which implies that extrinsic doping with aliovalent ions may also more easily generate $V_{\\mathrm{O}}$ for these\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-08_153_2533_209_827}\n\\end{center}\n\ncrystal structures (numerical values are summarized in Table S3 in $\\operatorname{ESI} \\dagger$ ).\n\nBefore proceeding, it is worthwhile to discuss the comparison of the computed values $\\left(E_{\\mathrm{g}}\\right.$ and $E_{\\mathrm{v}}$ shown in Fig. S1 in ESI $\\dagger$ ) between the GGA+U and GGA methods. It is noticeable that the $E_{\\mathrm{g}}$ obtained by the GGA+U are larger than those by the GGA, which implies that the GGA+U is useful to reduce the underestimation of the $E_{\\mathrm{g}}$. For the computed $E_{\\mathrm{v}}$, it is found that the $E_{\\mathrm{v}}$ obtained by the GGA are slightly smaller or almost the same as those obtained by the GGA+U. This suggests that the GGA+U does not lose its reliability compared with the GGA, despite including the empirical U parameter.\n\n\\subsection{Crystal structures with low $E_{\\mathbf{m}}$}\nWe summarize the $E_{\\mathrm{m}}$ values of the $F m \\overline{3} \\mathrm{~m}$ and the $P 4_{2} / \\mathrm{nmc}$ structures obtained herein and in former computational studies $^{42,47-50}$ in Table 5. Former computational studies have mainly used the GGA, rather than the GGA+U. To compare the results, we also employ the GGA with the PBE form. ${ }^{33}$ The $E_{\\mathrm{m}}$ values obtained herein using the GGA are almost the same as those mentioned in previous computational reports. The $E_{\\mathrm{m}}$ values obtained using the GGA+U are larger than those obtained using the GGA for both the $F m \\overline{3} m$ and $P 4_{2} / n m c$ structures.\n\nWe also compare the $E_{\\mathrm{m}}$ values of $\\left(V_{\\mathrm{O}}^{0}\\right)$ and $\\left(V_{\\mathrm{O}}^{2+}\\right)$. Table 5 shows that the $E_{\\mathrm{m}}$ values of $\\left(V_{\\mathrm{O}}^{0}\\right)$ are much larger than those of $\\left(V_{\\mathrm{O}}^{2+}\\right)$, independent of the crystal structure and the exchangecorrelation functional. Larger $E_{\\mathrm{m}}$ values for $\\left(V_{\\mathrm{O}}^{0}\\right)$ than for $\\left(V_{\\mathrm{O}}^{2+}\\right)$ have been reported in other oxides like $\\mathrm{MgO}^{51}$ and $\\mathrm{ZnO}^{52}$ When a $V_{\\mathrm{O}}$ jumps into its nearest-neighboring $\\mathrm{O}$ site, the $\\mathrm{O}$ atom at the nearest-neighboring site migrates in the opposite direction. For $\\left(V_{\\mathrm{O}}^{2+}\\right)$, no occupied levels are present inside $E_{\\mathrm{g}}$. On the other hand, for $\\left(V_{\\mathrm{O}}^{0}\\right)$, the two electrons occupying the deep level have transition into the conduction band when the moving $\\mathrm{O}$ atom is in the transition state (center of the hopping path), ${ }^{47}$ which may need more energy for $V_{\\mathrm{O}}$ hopping. Considering the abovementioned reasons, we employed $\\left(V_{\\mathrm{O}}^{2+}\\right)$ for the $E_{\\mathrm{m}}$ in this study.\n\nHereafter, we will refer to the $E_{\\mathrm{m}}$ obtained by the GGA+U calculations.\n\nIn the case of the initial-state structure for the CI-NEB method, we employed the relaxed supercell possessing a $\\left(V_{\\mathrm{O}}^{2+}\\right)$ having the lowest energy among the different $\\mathrm{O}$ sites. For the 14 crystal structures of reoptimized- $\\mathrm{ZrO}_{2}$ that have well-converged structures with a $\\left(V_{\\mathrm{O}}^{2+}\\right)$, we considered various final-state structures that have the $V_{\\mathrm{O}}$ at the nearest-neighboring $\\mathrm{O}$ site with the cutoff distance of $3.5 \\AA$ for the CI-NEB method (see Fig. S2 in ESI $\\dagger$ ). Among the $E_{\\mathrm{m}}$ values of different migration paths, the lowest value was extracted; we then checked whether the $V_{\\mathrm{O}}$ could migrate to the original site in the nearestneighboring supercell via the one type of migration path with the lowest $E_{\\mathrm{m}}$, because the migration of the $V_{\\mathrm{O}}$ through the bulk system is practically meaningful. In 12 of the 14 crystal structures, $V_{\\mathrm{O}}$ could migrate to the original site in the nearestneighboring supercell via the migration path with the lowest $E_{\\mathrm{m}}$. However, for the $P 4 / n$ and $R \\overline{3}$ structures, a $V_{\\mathrm{O}}$ needs different paths with different $E_{\\mathrm{m}}$ values to migrate to the\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f8875eb68affb0a6cb2bg-09_164_788_382_1690}\n\nFig. 7 Relationship between the computed $E_{\\mathrm{v}}\\left[(\\mathrm{a}) E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{0}\\right)\\right.$ and (b) $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{2+}\\right)$, respectively] and $E_{\\mathrm{m}}$ of various crystal structures of $\\mathrm{ZrO}{ }_{2}$. The $r_{\\mathrm{p}}$ between the $E_{\\mathrm{m}}$ and $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{0}\\right)$ and between the $E_{\\mathrm{m}}$ and $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{2+}\\right)$ of the 14 crystal structures from reoptimized- $\\mathrm{ZrO}{ }_{2}$ are $0.64$ and $0.62$, respectively, which implies that the correlation in a reasonable level is found. The crystal structures with asterisks $(*)$ need several different types of migration for a $V_{\\mathrm{O}}$ to move to the same site in the nearest-neighboring computational cell (see Fig. S3 in ESI $\\dagger$ ). On the basis of this information, the $E_{m}$ of three crystal structures from generated $-\\mathrm{ZrO}_{2}$ are obtained (red $\\times$ marks).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-09_1075_1854_165_998}\n\\end{center}\n\nFig. 8 Relationship between the $E_{\\mathrm{m}}$ and relative $\\Delta E_{\\mathrm{f}}$ (compared with that of the ground-state $P 2_{1} / c$ structure) of the 14 crystal structures of reoptimized- $\\mathrm{ZrO}_{2}$ and three crystal structures of generated $-\\mathrm{ZrO}_{2}$ which have $E_{\\mathrm{m}}$ values.\n\noriginal site in the nearest-neighboring supercell. We define the $E_{\\mathrm{m}}$ for these structures as the minimum barrier energy required for migration from the original site to that in the nearestneighboring supercell with several kinds of CI-NEB calculations. The energy diagrams for the migration of a $V_{\\mathrm{O}}$ are shown in Fig. S3 and Table S4 in ESI. $\\dagger$\n\nFig. 7 and 8 show the relationships between the computed $E_{\\mathrm{v}}$ and $E_{\\mathrm{m}}$ values, and between the relative $\\Delta E_{\\mathrm{f}}$ (compared with that of the ground-state $P 2_{1} / c$ structure) and $E_{\\mathrm{m}}$ values of various $\\mathrm{ZrO}_{2}$ crystal structures, respectively. Firstly, we compare the $E_{\\mathrm{m}}$ of the 14 crystal structures of the reoptimized-ZrO${ }_{2}$. The $E_{\\mathrm{m}}$ values ( $0.39$ and $0.34 \\mathrm{eV}$, respectively) of the $F m \\overline{3} m$ and $P 4_{2} / n m c$ structures are lower than that $(0.61 \\mathrm{eV})$ of the ground-state $P 2_{1} / c$ structure. Ten crystal structures, including the $F m \\overline{3} m$ and the $P 4_{2} / n m c$ structures, show lower $E_{\\mathrm{m}}$ than that of the ground-state $P 2_{1} / c$ structure.\n\nAmong these ten, eight crystal structures have only $0.05 \\mathrm{eV}$ per atom higher $\\Delta E_{\\mathrm{f}}$ than the ground-state $P 2_{1} / c$ structure (Table 1 and Fig. 8). This suggests that high $\\sigma_{\\mathrm{O}}$ can be realized for these structures with stabilizing methods such as extrinsic doping and the formation of epitaxial heterostructures. The $P 4_{2} / n m c$ and $F m \\overline{3} m$ structures are confirmed to have both relatively low $E_{\\mathrm{m}}$ and $\\Delta E_{\\mathrm{f}}$. The $P b c n$ structure, which also shows relatively low $\\Delta E_{\\mathrm{f}}$, is reportedly produced by biaxial tensile strain $^{53}$ on fluoritestructured $\\mathrm{CeO}_{2}$, which forms the (100) interface. This structure, obtained by $7 \\%$ tensile strain, is also reported to show a higher $\\mathrm{O}$ diffusivity than that of YSZ based on first-principles molecular dynamics calculations. ${ }^{54}$ The $I 4_{1} / a m d, P b c a, P c a 2_{1}$, $C 2 / c$, and $P 2_{1} / m$ structures also have the potential for stabilization, although they have somewhat larger $E_{\\mathrm{m}}$ than the $P 4_{2} /$ $n m c$ and $F m \\overline{3} m$ structures do. These crystal structures have not been investigated as oxygen-ion conductors to the best of the authors' knowledge; however, some of them have been reported as metastable structures. The Pbca structure was experimentally synthesized at $600{ }^{\\circ} \\mathrm{C}$ and $6 \\mathrm{GPa}^{55}$ This structure was also confirmed by first-principles calculations to be stabilized by hydrostatic pressure over $4.1 \\mathrm{GPa}^{56} \\mathrm{Mg}$-doped tetragonal $\\mathrm{ZrO}_{2}$ cooled to $\\sim 30 \\mathrm{~K}$ reportedly transforms to the orthorhombic structure with the space group of $P b c 2_{1}\\left(P c a 2_{1}\\right) \\cdot{ }^{57}$\n\nThe $E_{\\mathrm{m}}$ values for the 14 crystal structures of the reoptimized- $\\mathrm{ZrO}_{2}$ have similarly large $r_{\\mathrm{p}}$ of $0.64$ and $0.62$ with the computed $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{0}\\right)$ and $E_{\\mathrm{v}}\\left(V_{\\mathrm{O}}^{2+}\\right)$, respectively. The $E_{\\mathrm{v}}$ is the energy required for breaking all the chemical bonds to separate an $\\mathrm{O}$ atom from an oxide, and the $E_{\\mathrm{m}}$ is the energy required for breaking some of the chemical bonds locally in an oxide, as shown in Fig. 2. Therefore, this correlation may be reasonable in terms of chemical bond cleavage. Correlations between $E_{\\mathrm{v}}$ and $E_{\\mathrm{m}}$ have also been reported for other oxides, like perovskite oxides ${ }^{58}$ with various kinds of constituent elements and a multinary oxide of $\\mathrm{Ba}_{1-x} \\mathrm{Sr}_{x} \\mathrm{Co}_{1-y} \\mathrm{Fe}_{y} \\mathrm{O}_{3-\\delta} \\cdot{ }^{59}$ On the other hand, the relative $\\Delta E_{\\mathrm{f}}$ and $E_{\\mathrm{m}}$ do not show any correlation, having an $\\left|r_{\\mathrm{p}}\\right|$ of only $0.10$, which implies that the relative $\\Delta E_{\\mathrm{f}}$ is not a good single descriptor for the $E_{\\mathrm{m}}$. To realize crystal structures with low values for both relative $\\Delta E_{\\mathrm{f}}$ and $E_{\\mathrm{m}}$, special challenges in processing may be necessary.\n\nThe above information suggests that we are likely to identify a low- $E_{\\mathrm{m}}$ crystal structure when we initially investigate crystal structures with low $E_{\\mathrm{v}}$. Therefore, for $E_{\\mathrm{m}}$ calculations, we choose the four crystal structures (Gen-01, Gen-02, Gen-07, and Gen-08) of the generated- $\\mathrm{ZrO}_{2}$ that possess the lowest $E_{\\mathrm{v}}$ values in ascending order. The crystal structures between Gen-03 and Gen-06 are not chosen because we expect these structures to have properties similar to Gen-02 (see Fig. S4 in ESI $\\dagger$ ). The crystal structures from Gen-09 to Gen-14 are also not considered for the $E_{\\mathrm{m}}$ because they may have relatively high $E_{\\mathrm{m}}$ values.\n\nThe $E_{\\mathrm{m}}$ values of these crystal structures from the generated$\\mathrm{ZrO}_{2}$ are also shown in Fig. 7 and 8. The $E_{\\mathrm{m}}$ values of Gen-01, Gen-02, and Gen-08 are 0.42, 0.39, and $0.28 \\mathrm{eV}$, respectively. Therefore, we succeed in constructing crystal structures with lower $E_{\\mathrm{m}}$ as well as lower $E_{\\mathrm{v}}$ than those of the ground-state $P 2_{1} / c$ structure. It is worth analyzing the Gen-08 structure further because it is very similar in crystal structure and energetic properties to $P 4_{2} / n m c$, despite its space group being P1. Fig. 9 shows the crystal structures of the $P 4_{2} / n m c$ and Gen-08 structures. We confirm that Gen-08 and $P 4_{2} / n m c$ do not become the same by structural optimizations with denser $k$-space sampling. However, the space group defined by using looser tolerance and structural properties, such as the radial distribution function and the bond lengths (see Fig. S4 in ESI $\\dagger$ ), imply that these crystal structures are quite similar; the Gen-08 structure is slightly distorted in terms of its bond lengths and lattice parameters (see Table S5 in ESI $\\dot{\\dagger}$ ). In the macroscopic view, these crystal structures may be difficult to distinguish from each other. For the construction of the Gen-08 structure, we only prepared the prediction model of $E_{\\mathrm{v}}$ by the regression analysis and evolutionary algorithm that requires the initial structurerelated input of only the number of constituting atoms of $\\mathrm{Zr}$ and $\\mathrm{O}$ in empty space. Therefore, the construction of Gen-08, which has a similar crystal structure to $P 4_{2} / n m c$, implies a successful result of a combination of evolutionary algorithm and regression analysis.\n\nThe Gen-07 structure, possessing an energy of $0.2 \\mathrm{eV}$ per atom higher than that of the ground-state $P 2_{1} / c$ structure, is too unstable to contain a $\\left(V_{\\mathrm{O}}^{2+}\\right)$. This suggests that the energetic stability and the low $E_{\\mathrm{v}}$ of the crystal structures should be considered in choosing candidates for low $E_{\\mathrm{m}}$. The Gen-01-Gen-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-10_1351_1795_378_954}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-10_1870_2444_393_1056}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-10_1372_1779_1088_1672}\n\\end{center}\n\n(d)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f8875eb68affb0a6cb2bg-10_1811_2440_1075_1675}\n\\end{center}\n\nFig. 9 Unit-cells of (a) $P 4_{2} / n m c$ and (b) Gen-08 structures, and supercells of (c) $P_{2} / n m c$ and (d) Gen-08 structures of ZrO ${ }_{2}$. Numerical values in (c) and (d) are $\\mathrm{O}-\\mathrm{Zr}$ bond lengths (in Å). Green and light gray spheres denote $\\mathrm{Zr}$ and $\\mathrm{O}$ atoms, respectively. 07 crystal structures have energies more than $0.1 \\mathrm{eV}$ per atom higher than that of ground-state $P 2_{1} / c$ structure, despite having $E_{\\mathrm{v}}$ lower than $5.7 \\mathrm{eV}$. On the other hand, the crystal structures Gen-08-Gen-13 have less than $0.03 \\mathrm{eV}$ per atom higher energy than the ground-state $P 2_{1} / c$ structure, although they have higher $E_{\\mathrm{v}}$ values. The latter group may have higher stabilization potential than the former.\n\nBefore concluding, we note our exclusion of dynamical stabilities based on the phonon calculations with harmonic approximations $^{36,37}$ from this study. The $P 4_{2} / n m c$ and $F m \\overline{3} m$ structures are known to be stabilized at temperatures exceeding $\\sim 1173{ }^{\\circ} \\mathrm{C}$ and $\\sim 2370{ }^{\\circ} \\mathrm{C}$, respectively. However, as Fig. $\\mathrm{S} 5$ in ESI $\\dagger$ shows, the $P 4_{2} / n m c$ structure includes no imaginary phonon frequencies, whereas the $F m \\overline{3} m$ structure includes imaginary phonon frequencies despite its capacity for hightemperature stabilization, which is consistent with the phonon calculations by Wang et al. ${ }^{60}$ Therefore, anharmonic phonon effects, ${ }^{\\mathbf{6 1 , 6 2}}$ which are particularly significant at high temperatures, must be considered for these materials.\n\n\\section{Conclusion}\nWe have constructed a prediction model for the $E_{\\mathrm{v}}$ values of various crystal structures of $\\mathrm{ZrO}_{2}$ using a linearized $\\mathrm{RR}$ with 11 unit-cell descriptors. The predicted $E_{\\mathrm{v}}$ was used as the fitness value for crystal structure constructions based on the evolutionary algorithm in order to mainly construct crystal structures having $E_{\\mathrm{v}}$ lower than that of the ground-state $P 2_{1} / c$ structure. Our prediction model guarantees prediction errors of less than $\\sim 0.15 \\mathrm{eV}$ for various crystal structures of $\\mathrm{ZrO}_{2}$.\n\nWe also obtained the $E_{\\mathrm{m}}$ values of various crystal structures of $\\mathrm{ZrO}_{2}$, and found that this property is correlated with $E_{\\mathrm{v}}$. On the basis of this correlation, we calculated the $E_{\\mathrm{m}}$ values of several newly constructed crystal structures having low $E_{\\mathrm{v}}$, and confirmed that these $E_{\\mathrm{m}}$ values are also lower than those of the ground-state $P 2_{1} / c$ structure and lower than or similar to those of the $\\mathrm{P}_{2} / \\mathrm{nmc}$ and $F m \\overline{3} \\mathrm{~m}$ structures.\n\nWe have successfully discovered various crystal structures with low $E_{\\mathrm{v}}$ and $E_{\\mathrm{m}}$ values for $\\mathrm{ZrO}_{2}$ by the direct construction of crystal structures based on a combination of evolutionary algorithm and regression analysis and by reconsidering the crystal structures present in other oxides. Our DFT-unit-cell descriptors are constructed on the basis of the properties related to the chemical bonds between cations and $\\mathrm{O}$. Therefore, the good accuracy of the prediction model for $E_{\\mathrm{v}}$ and the correlation between the $E_{\\mathrm{v}}$ and $E_{\\mathrm{m}}$ may be reasonable because these properties are all related to the chemical bond cleavage. We expect that the method employed in this study can be applied to determine unknown low- $E_{\\mathrm{v}}$ and $-E_{\\mathrm{m}}$ crystal structures of other material systems, which have not been investigated closely. In addition, the strategy described herein can be also applied to search for crystal structures with other functional properties.\n\n\\section{Conflicts of interest}\nThere are no conflicts to declare.\n\n\\section{Acknowledgements}\nThe authors thank Dr N. Nagasako in TCRDL for fruitful discussions.\n\n\\section{References}\n1 P. Knauth and H. L. Tuller, J. Am. Ceram. Soc., 2002, 85, 16541680.\n\n2 S. J. Skinner and J. A. Kilner, Mater. Today, 2003, 6, 30-37.\n\n3 S. C. Singhal and K. Kendall, High-temperature solid oxide fuel cells: fundamentals, design and applications, Elsevier, 2003.\n\n4 P. J. Gellings and H. Bouwmeester, Handbook of solid state electrochemistry, CRC Press, 1997.\n\n5 M. Mogensen, N. M. Sammes and G. A. Tompsett, Solid State Ionics, 2000, 129, 63-94.\n\n6 N. Sammes, G. Tompsett, H. Näfe and F. Aldinger, J. Eur. Ceram. Soc., 1999, 19, 1801-1826.\n\n7 K. Shitara, T. Moriasa, A. Sumitani, A. Seko, H. Hayashi, Y. Koyama, R. Huang, D. Han, H. Moriwake and I. Tanaka, Chem. Mater., 2017, 29, 3763-3768.\n\n8 K. Huang and J. B. Goodenough, J. Alloys Compd., 2000, 303, 454-464.\n\n9 T. Ishihara, H. Matsuda and Y. Takita, J. Am. Chem. Soc., 1994, 116, 3801-3803.\n\n10 X. Kuang, M. A. Green, H. Niu, P. Zajdel, C. Dickinson, J. B. Claridge, L. Jantsky and M. J. Rosseinsky, Nat. Mater., $2008,7,498-504$.\n\n11 A. R. Oganov and C. W. Glass, J. Chem. Phys., 2006, 124, 244704.\n\n12 A. R. Oganov, C. W. Glass and S. Ono, Earth Planet. Sci. Lett., 2006, 241, 95-103.\n\n13 A. R. Oganov, J. Chen, C. Gatti, Y. Ma, Y. Ma, C. W. Glass, Z. Liu, T. Yu, O. O. Kurakevych and V. L. Solozhenko, Nature, 2009, 457, 863-867.\n\n14 Y. Shen, A. R. Oganov, G. Qian, J. Zhang, H. Dong, Q. Zhu and Z. Zhou, Sci. Rep., 2015, 5, 14204.\n\n15 A. R. Oganov and A. O. Lyakhov, J. Superhard Mater., 2010, 32, 143-147.\n\n16 Q. Zeng, A. R. Oganov, A. O. Lyakhov, C. Xie, X. Zhang, J. Zhang, Q. Zhu, B. Wei, I. Grigorenko and L. Zhang, Acta Crystallogr., Sect. C: Struct. Chem., 2014, 70, 76-84.\n\n17 C. G. Van de Walle and J. Neugebauer, J. Appl. Phys., 2004, 95, 3851-3879.\n\n18 P. Hohenberg and W. Kohn, Phys. Rev., 1964, 136, B864B871.\n\n19 W. Kohn and L. J. Sham, Phys. Rev., 1965, 140, A1133-A1138.\n\n20 A. Seko, T. Maekawa, K. Tsuda and I. Tanaka, Phys. Rev. B, $2014,89,054303$.\n\n21 J. Lee, A. Seko, K. Shitara, K. Nakayama and I. Tanaka, Phys. Rev. $B, 2016,93,115104$.\n\n22 A. Seko, A. Takahashi and I. Tanaka, Phys. Rev. B, 2014, 90, 024101.\n\n23 A. M. Deml, A. M. Holder, R. P. O'Hayre, C. B. Musgrave and V. Stevanović, J. Phys. Chem. Lett., 2015, 6, 1948-1953. 24 A. Jain, S. P. Ong, G. Hautier, W. Chen, W. D. Richards, S. Dacek, S. Cholia, D. Gunter, D. Skinner, G. Ceder and K. A. Persson, Appl. Phys. Lett. Mater., 2013, 1, 011002.\n\n25 K. Momma and F. Izumi, J. Appl. Crystallogr., 2011, 44, 12721276.\n\n26 A. E. Hoerl and R. W. Kennard, Technometrics, 1970, 12, 5567.\n\n27 A. R. Oganov, A. O. Lyakhov and M. Valle, Acc. Chem. Res., $2011,44,227-237$.\n\n28 A. O. Lyakhov, A. R. Oganov, H. T. Stokes and Q. Zhu, Comput. Phys. Commun., 2013, 184, 1172-1182.\n\n29 P. E. Blöchl, Phys. Rev. B, 1994, 50, 17953-17979.\n\n30 G. Kresse and D. Joubert, Phys. Rev. B, 1999, 59, 1758-1775.\n\n31 G. Kresse and J. Furthmüller, Comput. Mater. Sci., 1996, 6, 15-50.\n\n32 G. Kresse and J. Furthmüller, Phys. Rev. B, 1996, 54, 1116911186.\n\n33 J. P. Perdew, K. Burke and M. Ernzerhof, Phys. Rev. Lett., 1996, 77, 3865-3868.\n\n34 S. L. Dudarev, G. A. Botton, S. Y. Savrasov, C. J. Humphreys and A. P. Sutton, Phys. Rev. B, 1998, 57, 1505-1509.\n\n35 V. Stevanović, S. Lany, X. Zhang and A. Zunger, Phys. Rev. B, $2012,85,115104$.\n\n36 A. Togo, F. Oba and I. Tanaka, Phys. Rev. B, 2008, 78, 134106.\n\n37 A. Togo, L. Chaput, I. Tanaka and G. Hug, Phys. Rev. B, 2010, 81, 174301.\n\n38 G. Henkelman, B. P. Uberuaga and H. Jónsson, J. Chem. Phys., 2000, 113, 9901-9904.\n\n39 G. Henkelman and H. Jónsson, J. Chem. Phys., 2000, 113, 9978-9985.\n\n40 M. Shishkin and G. Kresse, Phys. Rev. B, 2007, 75, 235102.\n\n41 J. D. Evans, Straightforward statistics for the behavioral sciences, Brooks/Cole, 1996.\n\n42 A. Eichler, Phys. Rev. B, 2001, 64, 174103.\n\n43 J. Zheng, G. Ceder, T. Maxisch, W. Chim and W. Choi, Phys. Rev. $B, 2007,75,104112$.\n\n44 A. S. Foster, V. Sulimov, F. L. Gejo, A. Shluger and R. M. Nieminen, Phys. Rev. B, 2001, 64, 224108.\n\n45 J.-H. Hur, S. Park and U.-I. Chung, J. Appl. Phys., 2012, 112, 113719.\n\n46 W.-J. Yin, S.-H. Wei, M. M. Al-Jassim and Y. Yan, Appl. Phys. Lett., 2011, 99, 142109. 47 S. Kasamatsu, T. Tada and S. Watanabe, Appl. Phys. Express, 2009, 2, 061402.\n\n48 J. Hirschfeld and H. Lustfeld, Phys. Rev. B, 2011, 84, 224308.\n\n49 B. Liu, H. Xiao, Y. Zhang, D. S. Aidhy and W. J. Weber, Comput. Mater. Sci., 2014, 92, 22-27.\n\n50 O. I. Malyi, P. Wu, V. V. Kulish, K. Bai and Z. Chen, Solid State Ionics, 2012, 212, 117-122.\n\n51 J. Mulroue and D. Duffy, Proc. R. Soc. A, 2011, 467, 20542065.\n\n52 P. Erhart and K. Albe, Phys. Rev. B, 2006, 73, 115207.\n\n53 D. S. Aidhy, B. Liu, Y. Zhang and W. J. Weber, J. Phys. Chem. $C, 2014,118,30139-30144$.\n\n54 M. Oka, H. Kamisaka, T. Fukumura and T. Hasegawa, Phys. Chem. Chem. Phys., 2015, 17, 29057-29063.\n\n55 O. Ohtaka, T. Yamanaka, S. Kume, N. Hara, H. Asano and F. Izumi, Proc. Jpn. Acad., Ser. B, 1990, 66, 193-196.\n\n56 J. Dewhurst and J. Lowther, Phys. Rev. B, 1998, 57, 741.\n\n57 E. H. Kisi, C. J. Howard and R. J. Hill, J. Am. Ceram. Soc., 1989, 72, 1757-1760.\n\n58 T. T. Mayeshiba and D. D. Morgan, Solid State Ionics, 2016, 296, 71-77.\n\n59 R. Merkle, Y. A. Mastrikov, E. A. Kotomin, M. M. Kuklja and J. Maier, J. Electrochem. Soc., 2011, 159, B219-B226.\n\n60 G. Wang, G. Luo, Y. L. Soo, R. F. Sabirianov, H.-J. Lin, W.-N. Mei, F. Namavar and C. L. Cheung, Phys. Chem. Chem. Phys., 2011, 13, 19517-19525.\n\n61 O. Hellman, I. A. Abrikosov and S. I. Simak, Phys. Rev. B, $2011,84,180301$.\n\n62 P. Souvatzis, O. Eriksson, M. I. Katsnelson and S. P. Rudin, Phys. Rev. Lett., 2008, 100, 095901.\n\n63 E. Artacho, E. Anglada, O. Diéguez, J. D. Gale, A. García, J. Junquera, R. M. Martin, P. Ordejón, J. M. Pruneda and D. Sánchez-Portal, J. Phys.: Condens. Matter, 2008, 20, 064208.\n\n64 P. Giannozzi, S. Baroni, N. Bonini, M. Calandra, R. Car, C. Cavazzoni, D. Ceresoli, G. L. Chiarotti, M. Cococcioni and I. Dabo, J. Phys.: Condens. Matter, 2009, 21, 395502.\n\n65 J. P. Perdew, J. A. Chevary, S. H. Vosko, K. A. Jackson, M. R. Pederson, D. J. Singh and C. Fiolhais, Phys. Rev. B, $1992,46,6671-6687$.\n\n66 D. Vanderbilt, Phys. Rev. $B, 1990,41,7892-7895$.\n\n\n\\end{document}", "record_id": "2023_09_22_f8875eb68affb0a6cb2bg"}