{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Unveiling the superconducting mechanism of $\\mathbf{B a}_{0.51} \\mathbf{K}_{0.49} \\mathbf{B i O}_{3}$ }\n\n\n\\author{C. H. P. Wen, ${ }^{1}$ H. C. Xu,,${ }^{1}{ }^{*}$ Q. Yao, ${ }^{1}$ R. Peng, ${ }^{1} X$. H. Niu, ${ }^{1}$ Q. Y. Chen, ${ }^{2}$ Z. T. Liu, ${ }^{3,4}$\\\\\nD. W. Shen, ${ }^{3,4}$ Q. Song, ${ }^{1}$ X. Lou, ${ }^{1}$ Y. F. Fang, ${ }^{1}$ X. S. Liu, ${ }^{1}$ Y. H. Song, ${ }^{1}$ Y. J. Jiao, ${ }^{5,6}$\\\\\nT. F. Duan,,$^{5,6}$ H. H. Wen, ${ }^{5,6}$ P. Dudin, ${ }^{7}$ G. Kotliar, ${ }^{8}$ Z. P. Yin,, 9 t and D. L. Feng ${ }^{1,6,4}$\\\\\n${ }^{1}$ State Key Laboratory of Surface Physics, Department of Physics,\\\\\nand Laboratory of Advanced Materials, Fudan University,\\\\\nShanghai 200438, People's Republic of China\\\\\n${ }^{2}$ Science and Technology on Surface Physics and Chemistry Laboratory, Mianyang 621908, China\\\\\n${ }^{3}$ CAS Center for Excellence in Superconducting Electronics (CENSE), Shanghai 200050, China\\\\\n${ }^{4}$ State Key Laboratory of Functional Materials for Informatics,\\\\\nShanghai Institute of Microsystem and Information Technology (SIMIT),\\\\\nChinese Academy of Sciences, Shanghai 200050, China\\\\\n${ }^{5}$ National Laboratory of Solid State Microstructures and Department of Physics,\\\\\nNanjing University, Nanjing 210093, China\\\\\n${ }^{6}$ Collaborative Innovation Center of Advanced Microstructures, Nanjing 210093, China\\\\\n${ }^{7}$ Diamond Light Source, Harwell Science and Innovation\\\\\nCampus, Didcot OX11 ODE, United Kingdom\\\\\n${ }^{8}$ Department of Physics, Rutgers University,\\\\\nPiscataway, New Jersey 08854, U.S.A.\\\\\n${ }^{9}$ Department of Physics and Center for Advanced Quantum Studies,\\\\\nBeijing Normal University, Beijing 100875, China}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\n(Dated: March 1, 2018) Bismuthates were the first family of oxide high-temperature superconductors 1 , exhibiting superconducting transition temperatures ( $T_{c}$ ) up to $32 \\mathrm{~K}$ (Refs. 2 and 3 ), but the superconducting mechanism remains under debate despite more than 30 years of extensive research. Our angle-resolved photoemission spectroscopy studies on $\\mathrm{Ba}_{0.51} \\mathbf{K}_{0.49} \\mathrm{BiO}_{3}$ reveal an unexpectedly $34 \\%$ larger bandwidth than in conventional density functional theory calculations. This can be reproduced by calculations that fully account for long-range Coulomb interactions - the first direct demonstration of bandwidth expansion due to the Fock exchange term, a long-accepted and yet uncorroborated fundamental effect in many body physics ${ }^{4}$. Furthermore, we observe an isotropic superconducting gap with $2 \\Delta_{0} / \\mathbf{k}_{B} \\mathbf{T}_{\\mathrm{c}}=3.51 \\pm 0.05$, and strong electron-phonon interactions with a coupling constant $\\lambda \\sim 1.3 \\pm 0.2$. These findings solve a long-standing mystery $-\\mathbf{B a}_{0.51} \\mathbf{K}_{0.49}$ BiO $_{3}$ is an extraordinary Bardeen-CooperSchrieffer (BCS) superconductor, where long-range Coulomb interactions expand the bandwidth, enhance electron-phonon coupling, and generate the high $\\mathbf{T}_{\\mathrm{c}}$. Such effects will also be critical for finding new superconductors.\n\nThe phase diagram of bismuthate superconductors fits the paradigm of high-temperature superconductivity emerging near a competing broken-symmetry phase. As shown in Figs. $1 \\mathrm{a}-\\mathrm{b}, \\mathrm{BaBiO}_{3}$ is a perovskite-like insulator with a $\\sim 2 \\mathrm{eV}^{\\text {band }}$ gap ${ }^{\\underline{5}}$, where a commensurate charge density wave (CDW) doubles the unit cell and is accompanied by breathing and tilting distortions of the $\\mathrm{BiO}_{6}$ octahedra ${ }^{6-\\underline{\\underline{-}}}$. With potassium doping, the CDW is suppressed and superconductivity develops, reaching its highest $T_{c}$ of $32 \\mathrm{~K}$ at $\\mathrm{Ba}_{1-x} \\mathrm{~K}_{x} \\mathrm{BiO}_{3}$ with $x \\sim 0.35$ (Ref. 9). These $T_{c} \\mathrm{~s}$ are much higher than those of conventional phonon-mediated superconductors with a similar density of states at the Fermi energy 9-11. However, unlike cuprates or iron-based superconductors where superconductivity emerges near magnetic order, there is no magnetic phase anywhere in the phase diagrams of the bismuthate superconductors, suggesting a nonmagnetic pairing mechanism ${ }^{9,10}$.\n\nTwo pictures have emerged to explain the bismuthates' long-debated pairing mechanism. One, rooted in the chemistry of the compound, posits that Cooper pairs form locally. The nominal $\\mathrm{Bi}^{4+}$ valence is not energetically favorable and charge disproportionates into $\\mathrm{Bi}^{3+}$ and $\\mathrm{Bi}^{5+}\\left(\\mathrm{Refs}^{12} 12\\right.$ and 13), although the actual charge difference is much smaller than assumed in an ionic picture ${ }^{14,15}$. Electron pairs preferentially occupying one sublattice could give rise to the insulating CDW state. Upon increasing doping, the charge disproportionation weakens and eventually disappears, but the electron pairs may survive and Bose condense, leading to superconductivity ${ }^{13,16}$. It has also been stressed that one should think of these as negative charge-transfer materials, in which the holes introduced upon doping reside mainly in oxygen states of $A_{1 g}$ symmetry around the Bi sites ${ }^{7,17,18}$.\n\nAn alternative picture posits that the pairing in the bismuthates is due to strong electron-phonon coupling, with a model of electrons coupled to optical phonons introduced for $\\mathrm{BaPb}_{x} \\mathrm{Bi}_{1-x} \\mathrm{O}_{3}{ }^{19}$. Early density functional theory (DFT) calculations, however, found an electron-phonon coupling (EPC) constant $\\lambda$ of $0.34$, far too small to account for the high $T_{c}$ (Ref. 20). More recently, it has been argued that the long range Coulomb interactions (LRCI) were underestimated in bismuthates, since they are nearly insulators and the screening should be weak. Consequently, the electron-phonon coupling is underestimated by DFT coupled with semi-local exchange-correlation functionals such as local density approximation (LDA) and generalized gradient approximation $(\\mathrm{GGA})^{21}$. When LRCI exchange terms are considered using the screened hybrid functionals and the GW method, the calculated bandwidth is significantly broadened, and electron-phonon coupling is increased substantially to $\\lambda \\simeq 1$, which could account for the high $T_{c}$ of $\\sim 30 \\mathrm{~K}$ (Ref. 21 ). Furthermore, with such a large $\\lambda$, dynamical mean field theory (DMFT) calculations reproduce the main features of optical conductivity studies ${ }^{22}$. However, the band expansion effect of LRCI has never been directly corroborated in any real material ${ }^{4}$.\n\nTo clarify the superconducting mechanism of this important superconductor family, it is crucial to obtain a comprehensive understanding of its electronic structure and superconducting gap structure, which remain unknown. As one of the most direct probes of these properties, angleresolved photoemission spectroscopy (ARPES) studies on bismuthate superconductors are still lacking, possibly due to the difficult-to-cleave three-dimensional crystal structure and insufficient sample quality. Here we perform ARPES measurements on the electronic structure of high quality $\\mathrm{Ba}_{0.51} \\mathrm{~K}_{0.49} \\mathrm{BiO}_{3}$ single crystals with a $T_{c}$ of $22 \\mathrm{~K}$ (Fig. $1 \\mathrm{c}$ ), which is consistent with the reported phase diagram (Fig. $1 \\mathrm{1b}$ ).\n\nThe three-dimensional Fermi surface structure is revealed by the combination of $k_{z}$ dependent and in-plane photoemission intensity maps at the Fermi energy (Figs. 2a-c). The Fermi surface cross-sections in the ГZX plane match the period of the Brillouin zones when assuming an inner potential of $7 \\mathrm{eV}$ (Fig.2b) and match the cross-section in the ГMX plane (Fig.2.) as expected. The Fermi surface is a rounded cube shape centered at $\\Gamma$, consistent with theoretical calculations ${ }^{20,23,24}$. Based on the Fermi surface volume and Luttinger's theorem ${ }^{25}$, the electron carrier density is estimated to be $0.48 \\pm 0.05 \\mathrm{e}^{-} /$unit cell. The photoemission intensity along $\\Gamma-X$ shows three bands near the Fermi energy (Fig. $2 \\mathrm{~d}$ ). The energy distribution curves (EDCs, Fig. 2e) show two flat bands $(\\beta$ and $\\gamma$ ) around $3 \\mathrm{eV}$ below the Fermi energy, while the momentum distribution curves (MDCs) show an electron-like band ( $\\alpha$ ) crossing the Fermi level (Fig. 2f) to form the electron-like Fermi surface (Figs. 2b-c).\n\nAt $\\Gamma, \\alpha$ and $\\beta$ are degenerate as shown by the calculations (Fig. $2 \\mathrm{~g}$ ). The measured occupied bandwidth of $\\alpha$ is unexpectedly $\\sim 34 \\%$ larger than that calculated using GGA, in stark contrast to the cuprate and iron-based superconductors, where the electronic bands are strongly renormalized to be much narrower than the DFT-LDA/GGA bandwidth due to short-range Coulomb interactions. Our findings indicate that the short-range Coulomb interaction strength is very weak in $\\mathrm{Ba}_{0.51} \\mathrm{~K}_{0.49} \\mathrm{BiO}_{3}$, fundamentally different from in cuprate and iron-based superconductors. On the other hand, the highly-dispersing $\\alpha$ band is reproduced excellently by DFT-HSE06 calculations (using Heyd-Scuseria-Ernzerhof hybrid functional, Fig. $2 \\mathrm{~g}$ ), without any tuning parameter. A slight discrepancy near the $\\alpha$ band bottom leads to a $\\sim 8 \\%$ narrower occupied bandwidth than in the HSE06 calculation, perhaps arising from uncertainty due to broad photoemission features, or finite but weak short-range Coulomb interactions. The HSE06 hybrid functional (and GW method) includes the long-range exchange interaction, which results from LRCI and is largely omitted in the semi-local LDA and GGA functionals. This exchange interaction tends to delocalize conduction electrons and increase their kinetic energy and bandwidth 4 . LRCI often plays an important role in systems with low carrier density or poor screening, such as Mott insulators ${ }^{26}$, semiconductors $^{27}$, and semimetals ${ }^{28}$, and the near-perfect reproduction of the observed bandwidth by HSE06 here indicates that it plays an important role in the bismuthate superconductors, likely because bismuthates are near an insulating phase. As discussed later, this interaction not only expands the electronic bands, but also has a profound impact on the lattice dynamics and electronphonon interaction.\n\nThe temperature dependence of the superconducting gap is investigated at the Fermi momentum $\\left(k_{F}\\right)$ along $\\Gamma \\mathrm{X}$ in the $\\Gamma \\mathrm{MX}$ plane using $30 \\mathrm{eV}$ photons (Fig. $3 \\mathrm{a}$ ). At $10 \\mathrm{~K}$, the symmetrized photoemission intensity is suppressed at $E_{F}$, indicating the opening of an energy gap. Upon increasing temperature, the gap gradually decreases and finally closes at $21 \\mathrm{~K}$, consistent with the $T_{c}$ measured by magnetic susceptibility (Fig. 1tc). Below $T_{c}$, the symmetrized EDCs integrated around $k_{F}$ show a superconducting gap with a coherence peak (Fig. 3b). We fit the EDCs to the Dynes function ${ }^{29}, N(E, \\Gamma)=\\left|\\operatorname{Re}\\left[(E-i \\Gamma) / \\sqrt{(E-i \\Gamma)^{2}-\\Delta^{2}}\\right]\\right|$, where $N(E, \\Gamma)$ is the measured spectrum, $\\Delta$ is the gap and $\\Gamma$ is a broadening term (also called the scattering rate). After convolving the energy resolution, we get $\\Delta(10 \\mathrm{~K})=2.9 \\mathrm{meV}$ and $\\Gamma(10 \\mathrm{~K})=0.04 \\mathrm{meV}$. Upon increasing temperature, the coherence peak intensity decreases and the gap closes. The temperature dependence of the gap fits well to the BCS formula, giving a $2 \\Delta(0) / k_{B} T_{c}$ of $3.51 \\pm 0.05$, consistent with previous reports on overdoped samples ${ }^{30}$. The superconducting gap structure in momentum space, which reflects the pairing symmetry, was investigated along the Fermi surface cross-sections in the high-symmetry ГMX and ГZX planes (Figs. 3]d and e). As shown by the dashed lines tracking the coherence peaks, the gap remains constant within our uncertainty, indicating an isotropic gap.\n\nUpon closer inspection of the ARPES spectra near $k_{F}$, a kink in the dispersion can be observed around a binding energy of $50 \\mathrm{meV}$ (Fig. 4a), which is the signature of electron-boson interactions $^{31}$. In the dispersion extracted from the Lorentz fitting on the MDCs (Fig. 4b), the slope between $E_{F}-50 \\mathrm{meV}$ and $E_{F}$ gives the Fermi velocity, $v_{F}$, and the slope on a larger energy scale approximates the bare-band Fermi velocity, $v_{F}^{0}$. Their difference indicates a strongly enhanced band mass. The difference between the low energy dispersion and the polynomial fit of the bare band gives the real part of the self-energy, $\\operatorname{Re} \\Sigma$ (Fig. 4k), which shows a maximum around $50 \\mathrm{meV}$. The full-width at half-maximum (FWHM) of the MDCs also exhibits a prominent increase around $50 \\mathrm{meV}$ (Fig. 4 d), indicating a major change in the quasiparticle lifetime. The quasiparticle lifetime at $E_{F}$ is not infinite as expected for an ideal Fermi liquid, since the FWHM is finite at $E_{F}$ due to extrinsic experimental angular broadening. To exclude this, we subtract the minimum value of the FWHM around $E_{F}$ as a constant background; then the FWHM is multiplied by $v_{F}^{0}$ to obtain the imaginary part of the self-energy, $\\operatorname{Im} \\Sigma$. The $\\operatorname{Re} \\Sigma$ from the Kramers-Kronig transformation of $\\operatorname{Im} \\Sigma$ matches well with that obtained from the dispersion (Fig. 4c), indicating that $\\operatorname{Re} \\Sigma$ and $\\operatorname{Im} \\Sigma$ are self-consistent (Supplementary Fig. S2). The kink and the abrupt change of $\\operatorname{Im} \\Sigma$ within $[-35 \\mathrm{meV},-70 \\mathrm{meV}]$ demonstrate strong interactions between electrons and bosonic modes, and coincide with an oxygen-breathing mode found around $60 \\mathrm{meV}$ by neutron scattering (Fig. 4e) ${ }^{32}$ and predicted to couple with electrons most strongly ${ }^{21}$. Therefore, the observed self-energy behavior is most likely due to strong coupling of the conduction band to the oxygenbreathing phonon.\n\nThe electron-phonon coupling strength, $\\lambda$, is central to the controversy around the superconducting mechanism of $\\mathrm{Ba}_{1-x} \\mathrm{~K}_{x} \\mathrm{BiO}_{3}$. In a simple estimate $\\lambda=v_{F}^{0} / v_{F}-1=1.4$. Alternatively, one can compute $\\lambda$ from the self-energy. According to the Migdal-Eliashberg formalism, the electronphonon spectral function, $\\alpha^{2} F(\\omega, k)$, is obtained by the derivative of $\\operatorname{Im} \\Sigma(\\omega)$, which is in good agreement with the phonon DOS (Fig.4 ) . Then the coupling strength $\\lambda$ is calculated to be $1.3 \\pm$ $0.2$ (Ref. 31). Using the McMillan equation, $T_{c}=\\left(\\Theta_{D} / 1.45\\right) \\exp \\left\\{-1.04(1+\\lambda) /\\left[\\lambda-\\mu^{*}(1+0.62 \\lambda)\\right]\\right\\}$ with the Debye temperature $\\Theta_{D}=280 \\mathrm{~K}$ (Ref. 11) and $\\lambda=1.3$, we get $T_{c}=22 \\mathrm{~K}$ with a Coulomb pseudopotential parameter $\\mu^{*}=0.11$, which is within the usual assigned range of $0.1 \\sim 0.15$. Thus the large $\\lambda$ is sufficient to explain the high $T_{c}$ of this bismuthate superconductor. Based on this analysis and the observed self-energy behavior and isotropic gap structure, we conclude that $\\mathrm{Ba}_{0.51} \\mathrm{~K}_{0.49} \\mathrm{BiO}_{3}$ is a $\\mathrm{BCS}$ superconductor.\n\nRevealing the electron-phonon coupling strength is essential for a quantitative understanding of both the conventional BCS superconductors ${ }^{33.34}$, and even some unconventional superconductors where electron-phonon coupling plays a substantial role, such as monolayer $\\mathrm{FeSe} / \\mathrm{SrTiO}_{3}{ }^{35,36}$. When the electronic self-energy $\\Sigma(k, \\omega)$ is negligible, linear response calculations based on LDA/GGA can compute the electron-phonon coupling strength well. However, a large LRCI, as in $\\mathrm{Ba}_{0.51} \\mathrm{~K}_{0.49} \\mathrm{BiO}_{3}$, leads to a large momentum-dependent self-energy and an expansion of the electronic band $\\varepsilon(k) \\approx(1+a) \\varepsilon_{L D A}(k)+b$. As a result, the electron-phonon dynamical matrix element is roughly $(1+a)$ times the LDA/GGA value and the mode-dependent electron-phonon coupling strength is roughly $(1+a)^{2}$ times stronger. In $\\mathrm{Ba}_{0.51} \\mathrm{~K}_{0.49} \\mathrm{BiO}_{3}$, the GGA conduction bandwidth is $\\sim 2.8 \\mathrm{eV}$ whereas the HSE06 bandwidth is $\\sim 3.9 \\mathrm{eV}$, resulting in $a=0.4$ and a factor of $\\sim 2$ enhancement of the GGA electron-phonon coupling strength. Furthermore, the LRCI tends to delocalize electrons and overcome the over-binding problem of LDA and GGA, which gives the correct band gap for the insulating parent compound $\\mathrm{BaBiO}_{3}$ and a further enhancement of the LDA/GGA electron-phonon coupling. It was found that the combined effects due to the inclusion of LRCI result in the average coupling strength between electrons and oxygen breathing and stretching phonons to be $\\sim 1.0$, a factor of $\\sim 3$ enhancement over the LDA electron-phonon coupling strength ${ }^{21}$. The agreement between this calculation and our experimental findings highlights the profound impact of the LRCI on electron-phonon coupling.\n\nThe observed large bandwidth that can only be correctly reproduced by including long-range exchange interactions constitutes the first demonstration of significant bandwidth expansion introduced by the Fock term, i.e. LRCI, in the Hartree-Fock treatment of a many-body system. The exchange-hole effects reduce the electronic energy unequally in momentum space and thus expand the bands, as elaborated in many textbooks, for example in Fig. $17.1$ of Ashcroft \\& Mermin's Solid State Physics 4 . In real materials, there are always two opposite effects with comparative orders of magnitude - the frequency dependence of self-energy due to short-range Coulomb interactions narrows the bands, while the momentum dependence of self-energy arising from LRCI expands them. For metals with $s$ and $p$ orbitals, the bandwidth calculated by LDA or GGA is usually within $10 \\%$ of the experimental value, making it difficult to separate these two effects. In $\\mathrm{Ba}_{0.51} \\mathrm{~K}_{0.49} \\mathrm{BiO}_{3}$, the narrowing effect is small, while the expansion effect is huge, which provides a unique opportunity to uncover the LRCI band expansion. Our data and calculations represent the first direct demonstration of this fundamental effect.\n\nTo summarize, we here present the first comprehensive characterization of the electronic structure of a bismuthate superconductor, showing that $\\mathrm{Ba}_{0.51} \\mathrm{~K}_{0.49} \\mathrm{BiO}_{3}$ is a benchmark $\\mathrm{BCS}$ superconductor with an isotropic superconducting gap and $2 \\Delta / k_{B} T_{c}=3.51 \\pm 0.05$. The sizable electronphonon coupling strength $(\\lambda \\approx 1.3)$ can account for the high $T_{c}$, solving a 30-year mystery. Moreover, the remarkable agreement between our data and the screened hybrid functional calculations represents the first direct experimental proof that including long-range Coulomb interactions is crucial for compounds with low carrier density or poor screening, even if the on-site Coulomb interactions are weak, so that one can overcome the over-binding problem of LDA or GGA and obtain the correct band structure and electron-phonon coupling strength. This is particularly critical for the reliable prediction of new superconductors.\n\n\\section{Methods}\nSample synthesis and characterization: High quality $\\mathrm{Ba}_{0.51} \\mathrm{~K}_{0.49} \\mathrm{BiO}_{3}$ single crystals were synthesized by the self-flux method as described elsewhere $\\frac{37}{}$. The chemical composition was determined by electron probe micro-analysis (EPMA) and normalized to the stoichiometric value of Bi. The crystal structure was verified by x-ray diffraction (Supplementary Fig. S1). The superconductivity was confirmed through magnetic susceptibility measurements using a Quantum Design SQUID VSM.\n\nARPES measurements: The electronic structure in Fig. 2 was measured at Shanghai Synchrotron Radiation Facility beamline 09U with a Scienta DA30 analyzer, and the energy resolution was 18 meV. The superconducting gap was measured at Diamond Light Source beamline I05 with a Scienta R4000 analyzer, and the energy resolution was better than $4 \\mathrm{meV}$. The data in Fig. 4 were taken at Advanced Light Source (ALS) beamline 4.0.3 with a Scienta R8000 analyzer, and the energy resolution was $12 \\mathrm{meV}$. All samples were cleaved and measured under a vacuum better than $5 \\times 10^{-11} \\mathrm{mBar}$.\n\nARPES spectra analysis: According to the Migdal-Eliashberg formalism, the electron-phonon spectral function, $\\alpha^{2} F(\\omega, k)$, is related to the imaginary part of the self-energy by $\\operatorname{Im} \\Sigma(\\omega)=$ $\\pi \\int_{0}^{\\omega_{\\max }} \\alpha^{2} F(\\omega) \\mathrm{d} \\omega$. Thus we calculate $\\alpha^{2} F(\\omega, k)$ by the derivative of $\\operatorname{Im} \\Sigma(\\omega)$. Then the coupling strength is calculated according to the formula $\\lambda=2 \\int_{0}^{\\omega_{\\max }} \\alpha^{2} F(\\omega, k) / \\omega \\mathrm{d} \\omega$ (Ref. 31). Band structure calculations: Band structures were calculated using the VASP package $e^{38}$ with\n\nGGA (in the Perdew-Burke-Ernzerhof form ${ }^{39}$ ) and HSE06 exchange-correlation functionals ${ }^{40.41}$. We used the simple-cubic perovskite structure with lattice constant $a=4.27 \\AA$, an energy cutoff of $500 \\mathrm{eV}$ and a $20 \\times 20 \\times 20 k$ mesh in both DFT-GGA and DFT-HSE06 calculations.\n\n\\section{Acknowledgements}\nWe gratefully acknowledge enlightening discussions with Prof. Z.-X. Shen, Prof. C. M. Varma, Prof. G. A. Sawatzky and Dr. D. Peets, and the experimental support of Dr. J. Denlinger, Dr. Q. Q. Ge, Dr. Y. B. Huang, Dr. Z. H. Chen, Dr. T. Kim., and Dr. Z. Sun, We thank the Diamond Light Source for time on beam line I05 under Proposal No. SI11914, the Shanghai Synchrotron Radiation Facility for access to beamline 9U, and the Advanced Light Source for access to beamline 4.0.3. Some preliminary data were taken at National Synchrotron Radiation Laboratory (NSRL, China). This work is supported by the National Key R\\&D Program of the MOST of China (Grants Nos. 2016YFA0300200, 2017YFA0303004, 2016YFA0302300, and 2016YFA0300400), the National Natural Science Foundation of China (Grants Nos. 11574337, 11227902, U1332209, 11704073, 11504342, 11674030, and 11534005), and the Fundamental Research Funds for the Central Universities (Grant No. 310421113). The calculations used high performance computing cluster of Beijing Normal University in Zhuhai.\n\n\\section{Author contributions}\nSingle crystal samples were grown by Y. J. J., T. F. D., and H. H. W.. ARPES measurements were performed by C. H. P. W., R. P., Q. Y., X. H. N., Q. Y. C., Z. T. L., D. W. S. and Q. S.. Sample characterization was performed by C. H. P. W., Q. Y., X. L., Y. F. F., X. S. L., and Y. H. S. The data analysis was performed by C. H. P. W., H. C. X., R. P., and D. L. F.. Z. P. Y. performed the calculations, Z. P. Y. and G. K. contributed to the theoretical interpretation of the experiments. D. L. F., H. C. X., R. P., Z. P. Y., C. H. P. W. and Q. Y. wrote the manuscript. D. L. F. and H. H. W. coordinated the project. All authors have discussed the results and the interpretation.\n\n\\section{Additional information}\nSupplementary information is available in the online version of the paper. * \\href{mailto:xuhaichao@fudan.edu.cn}{xuhaichao@fudan.edu.cn}\n\n$\\dagger$ yinzhiping@ \\href{http://bnu.edu.cn}{bnu.edu.cn}\n\n$\\ddagger$ \\href{mailto:dlfeng@fudan.edu.cn}{dlfeng@fudan.edu.cn}\n\n1 A. W. Sleight, J. L. Gillson, and P. E. Bierstedt, Solid State Communications 17, 27 (1975).\n\n2 L. F. Mattheiss, E. M. Gyorgy, and D. W. Johnson, Physical Review B 37, 3745 (1988).\n\n3 R. J. Cava, B. Batlogg, J. J. Krajewski, R. Farrow, L. W. Rupp, A. E. White, K. Short, W. F. Peck, and T. Kometani, Nature 332, $814(1988)$.\n\n4 N. W. Ashcroft and N. D. Mermin, \"Solid State Physics,\" (Holt, Rinehart and Winston, 1976) Chap. 17, pp. 334-337.\n\n5 H. Sato, S. Tajima, H. Takagi, and S. Uchida, Nature 338, 241 (1989).\n\n6 S. Uchida, K. Kitazawa, and S. Tanaka, Phase Transitions 8,95 (1987).\n\n7 N. C. Plumb, D. J. Gawryluk, Y. Wang, Z. Ristic, J. Park, B. Q. Lv, Z. Wang, C. E. Matt, N. Xu, T. Shang, K. Conder, J. Mesot, S. Johnston, M. Shi, and M. Radovic, Physical Review Letters 117, 037002 (2016).\n\n8 K. Foyevtsova, A. Khazraie, I. Elfimov, and G. A. Sawatzky, Physical Review B 91, 121114 (2015).\n\n9 A. W. Sleight, Physica C: Superconductivity and its Applications 514, 152 (2015)\n\n10 B. Batlogg, R. J. Cava, L. W. Rupp, A. M. Mujsce, J. J. Krajewski, J. P. Remeika, W. F. Peck, A. S. Cooper, and G. P. Espinosa, Physical Review Letters 61, 1670 (1988).\n\n11 M. F. Hundley, J. D. Thompson, and G. H. Kwei, Solid State Communications 70, 1155 (1989).\n\n12 D. E. Cox and A. W. Sleight, Solid State Communications 19, 969 (1976).\n\n13 C. M. Varma, Physical Review Letters 61, 2713 (1988).\n\n14 Z. X. Shen, P. A. P. Lindberg, B. O. Wells, D. S. Dessau, A. Borg, I. Lindau, W. E. Spicer, W. P. Ellis, G. H. Kwei, K. C. Ott, J. S. Kang, and J. W. Allen, Physical Review B 40, 6912 (1989).\n\n15 J. T. W. de Hair and G. Blasse, Solid State Communications 12, 727 (1973).\n\n16 A. Taraphder, H. R. Krishnamurthy, R. Pandit, and T. V. Ramakrishnan, Physical Review B 52, 1368 (1995).\n\n17 A. Y. Ignatov, A. P. Menushenkov, and V. A. Chernov, Physica C: Superconductivity 271, 32 (1996).\n\n18 A. P. Menushenkov and K. V. Klementev, Journal of Physics: Condensed Matter 12, 3767 (2000).\n\n19 T. M. Rice and L. Sneddon, Physical Review Letters 47, 689 (1981).\n\n20 V. Meregalli and S. Y. Savrasov, Physical Review B 57, 14453 (1998). 21 Z. P. Yin, A. Kutepov, and G. Kotliar, Physical Review X 3, 021011 (2013).\n\n22 R. Nourafkan, F. Marsiglio, and G. Kotliar, Physical Review Letters 109, 017001 (2012).\n\n23 S. Sahrakorpi, B. Barbiellini, R. S. Markiewicz, S. Kaprzyk, M. Lindroos, and A. Bansil, Physical Review B 61, 7388 (2000).\n\n24 N. Hiraoka, T. Buslaps, V. Honkimäki, J. Ahmad, and H. Uwe, Physical Review B 75, 121101 (2007).\n\n25 J. M. Luttinger, Physical Review 119, 1153 (1960).\n\n26 R. Chitra and G. Kotliar, Physical Review Letters 84, 3678 (2000).\n\n27 D. Y. Qiu, F. H. da Jornada, and S. G. Louie, Physical Review B 93, 235435 (2016).\n\n28 D. S. L. Abergel and T. Chakraborty, Physical Review Letters 102, 056807 (2009).\n\n29 R. C. Dynes, V. Narayanamurti, and J. P. Garno, Physical Review Letters 41, 1509 (1978).\n\n30 A. Chainani, T. Yokoya, T. Kiss, S. Shin, T. Nishio, and H. Uwe, Physical Review B 64, 180509 (2001).\n\n31 P. Hofmann, I. Y. Sklyadneva, E. D. L. Rienks, and E. V. Chulkov, New Journal of Physics 11, 125005 (2009).\n\n32 C. K. Loong, P. Vashishta, R. K. Kalia, M. H. Degani, D. L. Price, J. D. Jorgensen, D. G. Hinks, B. Dabrowski, A. W. Mitchell, D. R. Richards, and Y. Zheng, Physical Review Letters 62, 2628 (1989)\n\n33 B. Cristina and Y. Tsutomu, Superconductor Science and Technology 14, R115 (2001).\n\n34 A. P. Drozdov, M. I. Eremets, I. A. Troyan, V. Ksenofontov, and S. I. Shylin, Nature 525, 73 (2015).\n\n35 J. J. Lee, F. T. Schmitt, R. G. Moore, S. Johnston, Y.-T. Cui, W. Li, M. Yi, Z. K. Liu, M. Hashimoto, Y. Zhang, D. H. Lu, T. P. Devereaux, D.-H. Lee, and Z.-X. Shen, Nature 515, 245 (2018).\n\n${ }^{36}$ Q. Song, T. L. Yu, X. Lou, B. P. Xie, H. C. Xu, C. H. P. Wen, Q. Yao, S. Y. Zhang, X. T. Zhu, J. D. Guo, R. Peng, and D. L. Feng, preprint: \\href{https://arxiv.org/abs/1710.07057}{https://arxiv.org/abs/1710.07057}.\n\n37 Y. Jiao, W. Cheng, Q. Deng, H. Yang, and H.-H. Wen, Physica C: Superconductivity and its Applications 545, 43 (2018).\n\n38 G. Kresse and J. Furthmüller, Computational Materials Science 6, 15 (1996).\n\n39 J. P. Perdew, K. Burke, and M. Ernzerhof, Physical Review Letters 77, 3865 (1996).\n\n40 A. V. Krukau, O. A. Vydrov, A. F. Izmaylov, and G. E. Scuseria, The Journal of Chemical Physics 125, 224106 (2006).\n\n41 T. M. Henderson, J. Paier, and G. E. Scuseria, Physica Status Solidi (B) 248, 767 (2011).\n\n42 S. Pei, J. D. Jorgensen, B. Dabrowski, D. G. Hinks, D. R. Richards, A. W. Mitchell, J. M. Newsam, S. K. Sinha, D. Vaknin, and A. J. Jacobson, Physical Review B 41, 4126 (1990). a\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d35eebe2e85cecf4103g-11_310_590_455_759}\n\\end{center}\n\nb\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d35eebe2e85cecf4103g-11_285_653_759_1236}\n\\end{center}\n\nc\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d35eebe2e85cecf4103g-11_257_653_1216_1652}\n\\end{center}\n\nFIG. 1. Crystal structure and phase diagram of $\\mathbf{B a}_{1-x} \\mathbf{K}_{x} \\mathbf{B i O}_{3} . \\mathbf{a}$, The perovskite-like crystal structure of $\\mathrm{Ba}_{1-x} \\mathrm{~K}_{x} \\mathrm{BiO}_{3}$. The purple shades illustrate the $\\mathrm{BiO}_{6}$ octahedra. b, Phase diagram of $\\mathrm{Ba}_{1-x} \\mathrm{~K}_{x} \\mathrm{BiO}_{3}$ according to Refs. 7 and 42. The abbreviations stand for charge density wave insulator (CDWI) and superconductor (SC). The red marker shows the doping and $T_{c}$ of our samples. c, Temperature dependence of the zero field-cooled (ZFC) and field-cooled (FC) magnetic susceptibility of our $\\mathrm{Ba}_{0.51} \\mathrm{~K}_{0.49} \\mathrm{BiO}_{3}$ single crystal measured at a magnetic field of $100 \\mathrm{Oe}$. The sample shows a diamagnetic response and $T_{c}=22 \\mathrm{~K}$. a\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d35eebe2e85cecf4103g-12_283_638_360_713}\n\\end{center}\n\nd\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d35eebe2e85cecf4103g-12_651_1090_367_739}\n\\end{center}\n\nb\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d35eebe2e85cecf4103g-12_256_655_770_1258}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d35eebe2e85cecf4103g-12_256_644_1296_1756}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d35eebe2e85cecf4103g-12_674_1094_752_1080}\n\\end{center}\n\n$\\mathbf{f}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d35eebe2e85cecf4103g-12_656_1090_1084_1437}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_2d35eebe2e85cecf4103g-12_652_1061_1428_1737}\n\\end{center}\n\nFIG. 2. Electronic structure of $\\mathbf{B a}_{0.51} \\mathbf{K}_{0.49} \\mathbf{B i O}_{3}$. a, The Brillouin zone of $\\mathrm{Ba}_{0.51} \\mathrm{~K}_{0.49} \\mathrm{BiO}_{3}$. The orange surface illustrates the momentum space sampled with $h v=73 \\mathrm{eV}$ photons near the ГMX plane. b, Photoemission intensity map in the $\\Gamma \\mathrm{ZX}$ plane integrated over an energy window of $E_{F} \\pm 15 \\mathrm{meV}$, which is measured with photons ranging from 57 to $132 \\mathrm{eV}$. c., In-plane photoemission intensity map measured with $h v=73 \\mathrm{eV}$ photons, integrated over an energy window of $E_{F} \\pm 15 \\mathrm{meV}$. d, Photoemission intensity along cut \\#1 shown in panel c. The bands $\\alpha, \\beta$, and $\\gamma$ are indicated on the right side by markers in red, blue, and green, respectively. e, Energy distribution curves (EDCs) of data in the lower part of panel d, showing the dispersions of bands $\\beta$ and $\\gamma . \\mathbf{f}$, Momentum distribution curves (MDCs) of data in the upper part of panel d, showing the dispersions of bands $\\alpha$ and $\\beta$. g, Band dispersion extracted from the data in panel d (markers in red, blue, and green) plotted over the density functional theory (DFT) calculations of $\\mathrm{BaKBi}_{2} \\mathrm{O}_{6}$ using generalized gradient approximation (GGA, blue curves) and Heyd-Scuseria-Ernzerhof hybrid functional calculations (HSE06, black curves).\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2d35eebe2e85cecf4103g-13_240_1224_556_1558}\n\nFIG. 3. Temperature and momentum dependence of the superconducting gap. a, Temperature dependence of symmetrized photoemission spectra along the $\\Gamma \\mathrm{X}$ direction, measured in the $Г \\mathrm{MX}$ plane by $30 \\mathrm{eV}$ photons. The right inset illustrates the Brillouin zones (orange squares), Fermi surfaces (gray rounded squares), and the photoemission cut (blue arrow). $\\mathbf{b}$, Temperature dependence of the symmetrized EDCs (diamond shaped markers) integrated around $k_{F}$ (double arrows in panel a). The EDCs are vertically offset for better visualization, while the horizontal bars indicate the zero position of each EDC. The red solid curves are the fitting with resolution-convolved Dynes functions. cc, Temperature dependence of the superconducting gap (red markers) fit to the BCS function (solid black curve). The error bars are determined by combining the standard deviation of the fitting by Dynes functions (panel c) and the energy uncertainty. d, Symmetrized EDCs at various $k_{F}$ 's (as shown in the top panel with the one-to-one corresponding colors) of band $\\alpha$ in the $\\Gamma \\mathrm{MX}$ plane measured at $10 \\mathrm{~K}$. The EDCs are vertically offset for better visualization, while the horizontal bars indicate the zero positions of each EDC. The top panel illustrates the Brillouin zone (orange square), Fermi surface cross-section (gray rounded square), and the color-coded Fermi momenta (open circles). e, Same as panel d but along the $k_{F}$ 's in the $\\Gamma$ ZX plane.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2d35eebe2e85cecf4103g-14_244_1018_630_996}\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2d35eebe2e85cecf4103g-14_251_454_1018_1411}\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_2d35eebe2e85cecf4103g-14_251_1009_1018_1496}\n\nFIG. 4. Electron-phonon interaction in $\\mathbf{B a}_{0.51} \\mathbf{K}_{0.49} \\mathbf{B i O}_{3}$. a, ARPES spectrum taken along $\\Gamma X$ using $72 \\mathrm{eV}$ photons. The band dispersion from Lorentz fitting on the MDCs is overlaid. b, MDC-derived dispersion from the raw data (open circles), and linear fits to the high energy $\\left(E-E_{F}<-80 \\mathrm{meV}, v_{F}^{0}\\right.$ fit, solid line) and low energy $\\left(E-E_{F}>-50 \\mathrm{meV}, v_{F}\\right.$ fit, dashed line) dispersions. cc, Real part of the self-energy $\\mathrm{Re} \\Sigma$ obtained in two ways: the difference between the band dispersion near $E_{F}$ and the polynomial fit approximating the bare band dispersion (red dots), and the Kramers-Kronig transformation of the imaginary part of the selfenergy $\\operatorname{Im} \\Sigma$ (black curve). d, Full-width at half-maximum (FWHM) of the MDCs, and $\\operatorname{Im} \\Sigma$ computed from the FWHM. e, Electron-phonon spectral function $\\alpha^{2} F(\\omega, k)$ (black squares) calculated from the $\\operatorname{Im} \\Sigma(\\omega)$. To avoid unphysical values, we have set all negative data points of $\\alpha^{2} F(\\omega, k)$ to zero. The blue curve is the phonon density of states (DOS) determined by neutron diffraction in Ref. 32.\n\n\n\\end{document}", "record_id": "2023_09_22_2d35eebe2e85cecf4103g"}