{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{APS physics }\n\n\n\\author{Kun Jiang,,${ }^{1,2}$ Xianxin Wu,${ }^{2,3, *}$ Jiangping $\\mathrm{Hu}^{2,}{ }^{2,4,5, \\dagger}$ and Ziqiang Wang ${ }^{1, \\ddagger}$\\\\\n${ }^{1}$ Department of Physics, Boston College, Chestnut Hill, MA 02467, USA\\\\\n${ }^{2}$ Beijing National Laboratory for Condensed Matter Physics and Institute of Physics,\\\\\nChinese Academy of Sciences, Beijing 100190, China\\\\\n${ }^{3}$ Institut für Theoretische Physik und Astrophysik,\\\\\nJulius-Maximilians-Universität Würzburg, 97074 Würzburg, Germany\\\\\n${ }^{4}$ Collaborative Innovation Center of Quantum Matter, Beijing, China\\\\\n${ }^{5}$ Kavli Institute of Theoretical Sciences, University of Chinese Academy of Sciences, Beijing, 100190, China}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nThis is the accepted manuscript made available via CHORUS. The article has been published as:\n\n\\section{Nodeless High-T_\\{c\\} Superconductivity in the Highly Overdoped CuO_\\{2\\} Monolayer}\n Kun Jiang, Xianxin Wu, Jiangping Hu, and Ziqiang WangPhys. Rev. Lett. 121, 227002 - Published 29 November 2018\n\nDOI: 10.1103/PhysRevLett.121.227002\n\n\\section*{Nodeless high- $\\mathrm{T}_{c}$ superconductivity in highly-overdoped monolayer $\\mathrm{CuO}_{2}$ }\n(Dated: November 5, 2018)\n\n\\begin{abstract}\nWe study the electronic structure and superconductivity in $\\mathrm{CuO}_{2}$ monolayer grown recently on $d$-wave cuprate superconductor $\\mathrm{Bi}_{2} \\mathrm{Sr}_{2} \\mathrm{CaCu}_{2} \\mathrm{O}_{8+\\delta}$. Density functional theory calculations indicate significant charge transfer across the interface such that the $\\mathrm{CuO}_{2}$ monolayer is heavily overdoped into the hole-rich regime yet inaccessible in bulk cuprates. We show that both the Cu $d_{x^{2}-y^{2}}$ and $d_{3 z^{2}-r^{2}}$ orbitals become important and the Fermi surface contains one electron and one hole pocket associated with the two orbitals respectively. Constructing a minimal correlated two-orbital model for the $e_{g}$ complex, we show that the spin-orbital exchange interactions produce a nodeless superconductor with extended $s$-wave pairing symmetry and a pairing energy gap comparable to the bulk $d$-wave gap, in agreement with recent experiments. The findings point to a direction of realizing new high- $T_{c}$ superconductors in ozone grown transition-metal-oxide monolayer heterostructures.\n\\end{abstract}\n\nThe commonly held belief of the high- $T_{c}$ cuprate superconducting (SC) state [1] is that the superconductivity originates from two-dimensional copper-oxide $\\left(\\mathrm{CuO}_{2}\\right)$ planes with a nodal $d$-wave pairing symmetry $[2-4]$. In a recent attempt to directly probe the SC state in the copper-oxide plane, monolayer $\\mathrm{CuO}_{2}$ on $\\mathrm{Bi}_{2} \\mathrm{Sr}_{2} \\mathrm{CaCu}_{2} \\mathrm{O}_{8+\\delta}$ (Bi2212) has been grown successfully by the state-of-the-art ozone molecular beam epitaxy (MBE) [5]. In contrast to the widely observed V-shaped local density of states (LDOS) typical of a nodal $d$-wave pairing gap in bulk cuprates, scanning tunneling microscopy (STM) on the $\\mathrm{CuO}_{2}$ monolayer reveals a robust U-shaped LDOS characteristic of a nodeless SC gap, which is further shown to be insensitive to nonmagnetic impurities [5]. Several theoretical scenarios have been proposed for this remarkable observation, largely based on the SC proximity effect but with the $d$-wave nodes avoided by different Fermi surfaces or coexisting magnetism in the monolayer [6-9]. Here, we propose a different scenario. We argue that the $\\mathrm{CuO}_{2}$ monolayer has a new electronic structure due to interface charge transfer and exhibits an intrinsic nodeless, $s$-wave SC state. Thus while the monolayer may not be representative of the bulk $\\mathrm{CuO}_{2}$ layers, it has potentially realized the direction of finding new and novel form of high- $\\mathrm{T}_{c}$ superconductors in transition-metal-oxide heterostructures by interface charge transfer.\n\nThe main findings are summarized in the schematic phase diagram shown in Fig. 1. The left side of Fig. 1 has been realized by hole-doping the antiferromagnetic (AF) parent state in bulk cuprates, where the $3 d^{9} \\mathrm{Cu}^{2+}$ has\n\n\\begin{itemize}\n  \\item \\href{mailto:xianxin.wu@physik.uni-wuerzburg.de}{xianxin.wu@physik.uni-wuerzburg.de}\n\\end{itemize}\n\n$\\dagger$ \\href{mailto:jphu@iphy.ac.cn}{jphu@iphy.ac.cn}\n\n$\\ddagger$ \\href{mailto:wangzi@bc.edu}{wangzi@bc.edu}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_984f5b905c02b6f21733g-2_1044_1542_1100_1957}\n\\end{center}\n\nFIG. 1. Schematic phase diagram as a function of hole doping $x_{h}$, contrasting the single-band $d$-wave $\\mathrm{SC}$ phase realized in bulk cuprates (left side) with the two-orbital nodeless SC phase in the hole-rich $\\mathrm{CuO}_{2} / \\mathrm{Bi} 2212$ monolayer (right side). The corresponding FS is shown in insets.\n\nthree $e_{g}$ electrons $\\left(n_{e}=3\\right)$ occupy the well-split $d_{x^{2}-y^{2}}$ $\\left(d_{x^{2}}\\right)$ and $d_{3 z^{2}-r^{2}}\\left(d_{z^{2}}\\right)$ orbitals due to Jahn-Teller distortion. The $d$-wave superconductor emerges under the SC dome with a maximum $T_{c}$ around an optimal doping concentration $x_{h} \\sim 0.16$. Experiments show that the metallic state in bulk cuprates has a single band of the $d_{x^{2}}$ character [10] crossing the Fermi level. Note that heavy overdoping is difficult and the region with $x_{h}>0.3$ has not been accessible in bulk cuprates.\n\nThe right side of Fig. 1 is conjectured for the monolayer $\\mathrm{CuO}_{2} / \\mathrm{Bi} 2212$. Based on the experimental evidence suggesting that the monolayer crystalizes into $\\mathrm{CuO}_{2}[5]$, significant charge transfer must occur between the $\\mathrm{CuO}_{2}$ monolayer and the Bi2212 substrate in order to maintain charge neutrality. We will show that this is indeed supported by density functional theory (DFT) calculations and charge transfer correlations. Thus, the $\\mathrm{CuO}_{2}$ monolayer is highly overdoped and reaches a regime yet inaccessible in bulk cuprates. As shown in Fig. 1, this hole-rich regime approaches $3 d^{8}\\left(\\mathrm{Cu}^{3+}\\right)$ with $n_{e}=2$ in the two $e_{g}$ orbitals. We show that both $d_{x^{2}}$ and $d_{z^{2}}$ orbitals become active and the electronic structure requires a minimal two-band description with one electron FS enclosing $\\Gamma$ and one hole FS around M (Fig. 1). Constructing a two-orbital Hubbard model and studying its SC properties using both weak and strong coupling approaches, we find that the hole-rich $\\mathrm{CuO}_{2}$ monolayer is a multiband nodeless superconductor driven by both spinspin and spin-orbital entangled (super)exchange interactions. The pairing energy gaps are comparable in magnitude to the bulk $d$-wave gap and exhibit a sign-change on the two FS, analogous to Fe-based superconductors. The calculated STM conductance displays the U-shaped spectrum consistent with the experimental observations.\n\nWe first carry out a DFT calculation to simulate a $\\mathrm{CuO}_{2}$ monolayer on Bi2212 using the Vienna ab initio simulation package (VASP) [11-15]. The details are given in the supplemental material (SM) [16]. As illustrated in Fig. 2(a), due to the missing apical oxygen in the unbalanced octahedron, the cation $\\mathrm{Cu}$ attracts the bottom anion oxygen $\\left(\\mathrm{O}_{a}\\right)$ and shortens the out-of-plane $\\mathrm{Cu}-\\mathrm{O}_{a}$ distance at the interface to $2.11 \\AA$, after relaxation. This value is close to the in-plane $\\mathrm{Cu}-\\mathrm{O}$ bond length of $1.92 \\AA$, which is much shorter than the $2.82 \\AA \\mathrm{Cu}-\\mathrm{O}_{a}$ distance in the bulk. The point group symmetry $D_{4 h}$ also breaks down to $C_{4 v}$. There are two immediate consequences. (i) The $p_{z}$ orbital of the bottom $\\mathrm{O}_{a}$ strongly hybridizes with the $\\mathrm{Cu} d_{z^{2}}$ orbital. This leads to a $d_{z^{2}}$ like bonding orbital and transfers charges to the oxygen in the $\\mathrm{BiO}$ layer. The excess charge transfer causes the $\\mathrm{Cu}$ valence in the monolayer to approch $3 d^{8}\\left(\\mathrm{Cu}^{3+}\\right)$ with two electrons occupying the $e_{g}$ orbitals. (ii) The crystal field splitting between the $d_{x^{2}}$ and $d_{z^{2}}$ orbitals is significantly reduced compared to in the bulk.\n\nThese phenomena show up in the calculated band structure shown in Fig. 2(b). The band highlighted by red markers contains the $d_{x^{2}}$ orbital mixed with the antisymmetric combination of the in-plane oxygen $p_{x}$ and $p_{y}$ orbitals [10]. We label this band as the $d_{x^{2}}$ band, which is heavily overdoped and electron-like near the zone center $\\Gamma$. The green markers indicate the $d_{z^{2}}$ band of the $\\mathrm{Cu} d_{z^{2}}$ orbital mixed with the anion oxygen $p_{z}$ orbital. It is holelike near the zone corner $M$, with its band top very close to the Fermi level. Thus, the monolayer $\\mathrm{CuO}_{2} / \\mathrm{Bi} 2212$ has a different electronic structure than the $\\mathrm{CuO}_{2}$ layer in the bulk. Note that in the experiments [5], the $\\mathrm{CuO}_{2}$ monolayer is MBE grown on Bi2212 substrates that are optimally hole doped by the excess oxygen dopants of which a substantial fraction resides near the $\\mathrm{BiO}$ layers $[17,18]$. Their density is further increased in the top $\\mathrm{BiO}$ layer in the ozone environment. As a result, additional charge transfer takes place via the oxygen dopants hole doping the $\\mathrm{CuO}_{2}$ monolayer across the interface, which further stabilizes the $\\mathrm{CuO}_{2}$ structure and pushes the chemical potential into the $d_{z^{2}}$ band. Consequently,\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_984f5b905c02b6f21733g-3_175_935_1084_1954}\n\nFIG. 2. (a) Atomic structure of monolayer $\\mathrm{CuO}_{2}$. Copper $d_{z^{2}}$ orbital is shown in gold and silver $\\left(d_{x^{2}}\\right.$ not shown). Blue balls are oxygen ions. The oxygen $\\left(\\mathrm{O}_{a}\\right)$ at the bottom of pyramid is in the $\\mathrm{BiO}_{2}$ layer of $\\mathrm{Bi} 2212$ substrate. (b) Band structure of monolayer $\\mathrm{CuO}_{2} / \\mathrm{Bi} 2212$ obtained using DFT. The orbital content of dispersions is colored coded with red $\\left(d_{x^{2}}\\right)$, green $\\left(d_{z^{2}}\\right)$, and blue $\\left(p_{z}\\right.$ strongly hybridized with $\\left.d_{z^{2}}\\right)$. (c) Band dispersion of the two-orbital TB model with FS shown in (d) at $x_{h}=0.9$ in the same color scheme.\n\nthe doped holes physically occupy both $d_{x^{2}}$ and $d_{z^{2}}$ orbitals, giving rise to one electron FS pocket around $\\Gamma$ and one hole pocket around $M$ at the Fermi energy. In the cuprates terminology, the $\\mathrm{CuO}_{2}$ monolayer corresponds to the heavily overdoped, hole-rich region yet unreachable in bulk materials where the $d_{z^{2}}$ orbital and $d-d$ excitations only play a limited role [19-28].\n\nWe next construct a minimal two-orbital Hamiltonian $H=H_{t}+H_{I}$ for the monolayer $\\mathrm{CuO}_{2}$, where $H_{t}$ is a tight-binding (TB) model for the band structure and $H_{I}$ describes the electronic correlations. Using $d_{\\alpha \\sigma}, \\alpha=x, z$ to denote a spin- $\\sigma$ electron in the $d_{x^{2}}$ and $d_{z^{2}}$ orbitals,\n\n\\[\nH_{t}=\\sum_{k \\alpha \\beta \\sigma} \\varepsilon_{k}^{\\alpha \\beta} d_{k \\alpha \\sigma}^{\\dagger} d_{k \\beta \\sigma}+e_{z} \\sum_{k \\sigma} d_{k z \\sigma}^{\\dagger} d_{k z \\sigma},\n\\]\n\nwhere $e_{z}$ is the crystal field splitting between the two orbitals. We consider up to third nearest neighbor hopping such that the kinetic energy of intraorbital hopping in Eq. (1) is $\\varepsilon_{k}^{\\alpha \\alpha}=-2 t_{\\alpha} \\gamma_{k}-4 t_{\\alpha}^{\\prime} \\alpha_{k}-2 t_{\\alpha}^{\\prime \\prime} \\gamma_{k}^{\\prime}$ with lattice harmonics of $A_{1}$ symmetry $\\gamma_{k}=\\cos k_{x}+\\cos k_{y}$, $\\alpha_{k}=\\cos k_{x} \\cos k_{y}$, and $\\gamma_{k}^{\\prime}=\\cos 2 k_{x}+\\cos 2 k_{y}$. Due to the different orbital symmetry, the interorbital hopping leads to $\\varepsilon_{k}^{x z}=2 t_{x z} \\beta_{k}+2 t_{x z}^{\\prime \\prime} \\beta_{k}^{\\prime}$, with $B_{1}$ harmonics $\\beta_{k}=\\cos k_{x}-\\cos k_{y}$ and $\\beta_{k}^{\\prime}=\\cos 2 k_{x}-\\cos 2 k_{y}$. The parameters of the TB model are given in the SM [16] and the chemical potential is treated as an independent variable. The TB band structure is shown in Fig. 2(c) at doping $x_{h}=0.9$ or $n_{e}=2.1$. It describes the DFT results in Fig. 2(b) very well. The FS is plotted in Fig. 2(d), showing one electron pocket around $\\Gamma$ and one hole pocket around M. Since $\\varepsilon_{k}^{x z}$ has $d$-wave form factors, the FS around $\\Gamma$ is mostly $d_{x^{2}}$ like around nodal but of a mixed character around antinodal directions. The hole pocket around M is mainly $d_{z^{2}}$ like since the bands are well separated in energy. The smaller overlap of out-of-plane orbitals makes the $d_{z^{2}}$ band narrow with a small bandwidth, consistent with the DFT dispersions.\n\nThe correlation part follows from the standard twoorbital Hubbard model $[29,30]$ for the $e_{g}$ complex\n\n\\[\n\\begin{aligned}\nH_{I} & =U \\sum_{i, \\alpha} \\hat{n}_{i \\alpha \\uparrow} \\hat{n}_{i \\alpha \\downarrow}+\\left(U^{\\prime}-\\frac{1}{2} J_{H}\\right) \\sum_{i, \\alpha<\\beta} \\hat{n}_{i \\alpha} \\hat{n}_{i \\beta} \\\\\n& -J_{H} \\sum_{i, \\alpha \\neq \\beta} \\mathbf{S}_{i \\alpha} \\cdot \\mathbf{S}_{i \\beta}+J_{H} \\sum_{i, \\alpha \\neq \\beta} d_{i \\alpha \\uparrow}^{\\dagger} d_{i \\alpha \\downarrow}^{\\dagger} d_{i \\beta \\downarrow} d_{i \\beta \\uparrow},\n\\end{aligned}\n\\]\n\nwhere the intra and interorbital Coulomb $U$ and $U^{\\prime}$ are related to Hund's coupling $J_{H}$ by $U=U^{\\prime}+2 J_{H}$.\n\nThe emergence the low-energy $d_{z^{2}}$-band and the hole FS pocket around $\\mathrm{M}$ enables an analogy to multiorbital nodeless Fe-pnictides superconductors [31-39], particularly when the correlation effects in Eq. (2) are treated using weak-coupling approaches. Since perfect nesting between the electron and hole pockets is absent, the only logarithmic divergence is in the Cooper channel. Following Ref. [34], we performed a two-patch renormalization group analysis and found that the nodeless $s$-wave superconductivity is the leading instability. Moreover, the relevant pair-scattering across the electron and hole FS, i.e. the $u_{3}$ channel [34], drives a sign-changing $s_{\\pm}$gap function on the two FS pockets.\n\nAn important difference between the Fe-based and cuprate superconductors is, however, that the former are $p$ - $d$ charge-transfer metals, whereas the latter are chargetransfer insulators [39]. Indeed, the nodeless SC state of monolayer $\\mathrm{CuO}_{2} / \\mathrm{Bi} 2212$ emerges [5] inside a chargetransfer gap of similar magnitude as in bulk cuprates [40]. It is thus necessary to carry out a strong coupling study of the two-orbital Hubbard model. To this end, we derive in the SM the general spin-orbital superexchange interactions of the Kugel-Khomskii type [16, 29, 41],\n\n\\[\n\\begin{aligned}\nH_{\\mathrm{J}-\\mathrm{K}}=\\sum_{\\langle i j\\rangle}\\left[J \\mathbf{S}_{i} \\cdot \\mathbf{S}_{j}\\right. & +\\sum_{\\mu \\nu} I_{\\mu \\nu} T_{i}^{\\mu} T_{j}^{\\nu} \\\\\n& \\left.+\\sum_{\\mu \\nu} K_{\\mu \\nu}\\left(\\mathbf{S}_{i} \\cdot \\mathbf{S}_{j}\\right)\\left(T_{i}^{\\mu} T_{j}^{\\nu}\\right)\\right]\n\\end{aligned}\n\\]\n\nwhere $\\mathbf{S}_{i}$ is the spin- $1 / 2$ operator, $T_{i}^{\\mu}, \\mu=0, x, y, z$, are the orbital pseudospin- $1 / 2$ operators in the orbital basis $\\left(\\left|x^{2}-y^{2}\\right\\rangle,\\left|z^{2}\\right\\rangle\\right)^{T}[41]$. In Eq. (3), the $J$-term is the $\\mathrm{SU}(2)$ invariant Heisenberg spin exchange coupling, while the terms proportional $I_{\\mu \\nu}$ and $K_{\\mu \\nu}$ describe the anisotropic orbital and spin-orbital entangled superexchange interactions respectively, since the orbital/pseudospin rotation symmetry is broken by the generic hoppings and crystal field in $H_{t}$. We thus arrive at an effective two-orbital strong coupling model\n\n\\[\nH=P_{G} H_{t} P_{G}+H_{\\mathrm{J}-\\mathrm{K}},\n\\]\n\nwhere $P_{G}$ stands for the Gutzwiller projection of states with multiple occupations. Hereafter, we consider Eq. (4) as an effective low-energy theory for the hole-rich regime of monolayer $\\mathrm{CuO}_{2}$ and study the emergent SC state due to the spin-orbit superexchange correlations. The Gutzwiller projection is treated in the SM [16] using the variational Gutzwiller approximation $[42-44]$ for a generic set of interactions $U=2.5 \\mathrm{eV}$ and $J_{H}=0.1 U$.\n\nThe intersite quantum spin-orbital fluctuations described by Eq. (3) can be projected into the spin-singlet channel by $P_{i j}^{s}=\\mathbf{S}_{i} \\cdot \\mathbf{S}_{j}-1 / 4$, and written in terms of the pairing operators $\\Delta_{i j}^{\\alpha \\beta \\dagger}=d_{i \\alpha \\uparrow}^{\\dagger} d_{j \\beta \\downarrow}^{\\dagger}-d_{i \\alpha \\downarrow}^{\\dagger} d_{j \\beta \\uparrow}^{\\dagger}$. Since the $d_{x^{2}}$ and $d_{z^{2}}$ orbitals are split by the crystal field, there is an orbital order that causes the operator $T_{i z}$ in Eq. (3) to take on its expectation value $1 / 2$. As shown in the SM [16], this leads to a spin exchange interaction corresponding to that of Heisenberg term in the $t-J$ model [2] with the familiar result $J_{s}\\left(\\mathbf{S}_{i} \\cdot \\mathbf{S}_{j}-\\frac{1}{4} n_{i} n_{j}\\right)=-\\frac{J_{s}}{2} \\sum_{\\alpha \\beta} \\Delta_{i j}^{\\alpha \\beta \\dagger} \\Delta_{i j}^{\\alpha \\beta}$. We set $J_{s}=120 \\mathrm{meV}$, the commonly accepted value for bulk cuprates [2]. However, the $T_{i z}$ order does not quench the transverse orbital fluctuations represented by $T_{i}^{\\pm}$that contribute to pairing. Remarkably, such spin-orbit entangled, quadruple exchange interactions in Eq. (3) generates a new pairing contribution\n\n\\[\nK P_{i j}^{s}\\left(T_{i}^{+} T_{j}^{+}+\\text {h.c. }\\right)=-\\frac{K}{2}\\left(\\Delta_{i j}^{x x \\dagger} \\Delta_{i j}^{z z}+\\text { h.c. }\\right)\n\\]\n\nwhich captures the physics of the interorbital pair scattering. This is the strong coupling counterpart of the inter FS pocket pair scattering in weak-coupling approaches [20, 34]. We considered all spin-singlet pairing in the SM [16] and determined the expectation values of the pairing fields $\\left\\langle\\Delta_{i j}^{\\alpha \\beta}\\right\\rangle$ self-consistently in the Gutzwiller approximation. The latter has the form,\n\n\\[\n\\left\\langle\\Delta_{i j}^{\\alpha \\beta}\\right\\rangle=\\frac{1}{N_{s}} \\sum_{\\mathbf{k}, \\alpha \\beta} \\Delta_{\\alpha \\beta} b_{\\alpha \\beta}(\\mathbf{k}) e^{i \\mathbf{k}\\left(r_{i}-r_{j}\\right)},\n\\]\n\nwhere $N_{s}$ is the number of lattice sites and $b_{\\alpha \\beta}(k)$ the form factors of different symmetries in the $C_{4 v}$ point group of the crystal. For nearest neighbor pairing, $b_{\\alpha \\alpha}(k)=\\gamma_{k}$ and $b_{x z}(k)=\\beta_{k}$ in the $A_{1}$ symmetry channel whereas $b_{\\alpha \\alpha}(k)=\\beta_{k}$ and $b_{x z}(k)=\\gamma_{k}$ in the $B_{1}$ channel. Our results show that the variational ground state in the strong coupling theory is a nodeless superconductor with $A_{1}$ symmetry in the hole-rich regime where the FS contains both the electron and hole pockets. Moreover, the pairing fields are dominated by the intra-orbital $\\Delta_{\\alpha \\alpha}$ with extended $s$-wave form factor $b_{\\alpha \\alpha}=\\gamma_{k}$ in Eq. (6). In Figs. 3(a-b), we show the FS at $x_{h}=0.9$ and the pairing energy gaps as a function of the angle along the two FS pockets for $K=80 \\mathrm{meV}$. The nodeless $s_{\\pm}$gap function with opposite signs and comparable magnitude is a\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_984f5b905c02b6f21733g-5_168_802_171_1044}\n\\end{center}\n\nFIG. 3. (a) Normal state FS at $x_{h}=0.9$. (b) SC pairing energy gaps at $K=80 \\mathrm{meV}$ along FS pockets with angle $\\theta$ defined in (a). (c) U-shaped total LDOS (red solid line) showing a nodeless gap $\\sim 25 \\mathrm{meV}$. LDOS from $d_{z^{2}}$ orbital is shown in dashed lines. (d) Same as in (c) obtained for $K=60 \\mathrm{meV}$.\n\nremarkable consequence of the spin-orbital entangled exchange pairing interaction $K$ in Eq. (5). The momentum space anisotropy of the gap function is small and more apparent on the electron pocket around $\\Gamma$ which is larger and less circular. Such a nodeless multiorbital superconductor in the hole-rich regime is proposed in Fig. 1 for the monolayer $\\mathrm{CuO}_{2} / \\mathrm{Bi} 2212$.\n\nTo compare to STM, we calculate the LDOS for each orbital $N_{\\alpha}(\\omega)=\\sum_{k \\sigma} \\operatorname{Im} \\int_{0}^{\\beta} e^{i \\omega \\tau}\\left\\langle\\mathrm{T}_{\\tau} d_{k \\alpha \\sigma}(\\tau) d_{k \\alpha \\sigma}^{\\dagger}(0)\\right\\rangle$. The total LDOS, $N(\\omega)=N_{x}(\\omega)+N_{z}(\\omega)$, is shown in Fig. 3(c). It has a U-shaped spectrum with a pair of coherence peaks demarcating a nodeless energy gap around $25 \\mathrm{meV}$, in good agreement with STM observations [5]. The LDOS from the $d_{z^{2}}$ orbital, also shown in Fig. 3(c), has a slightly larger onset spectral gap and the majority of the total differential conductance due to the large DOS of the $d_{z^{2}}$ band. Fig. 3(d) shows the LDOS spectra obtained for a smaller $K=60 \\mathrm{meV}$. The smaller onset spectral gap associated with the $d_{x^{2}}$ orbital is visible, but the tunneling conductance, especially that into the $d_{z^{2}}$ orbital, continues to exhibit the U-shaped spectrum. The tunneling matrix element on top of the monolayer also favors a path through the out-of-plane $\\mathrm{Cu} 3 d_{z^{2}}$ orbital as depicted in Fig. 2(a). The overall agreement with the STM findings supports our conjecture that the electronic structure and correlation in the monolayer $\\mathrm{CuO}_{2} / \\mathrm{Bi} 2212$ produce an intrinsic two-orbital nodeless $s$-wave SC state.\n\nThe proposed two-orbital nodeless $\\mathrm{SC}$ state near $\\mathrm{Cu}$ $3 d^{8}$ is different from the single-orbital extended $s$-wave pairing state known to arise with very small pairing amplitude in the overdoped single-band $t$ - $J$ model [2, 45]. To verify this point, we studied the intermediate doping regime $0.3<x_{h}<0.7$, where the $d_{z^{2}}$ hole pocket has disappeared following a Lifshitz transition and the FS contains a single $d_{x^{2}}$ electron pocket enclosing $\\Gamma$ (Fig. S1(c) in SM). The SC state indeed has extended $s$-wave pairing amplitudes that are two orders of magnitude smaller due to the suppression of orbital fluctuations. The electron pocket grows with reducing doping and transitions to a large hole FS around $M$ for $x_{h}<0.3$, where the nodal $d$-wave SC state is recovered as in the bulk cuprates. Finally, when the two-orbital model is studied at $x_{h}=1$, i.e. in the $\\mathrm{Cu} 3 d^{8}$ limit with two electrons in the $e_{g}$ complex, the Gutzwiller projected Hamiltonian $P_{G} H_{t} P_{G}$ has an insulating ground state with AF long-range order for our parameters as indicated in the phase diagram Fig. 1. This is consistent with the high-spin Mott insulating state of the two-orbital Hubbard model at half-filling [46-49], where the AF spin moments from the two orbitals are ferromagnetically aligned by $J_{H}$ [50].\n\nIn conclusion, we proposed that the ozone MBE grown $\\mathrm{CuO}_{2}$ monolayer on Bi2212 is heavily overdoped due to interface charge transfer, reaching the hole-rich regime yet inaccessible in bulk cuprates. The resulting electronic structure involves holes occupying both $\\mathrm{Cu} 3 d_{x^{2}}$ and $3 d_{z^{2}}$ orbitals. The quantum fluctuations of the spin-orbital superexchange interaction are shown to produce a twoorbital nodeless superconductor with a U-shaped LDOS and a comparably sized pairing gap as in bulk Bi2212 near optimal doping, providing a natural explanation of the STM experiments [5]. Although the SC proximity effect between a $d$-wave cuprate and a normal metal is difficult to achieve in $c$-axis oriented junctions [51] and more detailed studies are necessary, it is reasonable to expect that the intrinsic nodeless SC state of the $\\mathrm{CuO}_{2}$ monolayer to establish phase coherence with the bulk $d$ wave superconductor through inhomogeneous Josephson coupling at the interface. A possible mechanism to facilitate the interface charge transfer is through the typeB oxygen dopants in Bi2212 [17], residing close to the $\\mathrm{BiO}$ layer as observed by STM [18]. Ozone MBE growth can increase significantly the type-B dopants on the surface $\\mathrm{BiO}$ layer, which in turn provide heavy hole-doping for the capping monolayer $\\mathrm{CuO}_{2}$. The predictions can be tested experimentally by measuring the quasiparticle band dispersion using ARPES or STM quasiparticle interference on samples with large enough coverage of high quality $\\mathrm{CuO}_{2}$ monolayer. Indeed, interface charge transfer and the change of FS topology have been observed recently with enhanced $T_{c}$ in monolayer FeSe superconductors grown on $\\mathrm{SrTiO}_{3}$ substrate [52-55]. It would also be interesting to probe and study the phonon dynamics and electron-phonon coupling at the interface [56]. The findings presented here provide insights for a new direction of searching for high- $\\mathrm{T}_{c}$ superconductors in extended doping regimes and with liberated orbital degrees of freedom in ozone MBE grown transition metal oxides heterostructures.\n\nWe thank Sen Zhou and Andy Millis for helpful discussions. This work is supported in part by the Ministry of Science and Technology of China 973 program (No. 2017YFA0303100, No. 2015CB921300), National Science Foundation of China (Grant No. NSFC-1190020, 11534014, 11334012), and the Strategic Priority Research Program of CAS (Grant No.XDB07000000); and the U.S. Department of Energy, Basic Energy Sciences Grant No.\n\n[1] J.G. Bednorz, K.A. Muller, Z. Phys. B 64, 189 (1986).\n\n[2] Patrick A. Lee, Naoto Nagaosa, and Xiao-Gang Wen, Rev. Mod. Phys. 78, 17 (2006).\n\n[3] C. C. Tsuei, J. R. Kirtley, C. C. Chi, L. S. Yu-Jahnes, A. Gupta, T. Shaw, J. Z. Sun and M. B. Ketchen, Phys. Rev. Lett. 73, 593 (1994).\n\n[4] C. C. Tsuei and J. R. Kirtley, Rev. Mod. Phys. 72, 969 $(2000)$\n\n[5] Y. Zhong, Y. Wang, S. Han, Y. Lv, W. Wang, D. Zhang, H. Ding, Y. Zhang, L. Wang, K. He, R. Zhong, J. A. Schneeloch, G. Gu, C. Song, X. Ma, Q. K. Xue, Science Bulletin 61, 1239 (2016).\n\n[6] G. Zhu, F. Zhang, and G. Zhang, Phys. Rev. B 94, 174501 (2016).\n\n[7] G. Zhu, Z. Wang, G. Zhang, Euro. Phys. Lett. 11837004 (2017).\n\n[8] Y. Wang, Z. Wang and W. Chen, Phys. Rev. B 96, 104507 (2017).\n\n[9] S. Wang, L. Zhang, F. Wang, Phys. Rev. B 97, 035112 (2018).\n\n[10] F. C. Zhang and T. M. Rice, Phys. Rev. B 37, 3759(R) (1988).\n\n[11] G. Kresse and J. Hafner, Phys. Rev. B 47, 558 (1993).\n\n[12] G. Kresse and J. Furthmuller, Comput. Mater. Sci. 6, 15 (1996).\n\n[13] G. Kresse and J. Furthmuller, Phys. Rev. B 54, $11169(1996)$.\n\n[14] J. P. Perdew, K. Burke and M. Ernzerhof, Phys. Rev. Lett. 77, 3865 (1996).p\n\n[15] H. J. Monkhorst and J. Pack, Phys. Rev. B 13, 5188 (1976).\n\n[16] See Supplemental Material for more detailed discussions.\n\n[17] S. Zhou, H. Ding, and Z. Wang, Phys. Rev. Lett. 98, 076401 (2007).\n\n[18] I. Zeljkovic, Z. Xu, J.S. Wen, G.D. Gu, R.S. Markiewicz, and J.E. Hoffman, Science 337, 320 (2012).\n\n[19] W. Weber, Z. Phys. B 70323 (1988).\n\n[20] D.L. Cox, M. Jarrell, C. Jayaprakash, H.R. Krishnamurthy, and J. Deisz, Phys. Rev. Lett. 62, 2188 (1989).\n\n[21] F. Buda, D.L. Cox, and M. Jarrell, Phys. Rev. B 49, 1255 (1994).\n\n[22] L.F. Feiner, M. Grilli, and C. Di Castro, Phys. Rev. B 45, 10647 (1992).\n\n[23] J. Zaanen and A.M. Oles, Phys. Rev. B 48, 7197 (1993).\n\n[24] R. Raimondi, J.H. Jefferson, and L.F. Feiner, Phys. Rev. B 53, 8774 (1996).\n\n[25] C.-C. Chen, et. al. Phys. Rev. Lett. 105, 177401 (2010).\n\n[26] X. Wang, H.T. Dan, and A.J. Millis, Phys. Rev. B 84, $014530(2011)$.\n\n[27] H. Sakakibara, H. Usui, K. Kuroki, R. Arita, and H. Aoki, Phys. Rev. Lett. 105, 057003 (2010).\n\n[28] H. Sakakibara, H. Usui, K. Kuroki, R. Arita, and H. Aoki, Phys. Rev. B 85, 064501 (2012).\n\n[29] C. Castellani, C.R. Natoli, and J. Ranninger, Phys. Rev. B 18, 4945 (1978).\n\n[30] A. Georges, L. de Medici, and J. Mravlje, Annu. Rev. DE-FG02-99ER45747 (K.J. and Z.W.). Z.W. thanks the hospitality of IOP, CAS and Aspen Center for Physics and the support of ACP NSF grant PHY-1066293.\n\nCondens. Matter Phys. 4, 137 (2013).\n\n[31] I. I. Mazin, D. J. Singh, M. D. Johannes, and M. H. Du, Phys. Rev. Lett. 101, 057003 (2008).\n\n[32] S. Graser, T. A. Maier, P. J. Hirschfeld, and D. J. Scalapino, New J. Phys. 11, 025016 (2009).\n\n[33] F. Wang, H. Zhai, Y. Ran, A. Vishwanath, and D. Lee, Phys. Rev. Lett. 102, 047005 (2009).\n\n[34] A. Chubukov, D. Efremov, and I. Eremin, Phys. Rev. B $\\mathbf{7 8} 134512(2008)$.\n\n[35] K. Seo, B. Bernevig, and J. Hu, Phys. Rev. Lett. 101, $206404(2008)$.\n\n[36] W. Chen, K. Yang, Y. Zhou, and F. Zhang, Phys. Rev. Lett. 102, 047006 (2009).\n\n[37] H. Kontani and S. Onari, Phys. Rev. Lett. 104, 157001 $(2010)$\n\n[38] Y. Yanagi, Y. Yamakawa, and Y. Ono, Phys. Rev. B 81 , 054518 (2010).\n\n[39] S. Zhou, G. Kotliar, and Z. Wang, Phys. Rev. B 84, $140505(\\mathrm{R})(2011)$\n\n[40] P. Cai, W. Ruan, Y. Peng, C. Ye, X. Li, Z. Hao, X. Zhou, D. Lee and Y. Wang, Nat. Phys. 121047 (2016).\n\n[41] K. I. Kugel and D. I. Khomskii, Sov. Phys. JETP 37, 725 (1973); K. I. Kugel and D. I. Khomskii, Sov. Phys. Usp. 25, 231 (1982).\n\n[42] J. Bunemann, W. Weber, and F. Gebhard, Phys. Rev. B $\\mathbf{6 7}, 6898$ (1998).\n\n[43] F. Lechermann, A. Georges, G. Kotliar, and O. Parcollet, Phys. Rev. B 76, 155102 (2007).\n\n[44] S. Zhou and Z. Wang, Phys. Rev. Lett. 105, 096401 (2010).\n\n[45] M. U. Ubbens and P. A. Lee Phys. Rev. B 46, 8434 (1992).\n\n[46] A. Rügg, M. Indergrand, S. Pilgram, M. Sigrist, Eur. Phys. J. B 48, 55 (2005).\n\n[47] L. de'Medici, A. Georges, and S. Biermann, Phys. Rev. B 72, 205124 (2005).\n\n[48] P. Werner and A.J. Millis, Phys. Rev. Lett. 99, 126405 (2007).\n\n[49] S. Hoshino and P. Werner, Phys. Rev. B 93, 155161 (2016).\n\n[50] Y.M. Quan, L.J. Zou, D.Y. Liu, and H.Q. Lin, Eur. Phys. J. B 85, 55 (2012).\n\n[51] A. Sharoni, I. Asulin, G. Koren, and O. Millo, Phys. Rev. Lett. 92, 017003 (2004).\n\n[52] Q. Wang, Z. Li, W. Zhang, Z. Zhang, J. Zhang, W. Li, H. Ding, Y. Ou, P. Deng, K. Chang, J. Wen, C. Song, K. He, J. Jia, S. Ji, Y. Wang, L. Wang, X. Chen, X. Ma, Q.Xue, Chin. Phys. Lett. 29, 037402 (2012).\n\n[53] D. Liu, W. Zhang, D. Mou, J. He, Y. Ou, Q. Wang, Z. Li, L. Wang, L. Zhao, S. He, Y. Peng, X. Liu, C. Chen, L. Yu, G. Liu, X. Dong, J. Zhang, C. Chen, Z. Xu, J. Hu, X. Chen, X. Ma, Q. Xue, and X.J. Zhou, Nat. Commun. 3, 931 (2012).\n\n[54] S. He, J. He, W. Zhang, L. Zhao, D. Liu, X. Liu, D. Mou, Y. Ou, Q. Wang, Z. Li, L. Wang, Y. Peng, Y. Liu, C. Chen, L. Yu, G. Liu, X. Dong, J. Zhang, C. Chen, Z. Xu, X. Chen, X. Ma, Q. Xue , and X. J. Zhou, Nat. Mater. 12, 605 (2013).\n\n[55] W. Zhang, Y. Sun, J. Zhang, F. Li, M. Guo, Y. Zhao, H. Zhang, J. Peng, Y. Xing, H. Wang, T. Fujita, A. Hirata, Z. Li, H. Ding, C. Tang, M. Wang, Q. Wang, K. He, S. Ji, X. Chen, J. Wang, Z. Xia, L. Li, Y. Wang, J. Wang, L. Wang, M. Chen, Q. Xue, and X. Ma, Chin. Phys. Lett. 31, 017401 (2014).\n\n[56] J.J. Lee, F.T. Schmitt, R.G. Moore, S. Johnston, Y.-T. Cui, W. Li, M. Yi, Z. K. Liu, M. Hashimoto, Y. Zhang, D.H. Lu, T.P. Devereaux, D.-H. Lee, and Z.-X. Shen, Nature 515, 245 (2014).\n\n\n\\end{document}", "record_id": "2023_09_22_984f5b905c02b6f21733g"}