{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{HHS Public Access }\n\n\n\\author{Manman Lu${ }^{\\# 1,2}$, Sucharita Sarkar ${ }^{\\# 1,2}$, Mingzhang Wang M1,2 $^{\\text {, Jodi Kraus }}$ J1, Matthew Fritz $^{1}$,\\\\\nCaitlin M. Quinn ${ }^{1}$, Shi Bai $^{1}$, Sean T. Holmes ${ }^{1}$, Cecil Dybowski ${ }^{1}$, Glenn P. A. Yap ${ }^{1}$, Jochem\\\\\nStruppe $^{4}$, Ivan V. Sergeyev ${ }^{4}$, Werner Maas $^{4}$, Angela M. Gronenborn ${ }^{2,3,{ }^{*}}$, and Tatyana\\\\\nPolenova $^{1,2,{ }^{1},}$\\\\\n${ }^{1}$ Department of Chemistry and Biochemistry, University of Delaware, Newark, DE 19716, United\\\\\nStates\\\\\n${ }^{2}$ Pittsburgh Center for HIV Protein Interactions, University of Pittsburgh School of Medicine, 1051\\\\\nBiomedical Science Tower 3, 3501 Fifth Ave., Pittsburgh, PA 15261, United States\\\\\n${ }^{3}$ Department of Structural Biology, University of Pittsburgh School of Medicine, 3501 Fifth Ave.,\\\\\nPittsburgh, PA 15261, United States\\\\\n${ }^{4}$ Bruker Biospin Corporation, 15 Fortune Drive, Billerica, MA, United States\\\\\n\\# These authors contributed equally to this work.}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nAuthor manuscript\n\nJ Phys Chem B. Author manuscript; available in PMC 2019 June 14.\n\nPublished in final edited form as:\n\nJ Phys Chem B. 2018 June 14; 122(23): 6148–6155. doi:10.1021/acs.jpcb.8b00377.\n\n\\section{${ }^{19}$ F Magic Angle Spinning NMR Spectroscopy and Density Functional Theory Calculations of Fluorosubstituted Tryptophans: Integrating Experiment and Theory for Accurate Determination of Chemical Shift Tensors}\n\n\n\\begin{abstract}\nThe ${ }^{19} \\mathrm{~F}$ chemical shift is a sensitive NMR probe of structure and electronic environment in organic and biological molecules. In this report we examine chemical shift parameters of $4 \\mathrm{~F}-$, 5F-, 6F-, and 7F-substituted crystalline tryptophan by magic angle spinning (MAS) solid-state NMR spectroscopy and density functional theory (DFT). Significant narrowing of the ${ }^{19} \\mathrm{~F}$ lines was observed under fast MAS conditions, at spinning frequencies above $50 \\mathrm{kHz}$. The parameters characterizing the ${ }^{19} \\mathrm{~F}$ chemical shift tensor are sensitive to the position of the fluorine in the aromatic ring and, to a lesser extent, the chirality of the molecule. Accurate calculations of ${ }^{19} \\mathrm{~F}$ magnetic shielding tensors require the PBE0 functional with a $50 \\%$ admixture of a Hartree-Fock exchange term, as well as taking account of the local crystal symmetry. The methodology developed will be beneficial for ${ }^{19}$ F-based MAS NMR structural analysis of proteins and protein assemblies.\n\\end{abstract}\n\n\\section{Graphic Abstract}\n*Corresponding authors: Angela M. Gronenborn, Department of Structural Biology, University of Pittsburgh School of Medicine, 3501 Fifth Ave., Pittsburgh, PA 15260, USA, Tel.: (412) 6489959, \\href{mailto:amg100@pitt.edu}{amg100@pitt.edu}; Tatyana Polenova, Department of Chemistry and Biochemistry, University of Delaware, Newark, DE, USA, Tel.: (302) 831-1968, \\href{mailto:tpolenov@udel.edu}{tpolenov@udel.edu}.\n\nAUTHOR CONTRIBUTIONS\n\nA.M.G. and T.P. conceived and directed the project. M.L., S.S., M.W., J. K., M.F., C.M.Q., and S.B. performed NMR experiments. J.K. crystallized the fluorinated tryptophans, G.Y. solved the crystal structures, and S.S. performed DFT calculations. C.D. supervised the calculations. S.T.H. and J.S. contributed to the interpretation of the results. T.P., A.M.G., and C.D. took the lead in writing the manuscript. All authors discussed the results and commented on the manuscript.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-02_201_396_672_1453}\n\\end{center}\n\n\\section{INTRODUCTION}\nFluorine, or specifically, the magnetically active ${ }^{19} \\mathrm{~F}$ isotope, is an excellent NMR probe for applications in biological and biochemical studies due to its favorable magnetic and chemical properties. Being a $100 \\%$ naturally abundant spin- $1 / 2$ nucleus with a very high gyromagnetic ratio (third after ${ }^{3} \\mathrm{H}$ and ${ }^{1} \\mathrm{H}$ ), it possesses $83 \\%$ sensitivity compared to ${ }^{1} \\mathrm{H}$. Fluorine chemical shifts are exquisitely sensitive to changes in local environment, because its magnetic shielding is dominated by a large paramagnetic term: the ${ }^{19} \\mathrm{~F}$ chemical shift range is over $300 \\mathrm{ppm}$, 30-fold larger than that of ${ }^{1} \\mathrm{H} .{ }^{1-2}$ Fluorine is absent from virtually all naturally occurring biomolecules, small or large. In addition, fluorine can easily be biosynthetically incorporated into proteins in the context of either natural or unnatural amino acids or attached as a fluorinated tag to reactive amino acids, such as cysteine. ${ }^{1-5}$ In particular, tryptophan residues are often chosen for fluorine incorporation because of their relative sparseness in most proteins. ${ }^{6-7}$ Biosynthetic incorporation into proteins and peptides using standard $E$. coli expression systems is easy, ${ }^{3,} 8-10$ and the effects on conformation or biological activity of proteins upon fluorination are small, in most cases. ${ }^{3}$\n\nIndeed, ${ }^{19} \\mathrm{~F}$ has found interesting applications in NMR spectroscopy of biologically significant materials already. ${ }^{1-5,10-12}$ In solution, ${ }^{19} \\mathrm{~F}$ has been used as a probe to investigate protein folding, ${ }^{4}$ ligand binding, ${ }^{10}$ and conformational dynamics, ${ }^{2}$ including exciting applications to membrane proteins, such as $G$ protein-coupled receptors (GPCRs). ${ }^{13-14}$ In the solid state, ${ }^{19} \\mathrm{~F}$ chemical shift probes have been applied to membrane-associated peptides and proteins, using oriented samples and static experiments, as well as MAS NMR spectroscopy. ${ }^{15-21}$\n\nOne limitation that prevents the widespread use of fluorine as a NMR reporter in biochemical applications is the lack of a systematic understanding of the relationship between ${ }^{19} \\mathrm{~F}$ chemical shifts and local environments. This knowledge gap exists because there are, at present, no robust protocols for quantum mechanical calculations of ${ }^{19} \\mathrm{~F}$ chemical shifts. Such calculations have been traditionally difficult, ${ }^{22-23}$ due to the stringent requirements on the inclusion of electron-correlation terms, given the large number of electrons and free electron pairs in fluorine. Although earlier studies have suggested that Hartree-Fock self-consistent-field (HF SCF) or post-Hartree-Fock calculations are essential to compute accurate ${ }^{19} \\mathrm{~F}$ chemical shifts, ${ }^{22,}{ }^{24}$ recent reports suggest that density functional theory (DFT) can be used, provided that explicit solvent models are employed ${ }^{25}$ and appropriate hybrid functionals with sufficient exact exchange terms are applied. ${ }^{26-27}$ These developments are very promising.\n\nAnother challenge specific to ${ }^{19} \\mathrm{~F}$ solid-state NMR spectroscopy arises from its generic broad lines, ${ }^{21}$ often limiting fluorine-based correlation experiments when multiple sites are present. Currently the literature on ${ }^{19} \\mathrm{~F}$ magic angle spinning (MAS) NMR in biological systems is sparse, predominantly reporting on MAS studies at spinning frequencies below $25 \\mathrm{kHz}$, although a recent study demonstrated resolution enhancements for sitagliptin at 35 $\\mathrm{kHz}^{28}$ Developing optimal experimental conditions necessary for the acquisition of highquality datasets still need to be established.\n\nTo develop a robust protocol for ${ }^{19} \\mathrm{~F}$ MAS NMR spectroscopy-based characterization of structure and dynamics in fluorinated solids, it is imperative to examine a sufficiently large number of model systems to benchmark ${ }^{19} \\mathrm{~F}$ MAS NMR's use for biological applications. In this report, we present a combined ${ }^{19} \\mathrm{~F}$ MAS NMR and DFT study of fluorosubstituted tryptophans (Figure 1). We assess the dependence of the experimental ${ }^{19} \\mathrm{~F}$ chemical shift tensor (CST) parameters on the fluorine position in the aromatic ring and the chirality of the tryptophan molecule. For 5F-L-Trp, 5F-L-Trp $\\mathrm{H}_{2} \\mathrm{O}$, and 6F-DL-Trp, whose crystal structures we solved, DFT calculations of ${ }^{19} \\mathrm{~F}$ CST were carried out. Good agreement between experiment and theory was obtained when the PBE0 functional with a $50 \\%$ admixture of Hartree-Fock exchange terms was employed. On the experimental side, the use of high MAS frequencies of over $50 \\mathrm{kHz}$ is essential to obtain sufficiently narrow lines. Overall, the integrated approach presented here should set the stage for a wide variety of applications in organic and biological systems.\n\n\\section{MATERIALS AND METHODS}\n\\section{Fluorosubstituted tryptophans}\n4F-DL-tryptophan, 5F-L-tryptophan, 6F-L-tryptophan were purchased from Sigma-Aldrich. 5F-DL-tryptophan was purchased from MP Biomedicals, LLC (Santa Ana, CA). 6F-DLtryprophan was purchased from Apollo Scientific Ltd (UK). 7F-DL-tryptophan was purchased from Amatec Chemical Co. Ltd (Hong Kong). For measurements of the powders, all fluorosubstituted tryptophans were used without further purification.\n\n\\section{Crystallization of fluorosubstituted tryptophans and crystal structure determination}\n5F-L-tryptophan, 5F-DL-tryptophan, and 6F-DL-tryptophan were recrystallized from a $30 \\%$ water/ethanol mixture. Crystals suitable for X-ray diffraction were obtained at ambient temperature. The details of the crystal structure determination are provided in the Supporting Information.\n\n\\section{${ }^{19}$ F MAS NMR experiments}\n${ }^{19}$ F MAS NMR experiments on 4F-DL-tryptophan, 5F-DL-tryptophan, 5F-L-tryptophan, 6F-DL-tryptophan, 6F-L-tryptophan, and 7F-DL-tryptophan were carried out at room temperature $\\left(21^{\\circ} \\mathrm{C}\\right.$ ) on a $9.4 \\mathrm{~T}$ NMR spectrometer comprised of a wide-bore Magnex Scientific magnet and a Bruker AVANCE console. The spectrometer was equipped with a $3.2 \\mathrm{~mm}$ Varian T3 MAS HXY probe. The ${ }^{19} \\mathrm{~F}$ Larmor frequency was $376.476 \\mathrm{MHz}$. The samples comprised 20 mg of either 4F-DL-tryptophan, 5F-DL-tryptophan, 6F-DLtryptophan, or 6F-L-tryptophan packed in a 3.2-mm Varian rotor. For 5F-L-tryptophan and 7F-DL-tryptophan, $10 \\mathrm{mg}$ and $4 \\mathrm{mg}$ of sample, were packed into rotors, respectively. ${ }^{19} \\mathrm{~F}$ MAS NMR spectra were collected at MAS frequencies of $5 \\mathrm{kHz}, 7 \\mathrm{kHz}, 9 \\mathrm{kHz}$, and $11 \\mathrm{kHz}$, controlled to within $\\pm 10 \\mathrm{~Hz}$ by a Tecmag MAS controller. The typical ${ }^{19} \\mathrm{~F} 90^{\\circ}$ pulse length was $1.4 \\mu$ s. During the odd-numbered transients, a $180^{\\circ}$ pulse was applied before the $90^{\\circ}$ excitation pulse to suppress ${ }^{19} \\mathrm{~F}$ background signals. The recycle delay was $10 \\mathrm{~s}$.\n\n${ }^{19} \\mathrm{~F}$ MAS NMR experiments on $3.0 \\mathrm{mg}$ of 5F-DL-tryptophan, $3.0 \\mathrm{mg}$ of 5F-L-tryptophan, $1.8 \\mathrm{mg}$ of 6F-DL-tryptophan, and $2.2 \\mathrm{mg}$ of 6F-L-tryptophan, respectively, were also carried out on a Varian $14.1 \\mathrm{~T}$ narrow bore magnet equipped with a Bruker AVIII HD spectrometer operating at $564.278 \\mathrm{MHz}$ and outfitted with a $1.3 \\mathrm{~mm}$ Bruker HCN MAS probe. ${ }^{19} \\mathrm{~F}$ MAS NMR spectra were collected at MAS frequencies of $8 \\mathrm{kHz}, 11 \\mathrm{kHz}$ (except for 5F-DLtryptophan), $20 \\mathrm{kHz}, 30 \\mathrm{kHz}, 35 \\mathrm{kHz}, 40 \\mathrm{kHz}, 50 \\mathrm{kHz}$, and $60 \\mathrm{kHz}$; the frequencies were controlled to within $\\pm 5 \\mathrm{~Hz}$ by a Bruker MAS controller. The actual sample temperature was calibrated using $\\mathrm{KBr}$ as a temperature sensor and was maintained at $22 \\pm 1{ }^{\\circ} \\mathrm{C}$ throughout the experiments using a Bruker temperature controller. The typical ${ }^{19} \\mathrm{~F} 90^{\\circ}$ pulse length was $1.3$ $\\mu \\mathrm{s}$. The recycle delay was $3 \\mathrm{~s}$.\n\nThe effects of magnetic field strength and ${ }^{1} \\mathrm{H}$ decoupling were assessed using ${ }^{19} \\mathrm{~F}$ MAS NMR experiments with 5F-DL-tryptophan. MAS NMR experiments were carried out on an 11.7 T wide-bore Bruker AVANCE III spectrometer outfitted with a $2.5 \\mathrm{~mm}$ MAS HFX probe. Larmor frequencies were $500.1 \\mathrm{MHz}\\left({ }^{1} \\mathrm{H}\\right)$ and $470.6 \\mathrm{MHz}\\left({ }^{19} \\mathrm{~F}\\right) .8 \\mathrm{mg}$ of 5F-DLtryptophan were packed into a $2.5 \\mathrm{~mm}$ thick-walled Bruker rotor. ${ }^{19} \\mathrm{~F}$ MAS NMR spectra were collected at MAS frequencies of $5 \\mathrm{kHz}, 7 \\mathrm{kHz}, 11.111 \\mathrm{kHz}$, and $30 \\mathrm{kHz}$, with the frequencies controlled to within $\\pm 5 \\mathrm{~Hz}$ by a Bruker MAS controller. The actual sample temperature was calibrated using $\\mathrm{KBr}$ as a temperature sensor and was maintained at $20 \\pm 1^{\\circ} \\mathrm{C}$ throughout the experiments using a Bruker temperature controller. The typical $90^{\\circ}$ pulse lengths were $2.5 \\mu \\mathrm{s}\\left({ }^{1} \\mathrm{H}\\right)$, and $2.5 \\mu \\mathrm{s}\\left({ }^{19} \\mathrm{~F}\\right)$. Single-pulse ${ }^{19} \\mathrm{~F}$ spectra were acquired by using a small-angle excitation pulse with a pulse length of $0.5 \\mu \\mathrm{s} .{ }^{1} \\mathrm{H}$ TPPM decoupling ${ }^{29}$ (91 $\\mathrm{kHz}$ ) was used during the acquisition period. The recycle delay was $3 \\mathrm{~s}$.\n\nMAS NMR experiments were also carried out on a $19.96$ T Bruker AVANCE III spectrometer operating at $800.095 \\mathrm{MHz}$, outfitted with a $1.9 \\mathrm{~mm}$ MAS HX probe and a $1.6$ mm MAS HFDXY Phoenix probe. $9 \\mathrm{mg}$ of 5F-DL-tryptophan were packed into a $1.9 \\mathrm{~mm}$ thin-wall Bruker rotor. ${ }^{19} \\mathrm{~F}$ MAS NMR spectra were collected at MAS frequencies of 11 $\\mathrm{kHz}, 15 \\mathrm{kHz}, 30 \\mathrm{kHz}$, and $40 \\mathrm{kHz}$, and the frequencies were controlled to within $\\pm 5 \\mathrm{~Hz}$ by a Bruker MAS controller. The actual sample temperature was calibrated using $\\mathrm{KBr}$ as a temperature sensor and was maintained at $25 \\pm 1{ }^{\\circ} \\mathrm{C}$ throughout the experiments using a Bruker temperature controller. The typical $90^{\\circ}$ pulse length for ${ }^{19} \\mathrm{~F}$ was $1.8 \\mu \\mathrm{s}$. During the odd-numbered transients, a $180^{\\circ}$ pulse was applied before the $90^{\\circ}$ excitation pulse to suppress ${ }^{19} \\mathrm{~F}$ background signals. The recycle delay was $3 \\mathrm{~s}$.\n\n$7.6 \\mathrm{mg}$ of 5F-DL-tryptophan were also packed into a $1.6 \\mathrm{~mm}$ Varian rotor. ${ }^{19} \\mathrm{~F}$ MAS NMR spectra were collected at a MAS frequency of $40 \\mathrm{kHz}$, regulated to within $\\pm 5 \\mathrm{~Hz}$ by a Bruker MAS controller. The typical $90^{\\circ}$ pulse lengths were $2.7 \\mu \\mathrm{s}\\left({ }^{1} \\mathrm{H}\\right)$, and $2.7 \\mu \\mathrm{s}\\left({ }^{19} \\mathrm{~F}\\right) .{ }^{1} \\mathrm{H}$ TPPM decoupling $(10 \\mathrm{kHz})$ was used during the acquisition period. The recycle delay was $80 \\mathrm{~s}$.\n\n${ }^{19} \\mathrm{~F}$ chemical shifts were referenced to trifluoroacetic acid, TFA (100 $\\mu \\mathrm{M}$ solution in $25 \\mathrm{mM}$ sodium phosphate buffer, $\\mathrm{pH}$ 6.5), using an external reference ( $0 \\mathrm{ppm})$. All ${ }^{19} \\mathrm{~F}$ MAS spectra were processed using TopSpin. Baseline correction was employed using manually defined baseline points.\n\n\\section{Determination of chemical shift tensors}\nThe principal components of ${ }^{19} \\mathrm{~F}$ chemical shift tensors were determined by fitting the spinning sideband intensities according to the Herzfeld-Berger protocol. ${ }^{30}$ The peak intensities were obtained from TopSpin and were input into the HBA program, version 1.7.5. ${ }^{31}$\n\n\\section{DFT calculations}\n${ }^{19} \\mathrm{~F}$ magnetic shielding tensor calculations were carried out on 5F-L-TrpH $\\mathrm{H}_{2} \\mathrm{O}$, 5F-DL-Trp (L-form), and 6F-DL-Trp. For each, molecular clusters comprised of four molecules were generated from the crystal structures with GaussView, the graphical interface in Gaussian09 32 (Figure 4A-C).\n\nAll-atom geometry optimizations were carried out in Gaussian09, using the B3LYP functional and 6-31 $\\mathrm{G}$ basis set. The ${ }^{19} \\mathrm{~F}$ magnetic shielding tensor calculations were performed with the Amsterdam Density Functional Theory suite of programs ${ }^{33}$ (ADF2017), using a hybrid PBE0 functional with 50\\% Hartree-Fock (HF) exchange, and a TZ2P allelectron basis set (no frozen core). The numerical quality was set to 'very good' for each calculation using Becke integration. Magnetic shielding tensors were calculated only for the central fluorine atoms.\n\nThe ${ }^{19} \\mathrm{~F}$ chemical shifts were referenced by converting absolute magnetic shieldings $\\mathrm{s}$ into chemical shifts, using the relation $\\delta_{\\mathrm{i}}=\\sigma_{\\mathrm{ref}}-\\sigma_{\\mathrm{i}}$, with the value of $\\sigma_{\\text {ref }}$ determined by linear regression between calculated and experimental shifts. ${ }^{34}$\n\n\\section{SIMPSON and SIMMOL calculations}\nCalculations were performed for recrystallized 5F-L-Trp $\\cdot \\mathrm{H}_{2} \\mathrm{O}$, 5F-DL-Trp (L-form), and 6FDL-tryptophan. One fluorine in the crystal structure was chosen as the central atom and all other neighboring fluorines within $6 \\AA$ radius were considered for calculating dipolar coupling tensors. The SIMMOL program 35 reads in the atomic coordinates of the selected fluorines in the PDB format, from which it generates dipolar couplings and Euler angles.\n\nThe spectra of the crystals were simulated in SIMPSON. ${ }^{36}$ The experimental CSA tensors (Table 1) at $14.1 \\mathrm{~T}\\left({ }^{19} \\mathrm{~F}\\right.$ Larmor frequency of $\\left.564.278 \\mathrm{MHz}\\right)$ and a MAS frequency of 11 $\\mathrm{kHz}$ were used, with and without the F-F couplings added from the X-ray structures.\n\nThe peak intensities of the simulated spectra were obtained using NMRDRAW. ${ }^{37}$ These intensities and the isotropic chemical shifts (Table 1) were used in Herzfeld-Berger analysis for extracting the principal components of the tensors, the reduced anisotropy and the asymmetry parameter.\n\n\\section{RESULTS}\n\\section{${ }^{19} \\mathrm{~F}$ MAS NMR spectra of fluorosubstituted tryptophans}\n${ }^{19} \\mathrm{~F}$ MAS NMR spectra of powder and crystalline tryptophan with fluorine substitutions in the 4-, 5-, 6-, and 7-positions of the indole ring were acquired at magnetic field strengths of 9.4, 14.1, and $19.96 \\mathrm{~T}$, and at MAS frequencies ranging from 5 to $60 \\mathrm{kHz}$ (Figure 2, and S1S2 of the Supporting Information). Increasing the MAS frequency from 20 to $60 \\mathrm{kHz}$, in the absence of proton decoupling, results in dramatic line narrowing and increases in peak intensity, due to improved efficiency of the rotational averaging of ${ }^{19} \\mathrm{~F}$ chemical shift anisotropy (CSA) and ${ }^{1} \\mathrm{H}^{19} \\mathrm{~F} /{ }^{19} \\mathrm{~F}-{ }^{19} \\mathrm{~F}$ dipolar interactions (Figure 2; Table S1 of the Supporting Information). As can easily be appreciated from the comparison provided in Figure 2B, the spectral resolution attained for 5F-DL-tryptophan at $14.1 \\mathrm{~T}$ and a MAS frequency of $60 \\mathrm{kHz}$ in the absence of decoupling is similar to that observed in experiments at $19.96 \\mathrm{~T}$ and a MAS frequency of $40 \\mathrm{kHz}$, in the presence of ${ }^{1} \\mathrm{H}$ decoupling. At $60 \\mathrm{kHz}$, the linewidths are $~ 1 ~ p p m$ for all samples under investigation, indicating that the nonrecrystallized tryptophan powders are crystalline. This was confirmed by X-ray powder diffraction of 4F-DL-, 5F-DL-, 6F-L-, and 6F-DL- tryptophans (Figure S3 of the Supporting Information).\n\nThe above findings are important: they demonstrate that ${ }^{19} \\mathrm{~F}$ MAS NMR spectroscopy can be widely applied, even in the absence of specialized probes that are capable of ${ }^{1} \\mathrm{H}$ decoupling while detecting ${ }^{19} \\mathrm{~F}$.\n\n\\section{Experimental chemical shift tensors of fluorosubstituted tryptophans}\nTo determine accurate ${ }^{19} \\mathrm{~F}$ chemical shift parameters of the different fluorosubstituted tryptophans, we acquired ${ }^{19} \\mathrm{~F}$ MAS spectra at different magnetic field strengths $(9.4,14.1$, and $19.96 \\mathrm{~T})$ and at MAS frequencies ranging between 5 and $60 \\mathrm{kHz} .{ }^{19} \\mathrm{~F}$ isotropic shifts are summarized in Table 1 . The MAS isotropic shifts of $4 \\mathrm{~F}-\\operatorname{Trp}$ and $6 \\mathrm{~F}$-Trp are similar to the solution NMR values, to within $1 \\mathrm{ppm}$, for fluorosubstituted L-Trp molecules. ${ }^{5}$ For 7F-LTrp, a difference of $3.1 \\mathrm{ppm}$ is observed (the solution NMR shift is $-58.8 \\mathrm{ppm}$ ). Isotropic shifts range from $-41.4$ to $-59.6 \\mathrm{ppm}$, influenced by the position of the fluorine in the indole ring and the local environments. Interestingly, MAS isotropic shifts appear to be sensitive to the hydration state of the molecule, as seen for 5F-Trp (Figure 2C). The shift of $-46.4 \\mathrm{ppm}$ appears to be associated with the monohydrate form of the 5F-L-Trp. The chemical shift of -48.7 ppm was observed in microcrystalline non-hydrated powders of 5F-DL-Trp (minor peak), 5F-L-Trp (major peak), and is the only species in the recrystallized 5F-DL-Trp. Interestingly, a pure L-enantiomer was detected in the single-crystal X-ray diffraction experiments. The L-conformation was assigned based on the handedness that gave values of the Flack parameter closest to zero, albeit the standard error values were high (see Supporting Information). The major resonance in the 5F-DL-Trp powder ( $-47.7 \\mathrm{ppm})$ is assigned to the D-enantiomer by exclusion.\n\nRepresentative spectra acquired at MAS frequencies ranging between 5 and $15 \\mathrm{kHz}$ are provided in Figure 3 (all spectra are shown in Figures S1-S2 of the Supporting Information). ${ }^{19} \\mathrm{~F}$ CSTs have been previously determined for 5F-L, 5F-DL-, 6F-L- and 6F-DL-tryptophan, and the reported values for the reduced anisotropy parameter, $\\delta_{\\sigma}$, for 5F-DL-Trp differ by $2.2 \\mathrm{ppm}$ for the MAS $^{38}$ vs. the single-crystal static ${ }^{39}$ NMR study. These differences may be due to experimental uncertainties or, more likely, different crystal forms. In the present work, we recorded multiple MAS spectra for each compound, which permitted us to extract accurate CST parameters and assess the range of experimental errors in these measurements.\n\nExperimental CST parameters were obtained by analyzing the spinning sideband intensities using the Herzfeld-Berger protocol. ${ }^{30}$ All values are summarized in Table 1 . The reduced anisotropy parameters range between $48.6$ and $67.6 \\mathrm{ppm}$. The positioning of the fluorine in the indole ring exerts the largest effect on the shift, and smaller, but distinct, differences $(0.5$ - $3.2 \\mathrm{ppm}$ ) are observed for molecules of different chirality. All of the tensors are rhombic, with the asymmetry parameters ranging from 0.44-0.50 (for 5F-Trp) to $0.95$ (for 4F-Trp). Overall, pronounced differences in the CST parameters are observed, underscoring the remarkably high sensitivity of fluorine chemical shift tensors to local electronic structure.\n\nCST parameters for every fluorosubstituted tryptophan and each set of spectra (Table S2 of the Supporting Information) permitted us to evaluate the experimental errors carefully. The experimental uncertainties in the ${ }^{19} \\mathrm{~F}$ reduced anisotropy parameter $\\delta_{\\sigma}$, extracted from the spinning sideband analyses of the MAS spectra, are of the order of 0.8-3.7 ppm, or 5-7\\% of the total magnitude of $\\delta_{\\sigma}$. This error range is reasonable, since accurate values rely on the intensities of the outer, low-intensity sidebands, whose quantification becomes more difficult for slower MAS frequencies. We also considered the effect of ${ }^{19} \\mathrm{~F}-{ }^{19} \\mathrm{~F}$ homonuclear couplings on the spinning sideband intensities for the 5F-DL-Trp, 5F-L-Trp $\\cdot \\mathrm{H}_{2} \\mathrm{O}$, and $6 \\mathrm{~F}$ DL-Trp crystalline samples whose structures we solved (Table 2). For 5F-DL-Trp and 5F-LTrp $\\mathrm{H}_{2} \\mathrm{O}$, the effects are negligible. For 6F-DL-Trp the effects were small, but discernable, in the absence of ${ }^{1} \\mathrm{H}$ decoupling, and need to be considered when CST parameters are extracted from the spectra. Overall, the CSTs for 5F-L/DL and 6F-L/DL tryptophan determined here are in good agreement with the published values, ${ }^{38,40}$ within experimental uncertainty.\n\nDensity functional theory calculations of ${ }^{19} \\mathrm{~F}$ chemical shift tensors of fluorosubstituted tryptophans\n\nRecent studies indicate that in the DFT calculations of ${ }^{19} \\mathrm{~F}$ chemical shifts in solids, using the Amsterdam Density Functional (ADF) program with the PBE0 functional, ${ }^{41}$ a $50 \\%$ HartreeFock (HF) exchange admixture term, and an all-electron Slater-type (TZ2P) basis set yields values in reasonable agreement with experiment, if the molecular clusters reflect the overall symmetry of the crystal lattice. ${ }^{26-27}$ As revealed by the XRD patterns (Figure S3 of the Supporting Information), the crystal forms of the powdered fluorosubstituted tryptophans are not the same as the reported X-ray structures of the parent L-tryptophan, ${ }^{42}$ DL-tryptophan ${ }^{43}$ or $5 F$-DL-tryptophan ${ }^{39}$ in the Cambridge crystallographic data base. We therefore restricted our chemical shift calculations to $5 \\mathrm{~F}-\\mathrm{L}-\\mathrm{Trp}$, 5F-L-Trp $\\cdot \\mathrm{H}_{2} \\mathrm{O}$, and 6F-DLTrp crystals, whose structures we solved.\n\nFour molecule clusters were constructed, using the crystal coordinates. The molecular geometries of these clusters are shown in Figure 4(A-C), and the results of the chemical shift calculations are summarized in Figure $4 \\mathrm{D}$ and Table 1. Gratifyingly, the calculated tensors are in reasonable overall agreement with the experimental values with a slope of $1.12$ for the correlation between experimental and calculated chemical shift tensor components. Given that we restricted our calculations to the $5 \\mathrm{~F}$ - and $6 \\mathrm{~F}$-substituted tryptophans for which crystal structures were solved, the chemical shift range is too small (5.8 and $6.9 \\mathrm{ppm}$ for the isotropic shift and reduced anisotropy, respectively) to conduct rigorous analyses with respect to the quality of the calculations. Nevertheless, the slope of $1.12$ for the principal components of the CST in the four-molecule clusters suggests that these models do not fully capture the long-range electrostatic effects on the magnetic shielding. This is in line with previous studies, ${ }^{26-27}$ and a result of the fact that fluorine magnetic shieldings are dominated by long-range electrostatic contributions. Future studies will be conducted on larger molecular cluster models (15-17 molecules; 400-500 atoms) and on 4F- and 7F-substituted crystalline tryptophans of known structures.\n\nIt should also be noted, that periodic structure calculations do not yield better agreement with experiment, and large cluster calculations using appropriately constructed symmetryadapted molecular clusters and high level of theory appear to be necessary, as we have demonstrated previously for fluorine in a wide variety of environments. ${ }^{27}$\n\n\\section{DISCUSSION}\nSolid state ${ }^{19} \\mathrm{~F}$ NMR chemical shift parameters were determined for a series of crystalline tryptophans containing fluorine at the 4-, 5-, 6-, and 7- positions. The isotropic and anisotropic components of the CSTs in these molecules are very sensitive to the positioning of the fluorine atom in the indole ring, thereby making fluorotryptophans excellent ${ }^{19} \\mathrm{~F}$ NMR probes in protein studies, as has been previously shown for solution NMR studies. ${ }^{5,} 10$ One important result of the current work is the demonstration that the ${ }^{19} \\mathrm{~F}$ lines are narrow at a MAS frequency of $60 \\mathrm{kHz}$, diminishing the need for ${ }^{1} \\mathrm{H}$ decoupling. This observation holds true for proteins as well, making ${ }^{19} \\mathrm{~F}$ MAS NMR investigations on a broad range of large biological molecules and assemblies practical and accessible to many laboratories. Although we currently do not have access to ${ }^{19} \\mathrm{~F}$ 'ultrafast' MAS probes (frequencies of $100-110 \\mathrm{kHz}$ ), it is possible to extrapolate our findings to MAS frequencies above $100 \\mathrm{kHz}$, where, similar to the ${ }^{1} \\mathrm{H}$ ultrafast MAS NMR studies of organic molecules and proteins, ${ }^{44-45}$ further line narrowing and sensitivity gains are expected.\n\nIn addition to our experimental studies by MAS NMR spectroscopy, we also performed DFT calculations of chemical shift tensors in fluorosubstituted tryptophan crystals with known structures. This investigation was prompted by the paucity of literature on quantum chemical calculations of ${ }^{19} \\mathrm{~F}$ NMR parameters, both for organic and biological systems. Our findings demonstrate that density functional theory can be used successfully for the calculation of ${ }^{19} \\mathrm{~F}$ CSA parameters, provided a high percentage (50\\%) of the HF exchange term is used in the functional and the wavefunction is expanded in a basis of Slater-type atomic orbitals. Future investigations for improving the accuracy of these calculations will focus on large molecular clusters that reflect the overall crystal symmetry and capture long-range electrostatic effects.\n\n\\section{CONCLUSIONS}\nOur integrated experimental ${ }^{19} \\mathrm{~F}$ MAS NMR and computational DFT study of fluorosubstituted tryptophans permitted a thorough evaluation of the influence of the local environment on the ${ }^{19} \\mathrm{~F}$ chemical shift tensor and demonstrated the advantages of fast-MAS (60 $\\mathrm{kHz}$ or greater) experiments for studying ${ }^{19} \\mathrm{~F}$-containing solid biological materials. The approach presented here is broadly applicable for characterization of other organic solids by ${ }^{19}$ F MAS NMR spectroscopy and holds particular promise for studies employing fluorosubstituted tryptophans in proteins and protein assemblies.\n\n\\section{SUPPORTING INFORMATION AVAILABLE}\nMAS NMR spectra of fluorosubstituted tryptophans at several magnetic fields and MAS frequencies; powder XRD patterns; MAS frequency and magnetic field dependence of the sensitivity of the ${ }^{19} \\mathrm{~F}$ MAS NMR experiments; summary of experimental CSA parameters at various field strengths; for recrystallized 5F-DL-Trp, 5F-L-Trp $\\mathrm{H}_{2} \\mathrm{O}$, and 6F-DL-Trp - i) Xray structure determination protocols; ii) crystal data and structure refinement parameters; iii) atomic coordinates and equivalent isotropic displacement parameters; iv) bond lengths and bond angles; v) anisotropic displacement parameters; vi) hydrogen coordinates and isotropic displacement parameters. This information can be found on the internet at http:// \\href{http://pubs.acs.org}{pubs.acs.org}.\n\n\\section{Supplementary Material}\nRefer to Web version on PubMed Central for supplementary material.\n\n\\section{ACKNOWLEDGMENTS}\nWe thank Professor Eric Bloch for the use of the powder XRD instrumentation. This work was supported by the National Science Foundation (NSF Grant CHE-1708773 to AMG and TP) and by the National Institutes of Health (NIGMS and NIAID, Grant P50 GM082251, Technology Development Project on MAS NMR). We acknowledge the National Science Foundation (NSF grant CHE-0959496) for the acquisition of the $850 \\mathrm{MHz}$ NMR spectrometer at the University of Delaware and the National Institutes of Health (NIH Grants P30GM103519 and P30GM110758) for the support of core instrumentation infrastructure at the University of Delaware.\n\n\\section{REFERENCES}\n\\begin{enumerate}\n  \\item Gakh YG; Gakh AA; Gronenborn AM, Fluorine as an NMR Probe for Structural Studies of Chemical and Biological Systems. Magn. Reson. Chem 2000, 38, 551-558.\n\n  \\item Sharaf NG; Ishima R; Gronenborn AM, Conformational Plasticity of the NNRTIBinding Pocket in HIV-1 Reverse Transcriptase: A Fluorine Nuclear Magnetic Resonance Study. Biochemistry 2016, 55, 3864-3873. [PubMed: 27163463]\n\n  \\item Campos-Olivas R; Aziz R; Helms GL; Evans JNS; Gronenborn AM, Placement of ${ }^{19} \\mathrm{~F}$ into the Center of GB1: Effects on Structure and Stability. FEBS Lett. 2002, 517, 5560.\n\n  \\item Matei E; Andre S; Glinschert A; Infantino AS; Oscarson S; Gabius HJ; Gronenborn AM, Fluorinated Carbohydrates as Lectin Ligands: Dissecting Glycan-Cyanovirin Interactions by Using F-19 NMR Spectroscopy. Chem.-Eur. J 2013, 19, 5364–5374. [PubMed: 23447543]\n\n  \\item Matei E; Gronenborn AM, F-19 Paramagnetic Relaxation Enhancement: AValuable Tool for Distance Measurements in Proteins. Angew. Chem.-Int. Edit 2016, 55, 150-154.\n\n  \\item Carugo O, Amino Acid Composition and Protein Dimension. Protein Sci 2008, 17, 2187-2191. [PubMed: 18780815] 7. Gaur RK, Amino Acid Frequency Distribution among Eurkaryotic Proteins. IIOAB J. 2014, 5, 6-11.\n\n  \\item Clore GM; Gronenborn AM; Birdsall B; Feeney J; Roberts GCK, ${ }^{19} \\mathrm{~F}-\\mathrm{NMR}$ Studies of $3^{\\prime}, 5^{\\prime}$ Difluoromethotrexate Binding to Lactobacillus casei Dihydrofolate Reductase - Molecular Motion and Coenzyme-Induced Conformational Changes. Biochem. J 1984, 217, 659-666. [PubMed: 6424648\n\n  \\item Crowley PB; Kyne C; Monteith WB, Simple and Inexpensive Incorporation of ${ }^{19}$ F-Tryptophan for Protein NMR Spectroscopy. Chem. Commun 2012, 48, 10681-10683.\n\n  \\item Sharaf NG; Gronenborn AM, ${ }^{19}$ F-Modified Proteins and ${ }^{19}$ F-Containing Ligands as Tools in Solution NMR Studies of Protein Interactions In Isotope Labeling of Biomolecules - Labeling Methods, Kelman Z, Ed. Elsevier Academic Press Inc: San Diego, 2015; Vol. 565, pp 67-95.\n\n  \\item Kitevski-LeBlanc JL; Prosser RS, Current Applications of ${ }^{19} \\mathrm{~F}$ NMR to Studies of Protein Structure and Dynamics. Prog. Nucl. Magn. Reson. Spectrosc 2012, 62, 1-33. [PubMed: 22364614]\n\n  \\item Judge PJ; Watts A, Recent contributions from solid-state NMR to the understanding of membrane protein structure and function. Curr. Opin. Chem. Biol 2011, 15, 690-695. [PubMed: 21862384]\n\n  \\item Didenko T; Liu JJ; Horst R; Stevens RC; Wuthrich K, Fluorine-19 NMR of Integral Membrane Proteins Illustrated with Studies of GPCRs. Curr. Opin. Struct. Biol 2013, 23, 740-747. [PubMed: 23932201]\n\n  \\item Prosser RS; Luchette PA; Westerman PW, Using O-2 to Probe Membrane Immersion Depth by ${ }^{19} \\mathrm{~F}$ NMR. Proc. Natl. Acad. Sci. U. S. A 2000, 97, 9967-9971. [PubMed: 10954744]\n\n  \\item Koch K; Afonin S; Ieronimo M; Berditsch M; Ulrich AS, Solid-State ${ }^{19}$ F NMR of Peptides in Native Membranes In Solid State Nmr, Chan JCC, Ed. Springer-Verlag Berlin: Berlin, 2012; Vol. 306, pp 89-118.\n\n  \\item Wadhwani P; Strandberg E; Heidenreich N; Burck J; Fanghanel S; Ulrich AS, SelfAssembly of Flexible Beta-Strands into Immobile Amyloid-Like beta-Sheets in Membranes As Revealed by Solid-State ${ }^{19}$ F NMR. J. Am. Chem. Soc 2012, 134, 6512-6515. [PubMed: 22452513]\n\n  \\item Buffy JJ; Waring AJ; Hong M, Determination of Peptide Oligomerization in Lipid Bilayers Using ${ }^{19}$ F Spin Diffusion NMR. J. Am. Chem. Soc 2005, 127, 4477–4483. [PubMed: 15783230]\n\n  \\item Luo WB; Mani R; Hong M, Side-chain Conformation of the M2 Transmembrane Peptide Proton Channel of Influenza A Virus from ${ }^{19}$ F Solid-State NMR. J. Phys. Chem. B 2007, 111, 1082510832. [PubMed: 17705425]\n\n  \\item Su YC; DeGrado WF; Hong M, Orientation, Dynamics, and Lipid Interaction of an Antimicrobial Arylamide Investigated by ${ }^{19} \\mathrm{~F}$ and ${ }^{31} \\mathrm{P}$ Solid-State NMR Spectroscopy. J. Am. Chem. Soc 2010 , 132, 9197–9205. [PubMed: 20536141]\n\n  \\item Hong M; Schmidt-Rohr K, Magic-Angle-Spinning NMR Techniques for Measuring LongRange Distances in Biological Macromolecules. Acc. Chem. Res 2013, 46, 2154-2163. [PubMed: 23387532]\n\n  \\item Hellmich UA; Pfleger N; Glaubitz C, ${ }^{19}$ F MAS NMR on Proteorhodopsin: Enhanced Protocol for Site-Specific Labeling for General Application to Membrane Proteins. Photochem. Photobiol 2009, 85, 535-539. [PubMed: 19192211]\n\n  \\item Harding ME; Lenhart M; Auer AA; Gauss J, Quantitative Prediction of Gas-Phase ${ }^{19} \\mathrm{~F}$ Nuclear Magnetic Shielding Constants. J. Chem. Phys 2008, 128, 10.\n\n  \\item Sanders LK; Oldfield E, Theoretical Investigation of ${ }^{19} \\mathrm{~F}$ NMR Chemical Shielding Tensors in Fluorobenzenes. J. Phys. Chem. A 2001, 105, 8098-8104.\n\n  \\item Elavarasi SB; Dorai K, Characterization of the ${ }^{19}$ F Chemical Shielding Tensor Using CrossCorrelated Spin Relaxation Measurements and Quantum Chemical Calculations. Chem. Phys. Lett 2010, 489, 248-253.\n\n  \\item Isley WC; Urick AK; Pomerantz WCK; Cramer CJ, Prediction of ${ }^{19}$ F NMR Chemical Shifts in Labeled Proteins: Computational Protocol and Case Study. Mol. Pharm 2016, 13, 2376-2386. [PubMed: 27218275]\n\n  \\item Holmes ST; Iuliucci RJ; Mueller KT; Dybowski C, Critical Analysis of Cluster Models and Exchange-Correlation Functionals for Calculating Magnetic Shielding in Molecular Solids. J. Chem. Theory Comput 2015, 11, 5229–5241. [PubMed: 26894239] 27. Alkan F; Holmes ST; Dybowski C, Role of Exact Exchange and Relativistic Approximations in Calculating ${ }^{19} \\mathrm{~F}$ Magnetic Shielding in Solids Using a Cluster Ansatz. J Chem Theory Comput 2017, 13, 4741-4752. [PubMed: 28930636]\n\n  \\item Roos M; Wang T; Shcherbakov AA; Hong M, Fast Magic-Angle-Spinning ${ }^{19}$ F Spin Exchange NMR for Determining Nanometer ${ }^{19} \\mathrm{~F}^{19} \\mathrm{~F}$ Distances in Proteins and Pharmaceutical Compounds. J. Phys. Chem. B 2018, 122, 2900–2911. [PubMed: 29486126]\n\n  \\item Bennett AE; Rienstra CM; Auger M; Lakshmi KV; Griffin RG, Heteronuclear Decoupling in Rotating Solids. J. Chem. Phys 1995, 103, 6951-6958.\n\n  \\item Herzfeld J; Berger AE, Sideband intensities in NMR spectra of samples spinning at the magic angle. J. Chem. Phys 1980, 73, 6021-6030.\n\n  \\item Eichele K HBA, 1.7.5; Universität Tübingen, 2015.\n\n  \\item Frisch MJ; Trucks GW; Schlegel HB; Scuseria GE; Robb MA; Cheeseman JR; Scalmani G; Barone V; Mennucci B; Petersson GA, et al., Gaussian 09, Revision B.01. In Gaussian 09, Revision B.01, Wallingford CT, 2009.\n\n  \\item te Velde G; Bickelhaupt FM; Baerends EJ; Fonseca Guerra C; van Gisbergen SJA; Snijders JG; Ziegler T, Chemistry with ADF. J. Comp. Chem 2001, 22, 931-967.\n\n  \\item Baias M; Dumez JN; Svensson PH; Schantz S; Day GM; Emsley L, De Novo Determination of the Crystal Structure of a Large Drug Molecule by Crystal Structure Prediction-Based Powder NMR Crystallography. J. Am. Chem. Soc 2013, 135, 17501–17507. [PubMed: 24168679]\n\n  \\item Bak M; Schultz R; Vosegaard T; Nielsen NC, Specification and Visualization of Anisotropic Interaction Tensors in Polypeptides and Numerical Simulations in Biological Solid-State NMR. J. Magn. Reson 2002, 154, 28-45. [PubMed: 11820824]\n\n  \\item Bak M; Rasmussen JT; Nielsen NC, SIMPSON: A General Simulation Program for Solid-State NMR Spectroscopy. J. Magn. Reson 2011, 213, 366-400. [PubMed: 22152357]\n\n  \\item Delaglio F; Grzesiek S; Vuister GW; Zhu G; Pfeifer J; Bax A, NMRPipe: A Multidimensional Spectral Processing System Based on UNIX Pipes. J. Biomol. NMR 1995, 6, 277-293. [PubMed: 8520220]\n\n  \\item Dürr UH; Grage SL; Witter R; Ulrich AS, Solid-State ${ }^{19}$ F NMR Parameters of Fluorine-Labeled Amino Acids. Part I: Aromatic Substituents. J. Magn. Reson 2008, 191, 7-15. [PubMed: 18155936]\n\n  \\item Zhao X; DeVries JS; McDonald R; Sykes BD, Determination of the ${ }^{19}$ F NMR Chemical Shielding Tensor and Crystal Structure of 5-Fluoro-DL-Tryptophan. J. Magn. Reson 2007, 187, 88-96. [PubMed: 17475524]\n\n  \\item Zhao GP; Perilla JR; Yufenyuy EL; Meng X; Chen B; Ning JY; Ahn J; Gronenborn AM; Schulten K; Aiken C, et al., Mature HIV-1 Capsid Structure by CryoElectron Microscopy and All-Atom Molecular Dynamics. Nature 2013, 497, 643-646. [PubMed: 23719463]\n\n  \\item Adamo C; Barone V, Toward Reliable Density Functional Methods Without Adjustable Parameters: The PBE0 Model. J. Chem. Phys 1999, 110, 6158-6170.\n\n  \\item Gorbitz CH; Tornroos KW; Day GM, Single-Crystal Investigation of L-Tryptophan with Z' = 16 . Acta Cryst. B 2012, 68, 549-557. [PubMed: 22992800]\n\n  \\item Hübschle CB; Messerschmidt M; Luger P, Crystal Structure of DLTryptophan at 173 K. Cryst. Res. Techn 2004, 39, 274-278.\n\n  \\item Andreas LB; Le Marchand T; Jaudzems K; Pintacuda G, High-Resolution ProtonDetected NMR of Proteins at Very Fast MAS. J. Magn. Reson 2015, 253, 36-49. [PubMed: 25797003]\n\n  \\item Struppe J; Quinn CM; Lu M; Wang M; Hou G; Lu X; Kraus J; Andreas LB; Stanek J; Lalli D, et al., Expanding the Horizons for Structural Analysis of Fully Protonated Protein Assemblies by NMR Spectroscopy at MAS Frequencies Above $100 \\mathrm{kHz}$. Solid State Nucl. Magn. Reson 2017, 87, 117-125. [PubMed: 28732673] A\n\n\\end{enumerate}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-12_260_407_369_661}\n\\end{center}\n\nF\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-12_478_622_371_659}\n\\end{center}\n\nB\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-12_253_408_705_976}\n\\end{center}\n\nG\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-12_472_623_706_974}\n\\end{center}\n\n$\\mathrm{C}_{\\mathrm{F}}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-12_217_407_1010_1278}\n\\end{center}\n\n$\\mathrm{H}_{\\mathrm{F}}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-12_439_623_1012_1281}\n\\end{center}\n\nD\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-12_275_408_1319_1630}\n\\end{center}\n\nI\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-12_496_621_1323_1632}\n\\end{center}\n\nE\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-12_275_408_1662_1954}\n\\end{center}\n\nJ\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-12_492_625_1662_1949}\n\\end{center}\n\nFigure 1.\n\nChemical structures for tryptophan and variously substituted fluorotryptophan molecules (A) DL-tryptophan, (B) 4F-DL-tryptophan, (C) 5F-DL-tryptophan, (D) 6F-DL-tryptophan, (E) 7F-DL-tryptophan, (F) L-tryptophan, (G) 4F-L-tryptophan, (H) 5F-L-tryptophan, (I) 6F-Ltryptophan, (J) 7F-L-tryptophan.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-13_199_1882_390_1935}\n\\end{center}\n\nFigure 2.\n\n(A) MAS frequency dependence of the linewidth and signal intensity of fluorosubstituted tryptophan crystalline powders (top to bottom): 6F-L-tryptophan, 6F-DL-tryptophan, 5F-Ltryptophan, 5FDL-tryptophan. 1D ${ }^{19} \\mathrm{~F}$ spectra were acquired at $14.1 \\mathrm{~T}\\left(564.278 \\mathrm{MHz}{ }^{19} \\mathrm{~F}\\right.$ Larmor frequency) and MAS frequencies of $20 \\mathrm{kHz}, 30 \\mathrm{kHz}, 35 \\mathrm{kHz}, 40 \\mathrm{kHz}, 50 \\mathrm{kHz}$, and $60 \\mathrm{kHz}$. (B) For 5F-DL-tryptophan, ${ }^{19} \\mathrm{~F}$ 1D spectra were also acquired at $19.96 \\mathrm{~T}$ (800.095 $\\mathrm{MHz}{ }^{19} \\mathrm{~F}$ Larmor frequency) and a MAS frequency of $40 \\mathrm{kHz}$, with (right spectrum) and without ${ }^{1} \\mathrm{H}$ decoupling (left spectrum). (C) Superposition of the ${ }^{19} \\mathrm{~F}$ MAS NM spectra for different forms of 5F-Trp (powder vs. crystal). The chemical shift of $-46.4 \\mathrm{ppm}$ likely corresponds to the monohydrate form.\n\n\\section{A 9.4 $\\mathrm{T}, \\omega_{\\mathrm{r}}=7 \\mathrm{kHz}$}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-14_245_1045_478_779}\n\\end{center}\n\nB 14.1 $\\mathrm{T}, \\omega_{\\mathbf{r}}=8 \\mathrm{kHz}$\n\n5F-L-tryptophan\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-14_1159_1498_468_763}\n\\end{center}\n\nC 14.1 T, $\\omega_{\\mathbf{r}}=11 \\mathrm{kHz}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-14_1571_1975_474_762}\n\\end{center}\n\n7F-DL-tryptophan\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-14_309_613_858_1170}\n\\end{center}\n\n${ }^{19} \\mathrm{~F}$ Chemical shift (ppm)\n\n5F-DL-tryptophan\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-14_709_1048_861_1156}\n\\end{center}\n\n5F-DL-tryptophan\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-14_1171_1491_859_1152}\n\\end{center}\n\n5F-DL-tryptophan\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-14_1625_1931_859_1152}\n\\end{center}\n\n${ }^{19} \\mathrm{~F}$ Chemical shift (ppm) 6F-L-tryptophan\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-14_710_1046_1236_1545}\n\\end{center}\n\n6F-L-tryptophan\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-14_1165_1491_1235_1541}\n\\end{center}\n\n6F-DL-tryptophan\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-14_711_1050_1626_1935}\n\\end{center}\n\n6F-DL-tryptophan\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-14_1167_1500_1625_1931}\n\\end{center}\n\n6F-DL-tryptophan\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-14_1626_1968_1626_1930}\n\\end{center}\n\nFigure 3.\n\n${ }^{19}$ F MAS NMR spectra of microcrystalline powders of fluorosubstituted tryptophans acquired at (A) $9.4 \\mathrm{~T}$ and $7 \\mathrm{kHz}$, (B) $14.1 \\mathrm{~T}$ and $8 \\mathrm{kHz}$, and (C) $14.1 \\mathrm{~T}$ and $11 \\mathrm{kHz}$. The peaks colored in light grey in $(\\mathrm{A})$ arise from the ${ }^{19} \\mathrm{~F}$ signal of the sample spacer.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-15_198_1483_466_1870}\n\\end{center}\n\nFigure 4.\n\n(A-C) Molecular clusters of (A) 5F-L-tryptophan monohydrate, (B) 5F-L-tryptophan, and (C) 6FDL-tryptophan generated from the crystal structure coordinates. Fluorine atoms are shown in deep teal, nitrogen atoms in purple, oxygen atoms in orange, carbons in pale cyan, hydrogen atoms in dark grey. (D) Correlation between experimental and calculated ${ }^{19} \\mathrm{~F}$ chemical shift tensors for the three model clusters in fluorosubstituted tryptophans. The principal components of magnetic shielding tensors $\\delta_{11}, \\delta_{22}$ and $\\delta_{33}$ are shown as circles, triangles and squares, respectively. The best fit is shown as a solid line and the ideal $y=x$ as a dashed line. All calculations were performed with the ADF suite of programs.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-16_209_2361_173_1155}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_799ee1c298d190145c70g-17_220_2361_187_941}\n\\end{center}\n\n\n\\end{document}", "record_id": "2023_09_22_799ee1c298d190145c70g"}