{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{PAPER }\n\n\n\\author{Yusheng Wang, (D) ${ }^{* a c}$ Nahong Song, ${ }^{\\text {bc }}$ Xiaoyan Song, ${ }^{a}$ Tianjie Zhang, ${ }^{\\text {a }}$ Qiaoli Zhang ${ }^{a}$\\\\\nand Meng $\\mathrm{Li}^{d}$}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nView Article Online\n\nView Journal | View Issue\n\n\\section{Check for updates}\nCite this: RSC Adv., 2018, 8, 10848 Received 28th January 2018 Accepted 13th March 2018\n\nDOI: $10.1039 / \\mathrm{c} 8 \\mathrm{ra00861 \\textrm {b }}$\n\n\\href{http://rsc.li/rsc-advances}{rsc.li/rsc-advances}\n\n\\section{Metallic $\\mathrm{VO}_{2}$ monolayer as an anode material for $\\mathrm{Li}$, $\\mathrm{Na}, \\mathrm{K}, \\mathrm{Mg}$ or $\\mathrm{Ca}$ ion storage: a first-principle study}\nUsing density functional theory (DFT), we assess the suitability of monolayer $\\mathrm{VO}_{2}$ as promising electrode materials for $\\mathrm{Li}, \\mathrm{Na}, \\mathrm{K}, \\mathrm{Mg}$ and $\\mathrm{Ca}$ ion batteries. The metallic $\\mathrm{VO}_{2}$ monolayer can offer an intrinsic advantage for the transportation of electrons in materials. The results suggest that $\\mathrm{VO}_{2}$ can provide excellent mobility with lower diffusion barriers of $0.043 \\mathrm{eV}$ for $\\mathrm{K}, 0.119 \\mathrm{eV}$ for Li, $0.098 \\mathrm{eV}$ for $\\mathrm{Na}$, $0.517 \\mathrm{eV}$ for $\\mathrm{Mg}$, and $0.306 \\mathrm{eV}$ for $\\mathrm{Ca}$. The specific capacities of $\\mathrm{Li}, \\mathrm{Na}$ and $\\mathrm{Mg}$ can reach up to 968,613 and $815 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1}$ respectively, which are significantly larger than the corresponding value of graphite. Herein, with high open-circuit voltage the $\\mathrm{VO}_{2}$ sheet could be a promising candidate for the anode material in battery applications.\n\n\\section{Introduction}\nThe increase of the energy demands and the concentration of carbon dioxide in the atmosphere signify the search for sustainable and renewable energy sources. Li-ion battery (LIB) is an attractive power source and has been widely applied in portable electronic devices and electric vehicles. ${ }^{1-7}$ However, several issues including cost, safety, and capacity restrict the further development in large scale energy storage applications of LIB. ${ }^{8,9}$ Therefore, the development of new types of batteries is urgently needed. Batteries based on alternative carrier ions, such as $\\mathrm{Na},{ }^{10-13} \\mathrm{~K}^{14,15} \\mathrm{Mg}^{16,17}$ or $\\mathrm{Ca},{ }^{17}$ may be more suitable for large-scale energy storage systems. It is well known that the performance of ion batteries relies greatly on the properties of electrode materials. Therefore, great effort is being expended on finding novel and efficient electrode materials for next generation of renewable energy technologies. So far, two-dimensional (2D) materials, such as graphene ${ }^{18}$ porous graphene, ${ }^{19}$ silicene, $^{20}$ transition-metal dichalcogenides (TMDS), ${ }^{21-24}$ MXenes, ${ }^{25}$ black phosphorus ${ }^{26,27}$ and borophene, ${ }^{6,28-30}$ have been widely studied because of their particular structural, physical, and chemical properties, which may enable the high capacity and the fast metal ion diffusivity.\n\nRecently, a new 2D material, namely vanadium dioxide $\\left(\\mathrm{VO}_{2}\\right)$ has attracted great attention owing to its semiconductor to\n\n${ }^{a}$ School of Mathematics and Statistics, North China University of Water Resources and Electric Power, Zhengzhou, Henan, 450046, China. E-mail: \\href{mailto:wangyusheng@ncwu.edu}{wangyusheng@ncwu.edu}. $\\mathrm{cn}$\n\n${ }^{b}$ College of Computer and Information Engineering, Henan University of Economics and Law, Zhengzhou, Henan, 450000, China\n\n'International Joint Research Laboratory for Quantum Functional Materials of Henan, School of Physics and Engineering, Zhengzhou University, Zhengzhou 450001, China ${ }^{d}$ College of Science, Zhongyuan University of Technology, Zhengzhou 450007, China metal transition around $340 \\mathrm{~K}^{31-34}$ The existence of monolayer $\\mathrm{VO}_{2}$ and its metallic properties were already theoretically predicted. ${ }^{35}$ Beyond these novel properties, how $\\mathrm{VO}_{2}$ behave as battery electrodes is still unknown. More importantly, the monolayer $\\mathrm{VO}_{2}$ shows metallic characteristic with light weight and large surface area, suggesting its potential applications for metal ion storage. It is well known that the high capacity, electric conduction and excellent ion mobility are all requirements for an anode material. This work therefore aims to explore the applicability of monolayer $\\mathrm{VO}_{2}$ for $\\mathrm{Li}, \\mathrm{Na}, \\mathrm{K}, \\mathrm{Mg}$ and Ca ions storage. From our calculation results, we show that the monolayer $\\mathrm{VO}_{2}$ can be taken as a promising anode material for storing Li, Na and Mg.\n\n\\section{Computational method}\nFirst-principles density functional theory (DFT) calculations in the present study were carried out using Vienna $a b$ initio simulation package (VASP) ${ }^{36-38}$ with a generalized gradient approximation (GGA) in the Perdew-Burke-Ernzerhof (PBE).$^{39}$ Since the van der Waals (vdW) interaction plays a crucial role in the adsorption of adatoms on the substrate, a non-local vdW density functional in the form of Becke88 optimization (optB88) ${ }^{40}$ is adopted, which has been evidenced to give a much improved description for various systems including heterostructures, ${ }^{41-43}$ lithium carbides ${ }^{44}$ and the molecules/2D materials systems. ${ }^{45,46} \\mathrm{~A}$ kinetic energy cutoff of the plane-wave basis set was used to be $500 \\mathrm{eV}$. A $k$-point sampling of $5 \\times 5 \\times 1$ Monkhorst-Pack grids ${ }^{47}$ in the first Brillouin zone of the $4 \\times 4$ supercell is used in the calculation. An inter-layer vacuum space larger than $20 \\AA$ was kept to avoid mirror interactions. The convergence criteria of total energy and Hellmann-Feynman force were set as $10^{-4} \\mathrm{eV}$ and $0.01 \\mathrm{eV} \\AA^{-1}$, respectively. The optimized lattice constant of unit cell is $2.75 \\AA$, the bond length of $\\mathrm{V}-\\mathrm{O}$ is $1.95 \\AA$, which are consistent with previous results. ${ }^{35}$ For the evaluation of charge transfer between the ions and the $\\mathrm{VO}_{2}$, we performed Bader charge analysis. ${ }^{48}$ To obtain diffusion pathways and the corresponding energy barriers, we performed standard nudged elastic band (NEB) calculations. ${ }^{49}$\n\n\\section{Results and discussion}\n3.1 Structures and electronic properties of metal adatoms adsorption on $\\mathbf{V O}_{2}$ monolayer\n\nThe geometric structure of monolayer $\\mathrm{VO}_{2}$ sheet is depicted in Fig. 1. Clearly, from the top view, the $\\operatorname{VO}_{2}$ sheet exhibits typical graphene-like hexagonal structure, and from the side view, the $\\mathrm{VO}_{2}$ sheet is a triple-layer structure, which can be viewed as the $\\mathrm{V}$-atomic layer being sandwiched by two O-atomic layers through strong $\\mathrm{V}-\\mathrm{O}$ bonds. The unit cell of monolayer $\\mathrm{VO}_{2}$ sheet consists of two $\\mathrm{O}$ atoms and one $\\mathrm{V}$ atom. The optimized lattice constant and the bond length of $\\mathrm{V}-\\mathrm{O}$ are $2.753 \\AA$ and $2.050 \\AA$ respectively, which agree with the previous results. ${ }^{50}$ As depicted in Fig. 1 (b), $\\mathrm{VO}_{2}$ exhibits metallic behavior, which can ensure a satisfied electrical conductivity during battery cycling.\n\nWe first examine the adsorption behavior of a single metal atom $\\left(\\mathrm{Li}, \\mathrm{Na}, \\mathrm{K}, \\mathrm{Mg}\\right.$ and $\\mathrm{Ca}$ ) on the monolayer $\\mathrm{VO}_{2}$. The adsorption energy is defined as the difference between the sum of the energies of the pristine $\\mathrm{VO}_{2}$ sheet and the metal atom and the total energy of the metal-adsorbed system:\n\n\\[\nE_{\\mathrm{a}}=E_{\\mathrm{M}}+E_{\\mathrm{VO}_{2}}-E_{\\mathrm{M}_{\\mathrm{MO}}^{2}}\n\\]\n\nwhere $E_{\\mathrm{M}}, E_{\\mathrm{VO}_{2}}$, and $E_{\\mathrm{M}_{1} \\mathrm{VO}_{2}}$ are the energies of the metal adatoms, $\\mathrm{VO}_{2}$ sheet and the metal atom adsorption on $\\mathrm{VO}_{2}$ sheet. By this definition, the larger $E_{\\mathrm{a}}$, the stronger the interaction between the metal adatom and the $\\mathrm{VO}_{2}$ sheet. It is well known that for a material to be suitable as an anode for a particular ion storage, a relatively large adsorption energy plays a fundamental role. The $\\mathrm{VO}_{2}$ with a $4 \\times 4$ supercell structure is employed to avoid the interaction between the adjacent metal adatoms. We first determined the most favorable adsorption site for a single metal atom on $\\mathrm{VO}_{2}$ sheet. Herein, four different initial adsorption sites are considered: above the hollow center of hexagonal V-O ring $(\\mathrm{H})$, above the top of $\\mathrm{O}$ atom (T1), above the top of $\\mathrm{V}$ atom (T2) and above the V-O bond (B) as shown in Fig. 1(a). The results suggest that all the above metal atoms prefer to be adsorbed above the $\\mathrm{H}$ site. The corresponding adsorption energies are $3.85,3.89,4.42,4.31$, and $6.21 \\mathrm{eV}$ for $\\mathrm{Li}$, $\\mathrm{Na}, \\mathrm{K}, \\mathrm{Mg}$ and Ca respectively. These large adsorption energies ensure that the metal atoms can bind strongly to the $\\mathrm{VO}_{2}$ sheet.\n\nTo obtain insight into the adsorption process, we investigated the charge transfers by performing Bader charge analysis. ${ }^{48}$ The three-dimensional charge density difference of metal/ $/ \\mathrm{VO}_{2}$ are illustrated in Fig. 2, which were obtained from the formula\n\n\\[\n\\Delta \\rho=\\rho\\left(\\text { metal } / \\mathrm{VO}_{2}\\right)-\\left[\\rho\\left(\\mathrm{VO}_{2}\\right)+\\rho(\\text { metal })\\right]\n\\]\n\nwhere $\\rho\\left(\\mathrm{metal} / \\mathrm{VO}_{2}\\right)$ and $\\rho\\left(\\mathrm{VO}_{2}\\right)$ denote the total electron densities of the relaxed $\\mathrm{VO}_{2}$ sheet with and without metal atoms, respectively, and $\\rho$ (metal) is the total electron density of the metal atoms. The red and blue colors represent charge accumulation and depletion. It is found that all the metal atoms behave as charge donors. They donate $0.91 e, 0.90 e, 0.94 e, 1.70 e$, and 1.64e to the $\\mathrm{VO}_{2}$ sheet for $\\mathrm{Li}, \\mathrm{Na}, \\mathrm{K}, \\mathrm{Mg}$ and Ca respectively. To further understand the interaction between the metal atom and the $\\mathrm{VO}_{2}$ sheet, we have calculated the partial density of states (PDOS) of different systems and illustrated them in Fig. 3. Unlike many other two-dimensional materials that exhibit semi-conducting or semi-metallic characteristics, the $\\mathrm{VO}_{2}$ sheet as well as all the metal $/ \\mathrm{NO}_{2}$ systems are all metallic states. Therefore, the metallic nature of the $\\mathrm{VO}_{2}$ sheet remains unchanged during the metal adsorbed on it, and an excellent electronic conductivity is maintained, which will significantly improve the performance of metal ion batteries. The metal atoms donate their electrons to the $\\mathrm{O}$ atoms of the $\\mathrm{VO}_{2}$ so that the s and p orbitals of the Li, Na, $\\mathrm{K}$ and $\\mathrm{Mg}$ (s and $\\mathrm{d}$ orbitals for Ca) partially appear above the Fermi level. Meanwhile, the orbital hybridization between the metal atoms and the $\\mathrm{O}$ atoms are observed at the lower energy region, which contributes to the strong interaction between the metal atoms and the $\\mathrm{VO}_{2}$.\n\n\\subsection{Metal atom diffusion on $\\mathrm{VO}_{2}$ monolayer}\nAnother crucial characteristic to evaluate the suitability of an anode material for rechargeable batteries is mobility of metal\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-2_1991_2435_481_994}\n\\end{center}\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-2_2006_2429_994_1586}\n\\end{center}\n\n(b)\n\nFig. 1 (a) The optimized atomic structures and (b) the band structure of monolayer $\\mathrm{VO}_{2}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-3_172_595_233_576}\n\\end{center}\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-3_176_596_566_888}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-3_168_593_867_1205}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-3_172_595_1186_1500}\n\\end{center}\n\n(d)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-3_168_593_1480_1824}\n\\end{center}\n\n(e)\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_bba019fc933fc84ad347g-3_671_714_140_1922}\\\\\nof $0.0015$ e $\\AA^{-3}$ corresponds to charge accumulation and depletion respectively.\n\natoms on the electrode material. From this point of view, the diffusion of metal atoms on the surface of $\\mathrm{VO}_{2}$ must be quantified. In this regard we investigate the diffusion barriers of metal atoms on the $\\mathrm{VO}_{2}$ sheet. As illustrated in Fig. 4(a), HT2-H pathway is the most favorable diffusion pathway for all metal atoms studied in this work. The corresponding diffusion energy profiles along the optimized pathway for different metal atoms are shown in Fig. 4(b). It is found that the diffusion barriers of the alkali atoms are lower than those of alkaline earth atoms. Among the three alkali atoms, K possesses the lowest diffusion barrier, with a value of $0.043 \\mathrm{eV}$. The diffusion barriers of the Li and $\\mathrm{Na}$ are $0.119 \\mathrm{eV}$ and $0.098 \\mathrm{eV}$, respectively. The obtained low barrier for alkaline atoms on $\\mathrm{VO}_{2}$ is far superior to typical electrode materials, such as $\\mathrm{VS}_{2}(0.22 \\mathrm{eV}){ }^{24}$ borophene $(0.60 \\mathrm{eV}),{ }^{51}$ porous graphene $(0.37 \\mathrm{eV}),{ }^{19} \\mathrm{MoN}_{2}(0.49 \\mathrm{eV}){ }^{14}$ and so on. ${ }^{52-54}$ The low diffusion barriers of alkaline atoms on $\\mathrm{VO}_{2}$ implies the fast diffusion processes, especially for $\\mathrm{K}$ ion. On the other hand, we find that the obtained diffusion barriers of $\\mathrm{Mg}$ and Ca are $0.517 \\mathrm{eV}$ and $0.306 \\mathrm{eV}$ respectively, which are comparable to the energy barriers for Li diffusion on other anode materials. ${ }^{51,53,55}$ Therefore, we can conclude that the $\\mathrm{VO}_{2}$ monolayer will be easy for the above metal atoms to diffuse. In addition, the ZPE contributions are also considered. As a prototype model system, Li diffusion on $\\mathrm{VO}_{2}$ is tested. The diffusion barrier of $\\mathrm{Li}$ on $\\mathrm{VO}_{2}$ with ZPE is $0.149 \\mathrm{eV}$, which is slightly larger than that of the value $0.119 \\mathrm{eV}$ calculated without ZPE. Although the NEB method without ZPE underestimates the diffusion barrier, it is still comparable to that calculated with ZPE.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-3_1565_1962_248_804}\n\\end{center}\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-3_2006_2408_234_792}\n\\end{center}\n\n$(\\mathrm{d})$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-3_1566_1960_797_1291}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-3_2004_2416_782_1311}\n\\end{center}\n\n(e)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-3_1569_1963_1306_1824}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-3_2006_2408_1305_1825}\n\\end{center}\n\n(f)\n\nFig. 3 PDOS for (a) $\\mathrm{VO}_{2}$, (b) $\\mathrm{Li} / \\mathrm{VO}_{2}$, (c) $\\mathrm{Na} / \\mathrm{VO}_{2}$, (d) $\\mathrm{K}_{\\mathrm{NO}}^{2}$, (e) $\\mathrm{Mg} / \\mathrm{VO}_{2}$, (f) $\\mathrm{Ca} / \\mathrm{VO}_{2}$. The Fermi level is set as zero.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-4_167_759_482_977}\n\\end{center}\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-4_169_761_972_1566}\n\\end{center}\n\n(b)\n\nFig. 4 (a) Schematic of the diffusion pathways of a metal atom along $\\mathrm{H}-\\mathrm{T} 2-\\mathrm{H}$. (b) Energy profile corresponding to the minimum-energy pathway.\n\nIt should be noted that the charge states on metal atoms are positive $0.91,0.90,0.94,1.70$ and $1.64$ for Li, Na, K, Mg and Ca respectively, which suggests that all the metal atoms exist in the cationic state. In the light of this idea, the diffusion of charged metal atoms on $\\mathrm{VO}_{2}$ sheet could be much easier with the external electric field during the processes. Thus, the ultrafast charge/discharge rate is expected for the $\\mathrm{VO}_{2}$ sheet as the metalion battery anode material.\n\n\\subsection{Theoretical storage capacity of $\\mathrm{Li}, \\mathrm{Na}, \\mathrm{K}, \\mathrm{Mg}$ and $\\mathrm{Ca}$ on the $\\operatorname{VO}_{2}$ monolayer and open-circuit voltage}\nNext, we increased the coverage of adatoms over the $\\mathrm{VO}_{2}$ sheet. To this aim, we constructed a series of configurations with the chemical stoichiometry of $\\mathrm{M}_{x} \\mathrm{VO}_{2}(x=0.0625,0.25,0.5,0.75$, 1, $2,4)$ by placing different number of metal atoms on the single and both sides of the $\\mathrm{VO}_{2}$ sheet until the complete coverage was achieved. As a prototype model system, Fig. 5 displays the optimized structures for $\\mathrm{Li}_{x} \\mathrm{VO}_{2}$ with $x$ varying from $0.0625$ to 4 . In the case of $\\mathrm{M}_{2} \\mathrm{VO}_{2}$, the $\\mathrm{VO}_{2}$ fully covered by metal atoms leads to $x$ being 2 as illustrated in Fig. 5(f). In the case of $\\mathrm{K}_{0.75} \\mathrm{VO}_{2}$ and $\\mathrm{Ca}_{0.75} \\mathrm{VO}_{2}$, the average adsorption energies were estimated to be negative, this indicates that when the number of adsorbed of $K$ and $\\mathrm{Ca}$ atoms is larger than $0.75$ in a unit cell, the systems are unstable. To test the feasibility of multilayer adsorption, we also studied the $\\mathrm{VO}_{2}$ with bilayer metal atoms adsorbing on its both sides. For adsorption of the second layer, it should be noted that once the adsorption sites for the first layer are fully occupied, subsequent metal atoms of the next layer will occupy T2 sites. In the case of $\\mathrm{Mg}_{4} \\mathrm{VO}_{2}$, the average adsorption energy is calculated to be negative. This indicates that the second layer of $\\mathrm{Mg}$ atoms can not be adsorbed on the $\\mathrm{VO}_{2}$ with one layer of $\\mathrm{Mg}$ atoms fully covering on both sides, because the extra atoms occupy a second layer and it is difficult for these atoms to be adsorbed on $\\mathrm{VO}_{2}$ sheet. Interestingly, bilayer $\\mathrm{Li}$ and Na adsorptions on both sides of $\\mathrm{VO}_{2}$ sheet are feasible, corresponding to formulae of $\\mathrm{M}_{4} \\mathrm{VO}_{2}$, as shown in Fig. $5(\\mathrm{~g})$. Open-circuit voltage date is another crucial parameter to characterize the performance of metal ion batteries. In theory, the open-circuit voltage for the metal atom coverages between $x_{1} \\leq x \\leq x_{2}$ can be obtained by using the following equation: ${ }^{24,56-58}$\n\n\\[\nV \\approx-\\left(E_{\\mathrm{M} x_{2} \\mathrm{VO}_{2}}-E_{\\mathrm{M} x_{1} \\mathrm{VO}_{2}}-\\left(x_{1}-x_{2}\\right) E_{\\mathrm{M}}\\right) /\\left(\\left(x_{1}-x_{2}\\right)\\right)\n\\]\n\nin which, $E_{\\mathrm{Mx}_{2} \\mathrm{VO}_{2}}, E_{\\mathrm{M} x_{1} \\mathrm{VO}_{2}}$, and $E_{\\mathrm{M}}$ are the energies of $\\mathrm{M}_{x_{2}} \\mathrm{VO}_{2}$, $\\mathrm{M}_{x_{1}} \\mathrm{VO}_{2}$ and metal atom, respectively. Fig. 6 shows the voltage profiles of the $\\mathrm{VO}_{2}$ sheet as a function of the metal atom coverage ratio. It is seen that the voltage profiles of $\\mathrm{Li}_{x} \\mathrm{VO}_{2}$ and $\\mathrm{Na}_{x} \\mathrm{VO}_{2}$ are all positive which additionally confirms the suitability of $\\mathrm{VO}_{2}$ as anode material. In the case of $\\mathrm{Li}_{x} \\mathrm{VO}_{2}$, there is a dramatic decrease from approximately $3.85 \\mathrm{~V}$ when $x<0.25$ to $2.08 \\mathrm{~V}(x<0.75)$, and then decreases again to $1.16 \\mathrm{~V}$. Next, the voltage values are fluctuating around $1.16 \\mathrm{~V}(0.5<x<2)$. At last, the voltage value reduces to $0.31 \\mathrm{~V}$ for the bilayer Li atoms adsorbed on both sides of the $\\mathrm{VO}_{2}$. The voltage profile of $\\mathrm{Na}_{x} \\mathrm{VO}_{2}$ is similar to that of $\\mathrm{Li}_{x} \\mathrm{VO}_{2}$. In the case of $\\mathrm{K}_{x} \\mathrm{VO}_{2}$ $\\left(\\mathrm{Ca}_{x} \\mathrm{VO}_{2}\\right)$, when the $\\mathrm{K}(\\mathrm{Ca})$ atom coverage ratio is larger than $0.75 \\mathrm{~V}$, the open-circuit voltage becomes to be negative indicating that the $\\mathrm{VO}_{2}$ as $\\mathrm{K}(\\mathrm{Ca})$ ion battery node material is unstable for high coverage ratio of $\\mathrm{K}(\\mathrm{Ca})$. In the case of $\\mathrm{Mg}_{x} \\mathrm{VO}_{2}$, when the $\\mathrm{Mg}$ atom coverage ratio is lower than 2, the $\\mathrm{Mg}_{x} \\mathrm{VO} \\mathrm{O}_{2}$ is stable. Meanwhile, we calculated the average open-circuit voltage by numerically averaging the voltage profile, which are $1.56 \\mathrm{~V}$ for Li $(0<x<4), 0.98 \\mathrm{~V}$ for $\\mathrm{Na}(0<x<4), 2.36 \\mathrm{~V}$ for $\\mathrm{K}(0<x$ $<0.75), 1.21 \\mathrm{~V}$ for $\\mathrm{Mg}(0<x<1)$, and $2.82 \\mathrm{~V}$ for $\\mathrm{Ca}(0<x<0.75)$. Thus, the $\\mathrm{VO}_{2}$ based metal ion battery can provide high charging voltage, which are proper for the practical anodic applications. ${ }^{57-59}$\n\nTo designate $\\mathrm{VO}_{2}$ monolayer as anode material for metal ion battery, we calculated the specific capacities using the following equation ${ }^{54,58,60}$\n\n\\[\nC=\\frac{n N_{\\mathrm{A}} e}{3.6 m_{\\mathrm{M}_{x} \\mathrm{VO}_{2}}}\n\\]\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_bba019fc933fc84ad347g-5_164_692_332_1730}\n\\end{center}\n\n(c)\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_bba019fc933fc84ad347g-5_551_937_352_1690}\n\nFig. 5 The optimized atomic structures for (a) $\\mathrm{Li}_{0.625} \\mathrm{VO}_{2}$, (b) $\\mathrm{Li}_{0.25} \\mathrm{VO}_{2}$, (c) $\\mathrm{Li}_{0.5} \\mathrm{VO}_{2}$, (d) $\\mathrm{Li}_{0.75} \\mathrm{VO}_{2}$, (e) $\\mathrm{Li}_{1} \\mathrm{VO}_{2}$, (f) $\\mathrm{Li}_{2} \\mathrm{VO}_{2}$, (g) $\\mathrm{Li}_{4} \\mathrm{VO}_{2}$.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_bba019fc933fc84ad347g-5_1084_1486_168_1890}\n\nFig. 6 Predicted open-circuit voltage profiles as a function of metal atoms content $x$. (a) $\\mathrm{Li}_{x} \\mathrm{VO}_{2}$, (b) $\\mathrm{Na}_{x} \\vee \\mathrm{O}_{2}$, (c) $\\mathrm{K}_{x} \\mathrm{VO}_{2}$, (d) $\\mathrm{Mg}_{x} \\vee \\mathrm{O}_{2}$, (e) $\\mathrm{Ca} \\mathrm{a}_{x} \\vee \\mathrm{O}_{2}$.\n\nin which $n$ is the adsorbed electric charge per mole $\\mathrm{VO}_{2}, N_{\\mathrm{A}}$ is the Avogadro constant, $e$ is the elementary charge, and $m_{\\mathrm{M}_{x} \\mathrm{VO}_{2}}$ represents the molar mass of $\\mathrm{M}_{x} \\mathrm{VO}_{2}$. For bilayer $\\mathrm{Li}$ or $\\mathrm{Na}$ adsorption on both sides of the $\\mathrm{VO}_{2}$ sheet, each formula unit of $\\mathrm{VO}_{2}$ sheet can accommodate up to $4 \\mathrm{Li}$ or $4 \\mathrm{Na}$ atoms. Corresponding theoretical capacities are found to be about 968 and $613 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1}$, respectively, which are much larger than that for most of 2D materials. For example, the theoretical capacity of $\\mathrm{Li}$ on graphene is $372 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1}$, Li and $\\mathrm{Na}$ on $\\mathrm{Sc}_{2} \\mathrm{C}$ are 462 and $362 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1},{ }^{58} \\mathrm{Li}$ and $\\mathrm{Na}$ on $\\mathrm{Mo}_{2} \\mathrm{C}$ are 526 and $132 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1},{ }^{60}$ and $\\mathrm{Li}$ and $\\mathrm{Na}$ on $\\mathrm{Mo}_{2} \\mathrm{~N}$ are 432 and $864 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1} \\cdot{ }^{14}$ The maximum $\\mathrm{Mg}$ content is 1 resulting the theoretical capacity of $815 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1}$, which is also higher than conventional electrode capacity. Regarding to $\\mathrm{K}$ and $\\mathrm{Ca}$ ions, the predicted capacities are 131 and $260 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1}$ respectively, which are distinctly lower than that for $\\mathrm{Li}, \\mathrm{Na}$ and $\\mathrm{Mg}$. On the basis of the above analyses, we can conclude that the $\\mathrm{VO}_{2}$ monolayer should be a good candidate for the application of an electrode material in metal ion batteries, especially for $\\mathrm{Li}, \\mathrm{Na}$ and $\\mathrm{Mg}$ ion batteries. Also, it is equally important to explore the properties of the $\\mathrm{VO}_{2}$ with the substrate it was formed on in the future.\n\n\\section{Conclusion}\nIn summary, we have demonstrated the application of the monolayer $\\mathrm{VO}_{2}$ as anode material for metal (Li, $\\mathrm{Na}, \\mathrm{K}, \\mathrm{Mg}$ and Ca) ion batteries by DFT-based first-principles calculations. The results shown that the metal adatoms prefer to occupy the center of hexagonal $\\mathrm{V}-\\mathrm{O}$ ring and play the role of charge donors. The atoms adsorption on $\\mathrm{VO}_{2}$ exhibit the diffusion barriers as low as $0.043 \\mathrm{eV}$ for $\\mathrm{K}, 0.119 \\mathrm{eV}$ for $\\mathrm{Li}, 0.098 \\mathrm{eV}$ for $\\mathrm{Na}, 0.517 \\mathrm{eV}$ for $\\mathrm{Mg}$, and $0.306 \\mathrm{eV}$ for $\\mathrm{Ca}$, suggesting fast charging/ discharging processes especially for $\\mathrm{K}, \\mathrm{Li}$ and $\\mathrm{Na}$. The metallic nature of the $\\mathrm{VO}_{2}$ sheet remains unchanged during the metal adsorbed on it, which is essential for the use as an electrode. In addition, the theoretical specific capacity of $\\mathrm{VO}_{2}$ can be as much as 968,613 and $815 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1}$ for $\\mathrm{Li}, \\mathrm{Na}$ and $\\mathrm{Mg}$ respectively, which are significantly larger than that of graphene. The results also shown that the $\\mathrm{VO}_{2}$ based metal ion battery can provide high charging voltage. Given these advantages, we can conclude that the monolayer $\\mathrm{VO}_{2}$ has fascinating potential as the high capacity and fast charging-discharging anode material for metal ion batteries.\n\n\\section{Conflicts of interest}\nThere are no conflicts to declare.\n\n\\section{Acknowledgements}\nThis work was supported by the NSF of China (Grant No. 11404112), the Key Scientific Research Project of Colleges and Universities of Henan Province (Grant No. 16A140024) and Research in Cutting-edge Technologies of Zhengzhou (Grant No. 141PRKXF622).\n\n\\section{References}\n1 H. Wang, H. Feng and J. Li, Small, 2014, 10, 2165-2181.\n\n2 J. M. Tarascon and M. Armand, Nature, 2001, 414, 359-367.\n\n3 H. Li, Z. Wang, L. Chen and X. Huang, Adv. Mater., 2009, 21, $4593-4607$.\n\n4 M. Liang and L. Zhi, J. Mater. Chem., 2009, 19, 5871-5878.\n\n5 J. Dahn, T. Zheng, Y. Liu and J. Xue, Science, 1995, 270, 590593.\n\n6 H. R. Jiang, Z. Lu, M. C. Wu, F. Ciucci and T. S. Zhao, Nano Energy, 2016, 23, 97-104.\n\n7 Q. Zhang, J. Wang, J. Dong, F. Ding, X. Li, B. Zhang, S. Yang and K. Zhang, Nano Energy, 2015, 13, 77-91.\n\n8 J.-M. Tarascon, Nat. Chem., 2010, 2, 510.\n\n9 J. B. Goodenough and K.-S. Park, J. Am. Chem. Soc., 2013, 135, 1167-1176.\n\n10 B. Xiao, Y.-c. Li, X.-f. Yu and J.-b. Cheng, ACS Appl. Mater. Interfaces, 2016, 8, 35342-35352.\n\n11 L. Shi and T. Zhao, J. Mater. Chem. A, 2017, 5, 3735-3758.\n\n12 N. Yabuuchi, K. Kubota, M. Dahbi and S. Komaba, Chem. Rev., 2014, 114, 11636-11682.\n\n13 F. Legrain and S. Manzhos, J. Power Sources, 2015, 274, 6570.\n\n14 X. Zhang, Z. Yu, S.-S. Wang, S. Guan, H. Y. Yang, Y. Yao and S. A. Yang, J. Mater. Chem. A, 2016, 4, 15224-15231.\n\n15 A. Eftekhari, J. Power Sources, 2004, 126, 221-228.\n\n16 D. Aurbach, Z. Lu, A. Schechter, Y. Gofer, H. Gizbar, R. Turgeman, Y. Cohen, M. Moshkovich and E. Levi, Nature, 2000, 407, 724-727.\n\n17 R. Y. Wang, C. D. Wessells, R. A. Huggins and Y. Cui, Nano Lett., 2013, 13, 5748-5752.\n\n18 K. Persson, Y. Hinuma, Y. S. Meng, A. Van der Ven and G. Ceder, Phys. Rev. B, 2010, 82, 125416.\n\n19 Y. Wang, Q. Zhang, M. Jia, D. Yang, J. Wang, M. Li, J. Zhang, Q. Sun and Y. Jia, Appl. Surf. Sci., 2016, 363, 318-322.\n\n20 G. A. Tritsaris, E. Kaxiras, S. Meng and E. Wang, Nano Lett., 2013, 13, 2258-2263.\n\n21 D. B. Putungan, S.-H. Lin and J.-L. Kuo, ACS Appl. Mater. Interfaces, 2016, 8, 18754-18762.\n\n22 C. N. R. Rao, U. Maitra and U. V. Waghmare, Chem. Phys. Lett., 2014, 609, 172-183.\n\n23 Y. Jing, E. O. Ortiz-Quiles, C. R. Cabrera, Z. Chen and Z. Zhou, Electrochim. Acta, 2014, 147, 392-400.\n\n24 Y. Jing, Z. Zhou, C. R. Cabrera and Z. Chen, J. Phys. Chem. C, $2013,117,25409-25413$. 25 D. Sun, Q. Hu, J. Chen, X. Zhang, L. Wang, Q. Wu and A. Zhou, ACS Appl. Mater. Interfaces, 2016, 8, 74-81.\n\n26 Q.-F. Li, C.-G. Duan, X. G. Wan and J.-L. Kuo, J. Phys. Chem. $C, 2015,119,8662-8670$.\n\n27 L.-Q. Sun, M.-J. Li, K. Sun, S.-H. Yu, R.-S. Wang and H.-M. Xie, J. Phys. Chem. C, 2012, 116, 14772-14779.\n\n28 H. R. Jiang, W. Shyy, M. Liu, L. Wei, M. C. Wu and T. S. Zhao, J. Mater. Chem. A, 2017, 5, 672-679.\n\n29 B. Mortazavi, A. Dianat, O. Rahaman, G. Cuniberti and T. Rabczuk, J. Power Sources, 2016, 329, 456-461.\n\n30 S. Banerjee, G. Periyasamy and S. K. Pati, J. Mater. Chem. A, $2014,2,3856-3864$.\n\n31 B.-J. Kim, Y. W. Lee, B.-G. Chae, S. J. Yun, S.-Y. Oh, H.-T. Kim and Y.-S. Lim, Appl. Phys. Lett., 2007, 90, 023515.\n\n32 J. Liang, W. Li, J. Liu and M. Hu, Mater. Lett., 2016, 184, 9295.\n\n33 L. Liu, T. Yao, X. G. Tan, Q. H. Liu, Z. Q. Wang, D. C. Shen, Z. H. Sun, S. Q. Wei and Y. Xie, Small, 2012, 8, 3752-3756.\n\n34 S. Long, H. Zhou, S. Bao, Y. Xin, X. Cao and P. Jin, RSC Adv., $2016,6,106435-106442$.\n\n35 C. Ataca, H. Şahin and S. Ciraci, J. Phys. Chem. C, 2012, 116, 8983-8999.\n\n36 G. Kresse and J. Hafner, Phys. Rev. B: Condens. Matter Mater. Phys., 1993, 47, 558-561.\n\n37 G. Kresse and J. Furthmüller, Phys. Rev. B: Condens. Matter Mater. Phys., 1996, 54, 11169.\n\n38 G. Kresse and J. Furthmüller, Comput. Mater. Sci., 1996, 6, 15-50.\n\n39 J. P. Perdew, K. Burke and M. Ernzerhof, Phys. Rev. Lett., 1996, 77, 3865-3868.\n\n40 A. D. Becke, Phys. Rev. A: At., Mol., Opt. Phys., 1988, 38, 30983100.\n\n41 W. Yu, Z. Zhu, S. Zhang, X. Cai, X. Wang, C.-Y. Niu and W.-B. Zhang, Appl. Phys. Lett., 2016, 109, 103104.\n\n42 L. Zhang, P. Bampoulis, A. N. Rudenko, Q. Yao, A. van Houselt, B. Poelsema, M. I. Katsnelson and H. J. W. Zandvliet, Phys. Rev. Lett., 2016, 116, 256804.\n\n43 J. E. Padilha, A. Fazzio and A. J. R. da Silva, Phys. Rev. Lett., 2015, 114, 066803.\n\n44 Y. Lin, T. A. Strobel and R. E. Cohen, Phys. Rev. B: Condens. Matter Mater. Phys., 2015, 92, 214106.\n\n45 Y. Cai, Q. Ke, G. Zhang and Y.-W. Zhang, J. Phys. Chem. C, 2015, 119, 3102-3110.\n\n46 T. P. Kaloni, G. Schreckenbach and M. S. Freund, J. Phys. Chem. C, 2014, 118, 23361-23367.\n\n47 H. J. Monkhorst and J. D. Pack, Phys. Rev. B: Condens. Matter Mater. Phys., 1976, 13, 5188-5192.\n\n48 G. Henkelman, A. Arnaldsson and H. Jonsson, Comput. Mater. Sci., 2006, 36, 354-360.\n\n49 G. Henkelman, B. P. Uberuaga and H. Jónsson, J. Chem. Phys., 2000, 113, 9901.\n\n50 Z.-K. Tang, X.-B. Li, D.-Y. Zhang, Y.-N. Zhang and L.-M. Liu, J. Mater. Chem. C, 2015, 3, 3189-3197.\n\n51 X. Zhang, J. Hu, Y. Cheng, H. Y. Yang, Y. Yao and S. A. Yang, Nanoscale, 2016, 8, 15340-15347.\n\n52 T. H. Osborn and A. A. Farajian, J. Phys. Chem. C, 2012, 116, 22916-22920. 53 C. Sun and D. J. Searles, J. Phys. Chem. C, 2012, 116, 2622226226.\n\n54 C. C. Leong, H. Pan and S. K. Ho, Phys. Chem. Chem. Phys., $2016,18,7527-7534$.\n\n55 C. Uthaisar and V. Barone, Nano Lett., 2010, 10, 2838-2842.\n\n56 M. K. Aydinol, A. F. Kohan, G. Ceder, K. Cho and J. Joannopoulos, Phys. Rev. B: Condens. Matter Mater. Phys., 1997, 56, 1354-1365. 57 B. Mortazavi, M. Shahrokhi, M. Makaremi and T. Rabczuk, Applied Materials Today, 2017, 9, 292-299.\n\n58 X. Lv, W. Wei, Q. Sun, L. Yu, B. Huang and Y. Dai, ChemphysChem, 2017, 18, 1627-1634.\n\n59 H. Zheng, K. Jiang, T. Abe and Z. Ogumi, Carbon, 2006, 44, 203-210.\n\n60 Q. Sun, Y. Dai, Y. Ma, T. Jing, W. Wei and B. Huang, J. Phys. Chem. Lett., 2016, 7, 937-943.\n\n\n\\end{document}", "record_id": "2023_09_22_bba019fc933fc84ad347g"}