{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{Spectrally stable defect qubits with no inversion symmetry for robust spin-to-photon interface }\n\n\n\\author{Péter Udvarhelyi, ${ }^{1,2}$ Roland Nagy, ${ }^{3}$ Florian Kaiser, ${ }^{3}$ Sang-Yun Lee, ${ }^{4}$ Jörg Wrachtrup, ${ }^{3}$ and Adam Gali ${ }^{2,5}$\\\\\n${ }^{1}$ Department of Biological Physics, Loránd Eötvös University,\\\\\nPázmány Péter sétány 1/A,H-1117 Budapest, Hungary\\\\\n${ }^{2}$ Wigner Research Centre for Physics, Hungarian Academy of Sciences, P.O. Box 49, H-1525 Budapest, Hungary\\\\\n${ }^{3}$ Institute of Physics, University of Stuttgart and Institute for Quantum Science and Technology IQST, Germany\\\\\n${ }^{4}$ Center for Quantum Information, Korea Institute of Science and Technology, Seoul, 02792, Republic of Korea\\\\\n${ }^{5}$ Department of Atomic Physics, Budapest University of Technology and Economics, Budafoki út 8., H-1111 Budapest, Hungary}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\n (Dated: January 29, 2019)\n\n\\begin{abstract}\nScalable spin-to-photon interfaces require quantum emitters with strong optical transition dipole moment and low coupling to phonons and stray electric fields. It is known that particularly for coupling to stray electric fields, these conditions can be simultaneously satisfied for emitters that show inversion symmetry. Here, we show that inversion symmetry is not a prerequisite criterion for a spectrally stable quantum emitter. We find that identical electron density in ground and excited states can eliminate the coupling to the stray electric fields. Further, a strong optical transition dipole moment is achieved in systems with altering sign of the ground and excited wavefunctions. We use density functional perturbation theory to investigate an optical center that lacks of inversion symmetry. Our results show that this system close to ideally satisfies the criteria for an ideal quantum emitter. Our study opens a novel rationale in seeking promising materials and point defects towards the realization of robust spin-to-photon interfaces.\n\\end{abstract}\n\n\\section{INTRODUCTION}\nSolid state defect quantum emitters are at the heart of quantum technologies. Quantum information technologies ${ }^{1-3}$ and nanoscale sensor applications ${ }^{4-6}$ require defects with long coherence times. Further, a quantum emitter with good optical properties allows for convenient optically-assisted spin state initialization and readout ${ }^{7,8}$. However, inhomogeneities in the host crystal can lead to degradation of optical properties. A significant contribution is usually spectral diffusion and inhomogeneous broadening caused by the Stark shift effect. This spectral diffusion refers to the broadening of the integrated photoluminenscence zero-phonon-line (ZPL) after repetitive measurements on a single center as stray electric fields contribute fluctuating Stark shift to the transition. The mechanism is that optical excitation induces charge fluctuations of parasitic defects, which influence the optical properties of the investigated system ${ }^{9,10}$. Quantum emitters for quantum communication technology should emit predominantly coherent photons at large rate. However, especially for solid state emitters, photons are emitted either between purely electronic states (zero-phonon emission) or between states with phonons being excited. Photons of the latter emission are not coherent. Therefore, the ratio of the emitted photons with zero-phonon contribution to the total emission, i.e., the Debye-Waller factor of the quantum emitter also categorizes the quality of the quantum emitter. Deficiencies in the spin coherence time can be principally circumvented by dynamical decoupling schemes, which can extend the coherence times further at the expense of longer measurement times ${ }^{11}$, that is an inevitable technique in such host materials where no spin-free isotopes are available. The intensity of coherent emission of defects with low Debye-Waller factors can be significantly improved by designing and building optical cavities around the quantum emitter which is a technological challenge but principally doable. On the other hand, the minimal spectral diffusion criterion is, in particular, inherently bound to such defect qubit property that cannot be efficiently and systematically circumvented either by means of materials design or quantum optical control of the quantum bits.\n\nAs the elimination of the parasitic defects near the quantum bits is a too high challenge for materials scientists, a simple solution to the problem of spectral diffusion is utilizing quantum defects with inversion symmetry that ab ovo do not couple to static electric stray fields ${ }^{12}$. This condition is intimately connected to the crystal structure of the host material of the quantum emitter. This symmetry requirement excludes compound semiconductors or insulator crystals that per se do not host defects with inversion symmetry, although advanced production and processing technologies exist for those platforms. However, a plethora of compound semiconductors or insulators are potential candidates for hosting quantum emitters, e.g., defects in silicon carbide (SiC) have favorable coherence times in naturally abundant hosts without any dynamical decoupling procedures such as neutral divacancies ${ }^{13-16}$ and negatively charged silicon-vacancies ${ }^{17-22}$.\n\nIn this paper, we show that the inversion symmetry is not a prerequisite criterion for a spectrally stable defect quantum emitter. We demonstrate this principle by means of density functional perturbation theory calculations on the so-called V1 center, i.e., the negatively charged silicon-vacancy at the so-called hexagonal $(h)$ site in the compound semiconductor $4 \\mathrm{H} \\mathrm{SiC}$.\n\n\\section{COMPUTATIONAL METHODS}\nWe determined the coupling of optical excitation to the external electric fields by calculating the permanent dipole moments in the corresponding ${ }^{4} A_{2}$ ground state and ${ }^{4} A_{2}$ excited state of the negatively charged silicon vacancy (V1) h-site defect in $4 \\mathrm{H}-\\mathrm{SiC}^{23,24}$ and compared those to the corresponding ${ }^{3} A$ ground state and ${ }^{3} E$ excited state of the negatively charged nitrogen-vacancy center in diamond ${ }^{25-27}$ using density functional theory (DFT). We also determined the radiative lifetime of V1 center in $4 \\mathrm{H} \\mathrm{SiC}$.\n\n\\section{A. Electronic structure calculation}\nWe applied DFT for electronic structure calculation and geometry relaxation, using the plane-wave Vienna $\\mathrm{Ab}$ initio Simulation Package (VASP) ${ }^{28-31}$. The core electrons were treated in the projector augmented-wave (PAW) formalism ${ }^{32}$. The calculations were performed with $420 \\mathrm{eV}$ plane wave cutoff energy and with $\\Gamma$ centered $2 \\times 2 \\times 2 \\mathrm{k}$-point mesh for the $4 \\mathrm{H} \\mathrm{SiC}$ supercell, $420 \\mathrm{eV}$ plane wave cutoff energy and $\\Gamma$-point for the diamond supercell, respectively. We applied spinpolarized $\\mathrm{PBE}$ functional in these calculations ${ }^{33}$. The model of $\\mathrm{V} 1$ center in bulk $4 \\mathrm{H} \\mathrm{SiC}$ was constructed using a 432-atom hexagonal supercell whereas we used the 512-atom simple cubic supercell to model nitrogen-vacancy (NV) center in diamond. The excited state electronic structure and geometry were calculated by constraint occupation of states, or $\\triangle$ SCF method ${ }^{34}$.\n\n\\section{B. Permanent dipole moment calculation}\nWe calculated the permanent dipole moments in the ground and excited state. The difference in the dipole moments is associated with the coupling parameter of the electric fields and the optical transition. To calculate the permanent dipole moments of the corresponding states, we used the VASP implementation of both Born effective charge calculation using density functional perturbation theory ${ }^{35}$ and the Berry phase theory of polarization $^{36-38}$. In a DFT calculation, one can define the change in macroscopic electronic polarization $(\\mathbf{P})$ as an adiabatic change in the Kohn-Sham potential $\\left(V_{\\mathrm{KS}}\\right)$\n\n\\[\n\\begin{aligned}\n\\frac{\\partial \\mathbf{P}}{\\partial \\lambda}= & -\\frac{i f e \\hbar}{\\Omega m_{e}} \\sum_{\\mathbf{k}} \\sum_{n=1}^{M} \\sum_{m=M+1}^{\\infty} \\\\\n& \\frac{\\left\\langle\\psi_{\\mathbf{k} n}^{(\\lambda)}|\\hat{\\mathbf{p}}| \\psi_{\\mathbf{k} m}^{(\\lambda)}\\right\\rangle\\left\\langle\\psi_{\\mathbf{k} m}^{(\\lambda)}\\left|\\frac{\\partial V_{\\mathrm{KS}}}{\\partial \\lambda}\\right| \\psi_{\\mathbf{k} n}^{(\\lambda)}\\right\\rangle}{\\left(\\epsilon_{\\mathbf{k} n}^{(\\lambda)}-\\epsilon_{\\mathbf{k} m}^{(\\lambda)}\\right)^{2}}+\\text { c.c. }\n\\end{aligned}\n\\]\n\nwhere $f$ is the occupation number, $e$ elemental charge, $m_{e}$ electron mass, $\\Omega$ cell volume, $M$ number of occupied bands, $\\overrightarrow{\\hat{p}}$ momentum operator. The total change of polarization can be calculated by integrating over the adiabatic parameter $\\lambda$. In a periodic gauge, where the wavefunctions $\\left(u_{\\mathbf{k}}\\right)$ are cell periodic and periodic in the reciprocal space, the expectation values in (1) can be expressed as\n\n\\[\n\\begin{gathered}\n\\left\\langle\\psi_{\\mathbf{k} n}^{(\\lambda)}|\\hat{\\mathbf{p}}| \\psi_{\\mathbf{k} m}^{(\\lambda)}\\right\\rangle=\\frac{m_{e}}{\\hbar}\\left\\langle u_{\\mathbf{k} n}^{(\\lambda)}\\left|\\left[\\nabla_{\\mathbf{k}}, H_{\\mathbf{k}}\\right]\\right| u_{\\mathbf{k} m}^{(\\lambda)}\\right\\rangle, \\\\\n\\left\\langle\\psi_{\\mathbf{k} n}^{(\\lambda)}\\left|\\frac{\\partial V_{\\mathrm{KS}}}{\\partial \\lambda}\\right| \\psi_{\\mathbf{k} m}^{(\\lambda)}\\right\\rangle=\\left\\langle u_{\\mathbf{k} n}^{(\\lambda)}\\left|\\left[\\frac{\\partial V_{\\mathrm{KS}}}{\\partial \\lambda}, H_{\\mathbf{k}}\\right]\\right| u_{\\mathbf{k} m}^{(\\lambda)}\\right\\rangle,\n\\end{gathered}\n\\]\n\nwhere $H_{\\mathbf{k}}=\\frac{1}{2 m_{e}}(-i \\hbar \\nabla+\\hbar \\mathbf{k})^{2}+V_{\\mathrm{KS}}$ is the periodic Hamiltonian. Substituting (2) and (3) into (1), the only contribution is $\\left\\langle u_{\\mathbf{k} n}^{(\\lambda)}\\left|\\nabla_{\\mathbf{k}}\\right| u_{\\mathbf{k} n}^{(\\lambda)}\\right\\rangle$, as $\\left\\langle u_{\\mathbf{k} n}^{(\\lambda)}\\left|\\frac{\\partial}{\\partial \\lambda}\\right| u_{\\mathbf{k} n}^{(\\lambda)}\\right\\rangle$ is periodic in the reciprocal space. The permanent dipole moment takes a form similar to the Berry phase expression\n\n\\[\n\\mathbf{P}=\\frac{i f e}{8 \\pi^{3}} \\sum_{n=1}^{M} \\int_{\\mathrm{BZ}} d \\mathbf{k}\\left\\langle u_{\\mathbf{k} n}\\left|\\nabla_{\\mathbf{k}}\\right| u_{\\mathbf{k} n}\\right\\rangle .\n\\]\n\nUsing density functional perturbation theory (DFPT), $\\nabla_{\\mathbf{k}}\\left|u_{\\mathbf{k} n}\\right\\rangle$ can be calculated from the Sternheimer equations with similar self-consistent iterations as in the selfconsistent field DFT\n\n\\[\n\\begin{gathered}\n\\left(H_{\\mathbf{k}}-\\epsilon_{\\mathbf{k} n}\\right) \\nabla_{\\mathbf{k}}\\left|u_{\\mathbf{k} n}\\right\\rangle=-\\frac{\\partial\\left(H_{\\mathbf{k}}-\\epsilon_{\\mathbf{k} n}\\right)}{\\partial \\mathbf{k}}\\left|u_{\\mathbf{k} n}\\right\\rangle . \\\\\n\\text { C. Radiative lifetime calculation }\n\\end{gathered}\n\\]\n\nWe determined the radiative transition rate between the ground and excited ${ }^{4} A_{2}$ states by calculating the energy dependent dielectric function $\\epsilon_{r}(E)$. The spontaneous transition rate is given by the Einstein coefficient\n\n\\[\nA=\\frac{n \\omega^{3}|\\mu|^{2}}{3 \\pi \\epsilon_{0} \\hbar c^{3}},\n\\]\n\nwhere $n$ is the refractive index, $\\hbar \\omega$ is the transition energy, $\\mu$ is the optical transition dipole moment, $\\epsilon_{0}$ is the vacuum permittivity, $c$ is the speed of light. $\\mu$ is proportional to the integrated imaginary dielectric function $(I)$ of the given transition\n\n\\[\n|\\mu|^{2}=\\frac{\\epsilon_{0} V}{\\pi} \\int \\operatorname{Im} \\epsilon_{r}(E) d E=\\frac{\\epsilon_{0} V I}{\\pi},\n\\]\n\nwhere $V$ is the volume of the supercell. Thus, the radiative lifetime can be given by\n\n\\[\n\\tau_{\\mathrm{r}}=\\frac{3 \\pi^{2} \\hbar c^{3}}{n \\omega^{3} V I} .\n\\]\n\nIn our particular implementation, we applied the following procedure and parameters. We fit a Lorentzian function to the first peak of $\\operatorname{Im} \\epsilon_{r}(E)$. The results are $I=0.389 \\mathrm{eV}$ and $\\hbar \\omega=1.387 \\mathrm{eV}$. Using the refractive index $n=2.6473$ of $4 \\mathrm{H} \\mathrm{SiC}$ and the cell volume of $V=4.5346 \\mathrm{~nm}^{3}$, the radiative lifetime can be calculated using Eq. (8).\n\n\\section{RESULTS}\n\\section{A. Microscopic model of an ideal defect quantum emitter}\nAn ideal quantum emitter should show no spectral diffusion. This property can be achieved if the electric dipole moment remains either be zero or unchanged during the optical excitation process between the ground $(|g\\rangle)$ and excited $(|e\\rangle)$ states\n\n\\[\n|\\langle e|\\vec{r}| e\\rangle-\\langle g|\\vec{r}| g\\rangle|^{2}=0 .\n\\]\n\nOn the other hand, the optical transition rate should be large\n\n\\[\n|\\langle e|\\vec{r}| g\\rangle|^{2}>10 \\text { Debye }^{2} .\n\\]\n\nThe expectation values in Eqs. (10) are generally nonzero according to the selection rules of quantum mechanics. As vector operators have $P=-1$ parity, the wavefunctions in the integral must have different parity, in order to result in a nonzero scalar.\n\nFor color centers with inversion symmetry, Eq. (9) is satisfied as the individual integrals are zero, where the wavefunctions have either gerade (even) or ungerade (odd) parity. The high optical transition rate can be achieved by large overlap between a gerade orbital and an ungerade orbital in these optical centers.\n\nThe main point of the present paper is the following statement: the inversion symmetry is not an ultimate criterion in simultaneous fulfillment of these requirements as Eq. (9) may be satisfied without the restriction that all the individual terms in Eq. (9) should be set to zero. We show below that other types of optical centers may satisfy Eq. (9).\n\nDefects usually have axial symmetry in compound semiconductors. In this case, Eq. (9) can be satisfied for identical charge densities of the ground and excited state. In systems with axial symmetry, Eq. (10) can be separated into two parts,\n\n\\[\n\\left|\\left\\langle e\\left|\\vec{r}_{\\perp}\\right| g\\right\\rangle\\right|^{2}+\\left|\\left\\langle e\\left|\\vec{r}_{\\|}\\right| g\\right\\rangle\\right|^{2},\n\\]\n\nwhere the first contribution is typically zero for orbitally non-degenerate ground state. The second contribution can be maximized by a large overlap of the wavefunctions (already satisfied by the same density requirement), if they are well separated in their signs along the symmetry axis, i.e., alternating phase of wavefunctions. This condition restricts the optical polarization to be parallel to the symmetry axis. A possible realization of the wavefunctions that fulfills the requirements detailed above is depicted in Fig. 1 for a defect with axial $\\left(C_{3 v}\\right)$ symmetry.\n\nThe other requirement for an ideal quantum emitter is a high Debye-Waller factor, in order to achieve emission of coherent photons at high rate. This can be fulfilled for those defects that have negligible geometry relaxation upon optical excitation.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-3_214_561_1171_1474}\n\\end{center}\n\n(a) ground state\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-3_214_561_1599_1908}\n\\end{center}\n\n(b) excited state FIG. 1. Wavefunction of ideal defect quantum emitter with axial symmetry in a binary semiconductor. The different types of atoms are colored by gray and yellow balls, whereas the positive (negative) isovalues of the corresponding wavefunctions participating in the optical transition are depicted as red (blue) lobes.\n\nTABLE I. Macroscopic electric dipole moment of the negatively charged $h$-site Si-vacancy defect (V1) in $4 \\mathrm{H} \\mathrm{SiC}$ and nitrogen-vacancy (NV) center in diamond as calculated within Berry phase approximation. $\\operatorname{ex}(\\mathrm{gr})$ notes the excited state electron configuration calculated with fixed ground state geometry.\n\n\\begin{center}\n\\begin{tabular}{lllll}\n\\hline\\hline\ncentre & transition & $\\Delta p_{\\text {ion }}(e \\AA)$ & $\\Delta p_{\\text {el }}(e \\AA)$ & $\\Delta p_{\\text {tot }}(e \\AA)$ \\\\\n\\hline\nV1 & gr $\\rightarrow \\operatorname{ex}$ & 0 & $0.044$ & $0.044$ \\\\\nV1 & $\\mathrm{gr} \\rightarrow \\operatorname{ex}(\\mathrm{gr})$ & 0 & $0.039$ & $0.039$ \\\\\n$\\mathrm{NV}$ & $\\mathrm{gr} \\rightarrow \\mathrm{ex}$ & $0.061$ & $0.842$ & $0.903$ \\\\\n\\hline\\hline\n\\end{tabular}\n\\end{center}\n\nB. V1 center as an nearly ideal defect quantum emitter\n\nIn this paper, we identify the $h$-site silicon-vacancy defect (V1 center) in $4 \\mathrm{H} \\mathrm{SiC}$ as a nearly ideal quantum emitter with no inversion symmetry. Long coherence time was already reported for this defect making it a promising candidate for spin-based quantum applications $^{39,40}$. In order to demonstrate that this defect also possesses all the optical requirements for quantum communication, we performed DFT calculations and compared this defect to the negatively charged nitrogenvacancy $(\\mathrm{NV})$ center in diamond, which is known to exhibit a few tenths of $\\mathrm{GHz}$ spectral diffusion even in high purity diamond samples ${ }^{41}$.\n\nThe results of Berry phase evaluation for macroscopic dipole moment calculation for $\\mathrm{V} 1$ center in $4 \\mathrm{H} \\mathrm{SiC}$ and NV center in diamond are shown in Table I. We find that the change in the permanent dipole moments upon optical excitation for $\\mathrm{V} 1$ center in $4 \\mathrm{H} \\mathrm{SiC}$ is nearly 20 times smaller than that for NV center in diamond. This translates to weak coupling of optical excitation to stray electric fields for isolated Si-vacancies in $4 \\mathrm{H} \\mathrm{SiC}$, in good agreement with very recent experimental data ${ }^{42,43}$.\n\nThe geometry relaxation in the excitation transition of the V1 center is depicted in Fig. 2 which shows that\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-4_210_560_389_804}\n\\end{center}\n\nFIG. 2. Geometry relaxation of V1 center upon optical excitation. Small gray, large yellow and glass balls represent carbon, silicon atoms, and the vacant site, respectively. The movement of the first neighbor C-atoms are shown by arrows with the corresponding distances.\n\nthe ions move outward going from the electronic ground state to the excited state. This leads to smaller than unity Debye-Waller factor in the luminescence spectrum. It is experimentally verified ${ }^{40}$ to remain $\\sim 0.5$, which is about an order of magnitude larger than that of NV center in diamond ${ }^{3,44,45}$. The second row in Table I shows the change in the dipole moments without relaxation effect at fixed ground state geometry. We conclude that the outward relaxation of ions upon optical excitation has little effect on the final difference in the dipole moments, and the change is associated with the nature of the ground state and excited state wavefunctions.\n\n\\section{Origin of permanent dipole moments and}\n strong emission from $\\mathrm{V} 1$ center in $4 \\mathrm{H} \\mathrm{SiC}$The results on the microscopic level can be interpreted by considering the electron density of defect states in the ground state. The corresponding in-gap defect levels and labels are shown in Fig. 3. This approximation neglects relaxation effects of ions and the effect of the delocalized electron bath. We approximate the origin of total change of electric dipole moment by studying the difference of electron density of these in-gap Kohn-Sham states, which change occupation during optical transition (V1 $u$ and $v$ levels and NV $v$ and $e$ levels in Fig. 3).\n\nTo visualize this scenario, we plot the electron density in the minority spin channel of the localized Kohn-Sham orbitals in the ground state (Fig. 4) which represents the ground state and excited state in the photoexcitation process. NV in diamond shows a rather large change in localization and magnitude of the electron densities going from the excited state to the ground state which leads to a considerable change of electric dipole moment. However, V1 center manifests small change in localization and magnitude of the electron densities that suggests small change of electric dipole moment.\n\nFigure 5 (a, b) shows overlap of same phase for the lobe in axial direction resulting in a positive contribution. The $\\mathrm{NV}^{-}$ V1\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_d84d81c022c4b2981048g-4_226_870_1214_1826}\n\nFIG. 3. Schematic visualization of ground state Kohn-Sham levels of $\\mathrm{NV}$ and $\\mathrm{V} 1$ center in the band gap, respectively. $v$ and $u$ states have non-degenerate $a_{1}$ symmetry whereas $e$ state is double degenerate. The occupation of these levels shows the ground state electronic configuration. In the spin minority channel (spin down), the electron is promoted to the $e$ level in NV center and $v$ level in V1 center, respectively, in the excited state electronic configuration.\n\nbasal lobes overlap with different phase resulting in negative contribution. These spatially well-separated contributions with opposite sign integrate to a rather large transition dipole moment. The same argument can be made for NV center in the perpendicular direction to the defect axis. The calculated radiative lifetime of V1 center is 12 ns which is fairly comparable to the calculated $11 \\mathrm{~ns}^{46}$ and measured $\\sim 12 \\mathrm{~ns}^{47}$ lifetime of $\\mathrm{NV}$ center in diamond.\n\nThese lines of the discussion are inspired by Eqs. (9) and (10) that indeed explain well our ab initio results on the change of the permanent dipole moments versus the radiative lifetime.\n\n\\section{DISCUSSION}\nOur findings have important implications in seeking materials hosting defect quantum emitters for realizing robust spin-to-photon interfaces. It is a common wisdom in the present literature that only defects with inversion symmetry are decoupled from stray electric fields, which significantly constrains the type of host materials. For instance, only 84 centrosymmetrical three-dimensional (3D) crystal structures exist among the total 230 feasible 3D crystal structures. In particular, commercially available wide band gap semiconductors, such as $\\mathrm{SiC}, \\mathrm{ZnO}$ or $\\mathrm{GaN}$ are all not centrosymmetrical. In addition, twodimensional (2D) transition-metal dichalgonides (TMD) are also per se not centrosymmetrical, thus they cannot host single photon defect emitters with inversion sym-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-5_214_545_497_782}\n\\end{center}\n\n(a) $\\mathrm{NV}|v|^{2}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-5_657_1002_500_801}\n\\end{center}\n\n(d) $\\mathrm{V} 1|u|^{2}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-5_213_579_867_1258}\n\\end{center}\n\n(b) $\\mathrm{NV}|e|^{2}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-5_657_1002_934_1235}\n\\end{center}\n\n(e) $\\mathrm{V} 1|v|^{2}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-5_215_576_1300_1671}\n\\end{center}\n\n(c) $\\mathrm{NV}|e|^{2}-|v|^{2}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-5_653_1000_1359_1649}\n\\end{center}\n\n(f) $\\mathrm{V} 1|v|^{2}-|u|^{2}$\n\nFIG. 4. Electron density isosurfaces ( $0.025 \\AA^{-3}$ in purple color) of the ground state in the minority spin channel for the localized Kohn-Sham states of NV center in diamond (a, b) and V1 center in $4 \\mathrm{H} \\mathrm{SiC}(\\mathrm{d}$, e). Their positive (negative) difference is shown in red (blue) colors in (c, f). Gray, yellow and blue balls represent carbon, silicon and nitrogen atoms, respectively. Vacancy is represented by a glass ball.\n\nmetry. We show theoretical arguments that the quest of inversion can be relaxed and other types of defect quantum emitters are in contention, such as V1 center in 4H $\\mathrm{SiC}$. In particular, $4 \\mathrm{H} \\mathrm{SiC}$ hosts spin-active emitters, e.g., a recent study on molybdenum ${ }^{48,49}$, that might have also favorable optical stability against stray electric fields. Quantum emitters in other semiconductors such as $\\mathrm{ZnO}^{50,51}$ and $\\mathrm{GaN}^{52,53}$ should be also revisited in this regard. Our study also provides a guidance to design novel defect quantum emitters in $2 \\mathrm{D}$ compound materials ${ }^{54-58}$ for stable spin-to-photon interface at a single photon level.\n\n\\section{ACKNOWLEDGMENT}\nThe support from National Research, Development and Innovation Office in Hungary (NKFIH) Grant Nos. 2017-1.2.1-NKP-2017-00001 (National Quantum Technology Program) and NVKP\\_16-1-2016-0043 (NVKP Program) as well as Grant No. NN127902 (EU QuantERA Nanospin consortial project), and from the EU Commission (ASTERIQS project with Grant No. 820394) as well as BMBF project Q.Link.X is acknowledged. We acknowledge the discussion with Alp Sipahigil. 1 B. E. Kane, Nature 393, 133 (1998).\n\n2 E. Togan, Y. Chu, A. S. Trifonov, L. Jiang, J. Maze, L. Childress, M. V. G. Dutt, A. S. Sørensen, P. R. Hemmer, A. S. Zibrov, and M. D. Lukin, Nature 466, 730 (2010).\n\n${ }^{3}$ M. Atatüre, D. Englund, N. Vamivakas, S.-Y. Lee, and J. Wrachtrup, Nature Reviews Materials 3, 38 (2018). ${ }^{4}$ C. L. Degen, F. Reinhard, and P. Cappellaro, Rev. Mod. Phys. 89, 035002 (2017).\n\n5 F. Casola, T. van der Sar, and A. Yacoby, Nature Reviews Materials 3, 17088 (2018).\n\n${ }^{6}$ M. Niethammer, M. Widmann, S.-Y. Lee, P. Stenberg, O. Kordina, T. Ohshima, N. T. Son, E. Janzén, and J. Wrachtrup, Phys. Rev. Applied 6, 034001 (2016).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-6_195_558_278_568}\n\\end{center}\n\n(a) V1 $u$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-6_645_1014_217_591}\n\\end{center}\n\n(c) NV $v$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-6_197_552_694_997}\n\\end{center}\n\n(b) V1v\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d84d81c022c4b2981048g-6_642_1027_642_1038}\n\\end{center}\n\n(d) $\\mathrm{NV} e_{x}$ FIG. 5. Square moduli of the corresponding wavefunctions of the ground state in the minority spin channel in V1 (a, b) and NV (c, d) center. The same color code is used as in Fig. 4(f).\n\n7 L. Robledo, L. Childress, H. Bernien, B. Hensen, P. F. A. Alkemade, and R. Hanson, Nature 477, 574 (2011).\n\n${ }^{8}$ L. J. Rogers, K. D. Jahnke, M. H. Metsch, A. Sipahigil, J. M. Binder, T. Teraji, H. Sumiya, J. Isoya, M. D. Lukin, P. Hemmer, and F. Jelezko, Phys. Rev. Lett. 113, 263602 (2014)\n\n9 H. D. Robinson and B. B. Goldberg, Phys. Rev. B 61, R5086 (2000).\n\n${ }^{10}$ L. C. Bassett, F. J. Heremans, C. G. Yale, B. B. Buckley, and D. D. Awschalom, Phys. Rev. Lett. 107, 266403 (2011).\n\n11 D. D. Awschalom, R. Hanson, J. Wrachtrup, and B. B. Zhou, Nature Photonics 12, 516 (2018).\n\n12 A. Sipahigil, K. D. Jahnke, L. J. Rogers, T. Teraji, J. Isoya, A. S. Zibrov, F. Jelezko, and M. D. Lukin, Phys. Rev. Lett. 113, 113602 (2014).\n\n13 N. T. Son, P. Carlsson, J. ul Hassan, E. Janzén, T. Umeda, J. Isoya, A. Gali, M. Bockstedte, N. Morishita, T. Ohshima, and H. Itoh, Phys. Rev. Lett. 96, 055501 (2006).\n\n14 W. F. Koehl, B. B. Buckley, F. J. Heremans, G. Calusine, and D. D. Awschalom, Nature 479, 84 (2011).\n\n15 A. L. Falk, B. B. Buckley, G. Calusine, W. F. Koehl, V. V. Dobrovitski, A. Politi, C. A. Zorman, P. X. L. Feng, and D. D. Awschalom, Nature Communications 4, 1819 (2013).\n\n${ }^{16}$ D. J. Christle, P. V. Klimov, C. F. de las Casas, K. Szász, V. Ivády, V. Jokubavicius, J. Ul Hassan, M. Syväjärvi, W. F. Koehl, T. Ohshima, N. T. Son, E. Janzén, A. Gali, and D. D. Awschalom, Phys. Rev. X 7, 021046 (2017).\n\n17 N. Mizuochi, S. Yamasaki, H. Takizawa, N. Morishita, T. Ohshima, H. Itoh, and J. Isoya, Phys. Rev. B 66, 235202 (2002). 18 D. Riedel, F. Fuchs, H. Kraus, S. Väth, A. Sperlich, V. Dyakonov, A. A. Soltamova, P. G. Baranov, V. A. Ilyin, and G. V. Astakhov, Phys. Rev. Lett. 109, 226402 (2012).\n\n19 H. Kraus, V. A. Soltamov, D. Riedel, S. Väth, F. Fuchs, A. Sperlich, P. G. Baranov, V. Dyakonov, and G. V. Astakhov, Nature Physics 10, 157 (2013).\n\n${ }^{20}$ H. Kraus, V. A. Soltamov, F. Fuchs, D. Simin, A. Sperlich, P. G. Baranov, G. V. Astakhov, and V. Dyakonov, Scientific Reports 4, 5303 (2014).\n\n21 O. O. Soykal, P. Dev, and S. E. Economou, Phys. Rev. B 93, 081207 (2016).\n\n22 M. Widmann, S.-Y. Lee, T. Rendler, N. T. Son, H. Fedder, S. Paik, L.-P. Yang, N. Zhao, S. Yang, I. Booker, A. Denisenko, M. Jamali, S. A. Momenzadeh, I. Gerhardt, T. Ohshima, A. Gali, E. Janzén, and J. Wrachtrup, Nat Mater 14, 164 (2015).\n\n23 E. Janzén, A. Gali, P. Carlsson, A. Gällström, B. Magnusson, and N. Son, Physica B: Condensed Matter 404, 4354 (2009).\n\n24 V. Ivády, J. Davidsson, N. T. Son, T. Ohshima, I. A. Abrikosov, and A. Gali, Phys. Rev. B 96, 161114 (2017).\n\n${ }^{25}$ G. Davies, M. F. Hamer, and W. C. Price, Proceedings of the Royal Society of London. A. Mathematical and Physical Sciences 348, 285 (1976), \\href{https://royalsocietypublishing.org/doi/pdf/10.1098/rspa.1976.0039}{https://royalsocietypublishing.org/doi/pdf/10.1098/rspa.1976.0039}\n\n26 J. P. Goss, R. Jones, S. J. Breuer, P. R. Briddon, and S. Öberg, Phys. Rev. Lett. 77, 3041 (1996).\n\n27 A. Gali, M. Fyta, and E. Kaxiras, Phys. Rev. B 77, 155206 (2008).\n\n28 G. Kresse and J. Hafner, Phys. Rev. B 47, 558 (1993).\n\n${ }^{29}$ G. Kresse and J. Furthmüller, Phys. Rev. B 54, 11169 (1996).\n\n30 G. Kresse and J. Furthmüller, Computational Materials Science 6, 15 (1996).\n\n31 J. Paier, M. Marsman, K. Hummer, G. Kresse, I. C. Gerber, and J. G. Ángyán, The Journal of Chemical Physics 124, 154709 (2006).\n\n32 P. E. Blöchl, Phys. Rev. B 50, 17953 (1994).\n\n33 J. P. Perdew, K. Burke, and M. Ernzerhof, Phys. Rev. Lett. 77, 3865 (1996).\n\n34 A. Gali, E. Janzén, P. Deák, G. Kresse, and E. Kaxiras, Phys. Rev. Lett. 103, 186404 (2009).\n\n35 M. Gajdoš, K. Hummer, G. Kresse, J. Furthmüller, and F. Bechstedt, Phys. Rev. B 73, 045112 (2006).\n\n36 R. D. King-Smith and D. Vanderbilt, Phys. Rev. B 47, 1651 (1993).\n\n37 D. Vanderbilt and R. D. King-Smith, Phys. Rev. B 48, 4442 (1993).\n\n38 R. Resta, Rev. Mod. Phys. 66, 899 (1994).\n\n39 D. Simin, H. Kraus, A. Sperlich, T. Ohshima, G. V. Astakhov, and V. Dyakonov, Phys. Rev. B 95, 161201 (2017).\n\n40 R. Nagy, M. Widmann, M. Niethammer, D. B. R. Dasari, I. Gerhardt, O. O. Soykal, M. Radulaski, T. Ohshima, J. Vučković, N. T. Son, I. G. Ivanov, S. E. Economou, C. Bonato, S.-Y. Lee, and J. Wrachtrup, Phys. Rev. Applied $\\mathbf{9}, 034022$ (2018).\n\n41 P. Siyushev, H. Pinto, M. Vörös, A. Gali, F. Jelezko, and J. Wrachtrup, Phys. Rev. Lett. 110, 167402 (2013).\n\n42 R. Nagy, M. Niethammer, M. Widmann, Y.-C. Chen, P. Udvarhelyi, C. Bonato, J. U. Hassan, R. Karhu, I. G. Ivanov, N. T. Son, J. R. Maze, T. Ohshima, O. O. Soykal, A. Gali, S.-Y. Lee, F. Kaiser, and J. Wrachtrup, arXiv:1810.10296 (2018). ${ }^{43}$ H. B. Banks, O. O. Soykal, R. Myers-Ward, D. K. Gaskill, T. L. Reinecke, and S. G. Carter, arXiv:1811.01293 (2018).\n\n44 A. Alkauskas, B. B. Buckley, D. D. Awschalom, and C. G. V. de Walle, New Journal of Physics 16, 073026 (2014).\n\n${ }^{45}$ G. m. H. Thiering and A. Gali, Phys. Rev. B 96, 081115 (2017).\n\n46 P. Siyushev, H. Pinto, M. Vörös, A. Gali, F. Jelezko, and J. Wrachtrup, Phys. Rev. Lett. 110, 167402 (2013).\n\n47 A. Batalov, C. Zierl, T. Gaebel, P. Neumann, I.-Y. Chan, G. Balasubramanian, P. R. Hemmer, F. Jelezko, and J. Wrachtrup, Phys. Rev. Lett. 100, 077401 (2008).\n\n48 A. Csóré, A. Gällström, E. Janzén, and A. Gali, Materials Science Forum 858, 261 (2016).\n\n49 T. Bosma, G. J. J. Lof, C. M. Gilardoni, O. V. Zwier, F. Hendriks, B. Magnusson, A. Ellison, A. Gällström, I. G. Ivanov, N. T. Son, R. W. A. Havenith, and C. H. v. d. Wal, npj Quantum Information 4, 48 (2018).\n\n50 A. J. Morfa, B. C. Gibson, M. Karg, T. J. Karle, A. D. Greentree, P. Mulvaney, and S. Tomljenovic-Hanic, Nano Letters 12, 949 (2012), \\href{https://doi.org/10.1021/nl204010e}{https://doi.org/10.1021/nl204010e}.\n\n51 O. Neitzke, A. Morfa, J. Wolters, A. W. Schell, G. Kewes, and O. Benson, Nano Letters 15, 3024 (2015), \\href{https://doi.org/10.1021/nl504941q}{https://doi.org/10.1021/nl504941q}.\n\n52 A. M. Berhane, K.-Y. Jeong, Z. Bodrog, S. Fiedler, T. Schröder, N. V. Triviño, T. Palacios, A. Gali, M. Toth, D. Englund, and I. Aharonovich, Advanced Materials 29, 1605092 (2017).\n\n53 Y. Zhou, Z. Wang, A. Rasmita, S. Kim, A. Berhane, Z. Bodrog, G. Adamo, A. Gali, I. Aharonovich, and W.-b. Gao, Science Advances 4, eaar3580 (2018).\n\n54 T. T. Tran, K. Bray, M. J. Ford, M. Toth, and I. Aharonovich, Nat. Nanotechn. 11, 37 (2016).\n\n55 S. Tongay, J. Suh, C. Ataca, W. Fan, A. Luce, J. S. Kang, J. Liu, C. Ko, R. Raghunathanan, J. Zhou, F. Ogletree, J. Li, J. C. Grossman, and J. Wu, Scientific Reports 3 , $2657(2013)$.\n\n56 N. Saigal and S. Ghosh, Applied Physics Letters 109, 122105 (2016), \\href{https://doi.org/10.1063/1.4963133}{https://doi.org/10.1063/1.4963133}.\n\n57 Y.-M. He, G. Clark, J. R. Schaibley, Y. He, M.-C. Chen, Y.-J. Wei, X. Ding, Q. Zhang, W. Yao, X. Xu, C.-Y. Lu, and J.-W. Pan, Nature Nanotechnology 10, 497 (2015).\n\n58 A. Srivastava, M. Sidler, A. V. Allain, D. S. Lembke, A. Kis, and A. Imamoglu, Nature Nanotechnology 10, 491 (2015).\n\n\n\\end{document}", "record_id": "2023_09_22_d84d81c022c4b2981048g"}