{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{Locally Induced Spin States on Graphene by Chemical Attachment of Boron Atoms }\n\n\n\\author{Qing $\\mathrm{Li}^{1}$, Haiping $\\operatorname{Lin}^{1^{*}}$, Ruitao $\\mathrm{Lv}^{2}$, Mauricio Terrones ${ }^{3,4,5}$, Lifeng $\\mathrm{Chi}^{1}$, Werner A.\\\\\nHofer $^{6 *}$ and Minghu $\\operatorname{Pan}^{7 *}$\\\\\n${ }^{1}$ Institute of Functional Nano and Soft Materials (FUNSOM) \\& Collaborative\\\\\nInnovation Center of Suzhou Nano Science and Technology, Soochow University,\\\\\nSuzhou 215123, China.}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\n${ }^{2}$ Key Laboratory of Advanced Materials, School of Materials Science and Engineering, Tsinghua University, Beijing 100084, China.\n\n${ }^{3}$ Department of Chemistry, Department of Materials Science and Engineering and Center for 2Dimensional and Layered Materials, The Pennsylvania State University, University Park, PA 16802, USA.\n\n${ }^{4}$ Institute of Carbon Science and Technology, Shinshu University, 4-17-1 Wakasato, Nagano, 3808553, Japan.\n\n${ }^{5}$ Department of Materials Science and Engineering \\& Chemical Engineering, Carlos III University of Madrid, Avenida Universidad 30, 28911 Leganés, Madrid, Spain. IMDEA Materials Institute, Eric Kandel 2, Getafe, Madrid 28005, Spain.\n\n${ }^{6}$ School of Natural and Environmental Sciences, Newcastle University, Newcastle upon Tyne NE1 7RU, United Kingdom. ${ }^{7}$ School of Physics, Huazhong University of Science and Technology, Wuhan 430074, China.\n\nKEYWORDS: Graphene, STM, STS, spin, DFT\n\n\\begin{abstract}\nPristine graphene is known to be non-magnetic due to its $\\pi$-conjugated electron\n\\end{abstract}\n\nWhile pristine graphene is known to be intrinsically non-magnetic due to its $\\pi$-conjugated electron system ${ }^{1}$, Lieb ${ }^{2}$ proposed that the ground state of graphene may possess a total spin given by $S=1 / 2 \\times\\left|N_{A}-N_{B}\\right|$, where $N_{A}$ and $N_{B}$ are the number of $p_{z}$ orbitals removed from each triangular sublattice. Single magnetic states close to the Fermi energy $\\left(E_{F}\\right)$ can therefore be induced by removing $p_{z}$ orbitals from one of the carbon sublattices ${ }^{3-7}$. As the double occupation of such a magnetic state by two electrons with different spins is hindered due to the Coulomb repulsion, an energy split can be observed near the Fermi energy, with the energy difference being determined by the strength of Coulomb repulsion $U^{8}$. However, the removal of the $p_{z}$ orbital may not necessarily result in net magnetism ${ }^{8,9}$, as magnetic moments can only be induced if the strength of the Coulomb repulsion $U$ is significantly larger than the energy width $\\Delta$ of the split states $(\\pi \\Delta U<1)$.\n\nDespite several attempts of removing $p_{\\mathrm{z}}$ orbitals in $\\pi$-conjugated carbon systems, either by creating atomic vacancies or by chemically doping graphene with hetero-atoms ${ }^{3-5,50-18}$, local magnetic states at the atomic scale were not reported until very recently by Brihuega et al. ${ }^{8}$. In these experiments the chemisorption of single hydrogen atoms on graphene was observed to induce a magnetic moment of $1 \\mu_{B}$, and the polarized states were evidenced by the characteristic split of resonance peaks. Following on from their pioneering study, two key issues remain unclear: (1), whether heavier dopants would produce a larger moment per adsorption site; and (2), whether these magnetic moments interact between multiple adsorption sites. In this article, we show that localized magnetic moments can be induced in the graphene lattice by the chemisorption of boron atoms. Each boron atom gives rise to a magnetic moment of $2.8 \\mu_{B}$, which is much larger than the moment due to an adsorbed hydrogen atom ${ }^{8}$. More importantly, antiferromagnetic coupling between the induced spins is observed, giving rise to an increment of spin-down states in specific locations.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_54050a76c33463a8157fg-04_276_1530_431_1697}\n\nFigure 1. STM images and DFT simulations of the single substitutional boron dopant. (a) Largearea STM image of the synthesized BG sheet on $\\mathrm{SiO}_{2} / \\mathrm{Si}, V_{\\mathrm{b}}=-700 \\mathrm{mV}, I_{\\mathrm{s}}=50 \\mathrm{pA}$. The raw STM image was digitally flattened by removing the overall roughness of the substrate. The inset shows the corresponding FFT pattern. (b) High-resolution STM image for single boron substitutional dopant 1B (upper) and a height profile measured across such dopant (lower). (c) The structural model (left) and corresponding DFT simulation (right) of graphene with a substitutionally doped boron atom. (d) $d I / d V$ spectrum of the substitutional dopant 1B. (e) Calculated spin-DOS of the single substitutional boron-doped graphene. Boron doped graphene (BG) sheets were synthesized using ambient-pressure chemical vapor deposition (CVD), the details of the sample preparation can be found in the Methods part of the supporting information. The identity of boron atoms is confirmed by X-ray photoelectron (XPS) and Raman spectroscopy (Details of the XPS characterization can be found here ${ }^{19}$ ). For B-doped graphene, two prominent peaks located at $186.4 \\mathrm{eV}$ and $190.3 \\mathrm{eV}$ are identified in the B1s line scans $^{19}$. The peak of $190.3 \\mathrm{eV}$, can be assigned to the substitutional boron atoms embedded within the graphene lattice ${ }^{20,21}$. A Bader analysis shows that the chemisorbed boron carries less positive charge (+1 $|\\mathrm{e}|)$ compared to the substitutional boron (+3 $|\\mathrm{e}|)$. As a consequence, the binding energy of the chemisorbed boron is less than that of the substitutional boron. Therefore, the peak located at $\\sim 186 \\mathrm{eV}$ in the XPS spectra can be assigned to the chemisorbed boron ${ }^{22}$. STM/STS measurements were performed on $\\mathrm{BG}$ sheets after transfer onto $\\mathrm{SiO}_{2} / \\mathrm{Si}$ substrates. A large-area scan shows a surface with corrugations of $0.6 \\sim 1.0 \\mathrm{~nm}$, which can be attributed to the roughness of the $\\mathrm{SiO}_{2} / \\mathrm{Si}$ substrate. This roughness leads to difficulties in the identification of boron atoms, compared to graphene on a flat substrate ${ }^{8}$. We therefore flattened the raw data by subtracting the background roughness. As shown in Figure 1a, the carbon honeycomb lattice is decorated with numerous protrusions. Since these protrusions are absent in pristine graphene we identify them as boron dopants. The fast Fourier transform (FFT) image presented in the inset of Figure 1a exhibits the typical reciprocal hexagonal symmetry of the graphene lattice (outer hexagon) and the intervalley scattering peaks (inner hexagon), representing the enhanced electron scattering induced by the B-defect. Different from the well-studied nitrogen doped graphene ${ }^{23-26}$, boron dopants have been much less researched ${ }^{24,27-29}$. Figure 1 b shows an STM image on which a single protrusion is observed. A line profile across such protrusions shows an apparent height of $0.5 \\AA$. DFT simulations reveal that it is a single substitutionally doped boron atom (referred to as \"1B\", as shown in Figure 1c) and the calculated corrugation is about $0.7 \\AA$, in good agreement with experimental observations. The STS acquired on a single boron dopant shows an overall $U$-shaped curve with no obvious feature near the Fermi level, implying no $p_{\\mathrm{z}}$ orbital being removed upon substitutional-doping (Figure 1d). The conclusion is further confirmed by DFT calculations, which show that the spin-up and spin-down component of the DOS of the substitutionally doped boron atom is fully compensated (Figure 1e), leading to a net magnetism of $0 \\mu_{B}$. This can be understood from the fact that the electrons from boron atoms are embedded in the graphene lattice, so that the conjugation of $p_{z}$ orbitals over the atomic plane of graphene is not affected. Other types of substitutional boron dopants were also investigated by both STM/S and DFT calculations, all give a zero magnetic moment (see supplementary Figure S1 for details).\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_54050a76c33463a8157fg-07_278_1426_370_1758}\n\nFigure 2. STM image and DFT simulations for a chemisorbed boron atom. (a) High-resolution STM image for chemisorbed boron atoms. $V_{\\mathrm{b}}=-700 \\mathrm{mV}, I_{\\mathrm{t}}=50 \\mathrm{pA}$. Inset: A height profile measured along the blue dashed line across the protrusion. (b) $d I / d V$ spectrum measured on the site of the chemisorbed boron atom. (c) Structural model (upper) and DFT simulation (lower) of the single chemisorbed boron atom. (d) Top (upper) and side views (lower) of the spatial distribution of the calculated spin-up (red) and spin-down (blue) DOS. (e) Calculated spin-polarized density of states of the single chemisorbed boron.\n\nBy contrast, the situation for chemisorbed boron atoms is completely different. Figure 2a gives much brighter protrusions, the apparent height now is about $1.3 \\sim 1.6 \\AA$ above the carbon lattice. According to our DFT modeling and STM image simulation (Figure 2c), single boron atoms prefer to attach at the bridge sites of graphene, with an apparent height of $1.8 \\AA$. More intriguingly, the DOS (measured at $4.2 \\mathrm{~K}$ ) acquired on the chemisorbed atoms exhibit a distinct peak located at $+7$ $\\mathrm{meV}$ and a weak shoulder at $+70 \\mathrm{meV}$ (Figure $2 \\mathrm{~b}$ ), which differs significantly from the substitutional case. No prominent feature is observed at the Fermi level in the region far away from the adsorbates. Considering the similarities between the STS spectrum of the chemisorbed boron atom, the spectra on carbon vacancy defects ${ }^{30}$, and on hydrogen adsorbates ${ }^{8}$, we attribute the feature to an impurity-induced magnetic resonance. It is also worth noting that the Dirac point $E_{\\mathrm{d}}$ varies with the spatial locations, originating from the local inhomogeneity of doping, which is more prominent for CVD-grown graphene. We have obtained various spectra with different Dirac point energies $E_{\\mathrm{d}}$ over the studied surface, as shown in Figure S2. Note that the peak splitting remains unaltered within the error bar.\n\nAccording to the Anderson impurity model in which a single electronic state is attached to the host graphene state, the energy of the localized states can be written as: $E_{\\uparrow}=E_{\\mathrm{D}}-U \\mathrm{n}_{\\downarrow} ; E_{\\downarrow}=$ $E_{\\mathrm{D}}+U \\mathrm{n}_{\\uparrow}$, where $n$ is the occupation of each of the two spin states, $E_{\\mathrm{D}}$ is the energy of the Dirac point, and $U$ is the strength of the Coulomb repulsion which can be determined by the splitting of the magnetic peaks ${ }^{9,31}$. For the chemisorbed single boron atom, $U$ is measured to be $63 \\mathrm{meV}$, which is much larger than that of a hydrogen atom ${ }^{8}$. Additional differences are that the chemisorption of $\\mathrm{H}$ atoms leads to spin-split peaks with $n_{\\uparrow}=1, n_{\\downarrow}=0$, and where $E_{\\mathrm{D}}$ is below to the Fermi energy. In our case, $E_{\\mathrm{D}}$ is located at $+7 \\mathrm{meV}$, slightly above $E_{\\mathrm{F}}$, which might be due to a shift of the local Dirac point, induced by the boron doping. The introduction of magnetic states via boron chemisorption is further evidenced by DFT calculations. The spin-polarized density of states (spinDOS) of the single chemisorbed boron atom on the graphene lattice is shown in Figure 2e (the calculated spin-DOS with a wider energy window is provided in Figure S3). For comparison, the calculated spin-DOS of the vacancies in graphene lattice is provided in Figure S4, in which a localized spin is observed. Both, the prominent DOS peak for the spin-up component and the weak DOS peak for spin-down component appear near $E_{\\mathrm{F}}$, giving a total induced magnetic moment of $2.8 \\mu_{\\mathrm{B}}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_54050a76c33463a8157fg-10_270_1747_384_1741}\n\\end{center}\n\nFigure 3. Propagation of spin-split states in the graphene lattice. (a) Highly resolved STM image for a single chemisorbed boron atom. $V_{\\mathrm{b}}=-700 \\mathrm{mV}, \\mathrm{I}_{\\mathrm{t}}=50 \\mathrm{pA}$. The image size is about $0.9 \\times 6.5$ $\\mathrm{nm}^{2}$. The lower panel illustrates the propagation of the induced spin state. (b) A series of $d I / d V$ spectra recorded along the black dashed line in (a) with a distance separation of $1 \\AA$. The $d I / d V$ spectra are superimposed with the colored differential conductance map. The position of the boron atom is indicated by a yellow arrow. (c) The distribution of the intensities of the $+7$ meV peak with the tip displacements. Insert: Direction of the tip displacements. The blue dashed line is the fitting curve. The position of the boron atom is indicated by the black dashed arrow.\n\nDFT calculations reveal that the spin-polarized electronic states are mostly localized around the adsorbed boron atom, as shown in Figure 2d. Different from the chemisorbed $H$ that sits at the ontop site of carbon, the boron atom prefers to adsorb at the bridge site between two adjacent carbon atoms. Correspondingly, the spin-split states are in evidence on both of the two adjacent carbon atoms. Since these two carbon atoms belong to different graphene sublattices, the spin-split states are created in both sublattices and propagate along their respective sublattices, as shown in Figure 2d. To confirm the spatial distribution of the magnetic states, a series of $d I / d V$ spectra was recorded along a dashed line across a boron adsorbate at equal separations of $1 \\AA$ (Figure 3a). Here, we only extract the intensity of the peak located at $+7 \\mathrm{meV}$ since it is much stronger than that at $+70 \\mathrm{meV}$. From both, the differential conductance map (Figure 3b) and the extracted peak intensity (Figure 3c) plotted with respect to the lateral tip displacements, a slow decay of the resonances is in evidence, accompanied by a periodic oscillation. The periodicity of the spatial distribution of the magnetic states is $0.62 \\mathrm{~nm}$, corresponding to the atomic separation of one sublattice orientated $18^{\\circ}$ deviated from the zigzag direction (Figure 3c). Such a propagation of spin-split states can be well reproduced via an empirical formula, $\\exp \\left(-\\frac{x}{L}\\right)\\left[\\sum F u n c_{P e a k}\\left(x-x_{c}\\right)\\right]$. Here, $\\mathrm{x}$ is the tip displacements, $\\mathrm{x}_{\\mathrm{C}}$ is the lateral position of intensity maxima and $\\mathrm{L}$ is the decay length. Func is a series of Gauss peaks with various peak positions. The decay length is then calculated to be about $1.5 \\mathrm{~nm}$ by fitting the peak intensity. The periodicity is different along different directions. For example, as shown in Figure $S 5$, the $d I / d V$ spectra along the zigzag direction have a periodicity of $2.8 \\pm 0.2 \\AA$, close to the atomic separation along the zigzag direction of the carbon lattice (2.56 $\\AA)$. It is noteworthy that the adsorption of boron atoms at the bridge site does not break the sublattice symmetry of graphene, which is different from previous reports ${ }^{2,8}$. In fact, a boron adatom will induce spin polarization in both sublattices and propagate in each sublattice individually.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_54050a76c33463a8157fg-12_964_2002_252_1870}\n\nFigure 4. Spin interactions from multiple boron adsorbates. (a) From top to bottom, respectively: topographic image (four chemisorbed boron atoms indicated by the shadowed circles), conductance map acquired at $+7 \\mathrm{meV}$ and conductance map acquired at $+70 \\mathrm{meV}$. Images are obtained at $4.2 \\mathrm{~K}$. (b) Three representative $d I / d V$ spectra measured at the sites indicated in (a), showing the spin-up dominance, spin-down dominance and the coexistence of comparable spin states, respectively. (c) A series of $d I / d V$ spectra recorded along the black dashed line shown in (a) equally separated by $1 \\AA$. The spectra acquired on the top of boron atoms are indicated with yellow arrows. (d) Calculated spin intensity distributions based on the assumption of antiferromagnetic interaction among adjacent induced spins. The positions of boron atoms are indicated by the golden balls.\n\nAs a single chemisorbed boron atom can induce spin polarization in surrounding electrons, it is of particular interest to study the interaction of the spin states induced by multiple boron adsorptions. Figure 4a shows an STM image of a region that includes multiple chemisorbed boron atoms. Figure $4 \\mathrm{~b}$ gives three representative $d I / d V$ spectra taken at different positions in Figure 4a. The spectrum acquired above the boron atom (red dot and red curve), shows a dominant peak located at $+7 \\mathrm{meV}$ and a weak shoulder at $+70 \\mathrm{meV}$, the spectrum acquired in the middle area exhibits two split peaks with comparable intensities (blue curve), while at the positions of black dots the spectrum exhibits a dominant peak at $+70$ meV and a weak shoulder at $+7$ meV (black curve). To further investigate the spatial distributions of the spin-split peaks, a series of $d I / d V$ spectra (Figure 4c) were taken along the black dashed line given in Figure 4a. The spin-split peaks are always observed, and the peak positions remain unchanged, while the relative intensity varies spatially. This phenomenon can be further scrutinized by conductance maps, as shown in Figure 4a. The $d I / d V$ image acquired at $+7 \\mathrm{meV}$ exhibits four distinct protrusions, corresponding to the four adsorbed boron atoms. At the energies of $+70 \\mathrm{meV}$, the DOS above these adsorbed boron atoms is suppressed. By contrast, the DOS is substantially enhanced along the sides of the triangle defined by the black dots. According to previous reports ${ }^{8}$, the spin-split peaks are a result of Coulomb repulsion between electrons of different spins. The intensity of the $+7 \\mathrm{meV}$ and $+70 \\mathrm{meV}$ peaks therefore represents the level of spin-up and spin-down occupation, respectively. The occupation of spin-down states is negligible at boron adsorbates (Figure 3b), whereas it is enhanced within the boron triangle. The enhancement of the spin-down component can only be a result of the Coulomb interaction between multiple spins. This interaction between multiple spins is akin to a \"pseudo-antiferromagnetic\" spin interaction for induced spin states. To clarify the effect, a spin intensity map was calculated numerically, based on the assumption of antiferromagnetic interaction between the induced spin states generated by the three boron atoms; it is shown in Figure 4d. The spin intensity maps are in good agreement with the maps shown in Figure 4a, and they show a periodic variation of the spin amplitudes. In a non-magnetic system similar effects can be observed for the electron densities, for example in a quantum corral on silver $^{32}$. It is therefore tempting to think of the area enclosed by the boron adsorbates as a similar type of corral, only in this case a spin quantum corral.\n\nIn summary, we report that localized magnetic moments can be generated by chemically attaching boron atoms on CVD prepared graphene sheets. The magnetism arises from the removal of local $p_{z}$ orbitals from the carbon sublattices by the chemisorption of boron atoms. The magnetic polarization is characterized by the splitting of the resonance peaks close to the Fermi level, which is experimentally evidenced by STS measurements. These spin-split states extend $1.5 \\mathrm{~nm}$ over the\n\nsurface. In the vicinity of several co-adsorbed boron atoms, the Coulomb repulsion between multiple spins leads to antiferromagnetic coupling for the induced spin states in the graphene lattice, manifesting itself as a redistribution of the spin-up and spin-down state occupation, which can be interpreted as \"quantum spin corral\".\n\n\\section{ASSOCIATED CONTENT}\n\\section{Supporting Information.}\nThe Supporting Information is available free of charge on the ACS Publications Website at DOI: Xxxxxxx.\n\nThe details of the sample preparation, STM/STS measurements and the DFT calculations, various kinds of dopants and their electronic structures, Spin-DOS of the carbon vacancy (PDF)\n\n\\section{AUTHOR INFORMATION}\n\\section{Corresponding Author}\n*E-mail:hplin@suda.edu.cn; \\href{mailto:Werner.Hofer@newcastle.ac.uk}{Werner.Hofer@newcastle.ac.uk}\\href{mailto:;minghupan@hust.edu.cn}{;minghupan@hust.edu.cn}\n\n\\section{Author Contributions}\nThe manuscript was written through contributions of all authors. All authors have given approval to the final version of the manuscript.\n\n\\section{Notes}\nThe authors declare no competing financial interest.\n\n\\section{ACKNOWLEDGMENT}\nWe acknowledge the Collaborative Innovation Center of Suzhou Nano Science \\& Technology and the Priority Academic Program Development of Jiangsu Higher Education Institutions. This work is supported by National Natural Science Foundation of China $(91545127,21622306,21771134$, 51722207, 51372131, 11574095); National Major State Basic Research Development Program of China (2017YFA0205002, 2014CB932600); Natural Science Foundation of Jiangsu Province (BK20150305). M.T. thanks the Army Research Office (W911NF-16-1-0019) and the National Science Foundation (2DARE-EFRI 1542707). W.A.H. acknowledges EPSRC funding for the $\\mathrm{UKCP}$ consortium $(\\mathrm{EP} / \\mathrm{K} 013610 / 1)$\n\n\\section{REFERENCES}\n(1) Castro Neto, A. H.; Guinea, F.; Peres, N. M. R.; Novoselov, K. S.; Geim, A. K. The electronic properties of graphene. Rev. Mod. Phys. 2009, 81, 109-162.\n\n(2) Lieb, E. H. Two theorems on the Hubbard model. Phys. Rev. Lett. 1989, 62, 1201-1204.\n\n(3) Yazyev, O. V.; Helm, L. Defect-induced magnetism in graphene. Phys. Rev. B 2007, 75 , 125408.\n\n(4) Fernández-Rossier, J.; Palacios, J. J. Magnetism in graphene nano-islands. Phys. Rev. Lett. $2007,99,177204$. (5) Palacios, J. J.; Fernández-Rossier, J.; Brey, L. Electronic structure of gated graphene and graphene ribbons. Phys. Rev. $B \\mathbf{2 0 0 8}, 77,195428$.\n\n(6) Yazyev, O. V. Emergence of magnetism in graphene materials and nanostructures. Rep. Prog. Phys. 2010, 73, 056501.\n\n(7) Pereira, V. M.; Guinea, F.; Lopes dos Santos, J. M. B.; Peres, N. M. R.; Castro Neto, A. H. Disorder Induced Localized States in Graphene. Phys. Rev. Lett. 2006, 96, 036801.\n\n(8) Gonzalez-Herrero, H.; Gomez-Rodriguez, J. M.; Mallet, P.; Moaied, M.; Palacios, J. J.; Salgado, C.; Ugeda, M. M.; Veuillen, J. Y.; Yndurain, F.; Brihuega, I.. Atomic-scale control of graphene magnetism by using hydrogen atoms. Science 2016, 352, 437-439.\n\n(9) Anderson, P. W. Localized Magnetic States in Metals. Phys. Rev. 1961, 124, 41-53.\n\n(10) Lehtinen, P. O.; Foster, A. S.; Ma, Y. C.; Krasheninnikov, A. V.; Nieminen, R. M. IrradiationInduced Magnetism in Graphite: A Density Functional Study. Phys. Rev. Lett. 2004, 93, 187202-. (11) Nair, R. R.; Sepioni, M.; I-Ling Tsai, I-Ling; Lehtinen, O.; Keinonen, J.; Krasheninnikov, A. V.; Thomson, T.; Geim, A. K.; Grigorieva, I. V. Spin-half paramagnetism in graphene induced by point defects. Nat. Phys. 2012, 8, 199-202.\n\n(12) Zhang, Y.; Li, S. Y.; Huang, H. Q.; Li, W. T.; Qiao, J. B.; Wang, W. X.; Yin, L. J.; Bai, K. K.; Duan, W. H.; He, L. Scanning Tunneling Microscopy of the $\\pi$ Magnetism of a Single Carbon Vacancy in Graphene. Phys. Rev. Lett. 2016, 117, 166801. (13) Tucek, J.; Hola, K.; Bourlinos, A. B.; Blonski, P.; Bakandritsos, A.; Ugolotti, J.; Dubecky, M.; Karlicky, F.; Ranc, V.; Cepe, K.; Otyepka, M.; Zboril, R. Room temperature organic magnets derived from $\\mathrm{sp}^{3}$ functionalized graphene. Nat. Commun. 2017, 8, 14525.\n\n(14) Esquinazi, P.; Spemann, D.; Hohne, R.; Setzer, A.; Han, K. H.; Butz, T. Induced Magnetic Ordering by Proton Irradiation in Graphite. Phys. Rev. Lett. 2003, 91, 227201.\n\n(15) Yazyev, O. V. Magnetism in Disordered Graphene and Irradiated Graphite. Phys. Rev. Lett. 2008, 101, 037203.\n\n(16) Cervenka, J.; Katsnelson, M. I.; Flipse, C. F. J. Room-temperature ferromagnetism in graphite driven by two-dimensional networks of point defects. Nat. Phys. 2009, 5, 840-844.\n\n(17) Ohldag, H.; Tyliszczak, T.; Hohne, R.; Spemann, D.; Esquinazi, P.; Ungureanu, M.; Butz, T. $\\pi$-Electron Ferromagnetism in Metal-Free Carbon Probed by Soft X-Ray Dichroism. Phys. Rev. Lett. 2007, 98, 187204.\n\n(18) Xia, H. H.; Li, W. F.; Song, Y.; Yang, X. M.; Liu, X. D.; Zhao, M. W.; Xia, Y. Y.; Song, C.; Wang, T. W.; Zhu, D. Z.; Gong, J. L.; Zhu, Z. Y. Tunable Magnetism in Carbon - Ion - Implanted Highly Oriented Pyrolytic Graphite. Adv. Mater. 2008, 20, 4679-4683.\n\n(19) Lv, R. T.; Chen, G. G.; Li, Q.; McCreary, A.; Botello-Mendez, A.; Morozov, S. V.; Liang, L. B.; Declerck, X.; Perea-Lopez, N.; Culleni, D. A.; Feng, S. M.; Elias, A. L.; Cruz-Silva, R.; Fujisawa, K.; Endo, M.; Kang, F. Y.; Charlier, J. C.; Meunier, V.; Pan, M. H.; Harutyunyan, A. R.; Novoselov, K. S.; Terrones, M. Ultrasensitive gas detection of large-area boron-doped graphene. Proc. Natl. Acad. Sci. 2015, 112, 14527-14532. (20) Shirasaki, T.; Derre, A.; Menetrier, M.; Tressaud, A.; Flandrois, S. Synthesis and characterization of boron-substituted carbons. Carbon 2000, 38, 1461-1467.\n\n(21) Kim, Y. A.; Fujisawa, K.; Muramatsu, H.; Hayashi, T.; Endo, M.; Fujimori, T.; Kaneko, K.; Terrones, M.; Behrends, J.; Eckmann, A.; Casiraghi, C.; Novoselov, K. S.; Saito, R.; Dresselhaus, M. S. Raman Spectroscopy of Boron-Doped Single-Layer Graphene. ACS Nano 2012, 6, 62936300\n\n(22) Sheng, Z. H.; Gao, H. L.; Bao, W. J.; Wang, F. B.; Xia, X. H. J. Synthesis of boron doped graphene for oxygen reduction reaction in fuel cells. Mater. Chem. 2012, 22, 390-395.\n\n(23) Zhao, L. Y.; He, R.; Rim, K. T.; Schiros, T.; Kim, K. S.; Zhou, H.; Gutierrez, C.; Chockalingam, S. P.; Arguello, C. J.; Palova, L.; Nordlund, D.; Hybertsen, M. S.; Reichman, D. R.; Heinz, T. F.; Kim, P.; Pinczuk, A.; Flynn, G. W.; Pasupathy, A. N. Visualizing Individual Nitrogen Dopants in Monolayer Graphene. Science 2011, 333, 999-1003.\n\n(24) Lv, R. T.; Li, Q.; Botello-Mendez, A. R.; Hayashi, T.; Wang, B.; Berkdemir, A.; Hao, Q. Z.; Elias, A. L.; Cruz-Silva, R.; Gutierrez, H. R.; Kim, Y. A.; Muramatsu, H.; Zhu, J.; Endo, M.; Terrones, H.; Charlier, J. C.; Pan, M. H.; Terrones, M. Nitrogen-doped graphene: beyond single substitution and enhanced molecular sensing. Sci. Rep. 2012, 2, 586.\n\n(25) Deng, D. H.; Pan, X. L.; Yu, L. A.; Cui, Y.; Jiang, Y. P.; Qi, J.; Li, W. X. Fu, Q.; Ma, X. C.; Xue, Q. K.; Sun, G. Q.; Bao, X. H. Toward N-Doped Graphene via Solvothermal Synthesis. Chem. Mater. 2011, 23, 1188-1193. (26) Wang, H. B.; Maiyalagan, T.; Wang, X. Review on Recent Progress in Nitrogen-Doped Graphene: Synthesis, Characterization, and Its Potential Applications. ACS Catal. 2012, 2, 781794\n\n(27) Zhao, L. Y.; Levendorf, M.; Goncher, S.; Schiros, T.; Palova, L.; Zabet-Khosousi, A.; Rim, K. T.; Gutierrez, C.; Nordlund, D.; Jaye, C.; Hybertsen, M.; Reichman, D. R.; Flynn, G. W.; Park, J.; Pasupathy, A. N. Local Atomic and Electronic Structure of Boron Chemical Doping in Monolayer Graphene. Nano Lett. 2013, 13, 4659-4665.\n\n(28) Endo, M.; Hayashi, T.; Hong, S. H.; Enoki, T.; Dresselhaus, M. S. Scanning tunneling microscope study of boron-doped highly oriented pyrolytic graphite. J. Appl. Phys. 2001, 90 , $5670-5674$.\n\n(29) Kawai, S.; Saito, S.; Osumi, S.; Yamaguchi, S.; Foster, A. S.; Spijker, P.; Meyer, E. Atomically controlled substitutional boron-doping of graphene nanoribbons. Nat. Commun. 2015, 6, 8098.\n\n(30) Ugeda, M. M.; Brihuega, I.; Guinea, F.; Gómez-Rodríguez, J. M. Missing Atom as a Source of Carbon Magnetism. Phys. Rev. Lett. 2010, 104, 096804.\n\n(31) Uchoa, B.; Kotov, V. N.; Peres, N. M. R.; Castro Neto, A. H. Localized Magnetic States in Graphene. Phys. Rev. Lett. 2008, 101, 026805.\n\n(32) Heller, E. J.; Crommie, M. F.; Lutz, C. P.; Eigler, D. M. Scattering and absorption of surface electron waves in quantum corrals. Nature 1994, 369, 464-466.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_54050a76c33463a8157fg-21_426_1506_489_1019}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_54050a76c33463a8157fg-21_455_927_1061_1628}\n\\end{center}\n\nSpin-down\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_54050a76c33463a8157fg-21_1048_1435_1086_1625}\n\\end{center}\n\nSupporting Information for\n\n\\section*{Locally Induced Spin States on Graphene by Chemical Attachment of Boron Atoms }\n${ }^{2}$ Key Laboratory of Advanced Materials, School of Materials Science and Engineering, Tsinghua University, Beijing 100084, China.\n\n${ }^{3}$ Department of Chemistry, Department of Materials Science and Engineering and Center for 2-Dimensional and Layered Materials, The Pennsylvania State University, University Park, PA 16802, USA.\n\n${ }^{4}$ Institute of Carbon Science and Technology, Shinshu University, 4-17-1 Wakasato, Nagano, 380-8553, Japan.\n\n${ }^{5}$ Department of Materials Science and Engineering \\& Chemical Engineering, Carlos III University of Madrid, Avenida Universidad 30, 28911 Leganés, Madrid, Spain. IMDEA Materials Institute, Eric Kandel 2, Getafe, Madrid 28005, Spain.\n\n${ }^{6}$ School of Natural and Environmental Sciences, Newcastle University, Newcastle upon Tyne NE1 7RU, United Kingdom. ${ }^{7}$ School of Physics, Huazhong University of Science and Technology, Wuhan 430074 , China.\n\n\\section{1, Methods}\nSynthesis: The synthesis of large-area BG sheets was achieved using a bubbler-assisted chemical vapor deposition (BA-CVD) system operating at ambient pressure. A typical run for BG synthesis can be described as follows. Firstly, copper foils $(99.8 \\%$ purity, $25 \\mu \\mathrm{m}$ thick; Alfa Aesar) were cleaned in a diluted $\\mathrm{HCl}$ aqueous solution ( $\\mathrm{HCl}: \\mathrm{H}_{2} \\mathrm{O}=1: 3$ vol/vol), dried with $\\mathrm{N}_{2}$, and then loaded into the quartz tubing reactor. After degassing, the reactor was heated up to $1,000{ }^{\\circ} \\mathrm{C}$ stepwise and kept constant for $10 \\mathrm{~min}$ to anneal the copper foils. Then, a TEB/hexane solution was bubbled with $1 \\mathrm{sccm}$ Ar into the reactor at $1,000{ }^{\\circ} \\mathrm{C}$ for $5 \\mathrm{~min}$. Finally, the reactor was cooled down to room temperature in an Ar flow. The copper foils with BG sheets were taken out of the reactor for further characterizations.\n\nTransfer: As-grown BG sheets were on copper foils. In order to carry out STM/STS characterizations, they were transferred onto other substrates (e.g. silicon wafers). For large-area transfer onto silicon wafers, poly(methyl methacrylate) (PMMA) was used as a protective layer. Typically, the top surface of BG sheets was firstly coated with PMMA by spin coating at $4000 \\mathrm{rpm}$ for $60 \\mathrm{~s}$. Then, $\\mathrm{Cu}$ foil underneath the BG sheet was etched away in copper etchant $\\left(\\mathrm{FeCl}_{3} / \\mathrm{HCl}(0.5 \\mathrm{M} / 0.5 \\mathrm{M})\\right.$ aqueous solution in present work) at $50^{\\circ} \\mathrm{C}$. Next, PMMA/BG sheets were rinsed several times in deionized water to remove the $\\mathrm{FeCl}_{3}$ residues. Afterwards, a piece of $\\mathrm{SiO}_{2} / \\mathrm{Si}$ wafer was used to fish the floating PMMA/BG sheets from deionized water. Finally, PMMA was removed from the top surface of $\\mathrm{BG}$ sheets by alternative rinse in acetone $(10 \\mathrm{~s})$ and isopropanol (10 s) solvents for $2 \\mathrm{~min}$. A high-quality, large-area BG sheet could thus be obtained on $\\mathrm{SiO}_{2} / \\mathrm{Si}$ wafer after blowing solvents away with compressed $\\mathrm{N}_{2}$.\n\nSTM: STM measurements were conducted with a home-built variable temperature STM in an ultrahigh vacuum $(\\mathrm{UHV})$ system with a base pressure better than $1 \\times 10^{-10}$ mbar. The $\\mathrm{BG} / \\mathrm{SiO}_{2} / \\mathrm{Si}$ samples were loaded into the low-temperature $\\mathrm{STM}$. The samples were degassed in $\\mathrm{UHV}$ at $200^{\\circ} \\mathrm{C}$ for one hour before performing the $\\mathrm{STM} / \\mathrm{S}$ measurements. In this study, all the $\\mathrm{STM} / \\mathrm{S}$ data were acquired at $77 \\mathrm{~K}$ or $4.2 \\mathrm{~K}$ if not otherwise stated. A commercial Pt-Ir tip was prepared by gentle field emission at a clean $\\mathrm{Au}(111)$ sample. The bias voltage was applied on the sample during the STM observations. The STM images were analyzed using $\\mathrm{WSxM}^{1}$.\n\nCalculation: The first-principles DFT calculations were carried out with the Vienna Ab Initio Simulation Package (VASP) ${ }^{2}$. The core and valence electronic interactions were described with the frozen-core projector augmented-wave (PAW) potentials ${ }^{3}$. The Kohn-Sham single electron states were expanded in plane waves with a kinetic energy of up to $400 \\mathrm{eV}$. The exchange correlation energy was calculated with the PerdewBurke-Ernzerhof (PBE) of generalized gradient approximation (GGA $)^{4}$. The tolerance of $10^{-4} \\mathrm{eV}$ was chosen for energy convergence of electronic calculations. The graphene was modelled with a $(9 \\times 6)$ unit cell. A large vacuum of $20 \\AA$ along the direction normal to the surface was employed to separate surfaces from their periodic images. The integration over the 2D Brillouin zone is replaced by a summation over a MonkhorstPack (MP) grid of $6 \\times 6$ k-points. STM images were simulated using the TersoffHamman approach implemented in the bSKAN code ${ }^{5}$.\n\nTo simulate the spin polarized DOS variation in Figure $4 \\mathrm{~d}$, we first build a model with three boron atoms, located at three corners of a triangle. Then by measuring the distances between each Boron atom in the experiment, we created a corresponding graphene lattice in between. After that, we used the oscillation period and the decay length obtained from Figure 3, to calculate the induced spin-distribution maps for these three boron atoms, considering the interaction between the multiple spins.\n\n\\section{2, Various kinds of substitutional dopants and the calculated spin-DOS}\nFigure $1 \\mathrm{~d}$ shows that substitutionally doped boron atoms would not lead to net spins. To further confirm this, we calculated the spin-DOS of three alternative conditions: 1 , Two boron atoms dope substitutionally at adjacent positions within same sublattice, referred to as $2 \\mathrm{~B}_{\\mathrm{AA}}$. 2, Two boron atoms occupy two opposite positions belonging to different sublattices, referred to as $2 \\mathrm{~B}_{\\text {para. }} 3$, Single nitrogen substitutionally doped nitrogen atom, referred to as 1N. All of them have the spin-up and spin-down components of the DOS fully compensated, giving rise to an induced magnetic moment of $0 \\mu_{\\mathrm{B}}$.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_54050a76c33463a8157fg-26_861_2283_333_1715}\n\nFigure S1. STM image, structural model, STM simulation and spin-DOS of four kinds of dopants: (a) Two boron atoms dope substitutionally at adjacent positions within the same sublattice. (b) Two boron atoms occupy two opposite positions belonging to different sublattices. c, Single nitrogen substitutionally doped nitrogen atom.\n\n\\section{$3, d I / d V$ spectra acquired at different positions.}\nFigure $\\mathrm{S} 2$ gives various spectra with different Dirac point energy $E_{\\mathrm{d}}$ over the studied surface. Note the peak splitting retains unaltered within the error bar.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_54050a76c33463a8157fg-27_650_1698_547_1505}\n\nFigure S2. $\\mathrm{dI} / \\mathrm{dV}$ spectra acquired at different locations with different Dirac point energies\n\n4, Calculated spin-polarized DOS with wider energy window.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_54050a76c33463a8157fg-28_267_1001_498_1558}\n\\end{center}\n\nFigure S3. A wider energy window spin-polarized DOS of Figure $2 \\mathrm{e}$.\n\n\\section{5, The calculated Spin-DOS of the carbon vacancy}\nTo check the validity of our calculations, we calculated the DOS of the well studied vacancy in graphene sheets. As shown in Fig. S2b, a prominent DOS peak for the spinup component and the weak DOS peak for spin-down component appears near EF, giving a total injected magnetic moment of $1.2 \\mu_{\\mathrm{B}}$. The position of the magnetic moment near the graphene vacancy agrees well with the experimental observations ${ }^{6-9}$.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_54050a76c33463a8157fg-29_256_1284_316_1626}\n\nFigure S4. Optimized structural model (a), spin-DOS calculation (b) and the spin distribution (c) for single vacancy of graphene.\n\n\\section{6, The distribution of spin-up state along the zigzag direction.}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_54050a76c33463a8157fg-29_1723_2417_468_1606}\n\\end{center}\n\nFigure S5. Propagation of the spin-up state along the zigzag direction. a, a series of $d I / d V$ spectra taken along the zigzag direction of graphene across a single boron adsorbate. $\\mathbf{b}$, the peak intensity of the spin-up state is plotted with respect to the tip displacements. An oscillating and decaying dependence is clearly shown. The periodicity is measured to be around $2.8 \\AA$. However, due to thermal drift, the real periodicity is $2.56 \\AA$. This is clear evidence that the spin state is only propagating in one set of sublattices.\n\n\\section{REFERENCES}\n(1) Horcas, I.; Fernandez, R.; Gomez-Rodriguez, J. M.; Colchero, J.; Gomez-Herrero, J.; Baro, A. M. WSXM: A software for scanning probe microscopy and a tool for nanotechnology. Rev. Sci. Instru. 2007, 78, 013705.\n\n(2) Kresse, G.; Furthmuller, J. Efficient iterative schemes for ab initio total-energy calculations using a plane-wave basis set. Phys. Rev. B 1996, 54, 11169-11186.\n\n(3) Kresse, G.; Joubert, D. From ultrasoft pseudopotentials to the projector augmentedwave method. Phys. Rev. B 1999, 59, 1758-1775.\n\n(4) Perdew, J. P.; Burke, K.; Ernzerhof, M. Generalized Gradient Approximation Made Simple. Phys. Rev. Lett. 1996, 77, 3865-3868.\n\n(5) Hofer, W. A.; Foster, A. S.; Shluger, A. L. Theories of scanning probe microscopes at the atomic scale. Rev. Mod. Phys. 2003, 75, 1287-1331.\n\n(6) Palacios, J. J.; Fernández-Rossier, J.; Brey, L. Vacancy-induced magnetism in graphene and graphene ribbons. Phys. Rev. B 2008, 77, 195428.\n\n(7) Yazyev, O. V.; Helm, L. Defect-induced magnetism in graphene. Phys. Rev. B 2007, $75,125408$.\n\n(8) Lehtinen, P. O.; Foster, A. S.; Ma, Y. C.; Krasheninnikov, A. V.; Nieminen, R. M. Irradiation-Induced Magnetism in Graphite: A Density Functional Study. Phys. Rev. Lett. 2004, 93, 187202.\n\n(9) Ugeda, M. M.; Brihuega, I.; Guinea, F.; Gómez-Rodríguez, J. M. Missing Atom as a Source of Carbon Magnetism. Phys. Rev. Lett. 2010, 104, 096804.\n\n\n\\end{document}", "record_id": "2023_09_22_54050a76c33463a8157fg"}