{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{Tailoring Bandgap of Perovskite $\\mathrm{BaTiO}_{3}$ by Transition Metals Co-Doping for Visible-Light Photoelectrical Applications: A First-Principles Study }\n\n\n\\author{Fan Yang ${ }^{1,2}$, Liang Yang ${ }^{2}$, Changzhi Ai ${ }^{1,2}$, Pengcheng Xie $^{1,2}$, Shiwei Lin ${ }^{1,2, *}$,\\\\\nCai-Zhuang Wang ${ }^{3}$ and Xihong Lu $^{4}$\\\\\n1 State Key Laboratory of Marine Resource Utilization in South China Sea, Hainan University,\\\\\nHaikou 570228, China; 18789276621@163.com (F.Y.); changzhiai@outlook.com (C.A.);\\\\\njxxpc199406@163.com (P.X.)\\\\\n2 College of Materials and Chemical Engineering, Hainan University, Haikou 570228, China;\\\\\nyl5923@sina.com.cn\\\\\n3 Ames Laboratory, U. S. Department of Energy, and Department of Physics and Astronomy,\\\\\nIowa State University, Ames, IA 50011, USA; wangcz@ameslab.gov\\\\\n4 School of Chemistry, Sun Yat-Sen University, Guangzhou 510275, China; Luxh6@mail.sysu.edu.cn\\\\\n* Correspondence: linsw@hainu.edu.cn; Tel.: +86-898-662-76115}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nArticle\n\nReceived: 17 May 2018; Accepted: 19 June 2018; Published: 21 June 2018\n\ncheck for updates\n\n\\begin{abstract}\nThe physical and chemical properties of V-M ${ }^{\\prime \\prime}$ and $\\mathrm{Nb}-\\mathrm{M}^{\\prime \\prime}\\left(\\mathrm{M}^{\\prime \\prime}\\right.$ is $3 \\mathrm{~d}$ or $4 \\mathrm{~d}$ transition metal) co-doped $\\mathrm{BaTiO}_{3}$ were studied by first-principles calculation based on density functional theory. Our calculation results show that V-M\" co-doping is more favorable than $\\mathrm{Nb}-\\mathrm{M}^{\\prime \\prime}$ co-doping in terms of narrowing the bandgap and increasing the visible-light absorption. In pure $\\mathrm{BaTiO}_{3}$, the bandgap depends on the energy levels of the Ti $3 \\mathrm{~d}$ and $\\mathrm{O} 2 \\mathrm{p}$ states. The appropriate co-doping can effectively manipulate the bandgap by introducing new energy levels interacting with those of the pure $\\mathrm{BaTiO}_{3}$. The optimal co-doping effect comes from the V-Cr co-doping system, which not only has smaller impurity formation energy, but also significantly reduces the bandgap. Detailed analysis of the density of states, band structure, and charge-density distribution in the doping systems demonstrates the synergistic effect induced by the $\\mathrm{V}$ and $\\mathrm{Cr}$ co-doping. The results can provide not only useful insights into the understanding of the bandgap engineering by element doping, but also beneficial guidance to the experimental study of $\\mathrm{BaTiO}_{3}$ for visible-light photoelectrical applications.\n\\end{abstract}\n\nKeywords: $\\mathrm{BaTiO}_{3}$; co-doping; first-principles; photoelectrical\n\n\\section{Introduction}\nPerovskites have been extensively studied because of their unique structure and properties. Over the past decade, organic-inorganic hybrid perovskite iodides have received considerable attention due to their high efficiency in the photovoltaic process [1]. However, stability is a major issue, hindering a large-scale commercialization of the perovskite for photovoltaic applications [2-5]. To overcome this problem, inorganic perovskites, especially ferroelectric oxide perovskites, have attracted much current interest [6]. For example, $\\mathrm{Bi}_{2} \\mathrm{FeCrO}_{6}$ as a double perovskite material with its bandgap tunable by bandgap engineering has been reported [7]. $\\left[\\mathrm{KNbO}_{3}\\right]_{1-\\mathrm{x}}\\left[\\mathrm{BaNi}_{1 / 2} \\mathrm{O}_{3-\\delta}\\right]_{\\mathrm{X}}$ has a bandgap adjustable in the range of 1.1-3.8 eV [8]. Other perovskites, such as $\\mathrm{BaTiO}_{3}$ [9-11], $\\mathrm{BiFeO}_{3}[12-15]$, $\\mathrm{LiNbO}_{3}$ [16-19] and $\\mathrm{PbTiO}_{3}$ [20-22] have also been extensively studied.\n\nInorganic oxide perovskites $\\mathrm{ABO}_{3}$ have been investigated for photovoltaic applications due to their tunable bandgap [23], wide range of possibilities for switchable component [24], low cost [8], and high chemical stability. Recently, the potential of this class of materials for photovoltaic applications has been demonstrated by several theoretical and experimental studies. However, it is also known that these materials usually have limited light absorption due to the wide bandgaps and poor electrical conductivity [25]. Currently, the most common method used to overcome these problems is doping with either metal or non-metal elements. In terms of the feasibility and effectiveness, element doping is one of the most important strategies to regulate the bandgap of oxide perovskites at the atomic scale structure modification.\n\nIn one of our previous papers, we have systematically investigated the effects of single element doping with various metals on the performance of $\\mathrm{BaTiO}_{3}$ [26]. We showed that impurity levels could be introduced in the bandgap by the metal doping. These impurity levels can act as recombination centers for electrons and holes, which are harmful for the performance of the materials for photovoltaic applications. In general, wide bandgap semiconductors with doping may exhibit some unwanted properties or behaviors [27]: (i) desirable impurities may have limited solubility; (ii) for those impurities that have sufficient solubility, they may form deep levels that are not effective for carrier transitions; and (iii) spontaneous formation of compensating defects. In the literature, it has been shown that some of these unwanted features could be avoided by co-doping two different types of elements [28]. Ishii et al. [29] reported that $\\mathrm{Cr}^{3+}$ and $\\mathrm{Ta}^{5+}$ co-doped $\\mathrm{SrTiO}_{3}$ can improve photocatalytic activities. Kako et al. [30] reported a visible-light sensitive $\\mathrm{TiO}_{2}$ with $\\mathrm{Fe}$-Ta co-doping $\\left(\\left(\\mathrm{Fe}, \\mathrm{Ta}_{\\mathrm{x}} \\mathrm{Ti}_{1-\\mathrm{x}} \\mathrm{O}_{2}, 0 \\leq \\mathrm{x} \\leq 1\\right)\\right.$ that has a higher photocatalytic activity than the $\\mathrm{Fe}^{3+}$ doped $\\mathrm{TiO}_{2}$. Masahiro et al. [31] also reported that $\\mathrm{N}$ and $\\mathrm{La}$ co-doped $\\mathrm{SrTiO}_{3}$ had better visible-light absorption $(\\geq 400 \\mathrm{~nm})$ compared with the pure $\\mathrm{SrTiO}_{3}$.\n\nIn this paper, we screened out the suitable co-doped elements by studying the defect formation energy and electronic properties of the transition metals co-doping on the Ti-site in $\\mathrm{BaTiO}_{3}$. In comparison to the results of single doping, we evaluated the synergistic effects between the two co-doping elements and tried to use co-doping to overcome the shortcomings of single metal doping and avoid the formation of the deep levels in the bandgap, so as to promote the separation of photogenerated electron-hole pairs and expand the visible-light absorption range. Such information can provide beneficial guidance for the experimental regulation of the $\\mathrm{BaTiO}_{3}$ bandgap at atomic scale for visible-light utilization.\n\n\\section{Calculation Details}\nIn order to avoid the strong interaction between the co-doping elements and obtain a relatively reasonable doping concentration, the co-doping system was modelled using a $2 \\times 2 \\times 3$ (60 atoms) supercell of the cubic $\\mathrm{BaTiO}_{3}$ unit cell, as shown in Figure 1a. The dopant concentration was $3.3 \\%$. Two Ti atoms are substituted by two different transition metals $\\left(\\mathrm{M}^{\\prime}\\right.$ and $\\mathrm{M}^{\\prime \\prime}$ ) and the chemical formula can be expressed as $\\mathrm{Ba}_{8}\\left(\\mathrm{M}^{\\prime} \\mathrm{M}^{\\prime \\prime}\\right) \\mathrm{Ti}_{6} \\mathrm{O}_{24}$, where $\\mathrm{M}^{\\prime}$ refers to $\\mathrm{V}$ or $\\mathrm{Nb}$, while $\\mathrm{M}^{\\prime \\prime}$ includes $3 d$ transition metals (Cr, Mn, Fe, Co and Ni) and 4d transition metals (Mo, Tc, Ru and Pd). There are three kinds of possible substitution. These doping situations are schematically shown in Figure $1 \\mathrm{~b}-\\mathrm{d}$ and the lowest energy situation is described in Figure $1 \\mathrm{~b}$. The pure $\\mathrm{BaTiO}_{3}$ system was modelled using a $1 \\times 1 \\times 1$ supercell. To keep the doping concentration similar between the single doping and co-doping systems, the single doping system was modelled using $2 \\times 2 \\times 2$ supercell. The atomic percentage of the impurity was $2.5 \\%$.\n\nThe spin-polarized first-principles density functional theory (DFT) calculations were performed using the Vienna ab initio simulation package (VASP, Version 5.2, Materials Design Inc., Vienna, Austria) [32-34]. We used the generalized gradient approximation (GGA) [35] with the PerdewBurke-Ernzerhof formulation (PBE) [36] to treat the exchange and correlation energy. The plane-wave energy cutoff was set as $500 \\mathrm{eV}$ within the projector-augmented-wave method (PAW). The Monkhorst-Pack scheme K-points mesh was set as $4 \\times 4 \\times 2$ [37]. The structure optimization was performed until the residual force was less than $0.01 \\mathrm{eV} / \\AA$ on every atom [38]. In the process of calculating the band structure, the special points are $X \\rightarrow R \\rightarrow M \\rightarrow \\Gamma \\rightarrow R(1 \\times 1 \\times 1$ and $2 \\times 2 \\times 2$ supercell) and $\\Gamma \\rightarrow \\mathrm{F} \\rightarrow \\mathrm{Q} \\rightarrow \\mathrm{Z} \\rightarrow \\Gamma(2 \\times 2 \\times 3$ supercell). The special points coordinates are shown in Table S1.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_63a752c620bbc784200cg-03_301_1469_548_1510}\n\nFigure 1. Models for the calculation. (a) the structure of $2 \\times 2 \\times 3$ supercell model of $\\mathrm{BaTiO}_{3} ;$ (b-d) configurations for transition metals co-doping in $\\mathrm{BaTiO}_{3}$. The purple and green spheres indicate the transition metal dopants. The pink, blue and red spheres indicate $\\mathrm{Ba}$, Ti and $\\mathrm{O}$ atoms, respectively.\n\n\\section{Results and Discussion}\n\\subsection{Structure}\nThe calculated lattice parameter of pure $\\mathrm{BaTiO}_{3}$ is $4.03 \\AA$, which is in good agreement with the experimental value of $4.0 \\AA$ (within an error of $0.07 \\%$ ) [39]. The lattice parameter of the transition metal co-doped $\\mathrm{BaTiO}_{3}$ was also obtained after geometric structure optimization. The volume of the co-doped structure is not only dependent on the radii of the doped elements, but related to the interaction between atoms. As shown in Figure S1, after co-doping, the lattice constants a and b decrease slightly (except $\\mathrm{V}-\\mathrm{Ni}$ and $\\mathrm{Nb}-\\mathrm{Ni}$ ) while $\\mathrm{c}$ increases and oscillates. It indicates that the crystal cell is slightly enlarged in the c direction. As shown in Tables S2 and S3, the interatomic bond length varies due to the lattice distortion after co-doping. This means that the center of the positive charge after metal co-doping into the octahedral does not coincide with the center of the negative charge, resulting in the internal dipole moment. Since different elements co-doping causes a different interaction force, the deformation degree of the octahedral is different and the lattice constant accordingly changes. In this study, we chose $\\mathrm{V}$ or $\\mathrm{Nb}$ as one of the co-doping elements. Namely, the co-doping systems can be divided into two groups: V-M\" $\\mathrm{M}^{\\prime \\prime}$ and $\\mathrm{Nb}-\\mathrm{M}^{\\prime \\prime}$. On one hand, $\\mathrm{V}$ and $\\mathrm{Nb}$ are typical $3 \\mathrm{~d}$ and $4 \\mathrm{~d}$ transition metals, respectively. On the other hand, the locations of $\\mathrm{V}$ and $\\mathrm{Nb}$ in the periodic table of elements are close to Ti, and their atomic radii are similar. Thus, it is more suitable for $\\mathrm{V}$ and $\\mathrm{Nb}$ to replace Ti. In addition, the radius of $\\mathrm{V}$ is less than $\\mathrm{Nb}$, so the volume of the $\\mathrm{V}-\\mathrm{M}^{\\prime \\prime}$ co-doping system is smaller than that of the $\\mathrm{Nb}^{-\\mathrm{M}^{\\prime \\prime}}$ co-doping system. Also, the volume of the $3 \\mathrm{~d}$ transition metals co-doping systems is usually smaller than that of the $4 \\mathrm{~d}$ transition metals co-doping systems.\n\n\\subsection{Defect Formation Energy}\nThe defect formation energy $\\left(E_{F o r m}\\right)$ of transition metals co-doping $\\mathrm{BaTiO}_{3}$ can be calculated according to the formulas:\n\n\\[\n\\begin{gathered}\nE_{\\text {Form }}=E_{\\text {co-doped }}-E_{\\text {pure }}-\\mu_{M \\prime}-\\mu_{M^{\\prime \\prime}}+2 \\mu_{T i} \\\\\n\\mu_{M^{\\prime} / M^{\\prime \\prime}}=\\left(\\mu_{\\left(_{M^{\\prime} / M^{\\prime \\prime}}\\right)_{\\mathrm{m}} O_{n}}-n \\mu_{O}\\right) / m \\\\\nE_{T_{T O_{2}}}=\\mu_{T i}+2 \\mu_{O}\n\\end{gathered}\n\\]\n\nwhere $E_{c o \\text {-doped }}$ is the energy of the co-doped $\\mathrm{BaTiO}_{3}$ system, $E_{\\text {pure }}$ is the total energy of pure $\\mathrm{BaTiO}_{3}$ supercell, $\\mu_{M^{\\prime}}$ and $\\mu_{M^{\\prime \\prime}}$ are the chemical potentials of the co-doping metal elements, and $\\mu_{T i}$ is the chemical potential of Ti. The $\\mu_{M^{\\prime}}$ and $\\mu_{M^{\\prime \\prime}}$ are defined and calculated from Equation (2), and the $\\mu_{T i}$ is defined by Equation (3). The $\\mu_{\\left(M^{\\prime} / M^{\\prime \\prime}\\right)_{m} O_{n}}$ is the energy of the most stable oxide of the doping metal atom. $\\mu_{\\mathrm{O}}$ can be calculated from the ground state energy of $\\mathrm{O}_{2}$. Under the equilibrium condition, the concentrations of point defects are controlled by their formation energies, which rely on the chemical potentials of impurity atoms and host [6]. Thus, the smaller the defect formation energy value is, the more stable the co-doped $\\mathrm{BaTiO}_{3}$ is. The defect formation energies of all co-doped $\\mathrm{BaTiO}_{3}$ are shown in Figure 2. In comparison, the defect formation energies of $\\mathrm{Nb}-\\mathrm{M}^{\\prime \\prime}$ co-doping are energetically more favorable than $\\mathrm{V}-\\mathrm{M}^{\\prime \\prime}$ co-doping. It is difficult to find the tendency of $E_{F o r m}$ with the increase of the atomic number of $\\mathrm{M}^{\\prime \\prime}$. The formation energies of $\\mathrm{V}-\\mathrm{M}^{\\prime \\prime}(\\mathrm{Cr}$, $\\mathrm{Fe}$ and $\\mathrm{Ni})$ and $\\mathrm{Nb}-\\mathrm{M}^{\\prime \\prime}$ (Cr, $\\mathrm{Mn}$, $\\mathrm{Fe}, \\mathrm{Co}, \\mathrm{Ni}, \\mathrm{Mo}, \\mathrm{Tc}, \\mathrm{Ru}$, and $\\mathrm{Pd}$ ) are negative, which means that the co-doping system is energetically favorable and could be easily prepared in the experiment. From Tables S2 and S3, the average bond length of $\\mathrm{Nb}-\\mathrm{O}$ appears identical with that of Ti-O. Therefore, the influence of $\\mathrm{Nb}$ doping into the structure of $\\mathrm{BaTiO}_{3}$ is smaller, and thus the formation energy is smaller and the structure is more stable. The deformation of the octahedral in the $\\mathrm{V}-\\mathrm{M}^{\\prime \\prime}$ co-doping system is thus more serious, corresponding to the stronger internal stress and unstable structure.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_63a752c620bbc784200cg-04_1582_2072_356_1712}\n\nFigure 2. The defect formation energies of transition metals co-doped cubic $\\mathrm{BaTiO}_{3}$. (a) $\\mathrm{V}$ or $\\mathrm{Nb}$ with 3d metal $\\mathrm{M}^{\\prime \\prime}$ (Cr, Mn, Fe, Co, and $\\mathrm{Ni}$ ); (b) $\\mathrm{V}$ or $\\mathrm{Nb}$ with 4 d metal $\\mathrm{M}^{\\prime \\prime}$ (Mo, Tc, Ru, and Pd).\n\n\\subsection{Electronic Properties}\nFigure 3 shows the calculated band structure and density of states (DOS) of pure cubic $\\mathrm{BaTiO}_{3}$. The band structure shows an indirect bandgap of $1.56 \\mathrm{eV}$, which is smaller than the experimental value $(3.2 \\mathrm{eV})$ as the small calculated bandgap is a systematic error in the DFT calculation [40]. However, the DFT calculation can still give a reliable description of the result on the trend of bandgap variation due to doping. The valence band maximum (VBM) is mainly derived from the Ti $3 \\mathrm{~d}$ and $\\mathrm{O} 2 \\mathrm{p}$ states [41]. The conduction band minimum (CBM) is derived from the Ti 3 d states. Ba does not contribute to the VBM and CBM, although it does provide electrons to balance the system charge [42]. Therefore, the bandgap value of $\\mathrm{BaTiO}_{3}$ depends on the relative energy positions of the Ti 3d and $\\mathrm{O} 2 \\mathrm{p}$ states. However, as a light absorbing material, the bandgap of $\\mathrm{BaTiO}_{3}$ is too large to efficiently absorb the visible light.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_63a752c620bbc784200cg-05_440_1256_478_1578}\n\\end{center}\n\nFigure 3. Band structure, total and partial density of states of pure cubic $\\mathrm{BaTiO}_{3}$.\n\nIn order to clarify the co-doping effects with different transition metals on the electronic properties of the cubic $\\mathrm{BaTiO}_{3}$, we systematically and carefully compared the band structures and density of states of the different co-doping systems. The co-doping systems can be divided into two types: $\\mathrm{BVM}^{\\prime \\prime} \\mathrm{TO}$ and BNbM $\\mathrm{BNO}^{\\prime \\prime} \\mathrm{M}^{\\prime \\prime}$ includes $3 \\mathrm{~d}$ transition metals (Cr, Mn, Fe, Co, and Ni) and $4 \\mathrm{~d}$ transition metals (Mo, Tc, Ru, and Pd). Accordingly, the classified discussion is conducted in detail as follows. Although there exist the spin channels, the magnetic properties of the system have not been discussed in the article. The main reason is that this article mainly focuses on the change of the bandgap in the co-doped system and the effect on the absorption of light.\n\n\\subsection{1. $\\mathrm{V}$ and $3 \\mathrm{~d}^{\\prime \\prime}$ Co-Doping (Cr, Mn, Fe, Co and Ni)}\nFigure 4 reveals that the bandgap of $\\mathrm{BaTiO}_{3}$ after co-doping is narrowed due to the introduction of the impurity energy levels (IELs). It is noticed that $\\mathrm{BaTiO}_{3}$, after $\\mathrm{V}^{\\prime} \\mathrm{M}^{\\prime \\prime}$ co-doping, exhibits ferromagnetism, except for V-Co co-doping. The ferromagnetism caused by transition metal doping is also found in other doped semiconductors, such as V-Cr co-doped ZnO [43], Mn doped GaN [44], and Mn doped AIN [45]. The majority spin (up-spin) DOS has a smaller bandgap than the minority spin (down-spin) DOS. The bandgaps on both spin states are formed by the interaction of the V $3 d$ or $\\mathrm{M}^{\\prime \\prime} 3$ d states with the $\\mathrm{O} 2 \\mathrm{p}$ states. The electronic structure of BaTiO ${ }_{3}$ is significantly modified by the dopants. The V 3d states are located at the bottom of the conduction band (CB), while the $3 d$ states of $\\mathrm{Cr}, \\mathrm{Mn}, \\mathrm{Fe}, \\mathrm{Co}$, and Ni show up at the top of valence band (VB) (V-Cr, V-Mn and V-Fe co-doping) or in the middle of the bandgap (V-Co and V-Ni co-doping). Thus, the energy states from the dopants form new CBM, VBM, or a transition state in the bandgap, leading to a relatively narrow bandgap. Figure 4 shows that the IELs (from $\\mathrm{Cr}, \\mathrm{Mn}, \\mathrm{Co}$, and $\\mathrm{Ni}$ ) move from left to right, which means the highest occupied energy level of the $3 \\mathrm{~d}$ states is arranged in the order of $\\mathrm{Cr}<\\mathrm{Mn}<\\mathrm{Co}<\\mathrm{Ni}$ from lower to higher energy, consistent with the number of the d electrons in these atoms.\n\nFor further analysis of the effect of IELs in the co-doping systems, we compared the band structures of the V-Cr (a) and V-Co (b) co-doping systems (Figure 5). The bandgaps of V-Cr (a) and $\\mathrm{V}-\\mathrm{Co}$ (b) are $0.4 \\mathrm{eV}$ and $1.46 \\mathrm{eV}$, respectively. The $\\mathrm{V} 3 \\mathrm{~d}$ and $\\mathrm{Cr} 3 \\mathrm{~d}$ states make the VBM and CBM shift to the middle and result in a smaller bandgap. But the Co $3 d$ states are located in the middle of the bandgap, forming an intermediate level. Such a level in the bandgap usually plays two roles. One is to form a step for the electron transition and the other is to work as the electron-hole recombination center when the doping concentration is too high. The former is beneficial to visible light absorption, but the latter hinders electron-hole separation. Therefore, combining Figures 4 and 5, the results show that V-Cr, V-Mn, and V-Fe co-doping should have suitable bandgap and better visible light absorption than $\\mathrm{V}-\\mathrm{Co}$ and $\\mathrm{V}-\\mathrm{Ni}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_63a752c620bbc784200cg-06_654_1659_383_1673}\n\\end{center}\n\nFigure 4. The total and partial density of states of the V-M\" (3d metal elements: $\\mathrm{Cr}, \\mathrm{Mn}, \\mathrm{Fe}, \\mathrm{Co}$, and Ni) co-doped $\\mathrm{BaTiO}_{3}$. The black dashed line indicates the position of the Fermi level.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_63a752c620bbc784200cg-06_1822_2410_273_1783}\n\nFigure 5. The band structures of the $\\mathrm{V}-\\mathrm{Cr}(\\mathbf{a})$ and $\\mathrm{V}-\\mathrm{Co}(\\mathbf{b})$ co-doped $\\mathrm{BaTiO}_{3}$. The red lines indicate $\\mathrm{Cr}$ 3d states or Co 3 d states. The blue lines indicate V 3d states.\n\n\\subsection{2. $\\mathrm{V}$ and $4 \\mathrm{~d} \\mathrm{M}^{\\prime \\prime}$ Co-Doping (Mo, Tc, Ru and Pd)}\nAs shown in Figure 6, the IELs introduced by V-4d $\\mathrm{M}^{\\prime \\prime}$ co-doping emerges in the middle of bandgap and CB. Compared with Figure 4 , the IELs of the $4 \\mathrm{~d}$ metals are even closer to the CB than the IELs of $3 d$ metals. The reason is that the $4 \\mathrm{~d}$ states have higher energy than the $3 d$ states of the transition metals. Therefore, the IELs of V co-doping with the $4 \\mathrm{~d}$ transition metals are closer to the conduction band and belong to the significant n-doping. The Fermi level (EF) gradually shifts from the conduction band to the valence band with the increase of the atomic number of the $\\mathrm{M}^{\\prime \\prime}$ elements. The definition of the Fermi level is the highest energy level of the electron at the absolute zero degree, which corresponds to the energy state at $0 \\mathrm{eV}$. It can act as a reference to discuss the effects of the transition metal co-doping on the band edge modification and the bandgap variation. The IELs in the bandgap and near the bottom of the CB partially (V-Tc, V-Ru and V-Pd co-doping systems) or wholly overlap with the CBM (V-Mo co-doping system). Both cases can lead to the CBM downward shifting, while the valence bands remain barely unchanged upon the co-doping. The Fermi levels of the V-M\" (Mo, Tc, Ru and Pd) co-doping systems pass through the IELs, that is to say, the electrons can occupy the IELs below the Fermi level in the ground state. Due to the small distance between this energy level and the bottom of the CB, electrons can be excited by absorbing small photon energy [46,47].\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_63a752c620bbc784200cg-07_1102_2084_311_1756}\n\\end{center}\n\nFigure 6. The total and partial density of states of the V-M\" (4d metal elements: Mo, Tc, Ru and Pd) co-doped $\\mathrm{BaTiO}_{3}$. The black dashed line indicates the position of the Fermi level.\n\n\\subsection{3. $\\mathrm{Nb}$ and $3 \\mathrm{~d} \\mathrm{M}^{\\prime \\prime} \\mathrm{Co}$-Doping (Cr, Mn, Fe, Co and Ni)}\nFigure 7 shows that the effects of this series of co-doping are similar to the V-M ${ }^{\\prime \\prime}(\\mathrm{Cr}, \\mathrm{Mn}, \\mathrm{Fe}, \\mathrm{Co}$ and Ni) co-doping described in Figure 4 . The only difference is that the energy of the Nb $4 \\mathrm{~d}$ states is higher than that of the V 3 d states. Consequently, the V 3 d states are located at the CBM but the Nb $4 d$ states are in the upper $\\mathrm{CB}$. Therefore, the $\\mathrm{Nb} 4 \\mathrm{~d}$ states have little effect on the bandgap and there is no synergistic effect between the co-dopants. The Fermi level moves from CB to VB with the increase of the atomic number of $\\mathrm{M}^{\\prime \\prime}$ elements. The $\\mathrm{Cr}, \\mathrm{Mn}$, and Ni 3 d states occur in the middle of the bandgap and become the intermediate level. The intermediate state might be beneficial to the electron transition under visible-light irradiation. However, it might not be conducive to the effective separation of the electron-hole since it could also act as the recombination centers on the other hand. In addition, the Fe and Co 3d states are divided into two parts, where the high energy part is weak at the bottom of the CB, and the low energy part is strong, which is located at the top of the VB. Both cases can lead to the bandgap narrowing and are beneficial to visible-light absorption.\n\nIn these $\\mathrm{Nb}-\\mathrm{M}^{\\prime \\prime}$ co-doping systems, we chose two typical doping forms, the $\\mathrm{Nb}-\\mathrm{Mn}$ and $\\mathrm{Nb}-\\mathrm{Co}$ co-doping systems, to further investigate their band structures, as shown in Figure 8 . The bandgaps are found to be $1.2$ and $0.96 \\mathrm{eV}$, respectively. In the Nb-Mn co-doping system, the IELs in the middle of bandgap are contributed by the Mn $3 d$ states. However, in the $\\mathrm{Nb}$ and $\\mathrm{Co}$ co-doping system, the Co $3 \\mathrm{~d}$ and $\\mathrm{O} 2 \\mathrm{p}$ states form the $\\mathrm{p}$ - $\\mathrm{d}$ hybridization and locate above the original VB or partly coincided with the bottom of the CB. Overall, both co-doping could reduce the bandgap effectively but with different causes. It is also necessary to consider that $\\mathrm{Nb}$ and $\\mathrm{Mn}$ heavy co-doping might lead to a serious recombination due to the IELs in the bandgap.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_63a752c620bbc784200cg-08_904_1826_380_1670}\n\\end{center}\n\nFigure 7. The total and partial density of states of the $\\mathrm{Nb}-\\mathrm{M}^{\\prime \\prime}$ (3d metal elements: $\\mathrm{Cr}, \\mathrm{Mn}, \\mathrm{Fe}, \\mathrm{Co}$, and Ni) co-doped $\\mathrm{BaTiO}_{3}$. The black dashed line indicates the position of the Fermi level.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_63a752c620bbc784200cg-08_1982_2546_320_1738}\n\nFigure 8. The band structures of $\\mathrm{Nb}-\\mathrm{Mn}(\\mathbf{a})$ and $\\mathrm{Nb}-\\mathrm{Co}(\\mathbf{b})$ co-doped $\\mathrm{BaTiO}_{3}$. The red lines indicate Mn 3d states (a) and Co 3d states (b).\n\n\\subsection{4. $\\mathrm{Nb}-4 \\mathrm{~d} \\mathrm{M} \\mathrm{M}^{\\prime \\prime}$ Co-Doping (Mo, $\\mathrm{Tc}, \\mathrm{Ru}$ and $\\left.\\mathrm{Pd}\\right)$}\nAs shown in Figure 9, Nb-Mo, Nb-Tc, Nb-Ru, and Nb-Pd co-doping have very little influence on the top of valence band, but it changes the distribution of the electron states at the bottom of the conduction band. The $\\mathrm{Nb} 4 \\mathrm{~d}$ states are in the middle of the conduction band, while the Mo, Tc, Ru, and Pd $3 d$ states are located at the conduction band bottom or in the bandgap. Hence this series of co-dopings have no synergistic influence, and the doping effects around the bandgap are similar to the individual Mo, Tc, Ru, or Pd doping.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_63a752c620bbc784200cg-09_687_1609_361_1695}\n\\end{center}\n\nFigure 9. The total and partial density of states of the Nb-M\" (4d metal elements: Mo, $\\mathrm{Tc}, \\mathrm{Ru}$ and $\\mathrm{Pd}$ ) co-doped $\\mathrm{BaTiO}_{3}$. The black dashed line indicates the position of the Fermi level.\n\nGenerally, according to the results above, transition metal co-doping can have three effects on reducing the bandgap. Firstly, the IELs appear below the CB, partially or wholly overlap with the bottom of the CB, and eventually cause the CBM to move downward. Secondly, the IELs are located above the VB, overlap with the top of VB in different degrees, and make the VBM move up. Thirdly, the IELs lie in the middle of the bandgap to form the intermediate energy level. In the actual co-doping system, two or more effects can coexist to modify the energy bandgap.\n\nIn order to further study the difference between the single doping and co-doping systems, we calculated the band structures and total and partial $\\mathrm{DOS}$ of $\\mathrm{V}$ doped $\\mathrm{BaTiO}_{3}, \\mathrm{Nb}^{\\text {doped } \\mathrm{BaTiO}_{3}}$, and $\\mathrm{Cr}$ doped $\\mathrm{BaTiO}_{3}$, as shown in Figure 10. The band structures clearly show that $\\mathrm{V}$ doping reduces the bandgap to $1.15 \\mathrm{eV}$ since the $\\mathrm{V} 3 \\mathrm{~d}$ states appear at the bottom of $\\mathrm{CB}$ and form a new $\\mathrm{CBM}$. But the bandgap after $\\mathrm{Nb}$ doping is $1.63 \\mathrm{eV}$, which is even a bit larger than pure $\\mathrm{BaTiO}_{3}(1.56 \\mathrm{eV})$. The reason is that the $\\mathrm{Nb} 4 \\mathrm{~d}$ states are located in the $\\mathrm{CB}$ and far away from $\\mathrm{CBM}$, which have little effect on the bandgap. Thus, in the $\\mathrm{Nb}-\\mathrm{M}^{\\prime \\prime}$ co-doping system, the doping effect mostly depends on the single $\\mathrm{M}^{\\prime \\prime}$ doping. In the $\\mathrm{Cr}$-doped $\\mathrm{BaTiO}_{3}$, an IEL emerges in the bandgap, which is quite different from the $\\mathrm{V}$ and $\\mathrm{Nb}$ doping systems.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_63a752c620bbc784200cg-10_300_2356_272_1788}\n\nFigure 10. Band structures and total and partial density of states (DOS) of (a,b) $\\mathrm{Ba}_{8} \\mathrm{Ti}_{7} \\mathrm{VO}_{24}$, (c,d) $\\mathrm{Ba}_{8} \\mathrm{Ti}_{7} \\mathrm{NbO}_{24}$, and (e,f) $\\mathrm{Ba}_{8} \\mathrm{Ti}_{7} \\mathrm{CrO}_{24}$.\n\nIn addition, we compared the band structure and $\\mathrm{DOS}$ of $\\mathrm{V}, \\mathrm{Cr}$, and $\\mathrm{V}-\\mathrm{Cr}$ doped $\\mathrm{BaTiO}_{3}$. In the V-doped $\\mathrm{BaTiO}_{3}$, the IELs are located at the bottom of the $\\mathrm{CB}$. In the $\\mathrm{Cr}$-doped $\\mathrm{BaTiO}_{3}$, the IELs appear in the middle of the bandgap and form the intermediate energy level. But in the V-Cr co-doped BaTiO $_{3}$ as shown in Figure 4, the IELs divided into two parts. One was situated at the bottom of the $C B$, and the other at the top of the VB. Finally, as the intermediate energy level raised from the single Cr, doping disappeared, as confirmed in Figure 5a. Thus, the V-Cr co-doping can overcome the shortcoming of the single $\\mathrm{Cr}$ doping and combine the advantages of the $\\mathrm{V}$ and $\\mathrm{Cr}$ doping in reducing the bandgap to effectively shift the CBM and VBM toward the bandgap. Through such synergistic effect, the light absorption range could be expanded and the visible-light photoelectrical activity is expected to improve.\n\nFurthermore, the charge density distribution was investigated for the V-doped, Cr-doped, and $\\mathrm{V}-\\mathrm{Cr}$ co-doped $\\mathrm{BaTiO}_{3}$ as shown in Figure 11, which indicates that Ti-O, $\\mathrm{Cr}-\\mathrm{O}$, and $\\mathrm{V}-\\mathrm{O}$ form covalent bonds. Due to different electronegativity (Ti $<\\mathrm{V}<\\mathrm{Cr}<\\mathrm{O})$, the covalent bond strength is different. The greater the metal electronegativity is, the smaller the electronegativity difference between the metal and oxygen atoms, and the more uniform is the charge density distribution. According to an effective empirical determining method, the electronic energy level of an element is usually inversely proportional to its electronegativity. That is to say, the higher the electronegativity, the lower the position of the energy level and the lower the position of the corresponding energy band [48]. Therefore, when $\\mathrm{Cr}$ or $\\mathrm{V}$ with larger electronegativity was doped into $\\mathrm{BaTiO}_{3}$, the IELs with a relatively low energy position were introduced around the CBM or in the bandgap, leading to a narrower bandgap after doping. The results are verified by the line profile of the charge density as displayed in Figure 11 a-c. The charge density of $\\mathrm{Ti}, \\mathrm{O}, \\mathrm{Cr}$, and $\\mathrm{V}$ is slightly decreased in various degrees after $\\mathrm{Cr}-\\mathrm{V}$ co-doping compared to the single $\\mathrm{Cr}$ or $\\mathrm{V}$ doping. It can be found that in comparison to the single doping, where the charge density is more localized around the atoms, V-Cr co-doping could result in a relatively evener charge distribution. This not only causes the hybridization of the newly introduced IELs and the initial CBM or VBM of the pure $\\mathrm{BaTiO}_{3}$, but is associated with the interaction among the newly introduced energy states due to the V-Cr synergistic effect, which accounts for the bandgap engineering by the co-doping for visible-light activation.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_63a752c620bbc784200cg-11_1510_2256_272_1804}\n\nFigure 11. Charge-density distributions of metal doped $\\mathrm{BaTiO}_{3}$ in (100) surfaces: (a-c) Line profiles corresponding to the black dotted lines; (d) $\\mathrm{V}$ and $\\mathrm{Cr}$ co-doped $\\mathrm{BaTiO}_{3} ;$ (e) $\\mathrm{Cr}$ doped $\\mathrm{BaTiO}_{3}$;\n\n(f) $\\mathrm{V}$ doped $\\mathrm{BaTiO}_{3}$.\n\nIn order to further analyze the charge density near the bandgap, we calculated the distribution of the partial charge density from the top of the valence band to the bottom of the conduction band, as shown in Figure 12, which could reveal the visual information of the electron densities mainly derived from the doped/co-doped atoms. The calculated partial electron density in the V-Cr co-doped BaTiO $_{3}$ distributed around the $\\mathrm{V}$ and $\\mathrm{Cr}$ dopants is shown in Figure 12a, and is mainly derived from the $\\mathrm{Cr} 3 \\mathrm{~d}$ isolated non-bond states and the hybrids between the $\\mathrm{V} 3 \\mathrm{~d}$ and $\\mathrm{O} 2 \\mathrm{p}$ electronic states, as suggested by Figures 4 and 5. Figure $12 \\mathrm{~b}$ presents the partial electron density on $\\mathrm{Cr}$ in the $\\mathrm{Cr}$ doped $\\mathrm{BaTiO}_{3}$, which consists significantly of the isolated $\\mathrm{Cr} 3 \\mathrm{~d}$ orbitals confirmed by Figure 10 f. From Figure 12c, the partial electron density calculated in the $\\mathrm{V}$ doped $\\mathrm{BaTiO}_{3}$ distributed around the $\\mathrm{V}$ atom, which primarily originates from $\\mathrm{V}-\\mathrm{O}$ bonds arising from the hybridization of the $\\mathrm{O} 2 \\mathrm{p}$ and V 3d orbitals. As such, the doped/co-doped atoms play a key role in narrowing the bandgap of $\\mathrm{BaTiO}_{3}$. These results also reveal that the appropriate selection of co-doping elements, such as $\\mathrm{V}-\\mathrm{Cr}$ co-doping, can result in synergistic effects by the two co-dopants that can effectively manipulate the bandgap. Before choosing the pair of dopants for co-doping, it is important to examine the electronic structures of the individual doping and their interaction so that the pair of dopants in the co-doping system can coexist to properly modify the bandgap edge and improve the visible-light adsorption properties. Besides the electronic structure, charge mobility and surface properties/states also play important roles in the photoelectric behavior, which should be addressed in the future.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_63a752c620bbc784200cg-12_1005_1468_266_1808}\n\\end{center}\n\nFigure 12. Partial charge-density distribution calculated from the top of the valence band to the bottom\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_63a752c620bbc784200cg-12_1536_1588_334_1688}\n\\end{center}\n\n\\section{Conclusions}\nIn summary, the formation energy and electronic properties of the transition metal V-M $\\mathrm{M}^{\\prime \\prime}$ and $\\mathrm{Nb}^{\\prime \\prime} \\mathrm{M}^{\\prime \\prime}$ co-doped $\\mathrm{BaTiO}_{3}$ have been studied by first-principles calculations. The results indicate that the $\\mathrm{V}-\\mathrm{M}^{\\prime \\prime}$ co-doping is more suitable than the $\\mathrm{Nb}^{\\prime \\prime} \\mathrm{M}^{\\prime \\prime}$ co-doping for narrowing the bandgap of BaTiO ${ }_{3}$\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_63a752c620bbc784200cg-12_1839_1890_254_1808}\\\\\naround the bandgap edge while those energy levels induced by the Nb-M ${ }^{\\prime \\prime}$ co-doping are usually deep levels in the energy band or bandgap. The optimal co-doping model is proposed as the $\\mathrm{V}-\\mathrm{Cr}$ co-doped $\\mathrm{BaTiO}_{3}$, which not only has favorable defect formation energy, but also significantly reduce the bandgap. Simultaneous introduction of $\\mathrm{V}$ and $\\mathrm{Cr}$ results in a synergistic effect, which has been demonstrated by the detailed analysis of the density of states, band structure, and charge-density distribution of the doping systems. $\\mathrm{V}-\\mathrm{Cr}$ co-doping could overcome the shortcoming of the single $\\mathrm{Cr}$ doping and combine the advantages of both the $\\mathrm{V}$ and $\\mathrm{Cr}$ doping. For this optimal co-doped $\\mathrm{BaTiO}_{3}$ system, the Cr $3 d$ states are located just above the VBM and the V $3 d$ states occupied band just below the CBM, corresponding to a bandgap narrowing of about $0.4 \\mathrm{eV}$, which is beneficial for efficient visible-light adsorption. The results can provide an important guideline for future experiments to modify the wide $\\mathrm{BaTiO}_{3}$ bandgap for visible-light driven solar applications.\n\nSupplementary Materials: The following are available online at \\href{http://www.mdpi.com/2079-4991/8/7/455/s1}{http://www.mdpi.com/2079-4991/8/7/455/s1}, Figure S1: The lattice constants of transition metals co-doped cubic $\\mathrm{BaTiO}_{3}$, Table S1: The special $\\mathrm{K}$ points coordinates, Table S2: The average bond length obtained after optimization of the V-M $\\mathrm{M}^{\\prime \\prime}$ co-doping system, Table S3: The average bond length obtained after optimization of the $\\mathrm{Nb}-\\mathrm{M}^{\\prime \\prime}$ co-doping system.\n\nAuthor Contributions: S.L. conceived and designed the experiments; F.Y., L.Y., C.A. and P.X. performed the theoretical; F.Y., C.W. and X.L. analyzed the data; F.Y. wrote the paper. Funding: This research was funded by the Key Research and Development Program of Hainan Province (ZDYF2017166) and National Natural Science Foundation of China (Grant Nos. 51462008, 61764003). Work at Ames Laboratory was supported by the US Department of Energy, Basic Energy Sciences, Division of Materials Science and Engineering under Contract No. DE-AC02-07CH11358, including a grant of computer time at the National Energy Research Scientific Computing Centre (NERSC) in Berkeley, CA.\n\nAcknowledgments: This work is supported by the Key Research and Development Program of Hainan Province (ZDYF2017166) and National Natural Science Foundation of China (Grant Nos. 51462008, 61764003). Work at Ames Laboratory was supported by the US Department of Energy, Basic Energy Sciences, Division of Materials Science and Engineering under Contract No. DE-AC02-07CH11358, including a grant of computer time at the National Energy Research Scientific Computing Centre (NERSC) in Berkeley, CA.\n\nConflicts of Interest: The authors declare no conflict of interest.\n\n\\section{References}\n\\begin{enumerate}\n  \\item Kojima, A.; Teshima, K.; Shirai, Y.; Miyasaka, T. Organometal halide perovskites as visible-light sensitizers for photovoltaic cells. J. Am. Chem. Soc. 2009, 131,6050-6051. [CrossRef] [PubMed]\n\n  \\item Noh, J.H.; Im, S.H.; Heo, J.H.; Mandal, T.N.; Seok, S.I. Chemical management for colorful, efficient, and stable inorganic-organic hybrid nanostructured solar cells. Nano Lett. 2013, 13, 1764-1769. [CrossRef] [PubMed]\n\n  \\item Bao, X.; Zhu, Q.; Qiu, M.; Yang, A.; Wang, Y.; Zhu, D.; Wang, J.; Yang, R. High-performance inverted planar perovskite solar cells without a hole transport layer via a solution process under ambient conditions. J. Mater. Chem. A 2015, 3, 19294-19298. [CrossRef]\n\n  \\item Swainson, I.P.; Tucker, M.G.; Wilson, D.J.; Winkler, B.; Milman, V. Pressure response of an organic-inorganic perovskite: Methylammonium lead bromide. Chem. Mater. 2007, 19, 2401-2405. [CrossRef]\n\n  \\item Dualeh, A.; Gao, P.; Seok, S., II; Nazeeruddin, M.K.; Grätzel, M. Thermal behavior of methylammonium lead-trihalide perovskite photovoltaic light harvesters. Chem. Mater. 2014, 26, 6160-6164. [CrossRef]\n\n  \\item Lopez-Varo, P.; Bertoluzzi, L.; Bisquert, J.; Alexe, M.; Coll, M.; Huang, J.; Jimenez-Tejada, J.A.; Kirchartz, T.; Nechache, R.; Rosei, F.; et al. Physical aspects of ferroelectric semiconductors for photovoltaic solar energy conversion. Phys. Rep. 2016, 653, 1-40. [CrossRef]\n\n  \\item Zhang, G.; Wu, H.; Li, G.; Huang, Q.; Yang, C.; Huang, F.; Liao, F.; Lin, J. New high Tc multiferroics $\\mathrm{KBiFe}_{2} \\mathrm{O}_{5}$ with narrow bandgap and promising photovoltaic effect. Sci. Rep. 2013, 3. [CrossRef]\n\n  \\item Grinberg, I.; West, D.V.; Torres, M.; Gou, G.; Stein, D.M.; Wu, L.; Chen, G.; Gallo, E.M.; Akbashev, A.R.; Davies, P.K.; et al. Perovskite oxides for visible-light-absorbing ferroelectric and photovoltaic materials. Nature 2013, 503, 509-512. [CrossRef] [PubMed]\n\n  \\item Zhang, Y.; Schultz, A.M.; Salvador, P.A.; Rohrer, G.S. Spatially selective visible light photocatalytic activity of $\\mathrm{TiO}_{2} / \\mathrm{BiFeO}_{3}$ heterostructures. J. Mater. Chem. 2011, 21, 4168-4174. [CrossRef]\n\n  \\item Dharmadhikari, V.S.; Grannemann, W.W. Photovoltaic properties of ferroelectric $\\mathrm{BaTiO}_{3}$ thin films rf sputter deposited on silicon. J. Appl. Phys. 1982, 53, 8988-8992. [CrossRef]\n\n  \\item Zenkevich, A.; Matveyev, Y.; Maksimova, K.; Gaynutdinov, R.; Tolstikhina, A.; Fridkin, V. Giant bulk photovoltaic effect in thin ferroelectric $\\mathrm{BaTiO}_{3}$ films. Phys. Rev. B Condens. Matter Mater. Phys. $2014,90$. [CrossRef]\n\n  \\item Choi, T.; Lee, S.; Choi, Y.J.; Kiryukhin, V.; Cheong, S.W. Switchable ferroelectric diode and photovoltaic effect in $\\mathrm{BiFeO}_{3}$. Science 2009, 324, 63-66. [CrossRef] [PubMed]\n\n  \\item Ji, W.; Yao, K.; Liang, Y.C. Bulk photovoltaic effect at visible wavelength in epitaxial ferroelectric $\\mathrm{BiFeO}_{3}$ thin films. Adv. Mater. 2010, 22, 1763-1766. [CrossRef] [PubMed]\n\n  \\item Yang, S.Y.; Seidel, J.; Byrnes, S.J.; Shafer, P.; Yang, C.H.; Rossell, M.D.; Yu, P.; Chu, Y.H.; Scott, J.F.; Ager, J.W.; et al. Above-bandgap voltages from ferroelectric photovoltaic devices. Nat. Nanotechnol. 2010, 5, 143-147. [CrossRef] [PubMed]\n\n  \\item Nechache, R.; Harnagea, C.; Li, S.; Cardenas, L.; Huang, W.; Chakrabartty, J.; Rosei, F. Bandgap tuning of multiferroic oxide solar cells. Nat. Photonics 2014, 9, 61-67. [CrossRef]\n\n  \\item Glass, A.M.; Von Der Linde, D.; Negran, T.J. High-voltage bulk photovoltaic effect and the photorefractive process in $\\mathrm{LiNbO}_{3}$. Appl. Phys. Lett. 1974, 25, 233-235. [CrossRef]\n\n  \\item Peithmann, K.; Hukriede, J.; Buse, K.; Krätzig, E. Photorefractive properties of crystals doped by copper diffusion. Phys. Rev. B Condens. Matter Mater. Phys. 2000, 61, 4615-4620. [CrossRef] 18. Festl, H.G.; Hertel, P.; Krätzig, E.; von Baltz, R. Investigations of the Photovoltaic Tensor in Doped LiNbO $_{3}$. Phys. Status Solidi 1982, 113, 157-164. [CrossRef]\n\n  \\item Schirmer, O.F.; Imlau, M.; Merschjann, C. Bulk photovoltaic effect of $\\mathrm{LiNbO}_{3}: \\mathrm{Fe}^{\\mathrm{C}}$ and its small-polaron-based microscopic interpretation. Phys. Rev. B 2011, 83, 165106. [CrossRef]\n\n  \\item Nonaka, K.; Akiyama, M.; Xu, C.N.; Hagio, T.; Komatsu, M.; Takase, A. Enhanced photovoltaic response in lead lanthanum zirconate-titanate ceramics with a-site deficient composition for photostrictor application. Jpn. J. Appl. Phys. Part 1 2000, 39, 5144-5145. [CrossRef]\n\n  \\item Qin, M.; Yao, K.; Liang, Y.C. High efficient photovoltaics in nanoscaled ferroelectric thin films. Appl. Phys. Lett. 2008, 93. [CrossRef]\n\n  \\item Qin, M.; Yao, K.; Liang, Y.C. Photovoltaic mechanisms in ferroelectric thin films with the effects of the electrodes and interfaces. Appl. Phys. Lett. 2009, 95. [CrossRef]\n\n  \\item Fan, Z.; Sun, K.; Wang, J. Perovskites for photovoltaics: A combined review of organic-inorganic halide perovskites and ferroelectric oxide perovskites. J. Mater. Chem. A 2015, 3, 18809. [CrossRef]\n\n  \\item Wang, D.; Ye, J.; Kako, T.; Kimura, T. Photophysical and photocatalytic properties of $\\mathrm{SrTiO}_{3}$ doped with $\\mathrm{Cr}^{2}$ cations on different sites. J. Phys. Chem. B 2006, 110, 15824-15830. [CrossRef] [PubMed]\n\n  \\item Zhang, G.; Sun, S.; Jiang, W.; Miao, X.; Zhao, Z.; Zhang, X.; Qu, D.; Zhang, D.; Li, D.; Sun, Z. A Novel Perovskite $\\mathrm{SrTiO}_{3}-\\mathrm{Ba}_{2} \\mathrm{FeNbO}_{6}$ Solid Solution for Visible Light Photocatalytic Hydrogen Production. Adv. Energy Mater. 2017, 7, 1600932. [CrossRef]\n\n  \\item Yang, F.; Lin, S.; Yang, L.; Liao, J.; Chen, Y.; Wang, C.Z. First-principles investigation of metal-doped cubic $\\mathrm{BaTiO}_{3}$. Mater. Res. Bull. 2017, 96, 372-378. [CrossRef]\n\n  \\item Wei, W.; Dai, Y.; Guo, M.; Yu, L.; Huang, B. Density Functional Characterization of the Electronic Structure and Optical Properties of N-Doped, La-Doped, and N/La-Codoped SrTiO 3 . J. Phys. Chem. C 2009, 113, 15046-15050. [CrossRef]\n\n  \\item Li, W.; Wang, G.; Chen, C.; Liao, J.; Li, Z. Enhanced Visible Light Photocatalytic Activity of ZnO Nanowires Doped with $\\mathrm{Mn}^{2+}$ and $\\mathrm{Co}^{2+}$ Ions. Nanomaterials 2017, 7, 20. [CrossRef] [PubMed]\n\n  \\item Ishii, T.; Kato, H.; Kudo, A. $\\mathrm{H}_{2}$ evolution from an aqueous methanol solution on $\\mathrm{SrTiO}_{3}$ photocatalysts codoped with chromium and tantalum ions under visible light irradiation. J. Photochem. Photobiol. A Chem. 2004, 163, 181-186. [CrossRef]\n\n  \\item Kako, T.; Yao, W.; Ye, J. Preparation and characterization of visible light sensitive Fe- and Ta-codoped TiO ${ }_{2}$ photocatalyst. J. Mater. Res. 2010, 25, 110-116. [CrossRef]\n\n  \\item Miyauchi, M.; Takashio, M.; Tobimatsu, H. Photocatalytic Activity of $\\mathrm{SrTiO}_{3} \\mathrm{Codoped} \\mathrm{with} \\mathrm{Nitrogen} \\mathrm{and}^{2}$ Lanthanum under Visible Light Illumination. Langmuir 2004, 20, 232-236. [CrossRef] [PubMed]\n\n  \\item Kresse, G.; Joubert, D. From ultrasoft pseudopotentials to the projector augmented-Wave method. Phys. Rev. B 1999, 59, 1758. [CrossRef]\n\n  \\item Kresse, G.; Furthmüller, J. Efficient iterative schemes for ab initio total-energy calculations using a plane-wave basis set. Phys. Rev. B Condens. Matter Mater. Phys. 1996, 54, 11169-11186. [CrossRef]\n\n  \\item Kresse, G.; Furthmüller, J. Efficiency of ab-initio total energy calculations for metals and semiconductors using a plane-wave basis set. Comput. Mater. Sci. 1996, 6, 15-50. [CrossRef]\n\n  \\item Perdew, J.; Burke, K.; Ernzerhof, M. Generalized Gradient Approximation Made Simple. Phys. Rev. Lett. 1996, 77, 3865-3868. [CrossRef] [PubMed]\n\n  \\item Perdew, J.P.; Burke, K.; Ernzerhof, M. Perdew, Burke, and Ernzerhof Reply. Phys. Rev. Lett. 1998, 80, 891. [CrossRef]\n\n  \\item Skulason, E.; Karlberg, G.S.; Rossmeisl, J.; Bligaard, T.; Greeley, J.; Jonsson, H.; Nørskov, J.K. Density functional theory calculations for the hydrogen evolution reaction in an electrochemical double layer on the $\\mathrm{Pt}(111)$ electrode. Phys. Chem. Chem. Phys. 2007, 9, 3241–3250. [CrossRef] [PubMed]\n\n  \\item Xue, S.; Zhang, F.; Zhang, S.; Wang, X.; Shao, T. Electronic and Magnetic Properties of Ni-Doped Zinc-Blende ZnO: A First-Principles Study. Nanomaterials 2018, 8, 281. [CrossRef] [PubMed]\n\n  \\item Corà, F.; Catlow, C.R.A. QM investigations on perovskite-structured transition metal oxides: Bulk, surfaces and interfaces. Faraday Discuss. 1999, 114, 421-442. [CrossRef]\n\n  \\item Xiao, Z.; Meng, W.; Wang, J.; Yan, Y. Thermodynamic Stability and Defect Chemistry of Bismuth-Based Lead-Free Double Perovskites. ChemSusChem 2016, 9, 2628–2633. [CrossRef] [PubMed]\n\n  \\item Petraru, A.I. Optical and Electro-Optical Properties of BaTiO3 Thin Films and Mach-Zehnder Waveguide Modulators. Doctoral Thesis, Forschungszentrum Jülich, Jülich, Germany, 2003. 42. Weng, B.; Xiao, Z.; Meng, W.; Grice, C.R.; Poudel, T.; Deng, X.; Yan, Y. Bandgap Engineering of Barium Bismuth Niobate Double Perovskite for Photoelectrochemical Water Oxidation. Adv. Energy Mater. $2017,7$. [CrossRef]\n\n  \\item Mamouni, N.; El Kenz, A.; Ez-Zahraouy, H.; Loulidi, M.; Benyoussef, A.; Bououdina, M. Stabilization of ferromagnetism in (Cr, V) co-doped $\\mathrm{ZnO}$ diluted magnetic semiconductors. J. Magn. Magn. Mater. 2013, 340, 86-90. [CrossRef]\n\n  \\item Jungwirth, T.; Sinova, J.; Mašek, J.; Kučera, J.; MacDonald, A.H. Theory of ferromagnetic (III,Mn)V semiconductors. Rev. Mod. Phys. 2006, 78, 809-864. [CrossRef]\n\n  \\item Olibet, S.; Vallat-Sauvain, E.; Ballif, C. Model for a-Si:H/c-Si interface recombination based on the amphoteric nature of silicon dangling bonds. Phys. Rev. B 2007, 76, 35326. [CrossRef]\n\n  \\item Zhang, W.; Li, Y.; Zhu, S.; Wang, F. Copper doping in titanium oxide catalyst film prepared by dc reactive magnetron sputtering. Catal. Today 2004, 93-95, 589-594. [CrossRef]\n\n  \\item Zhu, J.; Chen, F.; Zhang, J.; Chen, H.; Anpo, M. $\\mathrm{Fe}^{3+}-\\mathrm{TiO}_{2}$ photocatalysts prepared by combining sol-gel method with hydrothermal treatment and their characterization. J. Photochem. Photobiol. A Chem. 2006, 180, 196-204. [CrossRef]\n\n  \\item Hur, S.G.; Kim, T.W.; Hwang, S.; Park, H.; Choi, W.; Kim, S.J.; Choy, J. Synthesis of New Visible Light Active Photocatalysts of $\\mathrm{Ba}\\left(\\operatorname{In}_{1 / 3} \\mathrm{~Pb}_{1 / 3} \\mathrm{M}_{1 / 3}{ }_{1 / 3}\\right) \\mathrm{O}_{3}\\left(\\mathrm{M}^{\\prime}=\\mathrm{Nb}\\right.$, Ta): A Bandgap Engineering Strategy Based on Electronegativity of a Metal Component. J. Phys. Chem. B 2005, 109, 17346. [CrossRef]\n\n\\end{enumerate}\n\n(c) 2018 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (http:/ / \\href{http://creativecommons.org/licenses/by/4.0/}{creativecommons.org/licenses/by/4.0/}).\n\n\n\\end{document}", "record_id": "2023_09_22_63a752c620bbc784200cg"}