{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Clusters of the lonic Liquid 1-Hydroxyethyl-3-methylimidazolium Picrate: From Theoretical Prediction in the Gas Phase to Experimental Evidence in the Solid State }\n\n\n\\author{Sumit K. Panja, ${ }^{[a]}$ Boumediene Haddad, $^{[b]}$ and Johannes Kiefer ${ }^{*[c]}$}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nInteronic interactions determine the macroscopic properties of ionic liquids (ILs). Hence, unravelling the relationships between the microscopic and macroscopic scales is key for rational design. Combining density functional theory (DFT) calculations of isolated ion pairs and vibrational spectroscopy of the condensed phase (fluid or solid) has become a very common approach. In the present work, we make a step towards understanding how the physicochemical effects in small gas phase clusters of a hydroxyl functionalized imidazolium-picrate IL relate with the molecular structure and interactions of the corresponding solid material taking 1-hydroxyethyl-3-methylimidazolium picrate, $\\mathrm{C}_{2} \\mathrm{OHmimPic}$, as an example. In the isolated ion pair, strong alkyl-OH...Pic hydrogen bonding interactions are found rather than the commonly observed hydrogen bonding interactions at the slightly acidic $\\mathrm{C}(2)-\\mathrm{H}$ site of the imidazolium ring. However, this part of the cation plays an important role when clusters of ion pairs in the gas phase and inside a crystal lattice are considered. For example, in the dimeric ion-pair cluster, one centre $\\left(\\mathrm{O}^{*}\\right)$ with two interaction sites $\\left(\\mathrm{C}(2)-\\mathrm{H}-\\mathrm{O}^{*}\\right.$ and alkyl OH-Pic) is observed. This configuration is suggested by single crystal X-ray diffraction (XRD), vibrational spectroscopy, and the dispersion-corrected DFT calculations. Hence, the study provides evidence for the appearance of theoretical gas phase clusters in an actual solidified ionic liquid. This ion pair dimer formation may be a general behavior of hydroxyl functionalized imidazolium ILs, but further research is needed to draw a final conclusion. Moreover, the Raman spectra confirm the exclusive gauche conformation of the hyroxyl functionalized alkyl chain.\n\n\\section{Introduction}\nIonic liquids (ILs) are fascinating ionic materials that have attracted considerable attention in various fields in recent years. This includes organic synthesis and catalysis, ${ }^{[1]}$ electrochemistry, ${ }_{1}^{[2]}$ chemical sensing, ${ }^{[3,4]}$ and dye-sensitized solar cells, ${ }^{[5]}$ but also their potential use as energetic materials, ${ }^{[6,7]}$ lubricants, ${ }^{[8]}$ and electro-wetting agents ${ }^{[9,10]}$ has sparked an interest in academia and industry. Their attractive and potentially tunable properties make them not just replacements for conventional solvents but open up opportunities to use them as new platforms for advanced multi-purpose materials, for example by combining them with nanostructured materials. ${ }^{[11]}$\n\nImidazolium-based ILs are very popular due to their chemical and thermal stability, well-established structural characterization, low viscosity, and their widespread potential\n\n[a] Dr. S. K. Panja\n\nDepartment of Inorganic and Physical Chemistry, Indian Institute of Science, Bangalore 560012, Karnataka, India\n\n[b] Dr. B. Haddad\n\nDepartment of Chemistry, Dr Moulay Tahar University, Saïda, EN-NASR, BP:138, Algeria\n\n[c] Prof. Dr. J. Kiefer\n\nTechnische Thermodynamik, Universität Bremen, Badgasteiner Str. 1, 28359 Bremen, Germany\n\n\\href{mailto:E-mail:jkiefer@uni-bremen.de}{E-mail:jkiefer@uni-bremen.de}\n\nSupporting information for this article is available on the WWW under \\href{https://doi.org/10.1002/cphc.201800684}{https://doi.org/10.1002/cphc.201800684} applications. For example, varying the substituents of the imidazolium ring drastically changes the physical properties of these ILs. ${ }^{[12-14]}$ Combining different cations and anions is another means of controlling the properties. ${ }^{[15-18]}$ The possibility to select the macroscopic properties by chosing the chemical structure and composition of an IL is the key for a rational design. However, in order to achieve this the structure-property relationships must be understood. ${ }^{[19,20]}$\n\nThe molecular and thus the macroscopic behavior of an IL is determined by the molecular interactions between the catand anions and between the ions and perhaps present solvents or solutes. These interactions have been the subject of many experimental and theoretical studies. ${ }^{[21-23]}$ It was found that parameters such as the magnitude of interaction energy, the orientation, the predominant long range coulombic forces, the dispersion forces, and the hydrogen bonding interactions play crucial roles in the formation of $\\mathrm{micro} / \\mathrm{mesoscopic} \\mathrm{local}$ domains, which in turn affect the physical properties of ILs. In order to study the effects in detail, experimental and theoretical methods have successfully been combined, for example vibrational or NMR spectroscopy and density functional theory (DFT) or molecular dynamics (MD) simulations. ${ }^{[24-27]}$\n\nIn recent years, task-specific hydroxyl-functionalized ILS have attracted attention. For instance, they were used for reversible capture of green-house gases, ${ }^{[28,29]}$ as media for organic synthesis, e.g. via Diels-Alder reactions, ${ }^{[30]}$ for the enhancement of hydrophilicity and enzyme activity, ${ }^{[31,32]}$ for the improvement of the solubility of inorganic salts, ${ }^{[33,34]}$ and to produce metal oxide powders with a specified size. ${ }^{[35,36]}$ Moreover, the introduction of a hydroxyl group into the alkyl side chain of the imidazolium cation leads to interesting phenomena such as the negative photochromism of spiropyran in contrast to its positive photochromism in non-hydroxyl ILs. ${ }^{[37,38]}$ Furthermore, using solvatochromic dyes and fluorescence probes a series of hydroxyl ILs and their non-functionalized counterparts were studied. ${ }^{[39]}$ In both groups, the polarity was found to be anion-dependent, but in the hydroxyl functionalized ILs the polarity varied over a significantly wider rage. This was attributed to the significant difference in hydrogen bonding strength. Further experimental and theoretical work supports this hypothesis. ${ }^{[40,41]}$ The detailed picture, however, is yet to be fully understood.\n\nThe present work aims at making a step towards understanding how the physicochemical effects in small gas phase clusters of a hydroxyl-functionalized imidazolium-picrate IL relate with the molecular structure and interactions of the corresponding solid material. For this purpose, density functional theory, single-crystal X-ray diffraction and Raman spectroscopy were applied to 1-hydroxyethyl-3-methylimidazolium picrate, $\\mathrm{C}_{2} \\mathrm{OHmimPic}$, which has potential applications as an energetic material. One goal was to find out whether or not the theoretical results obtained for isolated ion pairs and small gas phase clusters can be directly related to the structures in the solid material at room temperature.\n\n\\section{Experimental Section}\n\\section{Chemicals and Synthesis}\nAll starting materials were procured from Sigma Aldrich and were of analytical grade. Ultrapure water, acetonitrile, and dichloromethane, ethanol, DMSO, and other solvents were also procured from Sigma Aldrich. $\\mathrm{D}_{2} \\mathrm{O}$ and $\\mathrm{CDCl}_{3}$ (Sigma Aldrich) were used as received for the NMR study.\n\nThe synthesis and initial characterization of $\\mathrm{C}_{2} \\mathrm{OHmimPic}$ is described in the electronic supplementary information (ESI). The compound was obtained as a yellow solid with a melting point of $363.15 \\mathrm{~K}$. The chemical structure and numbering scheme is illustrated in Figure 1.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8181c4d6fa78a2ea82dag-2_2053_2264_180_591}\n\\end{center}\n\n$\\left[\\mathrm{C}_{2} \\mathrm{OHmim}\\right]^{+}$cation\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8181c4d6fa78a2ea82dag-2_2006_2300_632_989}\n\\end{center}\n\n[Pic] anion Figure 1. Structure and numbering scheme of the imidazolium cation (left) and the picrate anion (right).\n\n\\section{Raman Spectroscopy}\nFT-Raman spectra were acquired at room temperature using a Vertex 70-RAM II Bruker spectrometer (Nd:YAG laser (yttrium aluminium garnet crystal doped with triply ionized neodymium); wavelength $1064 \\mathrm{~nm}$; maximum power $1.5 \\mathrm{~W}$ ). The measurement accessory is pre-aligned such that only the Z-axis of the scattered light is adjusted to position the sample appropriately regarding the focal point. The RAM II spectrometer is equipped with a liquidnitrogen cooled $G e$ detector. The FT-Raman spectra (100$3500 \\mathrm{~cm}^{-1}$ ) were collected with $1 \\mathrm{~cm}^{-1}$ nominal resolution by coadding 128 scans for each spectrum.\n\n\\section{Quantum Chemical Calculations}\nStructure Calculation: DFT calculations were employed to optimize the energy and to compute the geometries for different possible conformers of the ion pair and the clusters of two ion pairs. In order to take dispersion effects into account, the DFT calculations were carried out using the long range dispersion CAM-B3LYP functional with the basis set $/ 6-311++\\mathrm{g}(\\mathrm{d}, \\mathrm{p}) / \\mathrm{def} 2 \\mathrm{sv}^{[42]}$ The Gaussian 09 suite software was used for all the computations, and the GaussView $5.1$ program was employed to visualize the structures. ${ }^{[43]}$ The electronic absorption spectra were calculated using the time-dependent density functional theory (TD-DFT) method using the long-range dispersion CAM-B3LYP functional with basis set/6-311 $++\\mathrm{g}(\\mathrm{d}, \\mathrm{p})$ /def2sv and the polarizable continuum model (PCM) employing acetonitrile (ACN) and water as solvent.\n\nWavenumber Calculation: The vibrational wavenumbers and the IR and Raman intensities of all conformers of the cation, the anion, and the ion pair configurations were calculated using the Gaussian 09 program. ${ }^{[44]}$ All the calculations were performed without applying any constraints. In every case, the optimized structures finally converged into the minima of the potential surface, which was confirmed by the absence of negative (imaginary) wavenumbers for any normal mode.\n\nBinding-Energy Calculation: The binding energy was computed through DFT calculations with the CAM-B3LYP/6-311+ $+\\mathrm{g}(\\mathrm{d}, \\mathrm{p}) /$ def2sv basis set using Gaussian 09 linked to the GaussView $5.1$ program. The energy of the ion pair formation $(\\Delta E)$ was estimated using Eqn. (1), according to Turner et al. ${ }^{[20]}$\n\n$\\Delta \\mathrm{E}=E_{A X}-E_{A^{+}}^{\\text {Min }}-E_{X^{-}}^{\\text {Min }}+E_{\\mathrm{BSSE}}+\\Delta \\mathrm{ZPVE}$\n\nwhere $\\Delta E$ is the energy of the ion pair formation and $E_{A X}, E_{A+}, E_{x}^{-}$ are the energies of the ion pair, the isolated cation, and the isolated anion, respectively. The interaction energies were corrected by the basis set super-position errors (BSSE) correction with the counterpoise procedure advanced by Boys and Bernardi. ${ }^{[45]}$ In addition, the zero-point vibrational energy (ZPVE) correction was calculated with the same basis set. The unscaled frequencies were also taken into account for the determination of the interaction energies.\n\n\\section{Results and Discussion}\nThis study aims at unravelling the links between the molecular structure of the commonly investigated isolated ions, the ion pair, and small clusters and the properties of the real condensed phase using the target compound $\\mathrm{C}_{2} \\mathrm{OHmimPic}$ as an example. In this section, we present the results of our combined computational and experimental study in several steps starting with the most simplistic case, i.e. the isolated ion pairs, via the more realistic situation of small clusters in the gas and solid phase to consider the real crystalline material, eventually.\n\n\\subsection{Isolated Ion Pairs and Small Clusters}\nTo obtain a first insight into the orientation patterns of the $[\\mathrm{Pic}]^{-}$anion, the $\\left[\\mathrm{C}_{2} \\mathrm{OHmim}\\right]^{+}$cation, and their potential molecular interactions, an isolated ion pair and a cluster comprising of two ion pairs are optimized at the CAM\\#B3LYP/6$311++\\mathrm{g}(\\mathrm{d}, \\mathrm{p}) /$ def2sv level of theory. Each optimized structure was checked to be a true local minimum through normal-mode frequency calculations to ensure the inexistence of imaginary frequencies.\n\nIn the beginning, the cation-anion interactions were initiated by introducing the $[\\mathrm{Pic}]^{-}$anion near the hydroxyl group of the $\\left[\\mathrm{C}_{2} \\mathrm{OHmim}\\right]^{+}$cation. The CAM-B3LYP method successfully optimized the molecular structure. Interestingly, the most stable geometry was not found at the $C(2)$ position of the cation, where the anion is preferably located in most imidazolium-based ionic liquids, see for example. ${ }^{[21-23,26,46]}$ This includes picrate ILs without the hydroxy functionalization. ${ }^{[47]}$ Instead, a classical H-bonding interaction between the cation's hydroxyl group and the phenoxide group of the picrate anion is observed. Figure 2 shows that the anion is preferably located\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8181c4d6fa78a2ea82dag-3_1363_1720_316_850}\n\\end{center}\n\nFigure 2. Intermolecular interactions for the ion pair in $\\mathrm{C}_{2} \\mathrm{OHmimPic}$, obtained from DFT calculations.\n\nabove the cation with the length of the optimized hydrogen bond being $1.78 \\AA$ A.\n\nAs aforesaid, the calculation of isolated ions or ion pairs is simplistic and it is difficult to draw conclusions for the real material. Therefore, the next step increased the level of complexity by considering a molecular cluster comprising of two ion pairs. The optimized geometry is displayed in Figure 3. The hydrogen bonding between the cationic hydroxyl group and the oxide in the anion can be observed in both ion pairs involved in the cluster. However, the length of this bond is elongated by $0.05 \\AA$ compared to the isolated ion pair. In other words, this hydrogen bond becomes weaker in the presence of further ion pairs. This weakening of the bond is a result of the interactions between the two ion pairs. Interestingly, they establish a kind of twin hydrogen bond doublet between the hydroxyl oxygen atom of one cation and the slightly acidic hydrogen atom at the $C(2)$ position of the other cation. These\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8181c4d6fa78a2ea82dag-3_224_661_1117_1853}\n\\end{center}\n\nFigure 3. Intermolecular Interactions of the dimeric ion pair obtained from DFT calculations.\n\nmutual H-bonds are identical in length $(1.96 \\AA)$. It can be concluded that the molecular interactions between the ion pairs in such a cluster are dominated by cation-cation interactions. The anions, on the other hand, do not engage in further strong/directional interactions, neither with a cation nor with the other anion.\n\nThe desribed interaction configuration means that each hydroxyl group is involved in two hydrogen bonds with different molecules similar to the situation often found in alkyl alcohols and water, ${ }^{[48,49]}$ but also in hydoxyl functionalized imidazolium-based ionic liquids with less bulky anions such as tetrafluoroborate and bis(trifluoromethanesulfonyl)imide. ${ }^{[50-52]}$ It is surprising to some extent, that such a configuration is identified in a cluster of rather complex and bulky molecules. In the liquid state, such a $\\mathrm{H}$-bond network exhibits a certain dynamic behavior resulting in a multitude of different bonding states. This gives rise to distinguishable vibrational frequencies, which manifest as broad $\\mathrm{OH}$ stretching bands. ${ }^{[53]}$ The discussion of the experimental vibrational spectra recorded in the solid state will shed some light at this in a later section of this paper.\n\nTo further characterize and understand the nature of these ion pair dimers, the electronic properties were studied. For this purpose, the highest and lowest occupied molecular orbitals were calculated. The electric transition that is close to the visible region is exclusively due to presence of the pricrate anion. The HOMO and LUMO orbitals of the isolated ion pair and the dimer are illustrated in Figures 4 and 5, respectively. In the isolated ion pair the electronic transition has an energy of\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8181c4d6fa78a2ea82dag-3_2133_2441_1089_1903}\n\\end{center}\n\nHOMO (-6.18 eV) LUMO (-2.42 eV)\n\nFigure 4. $\\mathrm{HOMO}$ and LUMO orbitals in the isolated $\\mathrm{C}_{2} \\mathrm{OHmimPic}$ ion pair.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_8181c4d6fa78a2ea82dag-4_220_472_176_988}\n\nHOMO (-6.46 eV) LUMO $(-2.75 \\mathrm{eV})$\n\nFigure 5. HOMO and LUMO orbitals in the $\\mathrm{C}_{2} \\mathrm{OHmimPic}$ ion pair dimer.\n\n$3.76 \\mathrm{eV}$, which corresponds to a wavelength of $329.75 \\mathrm{~nm}$, compared to $3.71 \\mathrm{eV}(334.19 \\mathrm{~nm})$ in the dimer.\n\nAs the hydroxyl groups as well as the $C(2)$ protons of the cation are mutually bound in the dimer formation, it is likely that these particular clusters form in the liquid state. Due to the bulkyness of the ions, larger clusters, in which the $\\mathrm{OH}$ groups of several cations are arranged in a ring configuration, ${ }^{[54]}$ are rather unlikely. In order to see whether or not the electronic transitions of the ion pair and its dimer can be found experimentally at room temperature, the crystalline material was dissolved in acetonitrile and water. Figure 6 shows the UV-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8181c4d6fa78a2ea82dag-4_1231_1762_157_1002}\n\\end{center}\n\nFigure 6. Experimental UV/Vis spectra of $\\mathrm{C}_{2} \\mathrm{OHmimPic}$ in $\\mathrm{ACN}$ and $\\mathrm{H}_{2} \\mathrm{O}$.\n\nVis absorption spectra of these solutions. Both spectra exhibit two bands, one between 300 and $450 \\mathrm{~nm}$ and one in the deep ultraviolet peaking around $200 \\mathrm{~nm}$. This is in very good agreement with the DFT results. The HOMO-LUMO analysis of the $\\mathrm{C}_{2} \\mathrm{OHmimPic}$ ion pair and the dimer yielded a transition around $330 \\mathrm{~nm}$. Solvent effects may explain the differences between the calculation and the experiment. ${ }^{[55]}$ The fact that the band maximum appears at different wavelengths for both solvents corroborates this hypothesis. From the DFT results, it was concluded that the band close to the visible part of the spectrum is exclusively from the picrate anion. On the other hand, the deep-UV band is most likely originating from the cation. A previous study of an imidazolium-based ionic liquid with the ethylsulfate anion showed that the imidazolium cation exhibits electronic transitions between 200 and $300 \\mathrm{~nm} .{ }^{[56]}$ The similarity in the peak shape lends further support to this interpretation. However, the data do not allow to make a conclusive and unambiguous statement about whether or not there are ion pairs or dimers in the solution. The impact of the interionic interactions on the molecular orbitals is not large enough.\n\n\\subsection{Ion Pairs and their Dimers in the Crystalline State}\nTo unravel the links between the idealistic situation of an ion pair or a small cluster and the real crystalline material at room temperature, the DFT calculations were compared with experimental data from the solid. For this purpose, the geometries of the ion pair and its dimer were deduced from Single Crystal Xray diffraction (SCXRD) measurements reported on the Cambridge Crystallographic Data Centre (CCDC, entry number 1550837). ${ }^{[7]}$ Table 1 compares selected geometric parameters\n\nTable 1. Experimentally and theoretically determined geometric parameters of $\\mathrm{C}_{2} \\mathrm{OH}$ mimPic ion pair and cluster.\n\n\\begin{center}\n\\begin{tabular}{llclc|}\n & Ion Pair & \\multicolumn{2}{c|}{Ion Pair Cluster} &  \\\\\n & Expt & DFT & Expt & DFT \\\\\n\\hline\n$\\mathrm{C}(2)-\\mathrm{H}-\\mathrm{O}^{*}$ & $-$ & $-$ & $2.03 \\AA$ & $1.96 \\AA$ \\\\\n$\\pi^{+}-\\mathrm{Pic}$ & $4.59 \\AA$ & $>5.00 \\AA$ & $4.59 \\AA$ & $>5.00 \\AA$ \\\\\nalkyl $\\mathrm{O}^{*} \\mathrm{H}-\\mathrm{Pic}$ & $2.07 \\AA$ & $1.78 \\AA$ & $2.07 \\AA$ & $1.83 \\AA$ \\\\\n$\\angle \\mathrm{C}(2)-\\mathrm{H}-\\mathrm{O}^{*}$ & $149.4^{\\circ}$ & $-$ & $149.4^{\\circ}$ & $164.1^{\\circ}$ \\\\\n$\\angle \\mathrm{N}_{1} \\mathrm{C}_{7} \\mathrm{C}_{8} \\mathrm{O}_{9}$ & $-67.3^{\\circ}$ & $-67.3^{\\circ}$ & $-67.3^{\\circ}$ & $-67.3^{\\circ}$ \\\\\n$\\mathrm{BE}$ & $-118.0 \\mathrm{kcal} / \\mathrm{mole}$ & $-22.3 \\mathrm{kcal} / \\mathrm{mole}$ &  &  \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nobtained by the DFT simulations and the SCXRD experiments. $\\mathrm{C}_{2} \\mathrm{OHmimPic}$ is found to be a monoclinic crystal system with space group $\\mathrm{P}_{2} / \\mathrm{n}$. Each asymmetric unit consists of one picrate anion and one dialkylimidazolium cation as can be seen in Figure 7. The dimeric ion pair geometry derived from the\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8181c4d6fa78a2ea82dag-4_1698_2049_1089_1880}\n\\end{center}\n\nFigure 7. Dimeric ion pair of $\\mathrm{C}_{2} \\mathrm{OHmimPic}$ from Solid state XRD (CCDCNo. 1550837).\n\ncrystallographic data suggests a primary interionic interaction in terms of alkyl-OH-Pic hydrogen bonding. This bond is $2.07 \\AA$ long, which is about $16 \\%$ and $13 \\%$ longer than the distances calculated in the isolated ion pair and the dimeric cluster, respectively. In addition, a weak $\\pi-\\pi$ stacking interaction involving the picrate and imidazolium rings is found. This has not been suggested for the simplistic cases discussed in the preceding section. The distance between the aromatic rings of the cations and anions is $4.59 \\AA$ A. As observed in the gas phase ion pair cluster, the experimental data support the ion pair interaction in terms of twining $\\mathrm{C}(2)-\\mathrm{H}-\\mathrm{O}^{*} \\quad \\mathrm{H}$-bonding interactions between two imidazolium rings. The length of the bond is found to be $2.03 \\AA$, which is only slightly longer $(\\sim 4 \\%)$ than the value determined in the DFT case and therefore means a good agreement. The dimeric ion pair cluster poses a stronger $\\mathrm{H}$ bond network via $\\mathrm{C}(2)-\\mathrm{H}-\\mathrm{O}^{*} \\mathrm{H}$-bonding interaction, where the anion is located at the top of the $\\mathrm{C}(2)-\\mathrm{H}$ group in such a way that the picrate anion forms $\\mathrm{H}$-bonds with the alkyl $\\mathrm{OH}$ making one centre $\\left(\\mathrm{O}^{*}\\right)$ with two interaction sites $\\left(\\mathrm{C}(2)-\\mathrm{H}-\\mathrm{O}^{*}\\right.$ and alkyl OH-Pic). This cluster model calculation strongly follows the same pattern of interaction as in the single ion pair and the dimeric ion pair cluster. These stable geometries were confirmed to be local minima on the potential energy surface through vibrational frequency analysis (no imaginary components). Their optimized energies, relative energies, and binding energies (BE), along with the BSSE corrected energies, are listed in Table 1 . It is noteworthy, that the binding energy of the ion pair dimer is less than $1 / 5$ of the value determined for the isolated ion pair. This highlights the high stability of the dimers and indicates them being a preferred configuration.\n\nIn the final step of this study, we consider the extented crystalline material. The crystal packing and molecular interactions derived from the SCXRD experiments are illustrated in Figure 8. In addition to the finding regarding the $\\mathrm{C}_{2} \\mathrm{OHmimPic}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8181c4d6fa78a2ea82dag-5_1352_1709_179_980}\n\\end{center}\n\nFigure 8. Crystal packing and intermolecular interactions of $\\mathrm{C}_{2} \\mathrm{OHmimPic}$ (CCDCNo. 1550837).\n\nion pair and dimer, a strong $\\pi-\\pi$ stacking interaction with an interacting distance of $3.66 \\AA$ involving picrate rings of two different ion pair dimers is observed. This distance is significantly shorter than the standard distance between picrate anion stacking (4.0 A) reported in the literature. ${ }^{[31]}$ In addition, we found further $\\pi-\\pi$ stacking interactions between imidazolium cation rings $(3.69 \\AA$ ). Due to these interactions, the ions are found to be arranged as a corrugated sheet array as highlighted in Figure 8 . It is also observed that the picrate rings do not remain face to face but appear slightly displaced laterally. This orientation perhaps favors a 'head-tail' interaction between two layers of picrate rings instead of a ring to ring interaction.\n\nTo further investigate the network of molecular interactions yielding the decribed crystal structure, Raman measurements were carried out. Figure 9 shows the enlarged fingerprint and $\\mathrm{CH} / \\mathrm{OH}$ stretching regions in panel a) and b), respectively, and\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_8181c4d6fa78a2ea82dag-5_208_1300_1050_1896}\n\nFigure 9. Experimental Raman spectra of $\\mathrm{C}_{2} \\mathrm{OHmimPic}$ (at region: 200$\\left.800 \\mathrm{~cm}^{-1}\\right)$.\n\nTable 2 summarizes the results of the vibrational analysis. The region displayed in Figure $9 \\mathrm{~b}$ is characteristic of the $\\mathrm{CH}$ and $\\mathrm{OH}$ stretching modes. The range from 2700 to $\\sim 3000 \\mathrm{~cm}^{-1}$ is attributed to aliphatic $\\mathrm{C}-\\mathrm{H}$ stretching modes, while the aromatic $\\mathrm{CH}$ groups vibrate at higher frequency manifesting between 3000 and $3200 \\mathrm{~cm}^{-1}$. The rather weak signals marked by arrows in Figure $3 \\mathrm{~b}$ originate from $\\mathrm{OH}$ stretching vibrations. Those OH stretching bands are located at 3417 and $3646 \\mathrm{~cm}^{-1}$. The former has a moderate intensity while the latter is extremely weak. The fact that the $\\mathrm{OH}$ stretching peaks appear at two distinct wavenumbers indicates that the $\\mathrm{OH}$ groups exist in only two distinct states: strongly hydrogen-bonded $\\mathrm{OH}$ and free $\\mathrm{OH}$. The free $\\mathrm{OH}$ wavenumber is virtually identical with the corresponding value in liquid alcohols and water. $^{[48,57]}$ This supports that these $\\mathrm{OH}$ groups are not participating in any intermolecular interaction. The band at $3417 \\mathrm{~cm}^{-1}$ is close to the wavenumber observed for asymmetrically hydrogenbonded water molecules. ${ }^{[49,58]}$ This strongly corroborates our hypothesis that each $\\mathrm{OH}$ group in $\\mathrm{C}_{2} \\mathrm{OHmimPic}$ is involved in two hydrogen bonding interactions. The free $\\mathrm{OH}$ groups can be attributed to signals generated at the crystal surface.\n\nThe $\\mathrm{CH}$ stretching region exhibits significantly stronger signals due to the higher Raman scattering cross section of the $\\mathrm{CH}$ groups and their higher amount. The previously discussed data suggested that the $\\mathrm{C}(2)-\\mathrm{H}$ group of the cation forms a $\\mathrm{H}$ bond with the $\\mathrm{O}^{*}$ atom of the alkyl hydroxyl group of another cation. The other $\\mathrm{CH}$ groups (neither aliphatic nor aromatic) Table 2. Observed Raman bands and their assignment: $(v w=$ very weak, $\\mathrm{w}=$ weak, $\\mathrm{m}=$ medium, $\\mathrm{s}=$ strong, $\\mathrm{sh}=$ shoulder, str $=$ stretch, $\\mathrm{d}=$ deformation, bend = bending deformation, $\\omega=$ wagging, $\\rho=$ rocking, $s=$ symmetric, as =antisymmetric). A scaling factor of $0.9439$ was applied to the calculated wavenumbers in the $\\mathrm{CH}$ stretching region.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_8181c4d6fa78a2ea82dag-6_400_1890_153_1012}\n\\end{center}\n\nseemed to not participate in hydrogen bonding interactions. The Raman spectrum is supposed to provide further insights here.\n\nThe detailed assignment of the $\\mathrm{CH}$ bands is subject to an ongoing debate in the community. ${ }^{[59-62]}$ In the following, we use an assignment that is in concert with our previous studies. ${ }^{[26,63,64]}$ The assignments presented in the following are based on our previous work on imidazolium-based ionic liquids and the recent studies of two $\\left[\\mathrm{C}_{2} \\mathrm{OHmim}\\right]^{+}$-based $\\mathrm{ILs}^{[65]}$ and an ammoniumbased picrate salt. ${ }^{[66]}$ The two high-wavenumber modes at 3151 and $3132 \\mathrm{~cm}^{-1}$ can be assigned to stretching vibrations of the $\\mathrm{C}(4 / 5)-\\mathrm{H}$ groups. They exhibit a slightly different frequency due to the fact that they experience a slightly different chemical environment within the crystal, as can be seen in Figure 3. The $\\mathrm{C}(2)-\\mathrm{H}$ stretch is observed at lower wavenumber $\\left(3106 \\mathrm{~cm}^{-1}\\right)$ because of the hydrogen bonding interactions. These findings support the above discussion where we concluded that hydrogen bonding takes place between the $\\mathrm{OH}$ and $\\mathrm{C}(2)-\\mathrm{H}$ groups of the cations. Strong interactions between the cation $\\mathrm{C}(2)-\\mathrm{H}$ and the anion $\\mathrm{O}^{-}$, which were observed in 1-alkyl-3-methylimidazlium picrates, ${ }^{[47]}$ do not take place in $\\mathrm{C}_{2} \\mathrm{OHmimPic}$. The $\\mathrm{C}(4 / 5)-\\mathrm{H}$ vibrations, on the other hand, are influenced by electrostatic forces as well as indirectly through the $\\pi-\\pi$ stacking of the aromatic rings. The signatures between 3000 and $3100 \\mathrm{~cm}^{-1}$ are attributed to the two aromatic $\\mathrm{CH}$ groups in the picrate anion, which is in good agreement with Raman data on other picrate compounds. ${ }^{[67]}$ In the range from 2800 to $3000 \\mathrm{~cm}^{-1}$, the stretching modes of the aliphatic $\\mathrm{CH}$ groups appear. There are two pairs of $\\mathrm{CH}_{2}$ modes due to the fact that the two $\\mathrm{CH}_{2}$ groups in the hydroxyethyl chain are chemically slightly different as one is neighboring an oxygen and the other one a nitrogen atom.\n\nFurther molecular information about both cation and anion can be obtained from the fingerprint region. In the experimental Raman spectrum, only a single $C=C$ band is found at $1566 \\mathrm{~cm}^{-1}$. The shape of the band, however, is non-symmetric and reveals a weak shoulder at $1576 \\mathrm{~cm}^{-1}$. The main band is likely originating from the picrate, while the shoulder can be assigned to the imidazolium cation. This is in agreement with the literature. ${ }^{[65,66]}$\n\nThe fingerprint region of Raman spectra has often been used to study conformational isomerism in imidazolium ILs, ${ }^{[22,68-71]}$ when alkyl chains with more than two carbon atoms are present. The majority of studies focused on butyl chains, which can exist in a trans and a gauche conformation. ${ }^{[72,73]}$ The bands between 600 and $650 \\mathrm{~cm}^{-1}$ have been identified as suitable markers for the conformation of the side chain. In butyl chains, a band at $\\sim 625 \\mathrm{~cm}^{-1}$ indicates the trans conformation and a band at $\\sim 603 \\mathrm{~cm}^{-1}$ is characteristic of the gauche isomer. In our experimental data, we observe a medium intensity band at $604 \\mathrm{~cm}^{-1}$ and a very weak band at $624 \\mathrm{~cm}^{-1}$. The intensity of the $604 \\mathrm{~cm}^{-1}$ line is more than a factor of ten stronger and hence it can be concluded that the hydroxyethyl group exists predominantly in the gauche conformation. This supports the results from the SCXRD and DFT investigations, where the data indicated that the hydroxyethyl group only exists as gauche conformer in the solid state (Figure 1 and 2). The weak trans signature observed in the Raman spectrum may be due to contributions from the surface or from defects inside the crystal.\n\n\\section{Conclusions}\nIn this paper, we have studied a hydroxyl functionalized imidazolium-picrate, namely 1-(2-hydroxyethyl)-3-methylimidazolium picrate $\\left(\\mathrm{C}_{2} \\mathrm{OHmimPic}\\right)$ by means of experiments and theoretical calculations. The aim was to investigate whether or not the structures theoretically predicted for isolated ion pairs and ion pair dimers can be found in the solid material at room temperature. It was shown that the commonly observed $\\mathrm{C}(2)-\\mathrm{H}$-anion hydrogen bonding interactions do not take place. Instead, the hydroxyl group of the cation establishes a hydrogen bond with the picrate anion. When two ion pairs are close to each other, they establish a highly interesting pattern, which is dominated by cation-cation interactions: the hydroxyl oxygen atoms form $\\mathrm{H}$-bonds with the $\\mathrm{C}(2)-\\mathrm{H}$ protons to give a distinct dimer. The hydrogen atoms of the $\\mathrm{OH}$ groups continue to interact with the picrate anions. The resulting ion pair dimers have also been identified in the XRD experiments and where supported by the Raman data. In addition, two types of $\\pi-\\pi$ stacking interactions were observed in the crystalline material: $\\pi-\\pi$ stacking of two picrate rings (interaction distance $3.66 \\AA$ ) and $\\pi-\\pi$ stacking between imidazolium cation rings at $3.69 \\AA$ A. These arrangements result in a layered molecular structure of the crystal and promote the stability of the ion pair dimers. Evidence for such distinct ion pair dimers within a crystal lattice of a solidified ionic liquid has not been shown before, to the best of our knowledge. The applied analytical approach of combining DFT calculations of isolated ion pairs and dimers with experimental techniques providing chemical and vibrational structure has shown its great potential for stuyding the physical chemistry of complex materials.\n\n\\section{Acknowledgment}\nSKP acknowledges to Prof. Puspendu K. Das for his suggestion and SERB for N-PDF post-doc fellowship (Scheme: N-PDF/2016/ 000041) at Department of Inorganic and Physical Chemistry (IPC), Indian Institute of Science (IISc), Bangalore-560012, India.\n\n\\section{Conflict of Interest}\nThe authors declare no conflict of interest.\n\nKeywords: cluster formation - density functional theory . hydrogen bonds $\\cdot$ ionic liquids $\\cdot$ ion-pairs\n\n[1] T. Welton, Chem. Rev. 1999, 99, 2071-2084.\n\n[2] D. R. MacFarlane, M. Forsyth, P. C. Howlett, J. M. Pringle, J. Sun, G. Annat, W. Neil, E. I. Izgorodina, Acc. Chem. Res. 2007, 40, 1165-1173.\n\n[3] M. C. Buzzeo, C. Hardacre, R. G. Compton, Anal. Chem. 2004, 76, 45834588.\n\n[4] M. C. Tseng, Y. H. Chu, Chem. Commun. 2010, 46, 2983-2985.\n\n[5] P. Wang, S. M. Zakeeruddin, I. Exnar, M. Grätzel, Chem. Commun. 2002, 2972-2973.\n\n[6] R. P. Singh, R. D. Verma, D. T. Meshri, J. M. Shreeve, Angew. Chem. Int. Ed. 2006, 45, 3584-3601; Angew. Chem. 2006, 118, 3664-3682.\n\n[7] H. Yang, Y. Liu, H. Ning, J. Lei, G. Hu, RSC Adv. 2017, 7, 33231-33240.\n\n[8] R. Gusain, O. P. Khatri, RSC Adv. 2015, 5, 25287-25294.\n\n[9] S. Millefiorini, A. H. Tkaczyk, R. Sedev, J. Efthimiadis, J. Ralston, J. Am. Chem. Soc. 2006, 128, 3098-3101.\n\n[10] Z. Liu, T. Cui, G. Z. Li, F. Endres, Langmuir. 2017, 33, 9539-9547.\n\n[11] M. P. Singh, R. K. Singh, S. Chandra, Prog. Mat. Sci. 2014, 64, 73-120.\n\n[12] E. I. Izgorodina, R. Maganti, V. Armel, P. M. Dean, J. M. Pringle, K. R. Seddon, D. R. MacFarlane, J. Phys. Chem. B. 2011, 115, 14688-14697.\n\n[13] M. Moosavi, F. Khashei, A. Sharifi, M. Mirzaei, Ind. Eng. Chem. Res. 2016, 55, 9087-9099.\n\n[14] K. Noack, P. S. Schulz, N. Paape, J. Kiefer, P. Wasserscheid, A. Leipertz, Phys. Chem. Chem. Phys. 2010, 12, 14153-14161.\n\n[15] S. Corderi, E. J. Gonzalez, N. Calvar, A. Dominguez, J. Chem. Thermodyn. 2012, 53, 60-66.\n\n[16] G. Giraud, C. M. Gordon, I. R. Dunkin, K. Wynne, J. Chem. Phys. 2003, $119,464-477$. [17] E. Gomez, N. Calvar, A. Dominguez, E. A. Macedo, Ind. Eng. Chem. Res. $2013,52,2103-2110$.\n\n[18] H. Jin, B. O'Hare, J. Dong, S. Arzhantsev, G. A. Baker, J. F. Wishart, A. J. Benesi, M. Maroncelli, J. Phys. Chem. B. 2008, 112, 81-92.\n\n[19] S. Katsyuba, E. Zvereva, A. Vidis, P. Dyson, J. Phys. Chem. A. 2007, 111, 352-370.\n\n[20] E. A. Turner, C. C. Pye, R. D. Singer, J. Phys. Chem. A. 2003, 107, 22772288.\n\n[21] P. A. Hunt, C. R. Ashworth, R. P. Matthews, Chem. Soc. Rev. 2015, 44, $1257-1288$\n\n[22] V. H. Paschoal, L. F. O. Faria, M. C. C. Ribeiro, Chem. Rev. 2017, 117, 70537112.\n\n[23] V. Kempter, B. Kirchner, J. Mol. Struct. 2010, 972, 22-34.\n\n[24] J. Kiefer, K. Noack, T. C. Penna, M. C. C. Ribeiro, H. Weber, B. Kirchner, Vib. Spectrosc. 2017, 91, 141-146.\n\n[25] N. Dias, K. Shimizu, P. Morgado, E. J. M. Filipe, J. N. Canongia Lopes, F. V. Chavez, J. Phys. Chem. B. 2014, 118, 5772-5780.\n\n[26] B. Haddad, D. Mokhtar, M. Goussem, E. H. Belarbi, D. Villemin, S. Bresson, M. Rahmouni, N. R. Dhumal, H. J. Kim, J. Kiefer, J. Mol. Struct. 2017, 1134, 582-590.\n\n[27] K. Fumino, S. Reimann, R. Ludwig, Phys. Chem. Chem. Phys. 2014, 16, 21903-21929.\n\n[28] M. Shokouhi, M. Adibi, A. H. Jalili, M. Hosseini-Jenab, A. Mehdizadeh, J. Chem. Engin. Data. 2010, 55, 1663-1668.\n\n[29] A. H. Jalili, A. Mahdizadeh, M. Shokouhi, H. Sakhaeinia, V. Taghikhani, J. Chem. Thermodyn. 2010, 42, 787-791.\n\n[30] S. V. Dzyuba, R. A. Bartsch, Tetrahedron Lett. 2002, 43, 4657.\n\n[31] J. D. Holbrey, M. B. Turner, W. M. Reichert, R. D. Rogers, Green Chem. $2003,5,731-736$.\n\n[32] S. Zhang, X. Qi, X. Ma, L. Lu, Y. Deng, J. Phys. Chem. B. 2010, 114, $3912-$ 3920.\n\n[33] L. C. Branco, J. N. Rosa, J. J. M. Ramos, C. A. M. Afonso, Chem. Eur. J. 2002, 8, 3671-3677.\n\n[34] J. Suna, S. Zhang, W. Cheng, J. Ren, Tetrahedron Lett. 2008, 49, 35883591.\n\n[35] N. Recham, L. Dupont, M. Courty, K. Djellab, D. Larcher, M. Armand, J. M. Tarascon, Chem. Mater. 2009, 21, 1096-1107.\n\n[36] X. Yang, N. Yan, Z. F. Fei, R. M. Crespo-Quesada, G. Laurenczy, L. KiwiMinsker, Y. Kou, Y. D. Li, P. J. Dyson, Inorg. Chem. 2008, 47, 7444-7446.\n\n[37] Y. Wu, T. Sasaki, K. Kazushi, T. Seo, K. Sakurai, J. Phys. Chem. B. 2008, 112, 7530-7536.\n\n[38] S. Zhang, Q. Zhang, B. Ye, X. Li, X. Zhang, Y. Deng, J. Phys. Chem. B. 2009, 113, 6012-6019.\n\n[39] S. Zhang, X. Qi, X. Ma, L. Lu, Y. Deng, J. Phys. Chem. B. 2010, 114, 39123920.\n\n[40] S. Zhang, X. Qi, X. Ma, L. Lu, Q. Zhang, Y. Deng, J. Phys. Org. Chem. 2012, $25,248-257$\n\n[41] M. Fakhraee, B. Zandkarimi, H. Salari, M. R. Gholami, J. Phys. Chem. B. 2014, 118, 14410-14428.\n\n[42] R. Krishnan, J. S. Binkley, R. Seeger, J. A. Pople, J. Chem. Phys. 1980, 72, 650-654.\n\n[43] R. Dennington, T. Keith, J. M. Millam, GaussView version 5, Semichem Inc., Shawnee Mission, KS, 2009.\n\n[44] M. J. Frisch, G. W. Trucks, H. B. Schlegel, G. E. Scuseria, M. A. Robb, J. R. Cheeseman, G. Scalmani, V. Barone, G. A. Petersson, H. Nakatsuji, X. Li, M. Caricato, A. Marenich, J. Bloino, B. G. Janesko, R. Gomperts, B. Mennucci, H. P. Hratchian, J. V. Ortiz, A. F. Izmaylov, J. L. Sonnenberg, D. Williams-Young, F. Ding, F. Lipparini, F. Egidi, J. Goings, B. Peng, A. Petrone, T. Henderson, D. Ranasinghe, V. G. Zakrzewski, J. Gao, N. Rega, G. Zheng, W. Liang, M. Hada, M. Ehara, K. Toyota, R. Fukuda, J. Hasegawa, M. Ishida, T. Nakajima, Y. Honda, O. Kitao, H. Nakai, T. Vreven, K. Throssell, J. A. Montgomery Jr., J. E. Peralta, F. Ogliaro, M. Bearpark, J. J. Heyd, E. Brothers, K. N. Kudin, V. N. Staroverov, T. Keith, R. Kobayashi, J. Normand, K. Raghavachari, A. Rendell, J. C. Burant, S. S. lyengar, J. Tomasi, M. Cossi, J. M. Millam, M. Klene, C. Adamo, R. Cammi, J. W. Ochterski, R. L. Martin, K. Morokuma, O. Farkas, J. B. Foresman, D. J. Fox, Gaussian 09, Revision A.02, Gaussian Inc., Wallingford CT, 2016\n\n[45] S. F. Boys, F. Bernardi, Mol. Phys. 1970, 19, 553-566.\n\n[46] N. R. Dhumal, K. Noack, J. Kiefer, H. J. Kim, J. Phys. Chem. A. 2014, 118, 2547-2557.\n\n[47] S. K. Panja, N. Dwivedi, H. Noothalapati, S. Shigeto, A. K. Sikder, A. Saha, S. S. Sunkari, S. Saha, Phys. Chem. Chem. Phys. 2015, 17, 18167-18177.\n\n[48] J. Kiefer, S. Wagenfeld, D. Kerle, Spectrochim. Acta Part A 2018, 189, 5765.\n\n[49] D. A. Schmidt, K. Miki, J. Phys. Chem. A. 2007, 111, 10119-10122. [50] A. Strate, T. Niemann, D. Michalik, R. Ludwig, Angew. Chem. Int. Ed. 2017, 56, 496-500; Angew. Chem. 2017, 129, 510-514.\n\n[51] A. Knorr, P. Stange, K. Fumino, F. Weinhold, R. Ludwig, ChemPhysChem. 2016, 17, 458-462.\n\n[52] F. S. Menges, H. J. Zeng, P. J. Kelleher, O. Gorlova, M. A. Johnson, T. Niemann, A. Strate, R. Ludwig, J. Phys. Chem. Lett. 2018, 9, 2979-2984.\n\n[53] F. Perakis, L. De Marco, A. Shalit, F. Tang, Z. R. Kann, T. D. Kühne, R. Torre, M. Bonn, Y. Nagata, Chem. Rev. 2016, 116, 7590-7607.\n\n[54] P. B. P. Serra, M. A. A. Rocha, B. Rathke, K. Ruzicka, M. Fulem, J. Kiefer, J. Mol. Liq. 2017, 244, 528-532.\n\n[55] F. M. Zehentbauer, C. Moretto, R. Stephen, T. Thevar, J. R. Gilchrist, D. Pokrajac, K. L. Richard, J. Kiefer, Spectrochim. Acta Part A 2014, 121, 147-151.\n\n[56] N. R. Dhumal, H. J. Kim, J. Kiefer, J. Phys. Chem. A. 2011, 115, 3551-3558.\n\n[57] V. M. Wallace, N. R. Dhumal, F. M. Zehentbauer, H. J. Kim, J. Kiefer, J. Phys. Chem. B. 2015, 119, 14780-14789.\n\n[58] J. Kiefer, K. Frank, F. M. Zehentbauer, H. P. Schuchmann, Biosensors. 2016, 6, 13.\n\n[59] J. Grondin, J. C. Lassègues, D. Cavagnat, T. Buffeteau, P. Johansson, R. Holomb, J. Raman Spectrosc. 2011, 42, 733-743.\n\n[60] J. C. Lassègues, J. Grondin, D. Cavagnat, P. Johansson, J. Phys. Chem. A. 2009, 113, 6419-6421.\n\n[61] J. C. Lassègues, J. Grondin, D. Cavagnat, P. Johansson, J. Phys. Chem. A. 2010, 114, 687-688.\n\n[62] A. Wulf, K. Fumino, R. Ludwig, J. Phys. Chem. A. 2010, 114, 685-686.\n\n[63] D. K. Singh, B. Rathke, J. Kiefer, A. Materny, J. Phys. Chem. A. 2016, 120, 6274-6286. [64] B. Haddad, J. Kiefer, H. Brahim, E. H. Belarbi, D. Villemin, S. Bresson, O. Abbas, M. Rahmouni, A. Paolone, O. Palumbo, Appl. Sci. 2018, 8, 1043.\n\n[65] Y. Chaker, H. Ilikti, M. Debdab, T. Moumene, E. H. Belarbi, A. Wadouachi, O. Abbas, B. Khelifa, S. Bresson, J. Mol. Struct. 2016, 1113, 182-190.\n\n[66] N. Sudharsana, A. Sharma, N. Kus, R. Fausto, M. Luisa Ramos, V. Krishnakumar, R. Pal, T. N. Guru Row, R. Nagalakshimi, J. Mol. Struct. 2016, 1104, 40-51.\n\n[67] S. Senthilkumar, M. Briget Mary, V. Ramakrishnan, J. Raman Spectrosc. 2007, 38, 288-294.\n\n[68] R. Holomb, A. Martinelli, I. Albinsson, J. C. Lassègues, P. Johansson, P. Jacobsson, J. Raman Spectrosc. 2008, 39, 793-805.\n\n[69] M. Herstedt, M. Smirnov, P. Johansson, M. Chami, J. Grondin, L. Servant, J. C. Lassègues, J. Raman Spectrosc. 2005, 36, 762-770.\n\n[70] J. Kiefer, C. C. Pye, J. Phys. Chem. A. 2010, 114, 6713-6720.\n\n[71] R. Ozawa, S. Hayashi, S. Saha, A. Kobayashi, H. Hamaguchi, Chem. Lett. 2003, 32, 948-949.\n\n[72] H. O. Hamaguchi, R. Ozawa, Adv. Chem. Phys. 2005, 131, 85-104.\n\n[73] H. Okajima, H. O. Hamaguchi, Chem. Lett. 2011, 40, 1308-1309.\n\nManuscript received: July 16,2018\n\nAccepted manuscript online: September 14, 2018\n\nVersion of record online: October 8,2018\n\n\n\\end{document}", "record_id": "2023_09_22_8181c4d6fa78a2ea82dag"}