{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\n\\title{VU Research Portal }\n\n\\author{}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nOrigins of the Endo and Exo Selectivities in Cyclopropenone, Iminocyclopropene, and Triafulvene Diels-Alder Cycloadditions\n\nLevandowski, Brian J.; Hamlin, Trevor A.; Helgeson, Roger C.; Bickelhaupt, F. Matthias; Houk, K. N.\n\n\\section{published in}\nJournal of Organic Chemistry\n\n2018\n\nDOI (link to publisher)\n\n10.1021/acs.joc.8b00025\n\n\\section{document version}\nPublisher's PDF, also known as Version of record\n\n\\section{document license}\nArticle 25fa Dutch Copyright Act\n\n\\section{Link to publication in VU Research Portal}\n\\section{citation for published version (APA)}\nLevandowski, B. J., Hamlin, T. A., Helgeson, R. C., Bickelhaupt, F. M., \\& Houk, K. N. (2018). Origins of the Endo and Exo Selectivities in Cyclopropenone, Iminocyclopropene, and Triafulvene Diels-Alder Cycloadditions. Journal of Organic Chemistry, 83(6), 3164-3170. \\href{https://doi.org/10.1021/acs.joc.8b00025}{https://doi.org/10.1021/acs.joc.8b00025}\n\nGeneral rights\\\\\nCopyright and moral rights for the publications made accessible in the public portal are retained by the authors and/or other copyright owners and it is a condition of accessing publications that users recognise and abide by the legal requirements associated with these rights.\n\n\\begin{itemize}\n  \\item Users may download and print one copy of any publication from the public portal for the purpose of private study or research.\n\n  \\item You may not further distribute the material or use it for any profit-making activity or commercial gain\n\n  \\item You may freely distribute the URL identifying the publication in the public portal ?\n\n\\end{itemize}\n\n\\section{Take down policy}\nIf you believe that this document breaches copyright please contact us providing details, and we will remove access to the work immediately and investigate your claim.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-2_179_321_193_1972}\n\\end{center}\n\nOrigins of the Endo and Exo Selectivities in Cyclopropenone, Iminocyclopropene, and Triafulvene Diels-Alder Cycloadditions\n\nBrian J. Levandowski, ${ }^{\\dagger} \\| \\odot$ Trevor A. Hamlin, ${ }^{\\ddagger, \\| l}$ Roger C. Helgeson, ${ }^{\\dagger}$ F. Matthias Bickelhaupt, ${ }^{*} \\neq, \\$ \\odot$ and K. N. Houk*\n\n${ }^{\\dagger}$ Department of Chemistry and Biochemistry, University of California, Los Angeles, California 90095, United States\n\n${ }^{\\ddagger}$ Department of Theoretical Chemistry and Amsterdam Center for Multiscale Modeling (ACMM), Vrije Universiteit Amsterdam, 1081 HV Amsterdam, The Netherlands\n\n${ }^{\\S}$ Institute for Molecules and Materials (IMM), Radboud University, $6525 \\mathrm{AJ}$ Nijmegen, The Netherlands\n\n(5) Supporting Information\n\n\\begin{abstract}\nThe endo and exo stereoselectivities of Diels-Alder reactions of cyclopropenone, iminocyclopropene, and substituted triafulvenes with butadiene were rationalized using density functional theory calculations. When cyclopropenone is the dienophile, there is a $1.8 \\mathrm{kcal} / \\mathrm{mol}$ preference for the exo cycloaddition with butadiene, while the reaction of 3-difluoromethylene triafulvene with butadiene favors the endo cycloaddition by $2.8 \\mathrm{kcal} /$ mol. The influence of charge transfer and secondary orbital interactions on the stereoselectivity of Diels-Alder reactions involving triafulvenes and heteroanalogs is discussed. The predicted stereoselectivity correlates with both the charge and highest occupied molecular orbital (HOMO) coefficient at the $\\mathrm{C}_{3}$ carbon of the triafulvene motif.\n\\end{abstract}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-2_974_1263_1310_1538}\n\\end{center}\n\nSOl : Endo\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-2_958_1218_1621_1954}\n\\end{center}\n\nNo SOI : Exo\n\n\\section{INTRODUCTION}\nIn 1969, Breslow reported that the Diels-Alder reaction of cyclopropenone with 1,3 -diphenylisobenzofuran proceeds with unusual exo stereoselectivity (Scheme 1). ${ }^{1}$ Berson reinvestigated\n\nScheme 1. Diels-Alder Reaction of Cyclopropenone and 1,3Diphenylisobenzofuran\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_430c3ddffa99af6a2545g-2_1764_1920_192_1050}\n\nendo\n\nexo\n\nthis reaction in 1994 and confirmed the exo-selectivity of cyclopropenone with 1,3-diphenylisobenzofuran by obtaining the crystal structures of the endo and exo Diels-Alder adducts. ${ }^{2}$ Analysis of the reaction kinetics at $-30^{\\circ} \\mathrm{C}$ revealed an estimated preference of $50: 1$ exo/endo.\n\nBachrach computationally analyzed the Diels-Alder reaction between cyclopropenone and furan at the MP2 level. ${ }^{3} \\mathrm{He}$ computed a $1.8 \\mathrm{kcal} / \\mathrm{mol}$ kinetic and a $6.4 \\mathrm{kcal} / \\mathrm{mol}$ thermodynamic preference for the exo adduct. The exo preference was attributed to a stabilizing electrostatic interaction between the oxygen atom of furan and the carbonyl carbon of the cyclopropenone in the exo transition state (Scheme 2). ${ }^{3}$ Recently, we computed that cyclopropenone also reacts with exo stereoselectivity when cyclopentadiene is the diene, ${ }^{4}$ in contrast to the highly endo selective cyclopropene. ${ }^{5}$ This discovery, and the fact that cyclopropenones have emerged as Scheme 2. Stabilizing Electrostatic Interaction Proposed by Bachrach in the Exo Transition State for the Diels-Alder Reaction of Furan with Cyclopropenone ${ }^{3}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-2_1597_1722_1457_1629}\n\\end{center}\n\nstable, minimally invasive probes for bioorthogonal labeling studies, ${ }^{6}$ prompted us to systematically study the origins of the endo and exo Diels-Alder stereoselectivity of cyclopropenone (1), cyclopropenethione (2), iminocyclopropene (4), the iminium derivative $(3)$, and triafulvenes $(5-7)$, with butadiene (Bd) (Scheme 3).\n\n\\section{COMPUTATIONAL METHODS}\nComputations were carried out with Gaussian 09, revision D.01. Geometry optimizations and vibrational frequency calculations were performed using the M06- $2 \\mathrm{X}^{8}$ density functional with the $6-31+\\mathrm{G}(\\mathrm{d})$ basis set. Single-point energies were calculated at the M06-2X/6-311+ $+\\mathrm{G}(\\mathrm{d}, \\mathrm{p})$ level of theory. The M06-2X functional has been shown to\n\nScheme 3. Cyclopropenone (1) and Analogs (2-7)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-2_2349_2502_1156_1914}\n\\end{center}\n\nReceived: January 4, 2018\n\nPublished: February 22, 2018\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-3_225_1590_529_1625}\n\\end{center}\n\nFigure 1. Computed Diels-Alder transition structures for the reactions of butadiene (Bd) with triafulvenes $\\mathbf{1 - 7}$. The two forming bond lengths are reported in angstroms, and activation free energies $\\Delta G^{\\ddagger}$ are reported in $\\mathrm{kcal} / \\mathrm{mol}$.\n\nprovide relatively accurate energies for cycloadditions. ${ }^{9}$ Solvation effects of dichloromethane (DCM) were included in the optimizations and single-point energies using the self-consistent reaction field (SCRF) using the CPCM model. ${ }^{10}$ Normal mode analysis was used to verify each stationary point as either a first-order saddle point or a minimum. The thermal corrections were computed from unscaled $M 06-2 X / 6-31+G(d)$ frequencies for a $1 \\mathrm{M}$ standard state and $298.15 \\mathrm{~K}$. Truhlar's quasiharmonic correction was applied by setting all positive frequencies below $100 \\mathrm{~cm}^{-1}$ to $100 \\mathrm{~cm}^{-1}$. 11 The molecular orbital coefficients from the outer Gaussian function charges were calculated from natural bond orbital (NBO) analysis at the $\\mathrm{HF} / 6-31 \\mathrm{G}(\\mathrm{d}) / / \\mathrm{CPCM}-(\\mathrm{DCM})$-M06$2 \\mathrm{X} / 6-31+\\mathrm{G}(\\mathrm{d})$ level of theory. ${ }^{12}$\n\nInsight into the origins of the endo and exo stereoselectivity was provided by the distortion/interaction-activation strain model (D/IASM). ${ }^{13}$ This analysis was performed using the ADF.2016.102 program $^{14}$ at the M06-2X/TZ2P ${ }^{8,15}$ level of theory on the geometries optimized at CPCM-(DCM)-M06-2X/6-31+G(d) in Gaussian 09. In this framework, the potential energy surface in solution $\\Delta E_{\\text {solution }}(\\zeta)$ is decomposed along the reaction coordinate $\\zeta$ into the energy of the solute $\\Delta E_{\\text {solute }}(\\zeta)$, specifically the reaction system in vacuum with the solution phase geometry, plus the solvation energy $\\Delta E_{\\text {solvation }}(\\zeta) .{ }^{16}$\n\n\\[\n\\Delta E_{\\text {solution }}(\\zeta)=\\Delta E_{\\text {solute }}(\\zeta)+\\Delta E_{\\text {solvation }}(\\zeta)\n\\]\n\nNext, the intrinsic energy of the solute $\\Delta E_{\\text {solute }}(\\zeta)$ is separated into the strain $\\Delta E_{\\text {strain }}(\\zeta)$ associated with deforming the individual solute reactants, plus the interaction $\\Delta E_{\\text {int }}(\\zeta)$ between the deformed solute reactants.\n\n\\[\n\\Delta E_{\\text {solute }}(\\zeta)=\\Delta E_{\\text {strain }}(\\zeta)+\\Delta E_{\\text {int }}(\\zeta)\n\\]\n\nThe $\\Delta E_{\\text {int }}(\\zeta)$ between the reactants is further analyzed by an energy decomposition analysis (EDA) in the conceptual framework provided by the Kohn-Sham molecular orbital (KS-MO) model $^{17}$ and is decomposed into three physically meaningful terms:\n\n\\[\n\\Delta E_{\\text {int }}(\\zeta)=\\Delta V_{\\text {elstat }}(\\zeta)+\\Delta E_{\\text {pauli }}(\\zeta)+\\Delta E_{\\text {oi }}(\\zeta)\n\\]\n\nThe $\\Delta V_{\\text {elstat }}(\\zeta)$ term corresponds to the classical electrostatic interaction between unperturbed charge distributions, $\\Delta E_{\\text {Pauli }}(\\zeta)$ is responsible for any steric repulsion, and the $\\Delta E_{\\mathrm{oi}}(\\zeta)$ accounts for charge transfer (HOMO-LUMO interactions) and polarization.\n\n\\section{RESULTS AND DISCUSSION}\nFigure 1 shows the endo and exo transition states for the DielsAlder reactions of butadiene $(\\mathbf{B d})$ with triafulvenes $(1-7)$. The computed activation free energies $\\left(\\Delta G^{\\ddagger}\\right)$ are shown below each structure, in $\\mathrm{kcal} / \\mathrm{mol}$. For the endo and exo Diels-Alder reactions with $\\mathbf{B d}$, the activation free energies are in the range $21-29$ and $20-27 \\mathrm{kcal} / \\mathrm{mol}$, respectively. The stereoselectivities of the triafulvene cycloadditions range from a $1.8 \\mathrm{kcal} / \\mathrm{mol}$ exo preference to a $2.8 \\mathrm{kcal} / \\mathrm{mol}$ endo preference. The cycloaddition of $\\mathbf{B d}$ with cyclopropenone (1) favors the exo approach by $1.8$ $\\mathrm{kcal} / \\mathrm{mol}$, whereas the 3-difluoromethylene triafulvene (7) cycloaddition favors the endo reaction by $2.8 \\mathrm{kcal} / \\mathrm{mol}$. The\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-4_222_550_221_1023}\n\\end{center}\n\nFigure 2. Isodesmic equation relating the stability of substituted cyclopropenes (triafulvenes) to substituted cyclopropanes with the computed reaction enthalpies $\\left(\\Delta H_{\\mathrm{ASE}}\\right)$ of triafulvenes $\\mathbf{1 - 7}$ in the above isodesmic equation.\n\nactivation free energies for neutral triafulvene analogs range from $21.8$ to $28.6$ and from $24.4$ to $26.8$ in the endo and exo reactions, respectively. The activation free energies for the positively charged iminium cyclopropene (3) with a low lying lowest unoccupied molecular orbital (LUMO) energy are $20.5$ and $19.5$ for the endo and exo transition states, respectively.\n\nThe effect of each exocyclic cyclopropene group on the stability of $1-7$ was assessed using the isodesmic reaction shown in Figure 2, which relates the stability of the triafulvene to a similarly substituted cyclopropane. All of the groups stabilize the cyclopropene to a greater extent than they stabilize the cyclopropane. We call this aromatic stabilization energy (ASE) since the substituted cyclopropenes have cyclic, potentially aromatic conjugation in the three-membered ring. A more positive number represents greater stability of the substituted cyclopropene compared to the substituted cyclopropane. Schleyer has shown that effects of resonance and hyperconjugation are also included in this isodesmic equation. ${ }^{18}$ The substituents have a strong influence on the stability of the cyclopropene. For triafulvenes $\\mathbf{1 - 7}$, the calculated aromatic stabilization enthalpies (ASE) are all stabilizing and range from $4.2$ to $26.2 \\mathrm{kcal} / \\mathrm{mol}$. The variation in stabilization arises primarily from differences in the aromaticity of the unsaturated three-membered ring. Electronegative substituents polarize the exocyclic double bond away from the cyclopropene ring, which causes the cyclopropene rings of these compounds to more closely resemble the $2 \\pi$ electron aromatic cyclopropenylium cation. The $\\pi$-donor $\\mathrm{F}$ destabilizes the triafulvene motif by increasing the four-electron character, thus decreasing the aromatic character of the cyclopropene ring.\n\nThe Diels-Alder reactions of $\\mathbf{B d}$ with cyclopropenes $(\\mathbf{1}-\\mathbf{7})$ are exergonic by $-41$ to $-63 \\mathrm{kcal} / \\mathrm{mol}$. Consistent with the Hammond postulate, the timing of the transition structures generally becomes earlier as the reaction is more exergonic. As shown in Figure 3a, there is no correlation between the activation enthalpies and the aromatic stabilization enthalpies $(2,3$, and 5 are outliers). Figure $3 b$ shows that there is a linear correlation between the exothermicity of reaction $\\left(\\Delta H_{\\mathrm{rxn}}\\right)$ and the aromatic stabilization energy of the triafulvene. The substituents have a significant effect on the reaction free energy, by stabilizing the reactants, but have little effect on the product or on the activation energies.\n\nApplication of the distortion/interaction-activation strain model (D/I-ASM) provided quantitative insight into the origins of the reactivity differences and endo and exo stereoselectivity. ${ }^{13}$ Figure $4 \\mathrm{a}$ shows the results of our analysis for the endo (black) and exo (red) Diels-Alder reactions of Bd with 3-difluoromethylene triafulvene (7). The strain, or distortion, curves are nearly identical along the respective reaction coordinates, and the endo selectivity is a result of the differences in the interaction energies. Figure $4 \\mathrm{~b}$ shows the decomposition of the interaction energy for the endo (black) and exo (red) Diels-Alder reactions of $\\mathbf{B d}$ with 7 along the reaction coordinate. The Pauli repulsion and electrostatic terms are nearly identical along the reaction coordinate. The differences in the strength of the orbital interactions in the endo and exo reactions are responsible for the endo Diels-Alder stereoselectivity of 7.\n\nThe results from the distortion/interaction-activation strain model along the reaction coordinate for the endo (black) and exo (red) Diels-Alder reactions of Bd with cyclopropenone (1) are shown in Figure 5a. The strain curves are nearly identical for the endo and exo reactions, and the exo stereoselectivity results from differences in interaction energies. Figure $5 b$ shows the\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-4_1751_2495_1084_1847}\n\\end{center}\n\nFigure 3. (a) Plot of the activation enthalpies $\\left(\\Delta H^{\\ddagger}\\right)$ of the Diels-Alder reactions of $\\mathbf{1}-7$ with butadiene (Bd) versus the aromatic stabilization enthalpies $\\left(\\Delta H_{\\mathrm{ASE}}\\right)$ (blue endo, red exo). (b) Plot of the reaction enthalpies $\\left(\\Delta H_{\\mathrm{rxn}}\\right)$ versus the aromatic stabilization enthalpies $\\left(\\Delta H_{\\mathrm{ASE}}\\right)$ for the DielsAlder reactions of $1-7$ with butadiene $(\\mathbf{B d})\\left(\\Delta H_{\\mathrm{rxn}}=1.00 \\Delta H_{\\mathrm{ASE}}-66.5, r^{2}=0.99\\right)$.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_430c3ddffa99af6a2545g-5_226_906_415_1755}\n\nFigure 4. (a) Distortion/interaction-activation strain and (b) energy decomposition analyses of the endo (black) and exo (red) cycloaddition reactions of butadiene $(\\mathbf{B d})$ with 3-difluoromethylene triafulvene (7).\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_430c3ddffa99af6a2545g-5_1020_1646_466_1708}\n\nFigure 5. (a) Distortion/interaction-activation strain and (b) energy decomposition analyses of the endo (black) and exo (red) cycloaddition reactions of butadiene $(\\mathbf{B d})$ with cyclopropenone (1).\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_430c3ddffa99af6a2545g-5_1764_2082_347_1825}\n\nFigure 6. Sum of charges across the butadiene $(\\mathrm{Bd})$ atoms, charge at the $\\mathrm{C}_{3}$ position of the triafulvene, and the $\\mathrm{C}_{3} \\mathrm{p}$-orbital coefficient of the triafulvenes and heteroanalogs HOMO obtained from the endo transition state structures for triafulvenes 1-7. Primary orbital interactions and secondary orbital interactions are represented by blue and red lines, respectively.\n\ndecomposition of the interaction energies into the electrostatic, Pauli repulsion and orbital components along the IRC. The exo selectivity of cyclopropenone (1) results from the combination of the electrostatic and orbital interactions, which overrule the endo preference of the Pauli repulsion and favor the exo transition state.\n\nFigure 6 summarizes the NBO charges at the $C_{3}$ position of the triafulvene and heteroatom analogs $1-7$, along with the sum of charges across all atoms of $\\mathbf{B d}$, and the $\\mathrm{C}_{3} \\mathrm{p}$-orbital coefficient of the triafulvene HOMO in the endo transition states. Secondary orbital interactions (SOI) involve overlap of the $\\mathrm{C}_{2}$ and $\\mathrm{C}_{3} \\mathrm{p}$ orbitals of the $\\mathbf{B d}$ LUMO with the $\\mathrm{C}_{3}$ p-orbital of the cyclopropene $\\mathrm{HOMO}$ in the endo transition state. The $\\mathrm{C}_{3} \\mathrm{p}$ orbital coefficients in the HOMO of $1-7$ range from $0.0$ to $0.26$. The charges at the $\\mathrm{C}_{3}$ position of $\\mathbf{1}-7$ range from $-0.18$ to $0.61$. Polarization of the exocyclic $\\pi$-bond diminishes the $\\pi$-electron density at the $\\mathrm{C}_{3}$ position and weakens the strength of the SOI. 3Difluoromethylene has the largest p-orbital coefficient and the most negative charge at $C_{3}$ and is the most endo selective. Cyclopropenone (1) with the smallest p-orbital HOMO a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-6_232_590_394_1021}\n\\end{center}\n\n\\begin{center}\n\\begin{tabular}{ccc}\n & $\\Delta \\varepsilon$ HOMO(Bd)-LUMO(7) $(\\mathrm{eV})$ & Orbital Overlap (S) \\\\\n\\hline\nendo & $6.3$ & $0.25$ \\\\\nexo & $6.3$ & $0.25$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nb)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-6_243_590_1173_1736}\n\\end{center}\n\n\\begin{center}\n\\begin{tabular}{ccc}\n & $\\Delta \\varepsilon$ HOMO(7)-LUMO(Bd) $(\\mathrm{eV})$ & Orbital Overlap (S) \\\\\n\\hline\nendo & $6.4$ & $0.17$ \\\\\nexo & $6.4$ & $0.11$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nFigure 7. MO diagram with orbital energy gap and overlap of (a) the $\\mathrm{HOMO}(\\mathbf{B d})-L U M O(7)$ interaction and (b) the $\\mathrm{HOMO}(7)-L U M O(\\mathbf{B d})$ for the cycloaddition between butadiene $(\\mathbf{B d})$ and 3,3-difluoromethylene triafulvene $(7)$, computed on structures with $\\mathrm{C} \\cdots \\mathrm{C}$ bond forming distances of $2.24 \\AA$ Å.\n\na)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-6_1048_1372_391_1007}\n\\end{center}\n\n\\begin{center}\n\\begin{tabular}{ccc}\n & $\\Delta \\varepsilon$ HOMO(Bd)-LUMO(1) (eV) & Orbital Overlap (S) \\\\\n\\hline\nendo & $6.3$ & $0.24$ \\\\\nexo & $6.3$ & $0.25$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nb)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-6_923_1375_1177_1732}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-6_1395_1536_1091_1773}\n\\end{center}\n\nFigure 8. MO diagram with orbital energy gap and overlap of the $\\mathrm{HOMO}(\\mathbf{B d})-\\operatorname{LUMO}(\\mathbf{1})$ interaction for the cycloaddition between butadiene $(\\mathbf{B d})$ and cyclopropenone (1), computed on structures with C $\\cdots \\mathrm{C}$ bond forming distances of $2.24 \\AA$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-6_1661_1947_240_1003}\n\\end{center}\n\nFigure 9. Charge transfer in the endo and exo transition structures for the Diels-Alder reactions of butadiene $(\\mathbf{B d})$ with a generic triafulvene. The primary orbital interactions and charge transfer are represented by blue and red lines, respectively.\n\ncoefficient and the strongest positive charge at the $\\mathrm{C}_{3}$ is the most exo selective.\n\nWe next performed molecular orbital analyses to quantify the contribution of the SOI in the endo reactions of $\\mathbf{1}$ and 7 with $\\mathbf{B d}$ (Figure 7). The molecular orbital (MO) diagrams and overlaps were calculated at the M06-2X/TZ2P//CPCM-(DCM)-M06$2 \\mathrm{X} / 6-31+\\mathrm{g}(\\mathrm{d})$ level of theory by using Kohn-Sham ${ }^{19} \\mathrm{MO}$ analyses on the geometries at $\\mathrm{C} \\cdots \\mathrm{C}$ bond forming distances of $2.24 \\AA$ A. In the Diels-Alder reaction of 7 with Bd, the FMO energy gap $(\\Delta \\varepsilon=6.3 \\mathrm{eV})$ and the orbital overlap $(S=0.25)$ of $\\mathrm{HOMO}(\\mathbf{B d})-\\operatorname{LUMO}(7)$ interaction are the same for the endo and exo transition states. The HOMO(7)-LUMO $(\\mathbf{B d})$ interaction includes the effects of the SOIs in the endo transition\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-6_1658_2238_1109_1977}\n\\end{center}\n\nFigure 10. Plot of the stereoselectivities measured as the difference in the activation free energies $\\left(\\Delta \\Delta G^{\\ddagger}\\right)$ between the endo and exo DielsAlder reactions of triafulvenes 1-7 with butadiene $(\\mathbf{B d})$ versus the computed NBO charge at $\\mathrm{C}_{3}$ in the triafulvene ground state.\n\nstate. The HOMO(7)-LUMO(Bd) of the endo and exo transition states both exhibit gaps with $\\Delta \\varepsilon=6.4 \\mathrm{eV}$. The orbital overlap of the HOMO(7)-LUMO $(\\mathbf{B d})$ in the endo transition state $(S=0.17)$ is significantly greater than that in the exo transition state $(S=0.11)$, a result of the SOI that arises from the\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_430c3ddffa99af6a2545g-7_226_862_444_1715}\n\\end{center}\n\nFigure 11. (a) Distortion/interaction-activation strain analyses and (b) energy decomposition analyses for the endo (black) and exo (red) Diels-Alder reactions of butadiene $(\\mathbf{B d})$ with cyclopropenethione (2).\n\noverlap of the p-orbital at the $C_{3}$ position in the HOMO of 7 with the $\\mathrm{C}_{2}$ and $\\mathrm{C}_{3} \\mathrm{p}$-orbitals in the LUMO of $\\mathrm{Bd}$ in the endo transition state.\n\nThe reaction between $\\mathbf{B d}$ and $\\mathbf{1}$ proceeds primarily through a normal electron-demand Diels-Alder cycloaddition, where the key FMO interaction is between the $\\operatorname{HOMO}(\\mathbf{B d})-\\operatorname{LUMO}(\\mathbf{1})$ with an FMO energy gap of $6.3 \\mathrm{eV}$ for both the endo and exo approach (Figure 8). The orbital overlaps are similar for the endo and exo approach with overlaps of $0.24$ and $0.25$, respectively. The lower lying HOMO-1(1) interacts with the $\\operatorname{LUMO}(\\mathbf{B d})$; however, this interaction has a relatively large energy gap of $9.1$ $\\mathrm{eV}$ for both the endo and exo cycloadditions. The orbital overlaps for the endo and exo approach are similar at $0.16$ and $0.15$, respectively. Similar orbital overlap of the HOMO-1 of 1 with the LUMO of Bd in the endo and exo transition state is evidence of weak secondary orbital interactions in the endo transition state. The weak SOIs with 1 are a result of the poor overlap between the small p-orbital coefficient at the $\\mathrm{C}_{3}$ position in the HOMO of 1 with the $p$-orbitals of the newly forming $\\pi$-bond in the LUMO of Bd. Weak SOI explains why the endo selectivity disappears from 7 to 1, but does not explain why cyclopropenone is exo selective.\n\nThe charge transfer between the triafulvene and $\\mathbf{B d}$ also appears in the orbital interaction term. The charge at the $C_{3}$ position of the triafulvene and heteroatom analogs $1-7$ ranges from $-0.18$ to $0.61$ in the endo transition states (Figure 6). The reactions are normal electron-demand Diels-Alder reactions, and Bd becomes partially positively charged as a result of charge transfer to the dienophile. The magnitude of the charge transfer generally increases as the dienophile becomes more electrondeficient. The sum of charge across all the atoms of $\\mathbf{B d}$ ranges from $0.05$ to $0.22$ in the endo transition states of $\\mathbf{1}-7$. Figure 9 shows a qualitative representation of a charge transfer interaction between the $\\mathrm{C}_{3}$ position of the triafulvene and $\\mathbf{B d}$ in the endo transition states. The charge transfer in the endo transition state can be understood as being more stabilizing when the $\\mathrm{C}_{3}$ carbon is negatively charged and destabilizing when the $C_{3}$ carbon is positively charged. Due to the increased distance between the $\\mathrm{C}_{3}$ position and the diene, this interaction is much weaker in the exo transition state. The lack of secondary orbital interactions and the unfavorable charge transfer between the electropositive $\\mathbf{B d}$ fragment and the electropositive $\\mathrm{C}_{3}$ position of cyclopropenone (1) in the endo transition state explains why there is a preference for the exo transition state in the Diels-Alder reaction of $\\mathbf{B d}$ with cyclopropene (1).\n\nWe have previously shown that both secondary orbital and electrostatic interactions play a role in determining the endo and exo Diels-Alder stereoselectivity in reactions of 3-substituted cyclopropenes. ${ }^{5 b}$ The charge at the $\\mathrm{C}_{3}$ position of the cyclopropene correlates with the cyclopropene stereoselectivity in the absence of steric effects and serves as a useful way to predict the stereoselectivity of cyclopropene Diels-Alder reactions. Figure 10 shows a linear correlation between the stereoselectivity $\\left(\\Delta G^{\\ddagger}\\right.$ ndo $-\\Delta G^{\\ddagger}$ exo $)$ and the NBO charge at the $\\mathrm{C}_{3}$ position of the triafulvene for the Diels-Alder reactions of triafulvenes 1-7 with Bd. The stereoselectivity increases linearly with increasing positive charge at the $C_{3}$ position of $1-7$ with cyclopropenethione 2 , an obvious outlier, represented by the unfilled diamond.\n\nThe $\\pi$-densities and charges at the $C_{3}$ positions are determined by the polarization of the exocyclic double bond. Compared to the $\\mathrm{C}=\\mathrm{O}$ double bond of cyclopropenone (1), the $\\mathrm{C}=\\mathrm{S}$ double bond of the cyclopropenethione (2) is less polarized because of the smaller difference in the electronegativities of carbon and sulfur compared to that of carbon and oxygen. However, sulfur is a strong $\\pi$ acceptor, and because of its size, it can accommodate additional $\\pi$-electron density compared to oxygen. Theoretical studies by Wiberg et al. found that the $\\pi$-densities of the $\\mathrm{C}=\\mathrm{O}$ bond in cyclopropenone and the $\\mathrm{C}=\\mathrm{S}$ bond in cyclopropenethione are similar, despite the differences in the polarization of the $\\mathrm{C}=\\mathrm{S}$ of $\\mathrm{C}=\\mathrm{O}$ bonds. ${ }^{20}$ This is consistent with 1 and 2 having similarly small HOMO orbital coefficients at the $\\mathrm{C}_{3}$ carbon, but different charges at the $\\mathrm{C}_{3}$ carbon (see Figure 6).\n\nFigure 11 shows the distortion/interaction-activation strain and energy decomposition analyses for the endo and exo DielsAlder reaction of Bd with cyclopropenethione (2). The slightly exo stereoselectivity in the Diels-Alder reaction of Bd with 2 results from poor stabilization of the endo transition state through secondary orbital and electrostatic interactions.\n\n\\section{CONCLUSIONS}\nThe reactivities and stereoselectivities of Diels-Alder reactions of cyclopropenone and triafulvene analogs are controlled by both the charge and HOMO coefficient at the $\\mathrm{C}_{3}$ carbon. In the endo transition state, polarization of the exocyclic bond by electron- withdrawing groups weakens the strength of the stabilizing secondary orbital interactions and creates unfavorable charge transfer between the electropositive $\\mathrm{C}_{3}$ position of the triafulvene and butadiene that favors exo stereoselectivity. The Diels-Alder reactivities of the triafulvene and heteroanalogs decrease as the size of the HOMO coefficient at the $\\mathrm{C}_{3}$ carbon decreases as a result of weaker secondary orbital and charge transfer interactions. We predict that exo stereoselectivity is favored when the exocyclic triafulvene group is $\\mathrm{O}, \\mathrm{S}$, or $\\mathrm{NR}_{2}^{+}$, endo stereoselectivity when $\\mathrm{CR}_{2}$ is the exocyclic group, and poor stereoselectivity when NR is the exocyclic substituent.\n\n\\section{ASSOCIATED CONTENT}\n\\section{(S) Supporting Information}\nThe Supporting Information is available free of charge on the ACS Publications website at DOI: 10.1021/acs.joc.8b00025.\n\nAdditional computational results, Cartesian coordinates, and energies of all stationary points ( $\\mathrm{PDF})$\n\n\\section{AUTHOR INFORMATION}\n\\section{Corresponding Authors}\n*f.m.bickelhaupt@vu.nl\n\n*houk@chem.ucla.edu\n\n\\section{ORCID ( )}\nBrian J. Levandowski: 0000-0002-8139-9417\n\nTrevor A. Hamlin: 0000-0002-5128-1004\n\nF. Matthias Bickelhaupt: 0000-0003-4655-7747\n\nK. N. Houk: 0000-0002-8387-5261\n\n\\section{Author Contributions}\n${ }^{\\|}$B.J.L. and T.A.H. contributed equally.\n\n\\section{Notes}\nThe authors declare no competing financial interest.\n\n\\section{ACKNOWLEDGMENTS}\nThis work was supported by the National Science Foundation (NSF CHE-1361104), the National Institute of Health (NIH R01GM109078), and The Netherlands Organization for Scientific Research (NWO) through the Planetary and ExoPlanetary Science program (PEPSci) and the Dutch Astrochemistry Network (DAN). We thank the University of California, Los Angeles Institute for Digital Research and SURFsara for use of the Hoffman 2 and Cartesius computers, respectively. We also thank Dr. Ashay Patel and Dr. Pier Alexandre Champagne for helpful discussions and Prof. Claude Y. Legault for developing CYLview, ${ }^{21}$ which was used to generate images of the optimized structures.\n\n\\section{REFERENCES}\n(1) Breslow, R.; Ryan, G.; Groves, J. T. J. Am. Chem. Soc. 1970, 92, 988.\n\n(2) Cordes, M. H. J.; de Gala, S.; Berson, J. J. Am. Chem. Soc. 1994, 116, 11161.\n\n(3) Bachrach, S. M. J. Org. Chem. 1995, 60, 4395.\n\n(4) Paton, R. S.; Kim, S.; Ross, A. G.; Danishefsky, S. J.; Houk, K. N. Angew. Chem., Int. Ed. 2011, 50, 10366.\n\n(5) (a) Wiberg, K. B.; Bartley, W. J. J. Am. Chem. Soc. 1960, 82, 6375.\n\n(b) Levandowski, B. J.; Houk, K. N. J. Am. Chem. Soc. 2016, 138, 16731.\n\n(c) Levandowski, B. J.; Hamlin, T. A.; Bickelhaupt, F. M.; Houk, K. N. J. Org. Chem. 2017, 82, 8668.\n\n(6) (a) Shih, H.-W.; Prescher, J. A. J. Am. Chem. Soc. 2015, 137, 10036.\n\n(b) Row, R. D.; Alexander, A. T.; Mehl, R. A.; Prescher, J. A.; Shih, H.-W. J. Am. Chem. Soc. 2017, 139, 7370. (7) Frisch, M. J.; Trucks, G. W.; Schlegel, H. B.; Scuseria, G. E.; Robb, M. A.; Cheeseman, J. R.; Scalmani, G.; Barone, V.; Mennucci, B.; Petersson, G. A.; Nakatsuji, H.; Caricato, M.; Li, X.; Hratchian, H. P.; Izmaylov, A. F.; Bloino, J.; Zheng, G.; Sonnenberg, J. L.; Hada, M.; Ehara, M.; Toyota, K.; Fukuda, R.; Hasegawa, J.; Ishida, M.; Nakajima, T.; Honda, Y.; Kitao, O.; Nakai, H.; Vreven, T.; Montgomery, J. A., Jr.; Peralta, J. E.; Ogliaro, F.; Bearpark, M.; Heyd, J. J.; Brothers, E.; Kudin, K. N.; Staroverov, V. N.; Kobayashi, R.; Normand, J.; Raghavachari, K.; Rendell, A.; Burant, J. C.; Iyengar, S. S.; Tomasi, J.; Cossi, M.; Rega, N.; Millam, M. J.; Klene, M.; Knox, J. E.; Cross, J. B.; Bakken, V.; Adamo, C.; Jaramillo, J.; Gomperts, R.; Stratmann, R. E.; Yazyev, O.; Austin, A. J.; Cammi, R.; Pomelli, C.; Ochterski, J. W.; Martin, R. L.; Morokuma, K.; Zakrzewski, V. G.; Voth, G. A.; Salvador, P.; Dannenberg, J. J.; Dapprich, S.; Daniels, A. D.; Farkas, Ö.; Foresman, J. B.; Ortiz, J. V.; Cioslowski, J.; Fox, D. J. Gaussian 09, revision D.01; Gaussian, Inc.: Wallingford, CT, 2009.\n\n(8) Zhao, Y.; Truhlar, D. G. Theor. Chem. Acc. 2008, 120, 215.\n\n(9) (a) Pieniazek, S.; Houk, K. N. Angew. Chem., Int. Ed. 2006, 45, 1442. (b) Pieniazek, S.; Clemente, F. R.; Houk, K. N. Angew. Chem., Int. Ed. $2008,47,7746$.\n\n(10) (a) Barone, V.; Cossi, M. J. Phys. Chem. A 1998, 102, 1995.\n\n(b) Cossi, M.; Rega, N.; Scalmani, G.; Barone, V. J. Comput. Chem. 2003, $24,669$.\n\n(11) Zhao, Y.; Truhlar, D. G. Phys. Chem. Chem. Phys. 2008, 10, 2813.\n\n(12) (a) Foster, J. P.; Weinhold, F. J. Am. Chem. Soc. 1980, 102, 7211.\n\n(b) Reed, A. E.; Weinhold, F. J. Chem. Phys. 1985, 83, 1736. (c) Reed, A.\n\nE.; Weinstock, R. B.; Weinhold, F. J. Chem. Phys. 1985, 83, 735.\n\n(d) Reed, A. E.; Curtiss, L. A.; Weinhold, F. Chem. Rev. 1988, 88, 899.\n\n(13) (a) Bickelhaupt, F. M.; Houk, K. N. Angew. Chem., Int. Ed. 2017, 56, 10070. (b) Wolters, L. P.; Bickelhaupt, F. M. WIRES Comput. Mol. Sci. 2015, 5, 324. (c) Fernańdez, I.; Bickelhaupt, F. M. Chem. Soc. Rev. 2014, 43, 4953. (d) van Zeist, W.-J.; Bickelhaupt, F. M. Org. Biomol. Chem. 2010, 8, 3118 . (e) Ess, D. H.; Houk, K. N. J. Am. Chem. Soc. 2008, 130, 10187. (f) Ess, D. H.; Houk, K. N. J. Am. Chem. Soc. 2007, 129, 10646. (g) Bickelhaupt, F. M. J. Comput. Chem. 1999, 20, 114.\n\n(14) (a) te Velde, G.; Bickelhaupt, F. M.; Baerends, E. J.; Fonseca Guerra, C.; van Gisbergen, S. J. A.; Snijders, J. G.; Ziegler, T. Chemistry with ADF. J. Comput. Chem. 2001, 22, 931. (b) Fonseca Guerra, C.; Snijders, J. G.; te Velde, G.; Baerends, E. J. Theor. Chem. Acc. 1998, 99, 391. (c) ADF2016, SCM Theoretical Chemistry; Vrije Universiteit, Amsterdam, The Netherlands, \\href{http://www.scm.com}{http://www.scm.com}.\n\n(15) (a) van Lenthe, E.; Baerends, E. J. J. Comput. Chem. 2003, 24, 1142. (b) Franchini, M.; Philipsen, P. H. T.; van Lenthe, E.; Visscher, L. J. Chem. Theory Comput. 2014, 10, 1994.\n\n(16) (a) Laloo, J. Z. A.; Rhyman, L.; Ramasami, P.; Bickelhaupt, F. M.; de Cózar, A. Chem. - Eur. J. 2016, 22, 4431. (b) Hamlin, T. A.; van Beek, B.; Wolters, L. P.; Bickelhaupt, F. M. Chem. - Eur. J. 2018, 24, DOI: $10.1002 /$ chem.201706075.\n\n(17) (a) Ziegler, T.; Rauk, A. Inorg. Chem. 1979, 18, 1755. (b) Ziegler, T.; Rauk, A. Inorg. Chem. 1979, 18, 1558. (c) Bickelhaupt, F. M.; Nibbering, N. M. M.; Van Wezenbeek, E. M.; Baerends, E. J. J. Phys. Chem. 1992, 96, 4864. (d) Baerends, E. J.; Gritsenko, O. V. J. Phys. Chem. A 1997, 101, 5383.\n\n(18) (a) Schleyer, P. v. R.; Pühlhofer, F. Org. Lett. 2002, 4, 2873. (b) Wang, Y.; Fernandez, I.; Duvall, M.; Wu, J. I.-C.; Li, Q.; Frenking, G.; Schleyer, P. v. J. Org. Chem. 2010, 75, 8252.\n\n(19) (a) Bickelhaupt, F. M.; Baerends, E. J. In Reviews in Computational Chemistry; Lipkowitz, K. B., Boyd, D. B., Eds.; Wiley-VCH: New York, 2000; Vol. 15, pp 1–86. (b) van Meer, R.; Gritsenko, O. V.; Baerends, E. J. J. Chem. Theory Comput. 2014, 10, 4432.\n\n(20) (a) Wiberg, K. B.; Rablen, P. R. J. Am. Chem. Soc. 1995, 117, 2201. (b) Wiberg, K. B.; Marquez, M. J. Am. Chem. Soc. 1998, 120, 2932.\n\n(21) Legault, C. Y., CYLview, 1.0b; Sherbrooke, QC: Université de SherbrookeCanada, Sherbrooke, QC, 2009. Available at: \\href{http://www}{http://www}. \\href{http://cylview.org}{cylview.org}.\n\n\n\\end{document}", "record_id": "2023_09_22_430c3ddffa99af6a2545g"}