{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{Theoretical Modeling of Electronic Excitations of Gas-Phase and Solvated $\\mathrm{TiO}_{2}$ Nanoclusters and Nanoparticles of Interest in Photocatalysis }\n\n\n\\author{Rosendo Valero*, Ángel Morales-García, Francesc Illas*\\\\\nDepartament de Ciència de Materials i Química Física \\& Institut de Química Teórica i\\\\\nComputacional (IQTCUB), Universitat de Barcelona,\\\\\nc/ Martí i Franquès 1, 08028, Barcelona, Spain.}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\n\n\n\\begin{abstract}\nThe optical absorption spectra of $\\left(\\mathrm{TiO}_{2}\\right)_{n}$, nanoclusters $(n=1-20)$ and nanoparticles $(n=35,84)$ have been calculated from the frequency-dependent dielectric function in the independent particle approximation under the framework of density functional theory. The PBE generalized gradient approach based functional, the so-called PBE $+U$ method and the PBE0 and PBEx hybrid functionals - containing $25 \\%$ and $12.5 \\%$ of non-local Fock exchange, respectively- have been used. The simulated spectra have been obtained in gas phase and in water on previously PBE0 optimized atomic structures. The effect of the solvent has been accounted for by using an implicit water solvation model. For the smallest nanoclusters, the spectra show discrete peaks whereas for the largest nanoclusters and for the nanoparticles they resemble a continuum absorption band. In the gas phase and for a given density functional, the onset of the absorption band (optical gap, $O_{\\text {gap }}$ ) remains relatively constant for all nanoparticle sizes although it increases with the percentage of non-local Fock exchange, as expected. For all tested functionals, the tendency of $O_{\\text {gap }}$ in water is very similar to that observed in gas phase with an almost constant up-shift. For comparison, the optical gap has also been calculated at the TD-DFT level with the PBEx functional in the gas phase and in water. Both approaches agree reasonably well although the TD-DFT gap values are lower than those derived from the dielectric-function. Overall, the position of the band maxima and the width of the spectra are relatively constant and independent of particle size which may have implications in the understanding of photocatalysis by $\\mathrm{TiO}_{2}$.\n\\end{abstract}\n\n\\section{Introduction}\nTitanium dioxide $\\left(\\mathrm{TiO}_{2}\\right)$ is a well-known semiconductor material which utilizes light to trigger photocatalytic reactions such as organic contaminant degradation in air or water ${ }^{123-4}$ and, even more appealing from a sustainable energy source, water splitting. ${ }^{5}$ In addition, $\\mathrm{TiO}_{2}$ is attractive due to its abundance in nature, high stability and non-toxicity. ${ }^{6}$ Roughly speaking, the mechanism behind photocatalysis consists in the absorption of light promoting the excitation of $\\mathrm{TiO}_{2}$ electrons from the valence band to the conduction band. The resulting excited electron-hole pairs are the main players of the redox photocatalytic reactions. However, the most common $\\mathrm{TiO}_{2}$ polymorphs (rutile and anatase) exhibit band gaps of or larger than $3 \\mathrm{eV},{ }^{7-89}$ thus largely inhibiting their practical use as only $\\sim 10 \\%$ of the sunlight incoming photons have enough energy to be absorbed and hence to participate in the photocatalytic process.\n\nRecently, several studies have shown that the photocatalytic activity does not only depend on the composition of the photocatalytic material and present evidence that both particle size and shape can play a noted role in controlling the fate of excitons in $\\mathrm{TiO}_{2} .^{1011-12}$ The effect of shape and size of $\\mathrm{TiO}_{2}$ nanoparticles in defining the corresponding band gap and their concomitant\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_39b7d4444fd6ff852b12g-02_1268_1331_181_1875}\\\\\nnanoclusters and nanoparticles including explicitly over one thousand atoms. These realistic models of nanoparticles allow one to surmount the difficulties encountered by experiments to represent different morphologies for a given composition. ${ }^{10,16}$ Using different state of the art computational techniques, the size- and shape-dependence of the electronic structure of $\\mathrm{TiO}_{2}$ nanoclusters and nanoparticles has been clearly established. ${ }^{17-1819}$\n\nDespite all engineering efforts, the main scientific goal remains to optimize the efficiency of solar energy conversion into readily available electricity. Therefore, an understanding of the optoelectronic properties of $\\mathrm{TiO}_{2}$ is necessary to unravel many fundamental questions concerning the experimental results and in particular the band gap, one of the main properties governing their technological applications both in photocatalysis and in solar cells.Error! Bookmark not defined. To avoid confusions related to the generic use of the band gap term, it is important to distinguish between the electronic or fundamental $\\left(E_{\\text {gap }}\\right)$ and the optical $\\left(O_{\\text {gap }}\\right)$ band gap. ${ }^{20} E_{\\text {gap }}$ is measured by (direct and inverse) photoemission techniques and thus involves charged states either of cationic (free extra hole, $h^{+}$) or anionic (free extra electron, $e^{-}$) character. ${ }^{21}$ On the other hand, $O_{\\text {gap }}$ is obtained from optical absorption experiments that generate an excited electron hole $\\left(e^{-}-h^{+}\\right)$pair, usually referred to as exciton pair. ${ }^{22}$ More precisely, $O_{\\text {gap }}$ is measured by photoacoustic spectroscopy (PAS), a technique which has been used as a nondestructive method for analyzing the optical properties of semiconductors. ${ }^{23,24}$ It is important to point out that there are two well defined but different ways to determine $O_{\\text {gap }}$. In the first one, $O_{\\text {gap }}$ is obtained from the absorption edge from a linear fitting in the plot of the square of the product between the absorption coefficient and the photon energy versus the photon energy for direct band gap or from the plot of the square root of the product between the absorption coefficient and the photon energy versus the photon energy for indirect band gap. ${ }^{25}$ In the second approach, $O_{\\text {gap }}$ is estimated from the change of the derivative of intensity signal of the absorption coefficient with respect to the photon energy near the fundamental absorption edge. ${ }^{26}$ The difference between $E_{\\text {gap }}$ and $O_{\\text {gap }}$ gaps becomes negligible in the limit of sufficiently large systems (including bulk or extended surfaces) since the addition (removal) of one electron to (from) fully delocalized states does not affect significantly its electronic structure. However, in small finite systems $O_{\\text {gap }}$ is lower than $E_{\\text {gap }}$ which may be used for band gap engineering purposes, for instance by nanostructuring processes. ${ }^{27}$\n\nIn the present work we present a systematic density functional theory (DFT) based study of the optical absorption spectra and optical gaps of $\\left(\\mathrm{TiO}_{2}\\right)_{n}$ nanoclusters $(n=1-20)$ and nanoparticles $(n=35$ and 84). The simulated spectra are obtained from the frequency-dependent dielectric function using GGA, GGA $+U$, and hybrid exchange-correlation functionals and results are validated by comparing to results arising from the more accurate and but also computationally more demanding, time-dependent DFT (TD-DFT) calculations. The present results provide unbiased information regarding the intensity of electronic transitions in $\\mathrm{TiO}_{2}$ nanoparticles potentially relevant to photocatalysis.\n\n\\section{Nanoparticle models and computational details}\nThe geometrical structure of the $\\left(\\mathrm{TiO}_{2}\\right)_{n}$ nanoclusters $(n=1-20)$ and nanoparticles $(n=35$ and 84) studied in the present work has been taken from previous work using bottom-up and topdown approaches, respectively.Error! Bookmark not defined. Error! Bookmark not defined. In short, the optimized structures for the nanoclusters correspond to global minima determined using a two-step procedure. In a first step, Monte Carlo basin hopping ${ }^{28}$ calculations with classical interionic potentials ${ }^{29}$ and data mining ${ }^{30}$ approaches were used to seek for low-energy isomers. In a second step, DFT based calculations with the PBE0 exchange-correlation potential ${ }^{31}$ were carried $^{2}$ out obtaining the final lowest-energy structures. For the crystalline nanoparticles, the initial geometry was obtained from a Wulff construction ${ }^{32}$ and the resulting, PBE0 optimized anatase nanoparticles exhibit an octahedral shape with (101) facets. For completeness, the structures of the nanoclusters and nanoparticles used in the present work are represented in Figure 1, further details regarding these structures can be found in the original references.Error! Bookmark not defined.Error! Bookmark not defined. For additional information regarding the modeling of oxide nanoparticles, the interested reader is referred to the review article by Bromley et al. ${ }^{33}$\n\nUsing the atomic structure of the nanoclusters and nanoparticles as described above, the optical absorption spectra were calculated using different density functionals. These involve the PBE implementation ${ }^{34}$ of the generalized gradient approach (GGA), the PBE0 hybrid functional containing 25\\% of non-local Fock exchange and a modification of the latter including $12.5 \\%$ of non-local Fock exchange hereafter referred to as PBEx. The PBEx functional was found to better reproduce the experimental band gaps of bulk rutile and anatase as well as the main features of oxygen vacancies in these polymorphs. ${ }^{35}$ In addition, the optical spectra have also been computed using the $\\mathrm{PBE}+U$ approach within the Dudarev approximation ${ }^{36,37}$ involving an effective $U$ value. To avoid any bias arising from the semiempirical character of this parameter, two different $U$ values (4.5 and $6.0 \\mathrm{eV}$ ) were used. In the following, the corresponding series of calculations will be referred to as $\\mathrm{PBE}+4.5$ and $\\mathrm{PBE}+6.0$, respectively. Here it is worth pointing out that even if most previous calculations on $\\mathrm{TiO}_{2}$ have used the $U$ parameter for studies of the bulk phases for $\\mathrm{Ti}(3 d)$ levels only, ${ }^{38-394041}$ it has been shown that including this parameter for both Ti $(3 d)$ and $\\mathrm{O}(2 p)$ levels improves the description of both the band structure and band gap. ${ }^{42}$ Consequently, the $U$ term was applied to both $\\mathrm{Ti}(3 d)$ and $\\mathrm{O}(2 p)$ levels. A final remark is necessary regarding the estimate of the optical gap by means of periodic density functional theory calculations. The band gap of bulk solids is usually obtained from the band structure provided by the Kohn-Sham one electron levels whereas in discrete systems it is estimated from the HOMO-LUMO energy difference. In both cases, this is a serious approximation since the rigorous calculation involves the use of many body perturbation techniques as in the $G W$ methods ${ }^{43}$ common implementations possibly including the Bethe-Salpeter equation if exciton effects are dominant. ${ }^{44}$ Therefore, the fact that a given functionals leads to a Kohn-Sham band gap in agreement with experiment needs to be regarded as fortuitous and taken as a practical choice rather than as a success of that particular functional. Note also that, at least in part, the success of band structure methods using GGA type functionals in predicting band gaps originates from the almost linear relationship between these and $G W$ calculated values. ${ }^{45}$\n\nApart from the computationally expensive $G W$ methods, other procedures exist to approach the optical gap of solids and nanoparticles. In particular, the frequency-dependent dielectric function and the TD-DFT methods provide physically grounded approaches that go well beyond the use of Kohn-Sham orbital energies or standard band structure calculations. Following previous work regarding the optical spectra of bulk $\\mathrm{TiO}_{2}$ polymorphs, ${ }^{46,47}$ the gas phase optical spectra of the $\\mathrm{TiO}_{2}$ nanoclusters and nanoparticles studied in the present work were obtained from the frequency- dependent dielectric function ${ }^{48}$ as obtained from DFT based calculations carried out using the wellknown Vienna ab initio simulation package (VASP) ${ }^{49-51}$ code which uses a plane wave basis set to expand the valence electron density and a projector augmented wave (PAW) ${ }^{52,53}$ description of the effect of electron cores on the valence electron density. For the gas phase nanoclusters and nanoparticles, the optical spectra were computed starting from a ground state calculation with the chosen exchange-correlation functional and calculating the complex frequency-dependent dielectric function, where the imaginary part is computed as a sum over empty states and the real part is obtained by the standard Kramers-Kronig transformation. For the same nanoclusters and nanoparticles, the calculation of the dielectric function in aqueous medium was performed using VASPsol, ${ }^{54,55}$ a modification of VASP which adds the implementation of an implicit solvation model accounting for the interaction between solute and solvent in the framework of a joint density functional theory (J-DFT). ${ }^{56-58}$ In this framework, the free energy of the combined solute/solvent system is obtained from the sum of two terms, one including the total electron density plus a thermodynamic average of the atomic densities of the solvent species and a second term accounting for the electrostatic energy. An additional term describes the free energy contribution of cavitation and dispersion.Error! Bookmark not defined. ${ }^{59}$ In the present calculations a value of $78.40$ was used for the dielectric constant of water.\n\nBoth gas phase and water solvation, DFT calculations were carried out for the closed shell electronic ground state, i.e. without spin polarization. In order to avoid spurious interactions resulting from the inherent periodic character of the $\\mathrm{VASP}$ code, the $\\left(\\mathrm{TiO}_{2}\\right)_{n}(n=1-20)$ nanoclusters were placed into a cubic box with a $30.0 \\AA$ side which is then replicated in the three spatial directions. For the larger $\\left(\\mathrm{TiO}_{2}\\right)_{35}$, and $\\left(\\mathrm{TiO}_{2}\\right)_{84}$ nanoparticles, larger cubic boxes with $45.0$ and $55.0$ $\\AA$ sides, respectively, were employed. In this way, the shortest distance between atoms belonging to different periodic replicas was larger than $20 \\AA$ for both nanoclusters and nanoparticles. Since the calculations involve discrete systems, calculations were always carried out at the $\\Gamma$ point. The valence states of oxygen $(2 s, 2 p)$ and titanium $(4 s, 3 p)$ were expanded in a plane wave basis set with an energy cutoff of $400 \\mathrm{eV}$. Convergence was facilitated by using a $\\sigma=0.1 \\mathrm{eV}$ Gaussian smearing although upon convergence this was removed.\n\nThe intensity of the optical absorption spectra $\\alpha$ as a function of the frequency $\\omega$ were derived from the real and imaginary parts of the computed frequency-dependent dielectric function $\\varepsilon(\\omega)$ in the independent particle approximation according to ${ }^{60}$\n\n$\\alpha=\\omega \\sqrt{2 \\sqrt{\\varepsilon_{1}^{2}(\\omega)+\\varepsilon_{2}^{2}(\\omega)}-2 \\varepsilon_{1}(\\omega)}$, where $\\varepsilon(\\omega)=\\varepsilon_{1}(\\omega)+i \\varepsilon_{2}(\\omega)$. The same computational approach has been previously applied to the study of the optical spectra of fluorine-doped titania in anatase, rutile, and brookite.Error! Bookmark not defined. In the present application of the dielectric function to finite nanoclusters and nanoparticles, the absolute value of the dielectric function cannot be obtained. Nevertheless, the relative values of the absorption coefficient for different nanoclusters and nanoparticles are expected to be correct.\n\nThe frequency-dependent dielectric function of the nanoclusters and nanoparticles and the intensity of the optical absorption spectra derived as in Eq. (1) allow one to extract several pieces of information. To this end, the lowest-energy rising section of the imaginary part of the dielectric function of all nanoclusters and nanoparticles was fitted to a linear function, and the intercept with the abscissa axis was taken as $O_{\\text {gap. }}$ Note that this graphical procedure introduces some uncertainty in the calculated $O_{\\text {gap }}$ so that the values thus computed have to be taken within an error bar of roughly $\\pm 0.1 \\mathrm{eV}$. Next, the intensity of the absorption spectra was fitted to Gaussian function as in Eq. (2)\n\n$g(I)=a e^{\\frac{-(I-b)^{2}}{2 c^{2}}}$\n\nwhere $I$ is the intensity and $a, b$ and $c$ are the fitting parameters. In particular, the maximum of the Gaussian curve is the $b$ parameter and full width at half maximum (FWHM) is related to the $c$ parameter as in Eq. (3)\n\n$F W H M=2 \\sqrt{2 \\ln 2} c \\approx 2.35482 c$\n\nFigure 2 presents a representative linear fit (left panel) and an example of a Gaussian fit (right panel) corresponding to the $\\left(\\mathrm{TiO}_{2}\\right)_{20}$ nanocluster calculated at the PBEx level in the gas phase. The linear and Gaussian fits were performed for all nanoclusters and nanoparticles, with and without water as implicit solvent and with the different density functionals commented above. Note that only the onset of the imaginary part of the dielectric function is considered for the linear fits. Figure 2 shows that a Gaussian fit provides a fair approximation to the shape of the bands, especially for the largest nanoclusters and the nanoparticles as illustrated in detail in the next section.\n\nFor comparison purposes, the $O_{\\text {gap }}$ was also obtained by using adiabatic linear response frequency-domain time-dependent DFT (TD-DFT) ${ }^{61}$ calculations in the so-called Casida formulation. $^{62}$ Note that a significant number of TD-DFT based studies have been reported for $\\left(\\mathrm{TiO}_{2}\\right)_{n}$ nanoclusters and nanoparticles. ${ }^{9,12,13,63-646566676869707172}$ The TD-DFT calculations were carried out for the first singlet excited state of all nanoclusters and nanoparticles with the PBEx functional using the standard 6-31G(d) GTO basis set. Both gas phase and implicit solvent calculations were performed, the latter based on an integral equation formalism polarizable continuum model (IEF-PCM). ${ }^{73,74}$ In the PCM model the solvent is described as a structureless continuum with a constant dielectric permittivity, which is polarized by the solute charge distribution and is the source of a reaction field polarizing back the solute. The solute is placed inside a cavity, and in the IEF variant of PCM, Green's functions are used to define the apparent charge on the cavity. For these calculations, the dielectric constant of water was set to a value of 78.3553. All TD-DFT gas phase and implicit solvent calculations were carried out with the GAUSSIAN09 package. ${ }^{75}$\n\nAs a general comment, we note that the treatment of solvation effects in the present work by means of implicit solvation methods is a first approximation to model the interaction of nanoclusters and nanoparticles with water. It is well known that the presence of low-coordinated $\\mathrm{O}$ and Ti atoms in the finite systems makes them amenable to hydration and hydroxylation. ${ }^{76-78}$ Also, local and specific interactions between water molecules and the nanoclusters and nanoparticles which are expected to be quite important, especially for the smallest nanoclusters studied in the present work, cannot be fully accounted for within the implicit solvation models. Nevertheless, general trends regarding for instance the influence of water on the $O_{\\text {gap }}$ of the gas phase systems (see below) should provide a sound first order approximation to the effect of the solvent on the electronic and optical properties of these nanoclusters and nanoparticles.\n\n\\section{Results and discussion}\nTo facilitate the discussion we present results for nanoclusters and nanoparticles separately. This is justified from the fact that the former exhibit structures which are usually far from that expected from anatase crystallites whereas the atomic structure of the two nanoparticles studied in the present work is closely related to anatase crystal structure. Unless otherwise stated, $O_{\\text {gap }}$ values reported in the present work are derived from the frequency-dependent dielectric function as described in the previous section. This remark is important to avoid any misunderstanding with previous works where $O_{\\text {gap }}$ is measured as the HOMO-LUMO Kohn-Sham energy levels difference. Trends in the optical gap of the $\\left(\\mathrm{TiO}_{2}\\right)_{n}(n=1-20)$ nanoclusters\n\nThe main results of the present study are the quantities derived from the simulated optical absorption spectra. Figure 3 presents $O_{\\text {gap }}$ as a function of the nanocluster size at the PBE, PBEx, and PBE0 levels. The optical gaps were computed by means of linear fits to the onset of the imaginary part of the dielectric function for each one of the nanoclusters studied, as explained above. The first clear feature emanating from Figure 3 is that the $O_{\\text {gap }}$ value behaves quite regularly as a function of size, except for the smallest nanoclusters ( $n=3$ or 4) for which relatively large fluctuations are observed. It is worth noting that relatively large fluctuations in the electronic band gap $\\left(E_{\\text {gap }}\\right)$ have been observed previously in such small nanoclusters, ${ }^{11}$ but as happens here for $O_{\\text {gap }}$, $E_{\\text {gap }}$ becomes quite regular for larger nanocluster sizes. Another interesting feature is the general upshift of $O_{\\text {gap }}$ with the percentage of non-local Fock exchange both in gas phase and in water, with PBE giving the lowest values of the optical gap, PBEx (12.5\\% Fock) shifting them up significantly, and PBE0 (25\\% Fock) leading to the larger values. Also, on average the difference between PBEx and PBE $O_{\\text {gap }}$ values is close to the difference between the PBE0 and PBEx ones which is in agreement with the linear trend between the band gap and the amount of non-local Fock exchange reported for $\\mathrm{TiO}_{2}$ bulk polymorphs.Error! Bookmark not defined. Another interesting feature arising from Figure 3 concerns the effect of water solvation on the calculated $O_{\\text {gap }}$ which always leads to larger values by a comparable amount for all these three density functionals. These trends are made more quantitative by taking the average $O_{\\text {gap }}$ along the nanocluster series in gas phase and in water which results are reported in Table 1 along with the standard deviations for the different series. In the gas phase the average energy differences between PBE and PBEx, and between PBEx and PBE0, are about $1.17$ and $1.14 \\mathrm{eV}$, respectively. Regarding the effect of water solvent on the average $O_{\\text {gap }}$, the upshift for PBE, PBEx and PBE0 is of $0.66,0.73$ and $0.83 \\mathrm{eV}$, respectively. On the other hand, the effect of water solvent obtained with the implicit solvation model used here is rather homogeneous for all density functionals employed, although it shows a slight increase with the percentage of Fock exchange.\n\nLet us now examine the values of the optical gap as predicted from the $\\mathrm{PBE}+U(U=4.5$ and $6.0 \\mathrm{eV}$ ) approach. The summary of results for all nanocluster sizes is presented in Figure 4 and the average and standard deviation for the different series are reported in Table 1 whereas a full list of $O_{\\text {gap }}$ values as obtained from calculations with the PBE, PBEx, PBE0, PBE+4.5 and PBE+6.0 functionals is reported in Table 2.\n\nComparing Figure 3 with Figure 4 , one can see that for $\\mathrm{PBE}+4.5$, results are in between those obtained with PBE and PBEx, whereas the curve for PBE+6.0 is comparable to the PBEx one. This is not surprising since such large $U$ value is required to reproduce the anatase band gap ${ }^{79}$ although at the price of predicting too deep oxygen vacancy related levels.Error! Bookmark not defined. It is interesting to observe that, as compared with the set of results obtained by using PBE and the hybrid PBEx and PBE0 functionals, the effect of the water solvent is reduced in the calculations with the $\\mathrm{PBE}+U$ approaches. More precisely, the average $O_{\\text {gap }}$ value in the gas phase $(3.89 \\mathrm{eV})$ is the same for PBEx and PBE+6.0 and the average difference between water and gas phase $O_{\\text {gap }}$ is about $0.43$ and $0.39 \\mathrm{eV}$ for $\\mathrm{PBE}+4.5$ and $\\mathrm{PBE}+6.0$, respectively. These results indicate that although the gas phase $O_{\\text {gap }}$ obtained with the hybrid PBEx functional can be reproduced by a particular value of the $U$ parameter, the electronic structure obtained at the PBEx and PBE $+U$ levels is not necessarily equivalent, as reflected in the different outcome of implicit solvent calculations.\n\nThe values of $O_{\\text {gap }}$ obtained in the present study can be compared to the $O_{\\text {gap }}$ for bulk anatase as computed within the same density functional method and also to experiment $(3.20 \\mathrm{eV})$. Note, however, that the energy of the exciton in bulk anatase is of about $0.2 \\mathrm{eV}^{19,80-82}$ and, consequently, the experimental $O_{\\text {gap }}$ value for anatase is $\\sim 3.0 \\mathrm{eV}$. As discussed above and shown elsewhere,Error! Bookmark not defined. PBEx reproduces the band gap of both anatase and rutile simply because it has been designed to do so. For nanoparticles, the PBEx estimate of $O_{\\text {gap, as }}$ measured from the energy difference between HOMO and LUMO Kohn-Sham levels, converges to the bulk values from above. ${ }^{30}$ In Table 1 , the average $O_{\\text {gap }}$ at the PBE level $(2.75 \\mathrm{eV})$ is well above below the corresponding bulk value, in agreement with trends found from the crude HOMO-LUMO energy. This trend is well reproduced for all density functionals explored. For the hybrid PBEx, the average $O_{\\text {gap }}$ value $(3.89 \\mathrm{eV})$ is significantly above the bulk value as calculated with the same functional thus confirming that $\\mathrm{TiO}_{2}$ nanoclusters $O_{\\text {gap }}$ is always larger than the bulk one which means that for photocatalytic applications one needs to find suitable modifications of nanoparticles to produce a decrease in the gap larger than for bulk-like samples.\n\nNext, we compare the present results with previous theoretical work on nanoclusters of comparable sizes. Most of previous work used TD-DFT for the calculation of $O_{\\text {gap }}$ and in a few cases the absorption spectra were also computed. For truncated bulk anatase $\\left(\\mathrm{TiO}_{2}\\right)_{n}$ nanoclusters with $n=2-18$, the calculated $O_{\\text {gap }}$ was in the 2.05-3.15 eV range with the PBE functional, ${ }^{63}$ with a significant, not surprising, dependence on the nanocluster structure. In a different study, the optical gap was computed for nanoclusters with $n=21-24$ and relying on a modified PBE0 functional with $43-48 \\%$ of non-local Fock exchange. The $O_{\\text {gap }}$ values thus obtained are in the $4.2-4.8 \\mathrm{eV}$ range. ${ }^{66} \\mathrm{In}$ another study of small nanoclusters with $n=1-7,10,13$ the method of choice was PBE0 within the Tamm-Dancoff approximation to TD-DFT, for the $n=6$ nanocluster an optical gap of $3.25 \\mathrm{eV}$ was reported. ${ }^{65}$ Nanoclusters and nanoparticles with $n$ up to 64 were studied employing the LDA functional, and for nanoclusters of sizes comparable to those in the present study, $O_{\\text {gap }}$ varies from $3.60 \\mathrm{eV}$ for $n=2$ to around $3.0 \\mathrm{eV}$ for $n=18-22 .^{68}$ Three different density functionals, namely LDA, PBE, and PBE0, were used for nanoclusters in the $n=3-10$ range. Optical gaps were in the 0.5-3.0 eV range depending on method (PBE or PBE0), behaving quite irregularly with size. ${ }^{64} \\mathrm{~A}$ study using the B3LYP functional for $n=10-16$ nanoparticles found vertical excitation energies within the 2.5-3.5 eV interval. ${ }^{70}$ Several density functionals (PBE, B3LYP, BHLYP, and CAM- B3LYP) were used to compute the TD-DFT first excited singlet state for nanoclusters with $n=1$ 13. A constant energy shift towards larger values was observed as a function of the amount of nonlocal Fock exchange and optical gaps were predicted to be in the $3.0-4.5 \\mathrm{eV}$ range. ${ }^{12}$ Overall, this brief survey of previous works in the literature shows that the influence of the functional is very large. We would argue that results predicted from the PBEx functional are more reliable since this was tuned to reproduce the bulk values for anatase and rutile and have shown to predict accurate values for brookite as well.\n\nRegarding the effect of environment, previous work has considered nanoclusters $(n=4,8$, 16) and nanoparticles $(n=35,84)$ and used the B3LYP and CAM-B3LYP levels to investigate the excited states in gas phase and also in water.Error! Bookmark not defined. In the gas phase the predicted $O_{g a p}$ was in the 2.5-4.0 eV range, depending significantly on the nanocluster shape and increasing approximately by $0.3 \\mathrm{eV}$ when considering the presence of water within a continuum model. Interestingly, results in water exhibited a less marked dependence on cluster size. For completeness we mention that for the $n=4,8,16$ nanoclusters, the gas phase B3LYP optical gaps were $3.86,4.11$, and $3.61 \\mathrm{eV}$ and $4.26,4.28$, and $4.05 \\mathrm{eV}$ in gas phase and water, respectively. These values change significantly if the CAM-B3LYP functional is used to $4.41,4.75$, and $4.74 \\mathrm{eV}$ for the gas phase and $4.72,4.84$, and $4.77 \\mathrm{eV}$ in water.Error! Bookmark not defined. Nevertheless, in spite of the influence of the functional, the trends regarding to the effect of water are consistent and less dependent on the functional.\n\nFinally, we compare $O_{\\text {gap }}$ obtained from the frequency-dependent dielectric function with that obtained as the excitation energy of the first singlet excited state of the nanoclusters at the TDDFT level. The TD-DFT calculated $O_{\\text {gap }}$ values for the nanoclusters are presented in Figure 5 , which can be compared with the values obtained from the frequency-dependent dielectric function for the different density functionals. The TD-DFT average $O_{\\text {gap }}$ value of $3.58 \\mathrm{eV}$ predicted from PBEx is slightly below the corresponding value obtained from the dielectric function in the gas phase $(3.89 \\mathrm{eV})$ using the same functional whereas the difference in water is slightly larger $(4.00 \\mathrm{vs}$. $4.61 \\mathrm{eV}$ ). The effect of the solvent is more pronounced when using an implicit model based on $\\mathrm{J}$ DFT and the dielectric function, as compared to using the IEF-PCM implicit model and TD-DFT. It is not clear if, and which one of the factors (electronic structure method or solvation model) is more relevant to this difference.\n\nSimulated optical spectra of the $\\left(\\mathrm{TiO}_{2}\\right)_{n}(n=1-20)$ nanoclusters\n\nIn the view of the previous discussion, the simulated optical absorption spectra for the $\\mathrm{TiO}_{2}$ nanoclusters considered in this section have been obtained using the PBEx functional and the results are presented in Figure 6. Nevertheless, the absorption spectra for all $n=1-20$ nanoclusters obtained from the five functionals ( $\\mathrm{PBE}, \\mathrm{PBEx}, \\mathrm{PBE} 0, \\mathrm{PBE}+4.5, \\mathrm{PBE}+6.0)$ considered in the present study in gas phase and in water, are shown in Figures S1-S10 in Supporting Information (SI). For the various nanocluster sizes, the spectra are qualitatively similar with an onset at about $4 \\mathrm{eV}$ and extending out to about $14 \\mathrm{eV}$. The main difference one can observe concerns the spectral shape, which shows discrete peaks for $n=5$ and 10 but an essentially continuous band for the nanoclusters with $n=15$ and 20 having diameters of $\\sim 0.8-0.9 \\mathrm{~nm}$. It is remarkable that band-like spectra are obtained even for small nanoclusters, especially considering that $O_{\\text {gap }}$ changes slowly with particle size and that for exciton shift, nanoparticles of more than $10000 \\mathrm{TiO}_{2}$ units and a diameter of about $20 \\mathrm{~nm}$ are still in the limit between discrete and bulk-like behaviour.Error! Bookmark not defined.\n\nA more quantitative survey of the spectral shape can be obtained by calculating two characteristic properties such as the energy of the band maxima and the width of the spectra as a function of size of the nanoclusters. Results for PBEx and for gas phase and water are presented in Table 3, and results for the rest of methods employed here can be found in Tables S1-S4. For the PBEx derived spectra, the position of the band maxima at about $8.3 \\mathrm{eV}$ and the FWHM of about $4.3$ $\\mathrm{eV}$, are almost constant with respect to nanocluster size, except for the smallest $n=1-5$ sizes which show a more erratic behavior. This may have important consequences as point out the difficulty to get information about particle size from optical spectroscopy related experimental techniques.\n\nTrends in the optical spectra of the $\\left(\\mathrm{TiO}_{2}\\right)_{n}(n=35,84)$ nanoparticles\n\nThe nanoparticles with $n=35$ and 84 have octahedral shape and approximate dimensions of $2.0 \\mathrm{~nm}$ long by $0.8 \\mathrm{~nm}$ wide $(n=35)$, and $3.0 \\mathrm{~nm}$ long by $1.5 \\mathrm{~nm}$ wide $(n=84)$. As shown in Table 2 , their $O_{\\text {gap }}$ values in the gas phase, $3.88$ and $3.82 \\mathrm{eV}$, respectively, are very close to the average $O_{\\text {gap }}$ for the $n=1-20$ nanoclusters, although they are lower than the optical gap found for the largest nanocluster with $n=20$. The $O_{\\text {gap }}$ in water, $3.89$ and $3.80 \\mathrm{eV}$ for the $n=35$ and 84 nanoparticles, respectively, show an insensitivity of the nanoparticles to solvent effects, different to what was observed for the $n=1-20$ nanoclusters. We can also compare the frequency-dependent dielectric function estimate of the gas phase $O_{\\text {gap }}$ with results in the literature obtained from different approaches. For nanoparticles with 28 and $38 \\mathrm{TiO}_{2}$ units, TD-DFT with the PBE functional yields an $O_{\\text {gap }}$ of $2.25-2.60 \\mathrm{eV}$ and $0.80-1.95 \\mathrm{eV}$, respectively, depending on the nanoparticle shape. ${ }^{63}$ These values are much lower than the $3.88 \\mathrm{eV}$ estimate of $O_{\\text {gap }}$ as obtained here for the $n=35$ nanoparticle from the dielectric function with the PBEx functional. To a large extent, the difference can be attributed to the underestimation of band gaps by the PBE functional. In fact, too small values are also predicted by the LDA functional being of $2.9$ and $2.8 \\mathrm{eV}$ for $n=32$ and 64 , respectively. ${ }^{68}$ On the other hand, for anatase-type nanoparticles with $n=32$ and 82 , values of $4.08$ $\\mathrm{eV}$ and of 3.84-3.90 $\\mathrm{eV}$, respectively, were reported for $O_{\\text {gap }}$ from TD-DFT calculations at the B3LYP level. ${ }^{69}$ Finally, it is worth pointing out the rather good agreement between $O_{\\text {gap }}$ values for the gas phase $n=35$ and 84 nanoparticles as estimated from the frequency dependent dielectric function with the PBEx functional (3.82 and $3.82 \\mathrm{eV}$ ) and those predicted by Cho et al. from TDDFT calculations with the B3LYP functional (3.67 and $3.40 \\mathrm{eV}$ ).Error! Bookmark not defined. It also remarkable that in the work of Cho et al.,Error! Bookmark not defined. the influence of water, approximated as an implicit solvent, on the $O_{g a p}$ was found to be rather unimportant (3.69 and $3.43 \\mathrm{eV}$ ), a feature which is fully confirmed by the present systematic study.\n\nWe can now attempt to compare present calculated values to the experimental optical gaps reported in the literature for $\\mathrm{TiO}_{2}$ nanoparticles. A blue shift has been generally observed in the UV-vis absorption edge of nanostructured $\\mathrm{TiO}_{2}$ as compared to the bulk, following the same tendency observed for $E_{\\text {gap83 }}$ and in full agreement with previous calculations on larger $\\mathrm{TiO}_{2}$ nanoparticles indicating that convergence to the bulk-like limit is attained for particles of over 20 nm.Error! Bookmark not defined. Note that experimental measurements for nanoparticles with sizes of $2.1,13.3$, and $26.7 \\mathrm{~nm}$, lead to an identical $O_{\\text {gap }}$ of $3.18 \\mathrm{eV} .{ }^{84}$ For large nanoparticles with a size of $21 \\mathrm{~nm}$, an $O_{\\text {gap }}$ of $2.75 \\mathrm{eV}$ was observed, and for $53 \\mathrm{~nm}$ nanoparticles $O_{\\text {gap }}$ was $2.95 \\mathrm{eV} .{ }^{85}$ Finally, for nanoparticles with sizes of 3 and $6 \\mathrm{~nm}$, values of $3.50$ and $3.34 \\mathrm{eV}$ were found for the optical gap. ${ }^{86}$ Thus, in general a quantum confinement effect has been observed for titania nanoparticles, with values of $O_{\\text {gap }}$ that are somewhat larger (blue shifted) than the bulk values. This tendency is in full agreement with the present estimate of $O_{\\text {gap }}$ from the dielectric function discussed in the present work and with previous values estimated from HOMO-LUMO energy difference.Error! Bookmark not defined. The effect of nanoparticles size in the $O_{\\text {gap }}$ values is readily seen from the values in Table 2 focusing on the $n=20,35,84$ series showing a clear decrease of this quantity. Again, this is the expected trend considering that $O_{\\text {gap }}$ should converge to the bulk limit from above, as it is also the case for $E_{\\text {gap }}$.\n\nIt is also of interest to compare the position of the band maxima and the width of the spectra along the same $n=20,35,84$ series. The maximum shifts towards lower energies and the bands tend to be a little wider as the size increases. The optical absorption spectra for the $n=35$ and 84 nanoparticles are shown in Figure 7. The shape of the nanoparticle spectra is comparable to those of the larger nanoclusters, especially for $n=20$, shown in Figure 6 although the nanoparticle spectra have a less regular shape at intermediate energy. We recall that the nanocluster geometries are obtained from unconstrained global minimizations for each cluster size and the final structure is often far from that of anatase cuts. On the contrary, the nanoparticle initial geometries are obtained from Wulff construction cuts of anatase $\\mathrm{TiO}_{2}$ bulk and this different origin could justify the somewhat different absorption spectra of nanoclusters and nanoparticles.\n\nLet us know discuss the TD-DFT results for the $n=35$ and 84 nanoparticles. The first excited state is located at $3.12$ and $3.14 \\mathrm{eV}$ in the gas phase, and $3.19$ and $3.17 \\mathrm{eV}$ in water, respectively. This estimate of the $O_{\\text {gap }}$ values of the two particles are significantly lower (by about $0.7 \\mathrm{eV}$ ) than those obtained from the frequency-dependent dielectric function. This is at variance of the values reported above for the $n=1-20$ nanoclusters where TDDFT values were just slightly below the dielectric-function-derived ones (Table 2). Clearly, the difference between both methods is amplified for the rather large nanoparticles. This could be due to an underestimate of the excited state energy by TD-DFT with the PBEx functional, which has a relatively low amount of non-local Fock exchange, caused by the partial charge transfer character of those excited states. Indeed, it is possible that for TD-DFT a higher amount of non-local Fock exchange is required for a reliable prediction of the excited state energy, as also pointed out in the previous study carried out in our group.Error! Bookmark not defined. Also note that the modest size of the 6-31G(d) basis set could affect the values of $O_{\\text {gap }}$ obtained with the TD-DFT method.\n\nReliability of the HOMO-LUMO estimate of $O_{\\text {gap }}$\n\nAs described earlier, the distinction between fundamental (electronic) and optical gaps has generated a great confusion in the literature, which is manifested by the frequent use of improper terminology.Error! Bookmark not defined. The difference between the fundamental band gap and the optical gap (when the latter reflects the transition from the ground state to the lowest excited state) is a measure of the excited electron-hole $\\left(e^{-}-h^{+}\\right)$pair or exciton binding energy $\\left(E_{\\mathrm{B}}\\right), E_{\\text {gap }}=$ $O_{\\text {gap }}+E_{\\mathrm{B}}$. Note that, in absence of excitons, $O_{\\text {gap }}$ and $E_{\\text {gap }}$ of a bulk solid coincide. In the framework of DFT, the use of the Kohn-Sham (KS) one-electron energies to approach either $O_{\\text {gap }}$ and $E_{\\text {gap }}$ is a frequent, although not rigorously grounded, practice. This approach is referred to as HOMO-LUMO gap. Contrarily to the HOMO-LUMO gap, the frequency-dependent dielectric function derived $O_{g a p}$ is obtained from a physically meaningful, observable, physical property.\n\nAttending to trends observed in our previous study between the HOMO-LUMO gap and the electronic gap of $\\left(\\mathrm{TiO}_{2}\\right)_{n}$ with $n=1-20$ as predicted from $G_{0} W_{0}$ calculations,Error! Bookmark not defined. one may wonder whether a similar trend exists between the HOMO-LUMO gap and the frequency-dependent dielectric function derived $O_{\\text {gap }}$ as reported in the present work. It is worth noting that, independently of the selected density functional, the trends of the frequency-dependent dielectric function derived $O_{\\text {gap }}$ values agree with those derived from the Kohn-Sham orbital energies (HOMO-LUMO gap) as evidenced in Figure 8. The differences maybe attributed, at least in part, to the error bars inherent to the procedure used in deriving $O_{\\text {gap }}$ from the plot of the imaginary part of the dielectric function as a function of the radiation frequency, as mentioned earlier on. Therefore, even if the numerical values do not coincide, one can safely conclude that the HOMO-LUMO gap provides a crude estimate of $O_{\\text {gap }}$, in agreement with the interpretation of Baerends. ${ }^{87}$ Therefore, while the frequency-dependent dielectric function derived $O_{g a p}$ or the corresponding values as obtained from $G W$ calculations represent physically grounded approaches to estimate the optical gap, the general trends along a series are generally well reproduced by the HOMO-LUMO gap that, in this way, can be accepted as a pragmatic choice.\n\n\\section{Conclusions}\nThe optical absorption spectra of $\\left(\\mathrm{TiO}_{2}\\right)_{n}(n=1-20)$ nanoclusters and $(n=35,84)$ nanoparticles has been computationally investigated in gas phase and in water as solvent based on the analysis of the frequency-dependent dielectric function in the independent particle approximation within the framework of the density functional theory. A set of density functionals was selected to this purpose including the PBE generalized gradient approach, the on-site Hubbard correction ( $\\mathrm{PBE}+U$ with $U=4.5$ and $6.0 \\mathrm{eV}$ ), and the PBEx and PBE0 hybrid functionals that contain $12.5 \\%$ and 25\\% of non-local Fock exchange, respectively. The PBEx hybrid functional is presented as the most reliable since it was designed in such a way that the Kohn-Sham derived band gap (HOMO-LUMO gap) of bulk anatase and rutile reproduces the experimental values. For comparison, $O_{\\text {gap }}$ was also calculated using TD-DFT with the PBEx functional.\n\nThe frequency-dependent dielectric function derived $O_{\\text {gap }}$ decreases systematically with the size of $\\mathrm{TiO}_{2}$ finite system and approaches to the bulk limit which is consistently found from standard band structure calculations with the same functional. This is also consistent with the fact that, independently of the selected density functional, the trends of the frequency-dependent dielectric function derived $O_{\\text {gap }}$ values agree with those derived from the Kohn-Sham orbital energies even if the calculated values may differ significantly.\n\nThe analysis of the shape of optical absorption spectra obtained from the frequencydependent dielectric function for large clusters and nanoparticles shows very similar features indicating that optical spectroscopy measurements will not be able to provide information about the particle size which may have implications in the characterization of samples of interest in photocatalysis.\n\nThe effect of the solvent has been estimated with implicit solvation models, and found to be larger when the J-DFT formalism is applied to frequency-dependent dielectric function calculations than when the IEF-PCM formalism is applied to those obtained from TD-DFT. In both cases, a clear blue shift of several tenths of an $\\mathrm{eV}$ is observed in $O_{\\text {gap }}$ on water solvation of the nanoclusters. In contrast, for the $n=35$ and 84 nanoparticles calculations predict essentially no effect of the solvent, as also found in previous work. All these implicit solvent calculations are presented with the caveat that explicit solvent as well as other effects such as surface hydroxylation have not been taken into account.\n\nFor the small clusters the frequency-dependent dielectric function and TD-DFT derived $O_{\\text {gap }}$ values with the PBEx functional are very similar but larger differences appear for the larger particles. This may point out to the inadequacy of PBEx in TD-DFT calculations, PBEx orbital energies attempt to mimic the quasiparticles and, hence, TD-DFT may lead to artifacts.\n\nFinally, the comparison of HOMO-LUMO and frequency-dependent dielectric function estimates of the optical gap indicates that the former can be taken as a crude estimate even if the Kohn-Sham orbital energies do not rigorously represent the corresponding quasiparticles. From this point of view and for a given series of similar systems HOMO-LUMO derived gaps can be taken as a practical choice.\n\n\\section{ASSOCIATED CONTENT}\n\\section{Supporting Information}\nThe Supporting Information is available free of charge on the ACS Publications website at DOI:\n\nTables S1-S4 show the location of band maxima and FWHM of the spectra of the nanoclusters with $n=1-20$ with the PBE0, PBE, PBE+ $4.5$ and PBE $+6.0$ functionals, respectively.\n\nFigures S1-S10 show the optical absorption spectra of nanoclusters with $n=1-20$ as predicted from calculations using the PBE, PBEx, PBE0, PBE+4.5 and PBE+6.0 density functionals in gas phase and in water. Figures $\\mathrm{S} 1$ and $\\mathrm{S} 2$ are for PBE, Figures $\\mathrm{S} 3$ and $\\mathrm{S} 4$ are for PBE0, Figures $\\mathrm{S} 5$ and S6 are for $\\mathrm{PBE}+6.0 \\mathrm{eV}$, Figures $\\mathrm{S} 7$ and $\\mathrm{S} 8$ are for $\\mathrm{PBE}+4.5$, and Figures $\\mathrm{S} 9$ and $\\mathrm{S} 10$ are for PBEx.\n\n\\section{AUTHOR INFORMATION}\n\\section{Corresponding authors}\n*e-mail: \\href{mailto:rosendo.valero@gmail.com}{rosendo.valero@gmail.com}, francesc.illas@,\\href{http://ub.edu}{ub.edu}\n\n\\section{Notes}\nThe authors declare no competing financial interest.\n\n\\section{ACKNOWLEDGEMENTS}\nThis research was supported by the Spanish MINECO/FEDER CTQ2015-64618-R grant and, in part, by Generalitat de Catalunya (grants 2014SGR97 and XRQTC) and by the NOMAD Center of Excellence project, which received funding from the European Union's Horizon 2020 research and innovation programme under grant agreement No 676580. A. M. G. thanks to Spanish Ministerio de Economía y Competitividad for the Juan de la Cierva postdoctoral grant (FJCI-2015-23760) and F. I. acknowledges additional support from the 2015 ICREA Academia Award for Excellence in University Research. Computational time at the MareNostrum supercomputer has been provided by the Barcelona Supercomputing Centre through grants from Red Española de Supercomputación and the EXCIPHOCAT project 2016163940 of the Partnership for Advanced Computing in Europe (PRACE) Table 1. Gas phase and water average and standard deviation of the optical gaps computed from the frequency-dependent dielectric function taken over all the $\\left(\\mathrm{TiO}_{2}\\right)_{n}, n=1-20$ nanoclusters for all the density functionals used in the present study. The corresponding band gap for bulk anatase as computed from the band structure is given in brackets. For PBEx, numbers in parentheses correspond to TD-DFT calculations.\n\n\\begin{center}\n\\begin{tabular}{lcc}\n\\hline\n & Gas phase & Water \\\\\n\\hline\nPBE & $2.75 \\pm 0.34$ & $3.41 \\pm 0.46$ \\\\\n & $[2.14]^{\\mathrm{a}}$ &  \\\\\n\\hline\nPBEx & $3.89 \\pm 0.59$ & $4.61 \\pm 0.50$ \\\\\n & $(3.58 \\pm 0.45)$ & $(4.00 \\pm 0.21)$ \\\\\n & $[3.22]^{\\mathrm{a}}$ &  \\\\\n\\hline\nPBE0 & $4.96 \\pm 0.39$ & $5.79 \\pm 0.45$ \\\\\n & $[4.40]^{\\mathrm{a}}$ &  \\\\\n\\hline\nPBE $+U(4.5 \\mathrm{eV})$ & $3.48 \\pm 0.53$ & $3.91 \\pm 0.54$ \\\\\n\\hline\nPBE+U $(6.0 \\mathrm{eV})$ & $3.89 \\pm 0.26$ & $4.28 \\pm 0.26$ \\\\\n & $[3.01]^{\\mathrm{b}}$ &  \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\na) ref. Error! Bookmark not defined.; b) ref. Error! Bookmark not defined. Table 2. Optical gaps (in eV) as calculated from the frequency-dependent dielectric function of the $\\left(\\mathrm{TiO}_{2}\\right) n(n=1-20)$ nanoclusters and $(n=35,84)$ nanoparticles, both in gas phase $(\\mathrm{G})$ and in implicit water solvent (W). For PBEx, numbers in parentheses correspond to optical gaps computed at TDDFT level with the $6-31 \\mathrm{G}(\\mathrm{d})$ basis set.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-18_473_2566_183_1902}\n\\end{center}\n\nTable 3. Energy location of the band maxima and full width at half maximum (FWHM) (in eV) derived from Gaussian fits of optical absorption spectra calculated at PBEx level with respect to the number of $\\left(\\mathrm{TiO}_{2}\\right)_{n}$ units.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-19_470_2237_176_1880}\n\\end{center}\n\nFigure 1.- Structure of global minima of the $\\left(\\mathrm{TiO}_{2}\\right)_{n}$ nanoclusters $(n=1-20)$ and nanoparticles $(n=$ 35, 84) obtained at PBE0 level (see also refs. Error! Bookmark not defined. and Error! Bookmark not defined.). Blue and red spheres represent titanium and oxygen atoms, respectively.\\\\\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-20_463_2069_218_1872}Figure 2. Linear fit of the onset region of the imaginary part of the frequency-dependent dielectric function (left panel) and Gaussian fit of the optical absorption spectrum (right panel). The nanocluster with $n=20$ and the PBEx functional in the gas phase were chosen for this representative example.\\\\\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-21_742_1274_266_1788}Figure 3. Optical gap of $\\left(\\mathrm{TiO}_{2}\\right)_{n},(n=1-20)$ nanoclusters as predicted from the frequencydependent dielectric function calculations with the PBE (green), PBEx (red), and PBE0 (blue) density functionals in gas phase (full lines) and in water (dashed lines). Average PBEx values energies in gas phase and in water are shown as horizontal lines.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-22_682_1499_366_1531}\n\\end{center}\n\nFigure 4. Optical gap of $\\left(\\mathrm{TiO}_{2}\\right)_{n}(n=1-20)$ nanoclusters as predicted from the frequency-dependent dielectric function calculations with the $\\mathrm{PBE}+4.5$ (green) and $\\mathrm{PBE}+6.0$ (red) density functionals in gas phase (full lines) and in water (dashed lines)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-23_494_1362_403_1619}\n\\end{center}\n\nFigure 5. First singlet excited state energies (in $\\mathrm{eV}$ ) for $\\left(\\mathrm{TiO}_{2}\\right)_{n}, n=1-20$ nanoclusters as predicted from TD-DFT calculations at the PBEx/6-31G(d) level, in gas phase and in water solvent. Full lines represent gas phase results and dashed lines represent results in water solvent.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-24_505_1362_388_1622}\n\\end{center}\n\nFigure 6. Optical absorption spectra of $\\left(\\mathrm{TiO}_{2}\\right)_{n}(n=5,10,15,20)$ simulated from the frequencydependent dielectric function calculations with the PBEx density functional in gas phase and in water as solvent. The gas phase spectra are presented in (a), (c), (e), and (g), and the water spectra are presented in (b), (d), (f), and (h), for $n=5,10,15,20$, respectively.\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-25_571_971_181_732}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-25_1089_1492_181_732}\n\\end{center}\n\n(e)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-25_1581_1983_183_737}\n\\end{center}\n\n(g)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-25_2090_2496_183_737}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-25_573_969_1249_1800}\n\\end{center}\n\n(d)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-25_1089_1492_1254_1802}\n\\end{center}\n\n(f)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-25_1583_1980_1251_1805}\n\\end{center}\n\n(h)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-25_2094_2497_1249_1800}\n\\end{center}\n\nFigure 7. Simulated (PBEx) optical absorption spectra of the $\\left(\\mathrm{TiO}_{2}\\right)_{n}(n=35,84)$ nanoparticles in gas phase and in water as solvent. The 35 units nanoparticle spectra are presented in (a) and (b), and $84 \\mathrm{~s}$ unit spectra are presented in (c) and (d), for gas phase and water, respectively.\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-26_563_1094_253_1004}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-26_1262_1793_251_1005}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-26_561_1095_1121_1872}\n\\end{center}\n\n(d)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-26_1266_1795_1121_1872}\n\\end{center}\n\nFigure 8. Optical gap values as predicted from HOMO-LUMO orbital energy differences from frequency-dependent dielectric function derived from calculations; both with the PBEx functional. Upper and bottom panels correspond to $\\mathrm{TiO}_{2}$ nanoclusters and nanoparticles, respectively.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-27_464_1786_548_1513}\n\\end{center}\n\n\\section{References}\nThompson, T. L.; Yates Jr., J. T. Surface Science Studies of the Photoactivation of $\\mathrm{TiO}_{2}$ New Photochemical Processes. Chem. Rev., 2006, 106, 4428-4453.\n\nChen, X.; Mao, S. S. Titanium Dioxide Nanomaterials: Synthesis, Properties, Modifications, and Applications. Chem. Rev. 2007, 107, 2891-2959.\n\nFuerte, A.; Hernández-Alonso, M. D.; Maira, A. J.; Martínez-Arias, A.; Fernández-García, M.; Conesa, J. C.; Soria, J. Visible Light-Activated Nanosized Doped-TiO ${ }_{2}$ photocatalysts. Chem. Commun. 2001, 2718-2719.\n\nWoan, K.; Pyrgiotakis, G.; Sigmund W. Photocatalytic Carbon-Nanotube-TiO ${ }_{2}$ Composites. $^{2}$ Adv. Mater. 2009, 21, 2233-2239.\n\nFujishima, A.; Honda K. Electrochemical Photolysis of Water at a Semiconductor Electrode. Nature 1972, 238, 37-38.\n\nHashimoto, K.; Irie, H.; Fujishima, A. $\\mathrm{TiO}_{2}$ Photocatalysis: A Historical Overview and Future Prospects. Jpn. J. Apply. Phys. 2005, 44, 8269-8285.\n\nAmtout, A.; Leonelli, R. Optical Properties of Rutile Near its Fundamental Band Gap. Phys. Rev. B Condens. Matter 1995, 51, 6842-6851.\n\nKowalczyk, S. P.; McFeely, F. R.; Ley, L.; Gritsyna, V. T.; Shirley, D. A. The Electronic Structure of $\\mathrm{SrTiO}_{3}$ and some Simple Related Oxides $\\left(\\mathrm{MgO}, \\mathrm{Al}_{2} \\mathrm{O}_{3}, \\mathrm{SrO}, \\mathrm{TiO}_{2}\\right)$. Solid State Commun., 1977, 23, 161-169.\n\nScanlon, D. O.; Dunnill, C. W.; Buckeridge, J.; Shevlin, S. A.; Logsdail, A. J.; Woodley, S. M.; Catlow, C. R. A.; Powell, M. J.; Palgrave, R. G.; Parkin, I. P.; Watson, G. W.; Keal, T. W.; Sherwood, P.; Walsh, A.; Sokol, A. Band Alignment of Rutile and Anatase $\\mathrm{TiO}_{2}$. Nat. Mater. 2013, 12, 798-801.\n\nOhno, T.; Sarukawa, K.; Matsumura, M. Crystal Faces of Rutile and Anatase $\\mathrm{TiO}_{2}$ particles and Their Roles in Photocatalytic Reactions. New J. Chem. 2009, 26, 1167-1170.\n\nAmano, F.; Prieto-Mahaney, O.-O.; Terada, Y.; Yasumoto, T.; Shibayama, T.; Ohtani, B. Decahedral Single-Crystalline Particles of Anatase Titanium (IV) Oxide with High Photocatalytic Activity. Chem. Mater. 2009, 21, 2601-2603.\n\nCernuto, G.; Masciocchi, N.; Cervellino, A.; Colonna, G. M.; Guagliardi, A. Size and Shape Dependence of the Photocatalytic Activity of $\\mathrm{TiO}_{2}$ Nanocrystals: a Total Scattering Debye Function Study. J. Am. Chem. Soc. 2011, 133, 3114-3119. Dependent Emergence of Crystallinity in Nanomaterials: Titania Nanoclusters versus Nanocrystals. Nanoscale, 2017, 9, 1049-1058.\n\nCho, D.; Ko, K. C.; Lamiel-García, O.; Bromley, S. T.; Lee, J. Y.; Illas, F.; Effect of Size and Structure on the Ground-State and Excited-State Electronic Structure of $\\mathrm{TiO}_{2}$ Nanoparticles. J. Chem. Theory. Comput. 2016, 12, 3751-3763.\n\nLamiel-García, O.; Ko, K. C.; Lee, J. Y.; Bromley, S. T.; Illas, F.; When Anatase Nanoparticles Become Bulk-Like: Properties of Realistic $\\mathrm{TiO}_{2}$ Nanoparticles in the 1-6 $\\mathrm{nm}$ Size Range from All Electron Relativistic Density Functional Theory Based Calculations. J. Chem. Theory. Comput. 2017, 13, 1785-1793.\n\nMorales-García, A.; Valero, R.; Illas, F. Performance of the $G_{0} W_{0}$ Method in Predicting the Electronic Gap of $\\mathrm{TiO}_{2}$ Nanoparticles. J. Chem. Theory Comput. 2017, 13, 3746-3753.\n\nBerardo, E.; Hu, H.-S.; Shevlin, S. A.; Woodley, S. M.; Kowalski, K.; Zwijnenburg, M. A. Modeling Excited States in $\\mathrm{TiO}_{2}$ Nanoparticles: on the Accuracy of a TD-DFT Based Description. J. Chem. Theory Comput. 2014, 10, 1189-1199.\n\nBerardo, E.; Hu, H.-S.; van Dam H. J. J.; Shevlin, S. A.; Woodley, S. M.; Kowalski, K.;\n\nZwijnenburg, M. A. Describing Excited State Relaxation and Localization in $\\mathrm{TiO}_{2}$ Nanoparticles Using TDDFT. J. Chem. Theory Comput. 2014, 10, 5538-5548.\n\nKo, K. C.; Bromley, S. T.; Lee, J. Y.; Illas, F. Size-Dependent Level Alignment between Rutile and Anatase $\\mathrm{TiO}_{2}$ Nanoparticles: Implications for Photocatalysis. J. Phys. Chem. Lett. 2017, 8, 5593-5598. Bredas, J. L. Mind the Gap! Mater. Horiz. 2014, 1, 17-19. Photoemission Electron Microscopy of $\\mathrm{TiO}_{2}$ Anatase Films Embedded with Rutile Nanocrystals. Adv. Func. Mater. 2007, 17, 2133-2138.\n\nBaldini, E.; Chiodo, L.; Dominguez, A.; Palumno, M.; Moser, S.; Yazdi-Rizi, M.; AuböckG.; Mallett, B. P. P.; Berger, H.; Magrez, A.; Bernhard, C.; Grioni, M.; Rubio, A.; Chergui, M. Strongly Bound Excitons in Anatase $\\mathrm{TiO}_{2}$ Single Crystals and Nanoparticles. Nat. Commun. 2017, 8, $13(1-11)$.\n\nIkari, T.; Fukuyama, A.; Maeda, K.; Futagami, K.; Shigetomi, S.; Akashi, Y. Photoacoustic Signals of $n$-type GaAs Layers Grown by Molecular-Beam Epitaxy on Semi-Insulating Substrates. Phys. Rev. B 1992, 46, 10173-10178. Sakai, K.; kakeno, T.; Ikari, T.; Shirakata, S.; Sakemi, T.; Awai, K.; Yamamoto, T. Defect\n\nCenters and Optical Absorption Edge of Degenerated Semiconductors ZnO Thin Films Grown by a Reactive Plasma Deposition by Means of Piezoelectric Photothermal Spectroscopy. J. Appl. Phys. 2006, 99, $043508(1-7)$.\n\nPankove, J. I. Optical Processes in Semiconductors; Dover Publications., New York 1975.\n\nFerreira da Silva, A.; Veissid, N.; An. Y.; Pepe, I.; Barros de Oliveira, N.; Batista da Silva, A. V. Optical Determination of the Direct Band Gap Energy of Lead Iodide Crystals. Appl. Phys. Lett. 1996, 69, 1930-1932.\n\nGe, M.; Cao, C.; Huang, J.; Li, S.; Chen, Z.; Zhang, K.-Q.; Al-Deyab, S. S.; Lai, Y. A Review of One-Dimensional $\\mathrm{TiO}_{2}$ Nanostructured Materials for Environmental and Energy Applications. J. Mater. Chem, A 2016, 4, 6772-6801.\n\nWales, D. J.; Doye, J. P. K. Global Optimization by Basin-Hopping and the Lowest Energy Structures of Lennard-Jones Clusters Containing up to 110 Atoms. J. Phys. Chem. A 1997, 101, 5111-5116.\n\nSyzgantseva, O. A.; Gonzalez-Navarrete P.; Calatayud, M.; Bromley, S.; Minot, C. Theoretical Investigation of the Hydrogenation of $\\left(\\mathrm{TiO}_{2}\\right)_{N}$ Clusters $(N=1-10)$. J. Phys. Chem. C $\\mathbf{2 0 1 1}, 115,15890-15899$.\n\nSokol, A.; Catlow, C. R. A.; Miskufova, M.; Shevlin, S. A.; Al-Sunaidi A. A.; Walsh, A.; Woodley, S. M. On the Problem of Cluster Structure Diversity and the Value of Data Mining. Phys. Chem. Chem. Phys. 2010, 12, 8438-8445.\n\nAdamo, C; Barone, V. Toward Reliable Density Functional Methods without Adjustable Parameters: The PBE0 model. J. Chem. Phys. 1999, 110, 6158-6170.\n\nWulff, G. On the Question of Speed of Growth and Dissolution of Crystal Surfaces. Z. Krystallogr. 1901, 34, 449-530.\n\nBromley, S.T.; Moreira, I. de P. R.; Neyman, K. M.; Illas, F. Approaching Nanoscale Oxides: Models and Theoretical Methods. Chem. Soc. Rev. 2009, 38, 2657-2670.\n\nPerdew, J. P.; Burke, K.; Ernzerhof, M. Generalized Gradient Approximation Made Simple. Phys. Rev. Lett. 1996, 77, 3865-3868.\n\nKo, K. C.; Lamiel-García, O.; Lee, J. Y.; Illas, F. Performance of a Modified Hybrid Functional in the Simultaneous Description of Stoichiometric and Reduced $\\mathrm{TiO}_{2}$ Polymorphs. Phys. Chem. Chem. Phys. 2016, 18, 12357-12367.\n\nLiechtenstein, A. I.; Anisimov, V. I.; Zaanen, J. Density-Functional Theory and Strong Interactions: Orbital Ordering in Mott-Hubbard Insulators. Phys. Rev. B 1995, 52, R5467-R5470. Energy-Loss Spectra and the Structural Stability of Nickel Oxide: An LSDA+U study. Phys. Rev. B 1998, 57, 1505-1509.\n\nDeskins, N. A.; Dupuis, M. Electron Transport via Polaron Hopping in Bulk $\\mathrm{TiO}_{2}$ : A Density Functional Theory Characterization. Phys. Rev. B 2007, 75, 195212 (1-10).\n\nCalzado, C. J.; Hernandez N. C.; Sanz, J. F. Effect of on-site Coulomb Repulsion Term $U$ on\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_39b7d4444fd6ff852b12g-31_675_730_231_1876}\\\\\n$(1-10)$\n\nHu, Z.; Metiu, H. Choice of $U$ for DFT $+U$ Calculations for Titanium Oxides. J. Phys. Chem. C 2011, 115, 5841-5845.\n\nArroyo-de Dompablo, M. E.; Morales-García A.; Taravillo, M. DFT $+U$ Calculations of\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_39b7d4444fd6ff852b12g-31_1031_1088_231_1870}\\\\\nChem. Phys. 2011, 135, 054503 (1-9).\n\nMagyari-Kope, B.; Park, S. G.; Lee, H.-D.; Nishi, Y. First Principles Calculations of Oxygen Vacancy-Ordering Effects in Resistance Change Memory Materials Incorporating Binary Transition Metal Oxides. J. Mater. Sci. 2012, 47, 7498-7514.\n\nHedin, L. New Method for Calculating the One-Particle Green's Function with Application to the Electron-Gas Problem. Phys. Rev. 1965, 139, A796-A823.\n\nSalpeter, E. E.; Bethe, H. A. A Relativistic Equation for Bound-State Problems. Phys. Rev. 1951, 84, 1232-1242.\n\nMorales García, A.; Valero, R.; Illas, F. An Empirical, Yet Practical Way to Predict the Band Gap in Solids by Using Density Functional Band Structure Calculations. J. Phys. Chem. C, 2017, $121,18862-18866$.\n\nLandmann, M.; Rauls, E.; Schmidt, W. G. The Electronic Structure and Optical Response of Rutile, Anatase and Brookite $\\mathrm{TiO}_{2}$. J. Phys.: Condens. Matter 1012, 24, 195503 (1-6).\n\nTosoni, S.; Fernandez Hevia, D.; González Díaz, O.; Illas, F. Origin of Optical Excitations in Fluorine-doped Titania from Response Function Theory: Relevance to Photocatalysis. J. Phys. Chem. Lett. 2012, 3, 2269-2274.\n\nGajdoš, M.; Hummer, K.; Kresse, G.; Furthmüller, J.; Bechstedt, F. Linear Optical Properties in the Projector-Augmented Wave Methodology. Phys. Rev. B 2006, 73, 045112 (19).\n\nKresse, G.; Furthmüller, J. Efficient Iterative Schemes for Ab Initio Total Energy Calculations Using a Plane-Wave Basis Set. Phys. Rev. B 1996, 54, 11169-11186. Kresse, G.; Hafner, J. Ab Initio Molecular Dynamics for Liquid Metals. Phys. Rev. B 1993, $47,558-561$.\n\nKresse, G.; Hafner, J. Ab Initio Molecular-Dynamics Simulation of the Liquid-Metal Amorphous Semiconductor Transition in Germanium. Phys. Rev. B 1994, 49, 14251-14269.\n\nBlöchl, P. E. Projector Augmented-Wave Method. Phys. Rev. B 1994, 50, 17953-17979.\n\nKresse, G.; Joubert, D. From Ultrasoft Pseudopotentials to the Projector Augmented-Wave Method. Phys. Rev. B 1999, 59, 1758-1775.\n\nMathew, K.; Sundararaman, R.; Letchworth-Weaver, K.; Arias, T. A.; Hennig, R. G. Implicit Solvation Model for Density-Functional Study of Nanocrystal Surfaces and Reaction Pathways. J. Chem. Phys. 2014, 140, $084106(1-8)$.\n\nFishman, M.; Zhuang, H. L.; Mathew, K.; Dirschka, W.; Hennig, R. G. Accuracy of Exchange-Correlation Functionals and Effect of Solvation on the Surface Energy of Copper. Phys. Rev. B 2013, 87, $245402(1-7)$.\n\nPetrosyan, S. A.; Rigos, A. A.; Arias, T. A. Joint Density-Functional Theory: Ab Initio Study of $\\mathrm{Cr}_{2} \\mathrm{O}_{3}$ Surface Chemistry in Solution. J. Phys. Chem. B 2005, 109, 15436-15444.\n\nAndreussi, O.; Dabo, I.; Marzari, N. J. Revised Self-Consistent Continuum Solvation in Electronic-Structure Calculations. J. Chem. Phys. 2012, 136, 064102 (1-20).\n\nLetchworth-Weaver K.; Arias, T. A. Joint Density Functional Theory of the ElectrodeElectrolyte Interface: Application to Fixed Electrode Potentials, Interfacial Capacitances, and Potentials of Zero Charge. Phys. Rev. B 2012, 86,075140 (1-16).\n\nGunceler, D.; Letchworth-Weaver K.; Sundararaman, R.; Schwarz, K. A.; Arias, T. A. The Importance of Nonlinear Fluid Response in Joint Density-Functional Theory Studies of Battery Systems. Modell. Simul. Mater. Sci. Eng. 2013, 21, 074005 (1-18). Rev. B 2007, 75, $155104(1-14)$.\n\nRunge, E.; Gross, E. K. Density-Functional Theory for Time-Dependent Systems. Phys. Rev. Lett. 1984, 52, 997-1000.\n\nCasida, M. E. Recent Advances in Density Functional Theory Methods, edited by D. P. Chong, World Scientific: Singapore 1995; vol. 1; p. 155-192. Muuronen, M.; Parker, S. M.; Berardo, E.; Le, A.; Zwijnenburg, M. A.; Furche F. Mechanism of Photocatalytic Water Oxidation on Small $\\mathrm{TiO}_{2}$ Nanoparticles. Chem. Sci. 2017, 8 , 2179-2183.\n\nAuvinen, S.; Alatalo, M.; Haario, H.; Jalava, J.-P.; Lamminmäki, R.-J. Size and Shape Dependence of the Electronic and Spectral Properties of $\\mathrm{TiO}_{2}$ Nanoparticles. J. Phys. Chem. C $\\mathbf{2 0 1 1}, 115,8484-8493$.\n\nChiodo, L.; Salazar, M.; Romero, A. H.; Laricchia, S.; Della Sala, F.; Rubio, A. Structure, Electronic, and Optical Properties of $\\mathrm{TiO}_{2}$ Atomic Clusters: An Ab Initio study. J. Chem. Phys. $\\mathbf{2 0 1 1}, 135,244704(1-10)$. Shevlin, S. A.; Woodley, S. M. Electronic and Optical Properties of Doped and Undoped $\\left(\\mathrm{TiO}_{2}\\right)_{n}$ Nanoparticles. J. Phys. Chem. C 2010, 114, 17333-17343. Properties of Small $\\left(\\mathrm{TiO}_{2}\\right)_{n}$ Nanoparticles, $n=21-24$. J. Phys. Chem. C 2017, 121, 9528-9536.\n\nChen, M.; Dixon, D. A. Modeling the Formation of $\\mathrm{TiO}_{2}$ Ultra-Small Nanoparticles. Nanoscale $\\mathbf{2 0 1 7}, 9,7143-7162$.\n\nHung, L.; Baishya, K.; Öğüt, S. First-Principles Real-Space Study of Electronic and Optical Excitations in Rutile $\\mathrm{TiO}_{2}$ Nanocrystals. Phys. Rev. B 2014, 90, 165424 (1-11).\n\nGałyńska, M.; Persson, P. Emerging Polymorphism in Nanostructured $\\mathrm{TiO}_{2}$ : Quantum chemical Comparison of Anatase, Rutile, and Brookite Clusters. Int. J. Quantum Chem. 2013, $113,2611-2620$.\n\nQu, Z.-W.; Kroes, G. J. Theoretical Study of Stable, Defect-Free $\\left(\\mathrm{TiO}_{2}\\right)_{n}$ Nanoparticles with $n=10-16$. J. Phys. Chem. C 2007, 111, 16808-16817.\n\nScalmani, G.; Frisch, M. J.; Mennucci, B.; Tomasi, J.; Cammi, R.; Barone, V. Geometries and Properties of Excited States in the Gas Phase and in Solution: Theory and Application of a Time Dependent Density Functional Theory Polarizable Continuum Model. J. Chem. Phys. 2006, 124, $094107(1-15)$.\n\nScalmani, G.; Frisch, M. J. Continuous Surface Charge Polarizable Continuum Models of Solvation. I. General Formalism. J. Chem. Phys. 2010, 132, 114110 (1-15).\n\nFrisch, M. J.; Trucks, G. W.; Schlegel, H. B.; Scuseria, G. E.; Robb, M. A.; Cheeseman, J. R.; Scalmani, G.; Barone, V.; Mennucci, B.; Petersson, G. A.; et al. Gaussian 09, Revision B.01; Gaussian, Inc.: Wallingford CT, 2009. Surface Properties of Anatase $\\mathrm{TiO}_{2}$ Nanocrystals from First Principles. Phys. Rev. B 2008, 78, $075405(1-11)$\n\nBarnard, A. S.; Zapol, P.; Curtiss, L. A. Modeling the Morphology and Phase Stability of $\\mathrm{TiO}_{2}$ Nanocrystals in Water. J. Chem. Theory Comput. 2005, 1, 107-116. on $(\\mathrm{TiO} 2)_{n}$ Clusters, $n=1-4$. J. Phys. Chem. A 2015, 119, 11406-11421.\n\nTosoni, S.; Lamiel-Garcia, O.; Fernandez Hevia, D.; Doña, J. M.; Illas, F. Electronic Structure of F-doped Bulk Rutile, Anatase and Brookite Polymorphs of $\\mathrm{TiO}_{2}$. J. Phys. Chem. C $\\mathbf{2 0 1 2}, 116,12738-12746$.\n\nPascual, J.; Camassel, J.; Mathieu, H. Fine Structure in the Intrinsic Absorption Edge of $\\mathrm{TiO}_{2}$. Phys. Rev. B: Condens. Matter Mater. Phys. 1978, 18, 5606-5614.\n\nTang, H.; Levy, F.; Berger, H.; Schmid, P. E. Urbach Tail of Anatase $\\mathrm{TiO}_{2}$. Phys. Rev. B $1995,52,7771-7774$.\n\nKang, W.; Hybertsen, M. S. Quasiparticle and Optical Properties of Rutile and Anatase $\\mathrm{TiO}_{2}$. Phys. Rev. B. 2010, 82, 085203 (1-11).\n\n$\\mathbf{2 0 1 3}, 25,115304(1-7)$ and references therein.\n\nSerpone, N.; Lawless, D.; Khaurutdinov, R. Size Effects on the Photophysical Properties of Colloidal Anatase $\\mathrm{TiO}_{2}$ Particles: Size Quantization or Direct Transitions in this Indirect Semiconductor? J. Phys. Chem. 1995, 99, 16646-16654. of Titania Nanoparticles. Spectrochim. Acta A: Mol. Biomol. Spectrosc. 2014, 127, 543-549. $\\mathrm{TiO}_{2}$ on its Photoactivity. J. Catal. 2002, 212, 145-156.\n\n\\section{Graphics for TOC}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_39b7d4444fd6ff852b12g-35_738_1704_498_1558}\n\\end{center}\n\n\n\\end{document}", "record_id": "2023_09_22_39b7d4444fd6ff852b12g"}