{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Author Manuscript }\n\n\n\\author{Jonathan Wyrick $^{*}, \\dagger$, Xiqiao Wang ${ }^{\\dagger, \\ddagger}$, Pradeep Namboodiri ${ }^{\\dagger}$, Scott W. Schmucker S $^{\\dagger, \\S}$, Ranjit V.\\\\\nKashid $^{\\dagger}$, and Richard M. Silver ${ }^{*}, \\dagger$\\\\\n†Nanoscale Device Characterization Division, National Institute for Standards and Technology,\\\\\nGaithersburg, Maryland 20899, United States\\\\\n${ }^{\\ddagger}$ Chemical Physics Program, University of Maryland, College Park, Maryland 20742, United\\\\\nStates\\\\\n§Joint Quantum Institute, University of Maryland, College Park, Maryland 20742, United States}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\DeclareUnicodeCharacter{2020}{$\\dagger$}\n\n\\begin{document}\n\\maketitle\nAccepted for publication in a peer-reviewed journal\n\n\\section{NGI}\nNational Institute of Standards and Technology • U.S. Department of Commerce\n\nPublished in final edited form as:\n\nNano Lett. 2018 December 12; 18(12): 7502–7508. doi:10.1021/acs.nanolett.8b02919.\n\n\\section{Atom-by-Atom Construction of a Cyclic Artificial Molecule in Silicon}\n\n\n\\begin{abstract}\nHydrogen atoms on a silicon surface, $\\mathrm{H}-\\mathrm{Si}$ (100), behave as a resist that can be patterned with perfect atomic precision using a scanning tunneling microscope. When a hydrogen atom is removed in this manner, the underlying silicon presents a chemically active site, commonly referred to as a dangling bond. It has been predicted that individual dangling bonds fUnction as artificial atoms, which, if grouped together, can form designer molecules on the $\\mathrm{H}-\\mathrm{Si}$ (100) surface. Here, we present an artificial ring structure molecule spanning three dimer rows, constructed from dangling bonds, and verified by spectroscopic measurement of its molecular orbitals. We found that removing 8 hydrogen atoms resulted in a molecular analog to 1,4disilylene-hexasilabenzene $\\left(\\mathrm{Si}_{8} \\mathrm{H}_{8}\\right)$. Scanning tunneling spectroscopic measurements reveal molecular $\\pi$ and $\\pi^{*}$ orbitals that agree with those expected for the same molecule in a vacuum; this is validated by density functional theory calculations of the dangling bond system on a silicon slab that show direct links both to the experimental results and to calculations for the isolated molecule. We believe the unique electronic structure of artificial molecules constructed in this manner can be engineered to enable future molecule-based electronics, surface catalytic functionality, and templating for subsequent site-selective deposition.\n\\end{abstract}\n\n\\section{Graphical Abstract}\n*Corresponding Authors: \\href{mailto:jonathan.wyrick@nist.gov}{jonathan.wyrick@nist.gov}; \\href{mailto:richard.silver@nist.gov}{richard.silver@nist.gov}.\n\nAuthor Contributions\n\nJ.W. conceived of and performed the experimental study under the guidance of R.M.S. All aspects of sample preparation were developed by X.W., P.N., and S.W.S. Ex situ sample preparation was carried out by X.W. and P.N. Analysis and calculations were carried out by J.W. The manuscript was written by J.W. with input from all authors.\n\nASSOCIATED CONTENT\n\nSupporting Information\n\nThe Supporting Information is available free of charge on the ACS Publications website at DOI: 10.1021/acs.nanolett.8b02919. Additional materials providing details of the experiment and theoretical analysis, details about atomic configurations for DFT calculations, additional differential conductance maps and point spectra compared to the fit from DFT, an energy level diagram, and a table of spectroscopy fit results (PDF)\n\nThe authors declare no competing financial interest.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b2865949a80ad08a2835g-02_205_663_687_1438}\n\\end{center}\n\n\\section{Keywords}\nArtificial molecule; feedback-controlled lithography; dangling bonds; molecular orbitals\n\nWithin the discipline of chemistry, it is well-understood that the wave functions of electrons bound to nuclei determine the chemical characteristics of atomic and molecular species. In this context, we define an artificial molecule (AM) as a system whose local electronic structure has been engineered to emulate molecular electronic orbitals. Coupled quantum dots $^{1}$ as well as collections of superconducting circuits ${ }^{2}$ both meet this criterion and indeed have been referred to as AMs. An alternative system that has also been described as an AM is based on colloidal particles arranged with various geometries and compositions ${ }^{3,4}$ but does not meet the criterion of producing a molecular electronic structure. The colloidal particles do, however, demonstrate an aspect of real molecules that has not, to date, been reproduced by the other approaches: functionality derived from complex geometrical arrangement of constituent \"atoms.\"\n\nScanning tunneling microscope (STM)-based hydrogen lithography ${ }^{5-7}$ offers the flexibility necessary to create an atom-sized quantum dot in the form of a dangling bond deterministically at any lattice point in the 2D plane of the $\\mathrm{H}-\\mathrm{Si}$ (100) surface. ${ }^{8}$ Preliminary support for treating collections of dangling bonds as AMs has been demonstrated by controlled construction of linear chains of dangling bonds,, 10 which have shown agreement with models of sequential potential wells, and some argument has been put forth that similar dangling bond chains are akin to linear molecules. ${ }^{11-13}$ While the language of AMs has been used to describe these systems, an unambiguous demonstration of a dangling-bond-based molecular analogue has yet to be reported, and only minimal evidence has been put forward that such structures can be extended across dimer rows into the 2D plane of the surface (an on/off switching device has been constructed out of three single dangling bonds spanning two dimer rows, ${ }^{14}$ although an analysis as to what degree an $\\mathrm{AM}$ analogy is appropriate was not pursued by the authors). Using hydrogen lithography, we have constructed an AM that both meets the electronic structure definition and demonstrates a nontrivial geometry: a cyclic atomic configuration spanning three dimer rows. Our constructed AM has an electronic structure exhibiting strong similarity to that of the $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ molecule (Figure 1a,b) and is artificial in both its construction from dangling bonds (Figure 1c) and its scale, which is larger by a factor of 2 in comparison to the equivalent gas-phase molecule. STM images reveal filled electronic states (Figure 1d) and empty states (Figure 1e) that visually resemble the squared amplitude of the $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ frontier orbitals: the highest occupied molecular orbital (HOMO) and the lowest unoccupied molecular orbital (LUMO), as depicted in Figure 1b. The left-right asymmetry seen in the HOMO and LUMO is due to the chair conformation of $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ as determined by density functional theory (DFT) relaxation of the atomic positions. This asymmetry is not apparent in the STM images; however, it is present, and the symmetric appearance is due to vertical buckling of the underlying silicon dimers at rates faster than is detectable by the experimental setup for some biases and tip-induced buckling for others. ${ }^{15-17}$\n\nThe AM was fabricated (Figure 2) using feedback-controlled lithography (FCL). ${ }^{18}$ This technique enables the precise removal of $\\mathrm{H}$ atoms from the surface by careful monitoring of the sample's local electronic structure as electrons are injected from the tip into the surface (Figure 2a). At the voltages used, this process results in vibrational heating of the Si-H bond until $\\mathrm{H}$ atom desorption occurs. ${ }^{7}$ When the depassivation event is detected, the energy and current of the incoming electrons are reduced to avoid removal of neighboring $\\mathrm{H}$ atoms. In contrast to previous implementations of FCL, which typically aim to remove only one $\\mathrm{H}$ atom from a dimer, our implementation (see the details of the experimental methods) is optimized to ensure full depassivation of each of the four dimers indicated by the red circles in the schematic of Figure 2a. In the example shown (Figure 2b), $\\mathrm{H}$ atoms were removed in the order specified by the numbers placed on $\\mathrm{H}$ atoms in Figure 2a, with each number corresponding to a single depassivation event. In events 5 and 6, a pair of $\\mathrm{H}$ atoms were removed simultaneously.\n\nOnce an AM has been built, it can then be characterized in situ using filled and empty-state imaging (Figure 1d,e) as well as scanning tunneling spectroscopy (Figures 3 and $4 \\mathrm{a}, \\mathrm{b}$ ). The differential conductance maps of Figure 3 show tip-induced charging ${ }^{19,20}$ for a single depassivated dimer (Figure 3a,b) and for an AM (Figure 3c,d). The appearance of multiple rings around the $\\mathrm{AM}$ is reminiscent of the lateral Friedel oscillations of the surface state that have been observed for molecules and other defects on metals; ${ }^{21-23}$ however, given that clear charging behavior is already present for the lone depassivated dimer as well as the same trend in radius dependence on sample bias, we interpret the appearance of multiple rings around the $\\mathrm{AM}$ as relating to multiple ionizations.\n\nThe point spectra of Figure 4a were acquired at positions indicated by the triangle and circle symbols on the inset. Both the large peak and the negative differential conductance (NDC) minimum at negative sample bias of the blue (triangle) spectrum are related to electrons tunneling from the HOMO states into the STM tip. In contrast, the red (circle) spectrum shows no negative differential conductance, and the peak at negative sample bias is significantly reduced in magnitude. The set of peaks at positive bias is indicative of electrons tunneling out of the STM tip and into LUMO states of the AM. The scans in the bottom panels of Figure $4 \\mathrm{~b}$ show the spatial intensity variation of the differential conductance measured at fixed sample biases that correspond to the energies of the NDC minimum and the HOMO and LUMO peaks. From these maps, it is quite clear that the negative differential conductance has the same geometry as the HOMO. To the first order, the differential conductance spectrum is proportional to the sample local density of states (LDOS) at the coordinates of the STM tip. ${ }^{24}$ In a low density of states material such as $\\mathrm{H}-\\mathrm{Si}$ (100), the LDOS is highly susceptible to perturbation from the STM tip potential and must be considered. For the system under study, we identify tip-induced charging of the AM, and current-induced buckling of the bare Si dimers as necessary components in modeling the measured spectrum. We find the latter to be the dominant effect with regards to the appearance of NDC, though the former has also been shown to play a role in dangling bonds ${ }^{25}$ and is believed to be present in the system under study (Figure 3). Engelund et al. ${ }^{17}$ showed that, in simulated STM images, the \"butterfly-like\" appearance of a depassivated Si dimer (see second panel of Figure $2 \\mathrm{~b}$ ) is well-reproduced by assuming the underlying Si dimer buckles in a manner that minimizes the STM tunnel current, while at some lower bias, the system should transition to a regime in which the dimer is better modeled by a thermal average of buckled states. Taking these effects into account is sufficient to enable a DFT slab-based model (top center schematic of Figure 4c) to reproduce the STM topography images (insets of Figure 1d,e), the point spectra (vertically offset curves of Figure 4a), and the differential conductance maps (top panels of Figure 4b).\n\nHaving established the slab-based model as a reasonable fit to the experimental measurements, we now verify that the electronic structure exposed at the surface represents molecular orbitals. Figure $4 \\mathrm{c}$ is a molecular orbital (MO) diagram that shows which states of the AM system (center) are derived from a precursor system consisting of only two depassivated dimers (left), in comparison with which states of the AM system show significant similarity with states from an isolated $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ system (right). The $\\mathrm{HOMO}$ - and LUMO-derived states in the slab-based system are labeled as H1 and H2 and as L1 and L2, respectively; derivation from the HOMO and LUMO is illustrated by the colored links drawn between the two sets of states on the right half of Figure 4c. Determination of whether a link between states can be drawn is based on the calculated degree of overlap between the two states (see the Supporting Information). H1 and $\\mathrm{H} 2$ additionally show some overlap with the HOMO-2 state of the $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ system, meaning that they are most accurately described as being linear combinations of the HOMO and HOMO-2 states; in combination with the splitting of both HOMO (into H1 and H2) and LUMO (into L1 and L2) states, this suggests some degree of hybridization of the AM with the underlying substrate. A morenuanced interpretation of the AM is, therefore, that it is an adsorbed AM rather than a molecule perfectly isolated in vacuum.\n\nWhile the above MO analysis establishes reasonable similarity between the constructed AM and an isolated $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ molecule, the individual dimers on an unpassivated $\\mathrm{Si}$ (100) surface are known to form occupied $\\pi$ and unoccupied $\\pi^{*}$ bands, ${ }^{26,27}$ and it is important to consider that if the four sites are not coupled, the depassivation pattern might still produce similar STM images and states that show reasonable overlap with the isolated molecule states without being true molecular orbitals. It is therefore necessary to investigate whether the $\\pi$ and $\\pi^{*}$ states of the four depassivated sites are truly conjugated or whether they are independent of one another. We present two complementary analyses: the first is illustrated in the left half of Figure 4c, and the second is illustrated in Figure 4d. If the four depassivated dimer sites are decoupled, then the states in the full AM system should be no different than those of an isolated depassivated dimer system or, as shown in Figure 4c (left), a system of two isolated dimers. It is clear from the MO diagram that the completion of the central ring introduces significant splitting, particularly with regards to generation of the L1 and L2 states, verifying that the AM system is indeed conjugated. Additional analysis highlighting the role of interactions of depassivated dimers with one another across dimer rows can be found in the Supporting Information, along with a comparison between the states of the fully depassivated $\\mathrm{Si}$ (100) surface and those of the AM (Figure S3), which further demonstrate the molecular nature of the dangling bond system.\n\nIn the second, complementary analysis of the bonding behavior, we use the molecular analog $\\left(\\mathrm{Si}_{8} \\mathrm{H}_{8}\\right)$ as a means to demonstrate that the frontier orbitals of the AM are fundamentally different from those of an unconjugated $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ molecule, while at the same time, they show significant similarity to the geometrically optimized (and, therefore, conjugated) $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ molecule. We calculate the overlaps (HOMO to H1 and LUMO to L1) as a function of increasing dimer separation (Figure 4d). The Si dimers, terminated with $\\mathrm{H}$ atoms in the same manner as the $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ molecule, are interpolated from their original $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ positions to the locations that each Si atom would hold in the slab-based system; because the dimers of $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ are in vacuum, they become truly isolated from one another when separated to this degree. The trend of decreasing overlap with increasing separation indicates that the AM is a better representation for the molecule (low separation fraction) than for a set of isolated dimers (high separation fraction). The optimum configuration of L1 lies closer to a separation fraction of $0.15$ but otherwise shows the same trend as H1.\n\nIn summary, we have exploited the customizable nature of the $\\mathrm{H}-\\mathrm{Si}$ (100) surface to create artificial molecular orbitals. This is verified by in situ electronic structure measurements and DFT modeling. By virtue of comparison to the $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ molecule, there is clear evidence that the frontier orbitals of the AM constitute a cyclic conjugated $\\pi$ system and therefore establish dangling-bond-based AMs as analogues to more traditionally synthesized molecules. What is particularly interesting about the cyclic $\\mathrm{Si}_{8} \\mathrm{H}_{8} \\mathrm{AM}$ is that it exhibits delocalized $\\pi$ bonding akin to what is expected for the 2-D material silicene, which itself has a similar electronic structure to graphene. We therefore expect that our AM can be used as a building block for artificial silicene devices of arbitrary shapes and sizes, with the interesting property that their honeycomb structure is twice the size of real silicene. Another practical application is the use of AMs as designer potential wells for precision doping of silicon. More generally, AMs can generate desired chemical behavior on the Si surface localized to regions where the STM has patterned them.\n\n\\section{Sample Preparation}\nThe $\\mathrm{H}-\\mathrm{Si}$ (100) surface was prepared from a $p$ type degenerately boron doped silicon chip (3 $\\times 10^{18} \\mathrm{~cm}^{-3}$ doping density), $4 \\mathrm{~mm} \\times 10 \\mathrm{~mm} \\times 300 \\mu \\mathrm{m}$. After standard chemical cleaning (Base Piranha followed by RCA-1 and RCA-2), the sample was inserted into an ultrahighvacuum (UHV) prep chamber with a base pressure of $7 \\times 10^{-11} \\mathrm{mbar}\\left(7 \\times 10^{-9} \\mathrm{~Pa}\\right)$, then degassed at $600^{\\circ} \\mathrm{C}$ for $12 \\mathrm{~h}$ using direct current heating, followed by flash annealing at $1200^{\\circ} \\mathrm{C}(30 \\mathrm{~s}$, then $10 \\mathrm{~s}$, then $5 \\mathrm{~s})$. The sample was then passivated at $350^{\\circ} \\mathrm{C}$ by leaking $\\mathrm{H}_{2}$ gas into the UHV chamber up to $2.8 \\times 10^{-6} \\mathrm{mbar}\\left(2.8 \\times 10^{-4} \\mathrm{~Pa}\\right.$ ) for $20 \\mathrm{~min}$, using a $\\mathrm{W}$ filament placed in line-of-sight to the Si surface to crack the $\\mathrm{H}_{2}$ (7 W, $0.7$ A). Once chamber pressure fell below $7 \\times 10^{-10} \\mathrm{mbar}\\left(7 \\times 10^{-8} \\mathrm{~Pa}\\right)$, the sample was transferred to a second UHV chamber with a base pressure of $1.3 \\times 10^{-11}$ mbar $\\left(1.3 \\times 10^{-9} \\mathrm{~Pa}\\right)$ for STM.\n\n\\section{Tip Preparation}\nThe tip was prepared by electrochemically etching a polycrystalline tungsten wire. The end of the tungsten wire was partially submerged in a $1 \\mathrm{M}$ solution of $\\mathrm{KOH}$ while a DC voltage was applied. The voltage was turned off when a current drop (due to removal of the end of the tip) was detected. The tip was then cleaned in situ by annealing to approximately $1000^{\\circ} \\mathrm{C}$ for several hours before use.\n\n\\section{STM Setup}\nAll lithography and measurements were performed on a Scienta Omicron LT STM at a temperature of $4.5 \\mathrm{~K}$. (Certain commercial equipment, instruments, or materials are identified in this paper to foster understanding. Such identification does not imply recommendation or endorsement by the national institute of standards and technology, nor does it imply that the materials or equipment identified are necessarily the best available for the purpose.) The sample is grounded while the bias is applied to the tip; by convention, all biases quoted in this work are the sample bias (i.e., opposite of the applied bias). Differential conductance was measured using a lock-in amplifier, applying an additive sample bias modulation of $20 \\mathrm{mV}$ RMS at $950 \\mathrm{~Hz}$ with a time constant of $200 \\mathrm{~ms}$, and recording of the first harmonic of the current signal.\n\n\\section{Experimental Details}\nAll STM imaging scans were performed in closed-loop feedback conditions to maintain a constant current of $I=30 \\mathrm{pA}$. The differential conductance measurements of Figure 3 were acquired with feedback turned on (closed-loop conditions). All other differential conductance measurements (point spectra as well as maps) were acquired with feedback turned off (open-loop) to ensure constant height separation between tip and sample. The tip height was set by positioning the tip away from the AM, on the H-Si (100) surface, and setting the sample bias ( $V_{\\mathrm{b}}$ ) to $2 \\mathrm{~V}$ and current $(I$ ) to $30 \\mathrm{pA}$ with feedback turned on. Then, before moving the tip and performing measurements, feedback was turned off. Tip motion during open-loop conditions included plane corrections to account for slight sample tilt.\n\n\\section{Implementation of FCL}\nIn our implementation, an STM tip is positioned above the H-Si (100) surface halfway between two $\\mathrm{H}$ atoms of a Si dimer, as shown in the schematic of Figure 2a. The tunneling current set-point is then quickly ramped to $1.5 \\mathrm{nA}$ and the sample bias is slowly ramped to $2.5 \\mathrm{~V}$. Both ramps are linear. During all ramping operations, feedback control is applied to ensure that the current remains fixed at the set-point, which is achieved by moving the tip toward (decreasing $z$ ) or away from (increasing $z$ ) the surface if the measured tunnel current is too low or high, respectively. By monitoring the $z$ signal, it is possible to detect a depassivation event in which either one or two hydrogen atoms become unbound and leave the surface. Such an event will appear as a sudden change in $z$ whose direction depends on the initial state of the dimer. If the dimer is initially fully passivated, then $z$ will increase (top graph of Figure 2a) as a result of the sudden increase in the LDOS associated with the presence of a dangling bond. When the change in $z$ is detected, the current and bias are ramped back to imaging conditions to avoid further depassivation. The depicted graph shows a case in which only one $\\mathrm{H}$ atom is removed by the depassivation event, yielding the image in the first panel of Figure 2b. In this case, the STM tip is repositioned at the same location as before, and the current and bias ramps are repeated. When the second $\\mathrm{H}$ atom is removed, $z$ will decrease (bottom graph of Figure 2a). A subsequent scan reveals the fully depassivated dimer structure shown in the second panel of Figure $2 \\mathrm{~b}$.\n\n\\section{DFT Calculations}\nCalculations were performed in GPAW ${ }^{28-30}$ using the Perdew-Burke-Ernzerhof generalized gradient approximation ${ }^{31,32}$ for the exchange-correlation functional and a projector augmented wave basis with energy cutoff of $800 \\mathrm{eV}$. Dimensions of the supercells for the slab-based and isolated molecule systems are shown at the top of Figure 4c. Slabs consisted of 8 monolayers (ML) of Si atoms ending in a $\\mathrm{p}(2 \\times 1)$ dimer row reconstruction on top and terminated with $1 \\mathrm{H}$ atom per $\\mathrm{Si}$, with atoms on the bottom layer set to bulk positions and terminated with $2 \\mathrm{H}$ atoms per Si. Lateral slab dimensions were chosen to accommodate 4 dimer rows with 5 dimers per row, while vertical dimensions were chosen to allow $12 \\AA$ of vacuum. The reconstructed surface coordinates were determined by constructing a smaller slab consisting of only 1 dimer row with 1 dimer, fixing the bottom layer of $\\mathrm{Si}$ at bulk positions and allowing all other atoms to relax, using a $\\Gamma$ centered $k$-point mesh of $8 \\times 4 \\times 1$. The smaller slab was then copied laterally to generate the larger one. Dimer buckling coordinates for the AM slab-based system were determined similarly by constructing a slab consisting of 2 dimer rows and 2 dimers but lacking $\\mathrm{H}$ termination on top and then allowing atoms to relax (after slight perturbations to the top layer atomic coordinates to break the symmetry) with a $\\Gamma$ centered $k$-point mesh of $4 \\times 2 \\times 1$. This buckled c $(4 \\times 2)$ configuration was then used to determine the vertical (and small lateral) offsets for buckled dimers in the larger slab-based systems, such as the configuration shown in the top center of Figure 4c. To simulate appropriate bond angles for the isolated molecule system, one additional $\\mathrm{H}$ atom was placed on each $\\mathrm{Si}$ atom already coordinated to at least one $\\mathrm{H}$, relaxation was performed, and then the additional $\\mathrm{H}$ atoms were removed; this yielded an armchair configured molecule whose $\\mathrm{H}$ atoms exist at bond angles similar to those of the slab-based system (note that $\\mathrm{H}$ atoms, for the isolated molecule in such a configuration, are representative of the $\\mathrm{Si}-$ Si bonds between the AM and the underlying slab). All large slab-based systems, as well as the isolated molecule, were calculated with a $k$-point mesh of the $\\Gamma$ point only. All relaxations were performed to a force cutoff of $0.05 \\mathrm{eV} / \\AA$.\n\n\\section{STM Simulation and Molecular Orbital Analysis.}\nSimulations were performed using the LDOS available from DFT slab calculations according to the Tersoff-Hamann approach ${ }^{24}$ under the assumption of an s-wave tip while taking into account effects from dimer buckling. ${ }^{17}$ Determination of the molecular orbital overlaps and generation of the molecular orbital diagram in Figure $4 c, d$ are based on calculation of the PAW overlaps between pairs of systems, following the prescription of previous work. ${ }^{33}$ Additional details can be found in the Supporting Information.\n\n\\section{Supplementary Material}\nRefer to Web version on PubMed Central for supplementary material.\n\n\\section{ACKNOWLEDGMENTS}\nThis work was sponsored by the Innovations in Measurement Science (IMS) project at the National Institute of Standards and Technology (NIST), \"Atom-Based Devices: Single Atom Transistors to Solid State Quantum Computing\". We thank Joseph Stroscio and Bryan Barnes for valuable comments and discussions.\n\n\\section{REFERENCES}\n(1). Kouwenhoven L Science 1995, 268, 1440-1441. [PubMed: 17843662]\n\n(2). Kou A; Smith WC; Vool U; Brierley RT; Meier H; Frunzio L; Girvin SM; Glazman LI; Devoret MH Phys. Rev. X 2017, 7, 031037.\n\n(3). van Blaaderen A Science 2003, 301, 470-471. [PubMed: 12881559]\n\n(4). Manoharan VN; Elsesser MT; Pine DJ Science 2003, 301, 483-487. [PubMed: 12881563]\n\n(5). Dagata JA; Schneir J; Harary HH; Evans CJ; Postek MT; Bennett J Appl. Phys. Lett 1990, 56, 2001-2003.\n\n(6). Lyding JW; Shen T-C; Hubacek JS; Tucker JR; Abeln GC Appl. Phys. Lett 1994, 64, 2010–2012.\n\n(7). Shen T-C; Wang C; Abeln GC; Tucker JR; Lyding JW; Avouris P; Walkup RE Science 1995, 268, 1590-1592. [PubMed: 17754609]\n\n(8). Haider MB; Pitters JL; DiLabio GA; Livadaru L; Mutus JY; Wolkow RA Phys. Rev. Lett 2009, 102, 046805. [PubMed: 19257458]\n\n(9). Schofield SR; Studer P; Hirjibehedin CF; Curson NJ; Aeppli G; Bowler DR Nat. Commun 2013 , 4, 1649. [PubMed: 23552064]\n\n(10). Naydenov B; Boland JJ Nanotechnology 2013, 24, 275202. [PubMed: 23765570]\n\n(11). Hitosugi T; Heike S; Onogi T; Hashizume T; Watanabe S; Li Z-Q; Ohno K; Kawazoe Y; Hasegawa T; Kitazawa K Phys. Rev. Lett 1999, 82, 4034–4037.\n\n(12). Wood JA; Rashidi M; Koleini M; Pitters JL; Wolkow RA 2016, arXiv:1607.06050 [cond-mat]. \\href{http://arXiv.org}{arXiv.org} e-Print archive. \\href{https://arxiv.org/abs/1607.06050}{https://arxiv.org/abs/1607.06050} (accessed on April 28, 2018).\n\n(13). Huff TR; Labidi H; Rashidi M; Koleini M; Achal R; Salomons MH; Wolkow RA ACS Nano 2017, 11, 8636-8642. [PubMed: 28719182]\n\n(14). Yengui M; Duverger E; Sonnet P; Riedel D Nat. Commun. 2017, 8, 2211. [PubMed: 29263380]\n\n(15). Ramos MMD; Stoneham AM; Sutton AP J. Phys.: Condens. Matter 1993, 5, 2849.\n\n(16). Yokoyama T; Takayanagi K Phys. Rev. B: Condens. Matter Mater. Phys 2000, 61, R5078–R5081.\n\n(17). Engelund M; Godlewski S; Kolmer M; Zuzak R; Such B; Frederiksen T; Szymonski M; SánchezPortal D Phys. Chem. Chem. Phys 2016, 18, 19309–19317. [PubMed: 27375264]\n\n(18). Hersam MC; Guisinger NP; Lyding JW J. Vac. Sci. Technol, A 2000, 18, 1349-1353.\n\n(19). Teichmann K; Wenderoth M; Loth S; Ulbrich RG; Garleff JK; Wijnheijmer AP; Koenraad PM Phys. Rev. Lett 2008, 101, 076103. [PubMed: 18764558]\n\n(20). Wyrick J; Natterer FD; Zhao Y; Watanabe K; Taniguchi T; Cullen WG; Zhitenev NB; Stroscio JA ACS Nano 2016, 10, 10698-10705. [PubMed: 28024319]\n\n(21). Crommie MF; Lutz CP; Eigler DM Nature 1993, 363, 524-527.\n\n(22). Hasegawa Y; Avouris P Phys. Rev. Lett 1993, 71, 1071–1074. [PubMed: 10055441]\n\n(23). Gross L; Moresco F; Savio L; Gourdon A; Joachim C; Rieder K-H Phys. Rev. Lett 2004, 93, 056103. [PubMed: 15323715]\n\n(24). Tersoff J; Hamann DR Phys. Rev. B: Condens. Matter Mater. Phys 1985, 31, 805-813. (25). Livadaru L; Pitters J; Taucer M; Wolkow RA Phys. Rev. B: Condens. Matter Mater. Phys 2011, 84, 205416.\n\n(26). Northrup JE Phys. Rev. B: Condens. Matter Mater. Phys 1993, 47, 10032-10035.\n\n(27). Okada H; Fujimoto Y; Endo K; Hirose K; Mori Y Phys. Rev. B: Condens. Matter Mater. Phys 2001, 63, 195324.\n\n(28). Mortensen JJ; Hansen LB; Jacobsen KW Phys. Rev. B: Condens. Matter Mater. Phys 2005, 71, 035109.\n\n(29). Enkovaara J; Rostgaard C; Mortensen JJ; Chen J; Dulak M; Ferrighi L; Gavnholt J; Glinsvad C; Haikola V; Hansen HA; et al. J. Phys.: Condens. Matter 2010, 22, 253202. [PubMed: 21393795]\n\n(30). Larsen AH; Mortensen JJ; Blomqvist J; Castelli IE; Christensen R; Dulak M; Friis J; Groves MN; Hammer B; Hargus C; et al. J. Phys.: Condens. Matter 2017, 29, 273002. [PubMed: 28323250]\n\n(31). Perdew JP; Burke K; Ernzerhof M Phys. Rev. Lett 1996, 77, 3865–3868. [PubMed: 10062328]\n\n(32). Perdew JP; Burke K; Ernzerhof M Phys. Rev. Lett 1997, 78, 1396-1396.\n\n(33). Wyrick J; Einstein TL; Bartels LJ Chem. Phys 2015, 142, 101907. a\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_b2865949a80ad08a2835g-10_216_548_816_1514}\n\nb\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_b2865949a80ad08a2835g-10_571_1965_759_1567}\n\nFigure 1.\n\nRing-structure Si-based molecule and analogous artificial molecule built by STM. (a) Top and side views of $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ molecule in vacuum. Blue spheres represent $\\mathrm{Si}$ atoms, and gray spheres represent hydrogen. A skeletal chemical structure is overlaid to aid in identification of corresponding features in subsequent images. The side view highlights that the molecule is not planar but rather has a chair conformation. (b) Calculated electron orbitals, HOMO and LUMO, of the molecular analogue. Orbitals are displayed as isosurfaces of the squared wave function. (c) Artificial molecule built on the passivated Si (100) surface by selective removal of $\\mathrm{H}$ atoms. (d) STM constant current topography images of the occupied states, and (e) unoccupied states of the artificial molecule. Insets show the corresponding simulated images based on DFT calculations. The orange, dashed overlay in panels c-e indicates the location of the central dimer row in each, where a dimer is defined to be a pair of two covalently bonded surface Si atoms. Imaging conditions are $-2 \\mathrm{~V}$ sample bias and $30 \\mathrm{pA}$ current set point for panel $\\mathrm{d}$ and $+2 \\mathrm{~V}$ sample bias and $30 \\mathrm{pA}$ current set point for panel e. Both images are $5 \\mathrm{~nm} \\times 5 \\mathrm{~nm}$.\n\n\\section{$\\mathbf{a}$}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b2865949a80ad08a2835g-12_256_1511_381_1950}\n\\end{center}\n\nb\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b2865949a80ad08a2835g-12_1618_1960_381_1950}\n\\end{center}\n\nFigure 2.\n\nConstruction of an AM on the passivated Si surface using FCL. (a) Representative graphs of the feedback, $z$, signal during the FCL procedure used at each step of molecule construction. The STM tip is positioned in the middle of a dimer, as illustrated in the schematic at right. The top graph is indicative of the feedback and depassivation event associated with removal of one or two hydrogen atoms on a dimer that was previously fully passivated. The bottom graph depicts the feedback and depassivation event associated with removal of the second $\\mathrm{H}$ atom of a dimer after the first had been removed by a previous FCL step. Feedback is maintained during the entire procedure so that the measured $z$ signal will be indicative of depassivation events, as illustrated (orange). The schematic at right shows the tip positions (red circles) and the order of $\\mathrm{H}$ atom removals for each of the numbered steps shown in panel b. Control signal ramps are indicated by the red and blue regions for tunnel current ramps and sample bias ramps, respectively. The bias ramp is allowed to go as high as $2.5 \\mathrm{~V}$ but will be cut off prematurely when a depassivation event is detected. All control signal ramps are linear. (b) STM topography images $(2.8 \\mathrm{~nm} \\times 2.8 \\mathrm{~nm}$ ) of the step-by-step construction of an artificial molecule. Red circles indicate the position of the STM tip in each FCL step. STM imaging conditions are $+2 \\mathrm{~V}$ sample bias and 30 pA current set point. a b\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_b2865949a80ad08a2835g-14_310_1099_511_996}\\\\\nC\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b2865949a80ad08a2835g-14_305_823_1144_1783}\n\\end{center}\n\n$2.0 \\mathrm{~V}$\n\nFigure 3.\n\nCharging rings measured with differential conductance maps. (a) An abrupt peak in differential conductance appears in a ring shape around a fully depassivated dimer, indicating charging of the dimer due to tip-induced band bending. The near circular shape can be understood as an energy isosurface of the tip-induced potential. (b) The radius of the ring increases with increasing sample bias in agreement with the charging ring interpretation of this feature. $(\\mathrm{c}, \\mathrm{d})$ Similar behavior is seen in a charging ring surrounding an AM, indicating charging behavior at positive sample bias. All differential conductance maps shown here were taken in constant current mode; the dark appearance of both the depassivated dimer and the AM in these images is due to the influence of tip height variations on the differential conductance signal and are the reason for the preferred use of constant-height-mode differential conductance maps in Figure 4. a\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b2865949a80ad08a2835g-16_221_1004_301_930}\n\\end{center}\n\nb\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b2865949a80ad08a2835g-16_1065_1537_325_954}\n\\end{center}\n\nc\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_b2865949a80ad08a2835g-16_218_486_946_2040}\n\nd\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_b2865949a80ad08a2835g-16_1106_1534_988_1256}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_b2865949a80ad08a2835g-16_1084_1317_1243_1652}\n\\end{center}\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_b2865949a80ad08a2835g-16_1144_1361_1691_1952}\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_b2865949a80ad08a2835g-16_1084_1360_1242_1952}\n\nFigure 4.\n\nSpectroscopy and calculation of artificial molecular electronic structure. (a) Differential conductance point spectra acquired at positions marked by the triangle and circle symbols in the inset. DFT simulated spectra are shown on the same graph offset vertically by 50 and 15 pS, respectively, for the triangle and circle spectra. (b) Differential conductance maps (bottom) and their corresponding simulated maps (top) acquired at the fixed sample bias voltages indicated at the bottom of each panel. (c) Molecular orbital energy diagram showing the links between calculated Kohn-Sham orbitals of the three systems (from left to right): a precursor to the artificial molecule slab, the artificial molecule slab, and the isolated $\\mathrm{Si}_{8} \\mathrm{H}_{8}$ molecule. States colored light blue for the artificial molecule slab system are those that show significant overlap with states from a fully hydrogen-terminated slab. (d) Normalized projector augmented wave (PAW) overlaps between the isolated molecule and the artificial molecule slab-based system as the isolated molecule's Si atoms are interpolated from their initial positions to those of their equivalent $\\mathrm{Si}$ atoms in the slab-based system. The atomic positions illustrated at right show the configuration at a separation fraction of 1 , which is defined to be the fully interpolated system. The graph of L1 stops at a separation fraction of $0.5$ as a result of the LUMO becoming filled. While the preferred separation between dimer pairs in the isolated molecule depends on which orbital is considered, the fact that the overlaps peak by a separation fraction of $0.15$ demonstrates that the bound molecule is a better description for the AM than an isolated set of dimers would be.\n\n\n\\end{document}", "record_id": "2023_09_22_b2865949a80ad08a2835g"}