{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{multirow}\n\n\\title{Magnetic Isotropy/Anisotropy in Layered Metal Phosphorous Trichalcogenide $\\mathrm{MPS}_{3}$ $(\\mathrm{M}=\\mathrm{Mn}$, Fe)Single Crystals }\n\n\n\\author{Zia ur Rehman ${ }^{1,2, \\dagger}$, Zahir Muhammad ${ }^{1, \\dagger}$, Oyawale Adetunji Moses ${ }^{1}$, Wen Zhu ${ }^{1}$,\\\\\nChuanqiang $\\mathrm{Wu}^{1}{ }^{1}$, Qun $\\mathrm{He}^{1}{ }^{1}$, Muhammad Habib ${ }^{1}$ and Li Song ${ }^{1, * \\text { (iD }}$\\\\\n1 National Synchrotron Radiation Laboratory, CAS Center for Excellence in Nanoscience,\\\\\nUniversity of Science and Technology of China, Hefei 230029, China; zurehman@mail.ustc.edu.cn (Z.u.R.);\\\\\nzahir@mail.ustc.edu.cn (Z.M.); oyawaletj@mail.ustc.edu.cn (O.A.M.); sa2016@mail.ustc.edu.cn (W.Z.);\\\\\nwucq@mail.ustc.edu.cn (C.W.); hqun@mail.ustc.edu.cn (Q.H.); mhabib@mail.ustc.edu.cn (M.H.)\\\\\n2 Department of Applied Physics, University of Karachi, Karachi-75270, Pakistan\\\\\n* Correspondence: song2012@ustc.edu.cn; Tel.: +86-551-6360-2102\\\\\n$+$ These two authors contributed equally in this work.}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nArticle\n\nReceived: 12 May 2018; Accepted: 8 June 2018; Published: 11 June 2018\n\n\\begin{abstract}\nDespite the fact that two-dimensional layered magnetic materials hold immense potential applications in the field of spintronic devices, tunable magnetism is still a challenge due to the lack of controllable synthesis. Herein, high-quality single crystals $\\mathrm{MPS}_{3}(\\mathrm{M}=\\mathrm{Mn}$, Fe $)$ of millimeter size were synthesized through the chemical vapor transport method. After systemic structural characterizations, magnetic properties were studied on the bulk MPS 3 layers through experiments, along with first principle theoretical calculations. The susceptibilities as well as the EPR results evidently revealed unique isotropic and anisotropic behavior in $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ crystals, respectively. It is worth noting that both of these materials show antiferromagnetic states at measured temperatures. The estimated antiferromagnetic transition temperature is $78 \\mathrm{~K}$ for bulk $\\mathrm{MnPS}_{3}$ and $123 \\mathrm{~K}$ for $\\mathrm{FePS}_{3}$ crystals. The spin polarized density functional theory calculations confirmed that the band gap of the antiferromagnetic states could be generated owing to asymmetric response all over the energy range. The ferromagnetic state in $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ is less stable as compared to the antiferromagnetic state, resulting in antiferromagnetic behavior. Additionally, frequency-dependent dielectric functions for parallel and perpendicular electric field component vectors, along with the absorption properties of $\\mathrm{MPS}_{3}$, are thoroughly investigated.\n\\end{abstract}\n\nKeywords: layered material; bulk single crystal; isotropy; anisotropy; chemical vapor transport $(\\mathrm{CVT})$; density-functional theory (DFT)\n\n\\section{Introduction}\nMagnetism has been proven to be widely helpful in the understanding of the quantum nature of materials. Although 2D transition metal dichalcogenides (TMDs) have been the center of attention in the recent era, transition metal chalcogenophosphates (TMCs) with general formula of MPX3 (M=Mn, $\\mathrm{Fe}, \\mathrm{Ni}, \\mathrm{Co}$ and $\\mathrm{X}=\\mathrm{S}, \\mathrm{Se}$ ) have also proven to be unique materials with their low-dimensional magnetic properties. These MPX3 have secured renewed interest owing to their importance, not only for fundamental research, but also as potential candidates for numerous technological applications [1-10]. They belong to one of the few layered systems having 2D lattice for both magnetic and crystallographic systems. These materials possess two spin channels, one conducting and the other insulating. This family of materials is considered to be the best suited for applications in spintronic [11,12]. Over the last few years, MPX3 have gained attention because of their enormous potential as a material for next generation electronics. In this regard, $\\mathrm{MnPS}_{3}$ has been the focus because of electron valley freedom coupled with antiferromagnetic order [13]. A minute amount of magnetic field leak makes these antiferromagnetic materials a well-suited choice for use in robust data storage applications [14,15]. In recent years, layered antiferromagnetic materials have been used to induce deterministic switching without an external magnetic field [16]. Additionally, the higher magnetic resonance frequency of antiferromagnetic materials, in comparison with ferromagnetic materials, has attracted their use in providing high-speed data processing [17].\n\n$\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ belong to the same MPX3 class of materials with isotropic and anisotropic magnetic susceptibilities, respectively [18]. Both $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ are layered magnetic materials with weak Van der Waal forces separating the layers. The presence of the Van der Waal gap rules out the possibility of superexchange pathways as well as minimizes the possibility of direct exchange owing to metal-metal interlayer distance of $\\sim .5 \\AA$ and $6.4 \\AA$ in $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$, respectively. These materials can be exfoliated into a single layer [19] and possess a magnetic ground state, dependent on transition metal element [18].\n\nMPX3 materials have been mostly investigated for their intercalation properties [9]. These are wide bandgap, highly resistive semiconductors having bandgap of the order of $3 \\mathrm{eV}$. Bandgaps for $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ are approximately $2.4$ and $1.5 \\mathrm{eV}$, respectively. The adequate amount of bandgap makes these materials a suitable semiconductor for optoelectronic [20], optoelectronic material processing [6], while $\\mathrm{MnPS}_{3}$ has also been realized as a promising photocatalyst for water splitting [21]. $\\mathrm{MnPS}_{3}$ is optically transparent with a greenish color [22], while $\\mathrm{FePS}_{3}$ has a brownish appearance. More importantly, the magnetic character of $\\mathrm{MnPS}_{3}$ arises from $\\mathrm{Mn}^{2+}$ having spin $5 / 2$ that forms a honeycomb lattice in a, b plane. The weak Van der Waal interlayer coupling is attributed to $S$ atoms, but the antiferromagnetic phase transition at $78 \\mathrm{~K}$ points towards an interplane exchange that can be associated with some degree of metal-ligand covalency [23,24]. $\\mathrm{FePS}_{3}$ is a striking compound because of the fact that it exhibits stronger magnetic interactions between $\\mathrm{Fe}^{2+}$ ions in comparison with $\\mathrm{Mn}^{2+}$ as well as due to the reason that electronic structure of the $\\mathrm{Fe}^{2+}$ ions demonstrate strong anisotropy [18,25]. The isotropic/anisotropic nature affects the frequency-dependent dielectric and absorption properties of $\\mathrm{MPS}_{3}$ as well. All these facts make these $\\mathrm{MPS}_{3}$ ideal candidates for 2D magnetic as well as optoelectronic systems.\n\nHerein, we report the chemical vapor transport (CVT) synthesis of highly crystalline, millimeter-size $\\mathrm{MPS}_{3}(\\mathrm{M}=\\mathrm{Mn}, \\mathrm{Fe})$ single crystals. Furthermore, the magnetic isotropic/anisotropic properties of bulk $\\mathrm{MPS}_{3}$ single crystals were tested using electron paramagnetic resonance (EPR) and vibrating sample magnetometer (VSM). Experimental results revealed the antiferromagnetic nature of these materials with $\\mathrm{MnPS}_{3}$ exhibiting isotropic whereas, $\\mathrm{FePS}_{3}$ showed highly anisotropic properties measured by magnetic susceptibilities. The magnetic and dielectric properties of these materials were confirmed using first principle spin polarized density-functional theory (DFT) calculations.\n\n\\section{Experiments}\nThe millimeter-sized $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ single crystals were prepared using CVT method. The charge for $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ was prepared by using a stoichiometric amount of $\\mathrm{Mn}, \\mathrm{P}, \\mathrm{S}$ and $\\mathrm{Fe}, \\mathrm{P}, \\mathrm{S}$ for $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$, respectively. Iodine was used as transport agent for this growth. The charge was kept in a $17-\\mathrm{cm}$ long silica tube, and was sealed under vacuum $\\left(\\approx 10^{-1} \\mathrm{~atm}\\right)$. The sealed ampoule was placed inside a two-zone furnace with a hot zone temperature of $650{ }^{\\circ} \\mathrm{C}$ and cold zone temperature of $600{ }^{\\circ} \\mathrm{C}$ for 7 days. The reaction yielded pale green colored single crystals and brownish single crystals at the low temperature end of ampoule for $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$, respectively.\n\nThe structural study of as-prepared samples was carried out by using X-ray diffraction (XRD) and high-resolution transmission electron by microscope (TEM); phonon spectrum was studied by using Raman Spectroscopy, chemical composition by using X-ray photoelectron spectroscopy (XPS), the morphology of the samples was investigated by using scanning electron microscope (SEM). The magnetic properties of these bulk crystal samples were studied by using electron paramagnetic resonance (EPR), and physical properties measurement system (PPMS) through vibrating sample magnetometer (VSM).\n\n\\section{Results and Discussions}\nTypical SEM images of as-obtained $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ samples are shown in Figure 1a,b. It can be seen that both $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ exhibit smooth surfaces with roughly hexagonal morphology. The SEM images also show a layered structure of $\\mathrm{MPS}_{3}$. Inset Figure 1a,b depict millimeter size as grown single crystals of $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$, respectively. Figure 1c,d represent the Raman spectra of $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ recorded at room temperature using $532 \\mathrm{~nm}$ laser excitation. For $\\mathrm{MnPS}_{3}$, the Raman peaks at 114.3, 152.2, 245 and $568 \\mathrm{~cm}^{-1}$ are identified as $\\mathrm{E}_{\\mathrm{g}}$ vibrating mode, and 273.3, $283.1$ and $580 \\mathrm{~cm}^{-1}$ are recognized as $A_{1 g}$ mode [21]. In the case of $F^{-P S} S_{3}$, the Raman peaks at $97.3,155.9,224.1$, $246.8 \\mathrm{~cm}^{-1}$ are identified as $\\mathrm{E}_{\\mathrm{g}}$ vibrating mode whereas, peaks at 279 and $379.2 \\mathrm{~cm}^{-1}$ are referred to as $\\mathrm{A}_{1 \\mathrm{~g}}$ mode [23].\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_7dab45b11a3ede362147g-03_961_2027_426_1628}\n\nFigure 1. (a,b) Scanning electron microscope (SEM) images, inset shows millimeter sized as grown single crystals and (c,d) Raman spectra of as-obtained $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ single crystals, respectively.\n\nThe X-ray diffraction data (XRD) of the samples were analyzed to study the crystal planes and crystallinity of $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ single crystals. It is evident from Figure 2a,b that these results are well in accordance with the standard JPCDS cards belonging to (PDF\\#33-0903, PDF\\#30-0663) $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$, respectively. The crystal lattice and phase identification revealed that both $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ exhibit high-quality single crystals with major (001) and (002) peaks. The absence of any impurity peak suggests that these samples have pure phases. Inset in Figure 2a,b shows the crystallographic model of $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ along (001) plane, respectively. Figure $2 \\mathrm{c}$, d displays the TEM images of $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$, suggesting that both samples are highly crystalline with growth as single crystal. The d-spacing\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7dab45b11a3ede362147g-03_2581_2633_254_1808}\n\\end{center}\n\nplanes in $\\mathrm{MnPS}_{3}$, while $0.25 \\mathrm{~nm}$ and $0.29 \\mathrm{~nm}$ correspond to (131) and ( $\\left.\\overline{2} 01\\right)$ planes in monoclinic unit cell of $\\mathrm{FePS}_{3}$.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_7dab45b11a3ede362147g-04_428_1618_333_1733}\n\nFigure 2. (a,b) X-ray diffraction patterns and (c,d) high resolution transmission electron by microscope\n\n(TEM) images for $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ single crystals prepared by ball-milling and sonication process.\n\nThe chemical composition and bonding state of the samples were studied by using XPS analysis, as shown in Figure 3. The Mn $2 \\mathrm{p}$ peaks of $\\mathrm{MnPS}_{3}$ detected at $652.8$ and $641 \\mathrm{eV}$ can be assigned to $2 \\mathrm{p}_{3 / 2}$ and $2 \\mathrm{p}_{1 / 2}$, respectively. The $\\mathrm{S} 2 \\mathrm{p}$, peaks identified at $162.75$ and $163.9 \\mathrm{eV}$ can be assigned to $2 \\mathrm{p}_{3 / 2}$ and $2 \\mathrm{p}_{1 / 2}$. For $\\mathrm{P} 2 \\mathrm{p}$, two peaks at $132.5 \\mathrm{eV}$ and $133.6 \\mathrm{eV}$ are assigned to $2 \\mathrm{p}_{3 / 2}$ and $2 \\mathrm{p}_{1 / 2}$. In case of $\\mathrm{FePS}_{3}$, the Fe $2 \\mathrm{p}$ peaks at 709 and $722 \\mathrm{eV}$ are assigned to $2 \\mathrm{p}_{3 / 2}$ and $2 \\mathrm{p}_{1 / 2}$. Both $\\mathrm{S} 2 \\mathrm{p}$ and $\\mathrm{P} 2 \\mathrm{p}$ peaks of $\\mathrm{FePS}_{3}$ show quite similar position and shape as those peaks for $\\mathrm{MnPS}_{3}$. All these values are consistent with the previous reports [26,27].\n\nMagnetic susceptibility indicates the magnetic properties of a material. It depicts the degree of magnetization of a material with respect to temperature at constant applied magnetic field. The magnetic susceptibility $(\\chi)$ as a function of temperature for both $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ crystals is represented in Figure 4a,b. The susceptibility plots of $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ were examined through field cooling (FC) and zero field cooling (ZFC) curves. From the susceptibility plots, we can observe the isotropic behavior of $\\mathrm{MnPS}_{3}$, while for $\\mathrm{FePS}_{3}$ a considerable anisotropic trend has been noticed. The susceptibilities of $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ increase with decreasing temperature till at $120 \\mathrm{~K}$ and $128 \\mathrm{~K}$, respectively. Beyond this point it shows rapid decrease, exhibiting a Curie like tail at lowest temperatures. Furthermore, the susceptibility is seen to follow the Curie-Weiss law at higher temperatures (inset Figure $4 a, b$ ), which is an identification feature of the antiferromagnetic nature of these materials [7]. It can be inferred from Figure $4 a, b$ that Neel temperature for $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ are $78 \\mathrm{~K}$ and $123 \\mathrm{~K}$, while the corresponding Curie temperatures are found to be at $365 \\mathrm{~K}$ and $324 \\mathrm{~K}$, respectively. These values of Neel temperature and Curie temperature are well matched with the previous reports [28,29]. The broad maxima above Neel temperature is a result of short-range spin-spin correlation in typical magnetic systems. We can observe that magnetic susceptibility for FC is higher than ZFC throughout the observed range for both $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$. The increased Curie temperature beyond room temperature shows that these materials are favorable for spintronic applications.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_7dab45b11a3ede362147g-05_578_1404_320_1736}\n\nFigure 3. X-ray photoelectron microscopy of $(\\mathbf{a}-\\mathbf{c}) \\mathrm{MnPS}_{3}$ and (d-f) $\\mathrm{FePS}_{3}$ single crystals.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7dab45b11a3ede362147g-05_1523_2509_434_1622}\n\\end{center}\n\nFigure 4. Magnetic susceptibility of (a) $\\mathrm{MnPS}_{3}$ and (b) $\\mathrm{FePS}_{3}$ single crystals with millimeter size. Electron paramagnetic resonance spectra of (c) bulk $\\mathrm{MnPS}_{3}$ and (d) $\\mathrm{FePS}_{3}$ single crystals. The electron paramagnetic resonance (EPR) method was employed to study the quantum mechanical mixed spin states of both samples. The EPR signal typically originates from the surface of electrons, which increases by the exposures of some metals. The EPR spectra of the samples were measured at $120 \\mathrm{~K}, 200 \\mathrm{~K}$ and $300 \\mathrm{~K}$ at constant frequency of $9 \\mathrm{GHz}$. Figure $4 \\mathrm{c}$,d depicts the EPR spectra of $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ with unpaired electrons. For $\\mathrm{MnPS}_{3}$, the EPR spectra is isotropic, with the magnetic signals containing a single narrow resonance peak (Figure 4c). On the other hand, EPR spectra for $\\mathrm{FePS}_{3}$ is highly anisotropic with multiple magnetic resonance peaks (Figure $4 \\mathrm{~d}$ ). The magnetic resonance peaks for $\\mathrm{MnPS}_{3}$ occurs at 404.1, 410 and $410.33 \\mathrm{mT}$, while multiple resonance peaks were observed for $\\mathrm{FePS}_{3}$ at all measured temperatures as described in Table 1. The strong signals at $300 \\mathrm{~K}$ for $\\mathrm{FePS}_{3}$ can be attributed to the shortening of relaxation time with temperature in anisotropic materials [30,31]. Details for the position of six resonance peaks observed for $\\mathrm{FePS}_{3}$ along with their corresponding values of g-factor is given in Table 1.\n\nTable 1. Resonance peak position and value of g-factor for bulk $\\mathrm{FePS}_{3}$ single crystals.\n\n\\begin{center}\n\\begin{tabular}{ccccccc}\n\\hline\n\\multirow{2}{*}{Temperature} & \\multicolumn{5}{c}{Value of $\\boldsymbol{g}$-Factor (Resonance Peak Position, mT)} &  \\\\\n\\cline { 2 - 7 }\n & Peak 1 & Peak 2 & Peak 3 & Peak 4 & Peak 5 & Peak 6 \\\\\n\\hline\n$300 \\mathrm{~K}$ & $1.080(593.62)$ & $1.057(608.36)$ & $1.032(623.11)$ & $1.007(638.5)$ & $0.983(653.9)$ & $0.9589(670.6)$ \\\\\n$200 \\mathrm{~K}$ & $1.088(590.9)$ & $1.062(605.0)$ & $1.036(621.0)$ & $1.007(638.5)$ & $0.986(651.85)$ & $0.9592(670.6)$ \\\\\n$120 \\mathrm{~K}$ & $1.082(594.27)$ & $1.066(602.95)$ & $1.043(616.39)$ & $1.018(631.13)$ & $0.990(649.14)$ & $0.9646(666.59)$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nThe magnetic coupling factor or $\\mathrm{g}$-factor \" $\\mathrm{geff}_{\\text {eff }}$ was computed from EPR spectra using the following relationship [32]:\n\n\\[\n\\mathrm{g}_{\\text {eff }} \\cong \\frac{\\mathrm{h} \\gamma}{\\mu_{\\mathrm{B}} \\mathrm{H}_{\\text {center }}}\n\\]\n\nwhere \" $\\gamma$ \" is the frequency, \" $h$ \" is Planck constant, \" $\\mu_{\\mathrm{B}}$ \" indicating Bohr magnetron and $\\mathrm{H}_{\\text {center }}$ is the resonance magnetic field. The calculated values of $g_{\\text {eff }}$ are found to be 1.5921, 1.5684, and $1.5679$ at 120, 200 and $300 \\mathrm{~K}$ for $\\mathrm{MnPS}_{3}$.\n\nAnisotropy of magnetization originates from the anisotropy of the particles themselves in the form of shape or crystalline anisotropy and degree of alignment. The crystalline anisotropy relies on lattice forces and subsequent magnetization along an easy axis. EPR spectrum intensity is affected by number, position and nature of magnetic ions as well as the spin environment e.g., electron spin exchange with identical and non-identical atoms or molecules or with the spin of unpaired electrons of neighboring molecules. Additionally, in case of single crystals having equal orientations, it is expected that one defect will exist in all orientations with equal probability. For a low symmetry g-tensor and at an arbitrary direction of magnetic field, different effective values of $\\mathrm{g}$-factors are possible for the different orientations of the defect that can give rise to different magnetic field positions of EPR lines [33]. In fact, isotropy and anisotropy also affect the dielectric and absorption properties of materials. Isotropic materials display uniform dielectric functions along different directions, whereas anisotropic materials possess direction-dependent dielectric properties. In order to further understand the effect of isotropic and anisotropic behavior, spin-polarized first-principle density functional theory (DFT) calculations were performed to describe the magnetic response of $\\mathrm{MPS}_{3}(\\mathrm{M}=\\mathrm{Fe}, \\mathrm{Mn})$. The computations were carried out by using DFT through Vienna ab initio simulation package (VASP) [34]. A projector augmented wave (PAW) method [35,36] was used to characterize the ion-electron interface and the generalized gradient approximation (GGA) was stated by the PBE functional $[37,38]$. The plane wave cutoff energy was set to $500 \\mathrm{eV}$ with energy precision of $10^{-5} \\mathrm{eV}$. The force criteria on each atom was less than $10^{-2} \\mathrm{eV} / \\AA$ A. The Brillouin zone $\\Gamma$-centered was sampled with a $12 \\times 12 \\times 1$ Monkhorst-Pack of k-points grid for geometry optimization, while the static electronic calculation $8 \\times 8 \\times 1$ and self-consistent calculations of the $\\mathrm{MPS}_{3}(\\mathrm{M}=\\mathrm{Mn}, \\mathrm{Fe})$ system were made. Unit cells were considered for these calculations. To obtain electronic and magnetic results, we employed a partition by hybrid HSE06 functional [38,39] with an accurate Fock exchange and typically achieved much better results than the DFT and DFT $+U$ methods [40]. A single unit cell with lattice parameters of $\\operatorname{MnPS}_{3}(a=6.076 \\AA$, $\\mathrm{b}=10.524 \\AA$ and $\\mathrm{c}=6.796 \\AA)$ and $\\mathrm{FePS}_{3}(\\mathrm{a}=5.949 \\AA, \\mathrm{b}=10.288 \\AA$ And $\\mathrm{c}=6.72 \\AA)$ from the experimental data has been used for calculations.\n\nAccording to our magnetic energy calculations that are listed in Table 2, the ferromagnetic state in both cases is less stable as compared to the antiferromagnetic state, with an energy difference of about $0.601 \\mathrm{eV}$ for $\\mathrm{MnPS}_{3}$, while for $\\mathrm{FePS}_{3}$ the difference in energies is around $1.02 \\mathrm{eV}$. Total energy calculations clearly defined that the room temperature antiferromagnetic (RTAFM) state is in the ground state of $\\mathrm{MPS}_{3}(\\mathrm{M}=\\mathrm{Fe}, \\mathrm{Mn})$.\n\nSimilarly, the density of states (DOS) calculations in Figure 5 show the asymmetry between the spin-up and spin-down state of $\\mathrm{MPS}_{3}(\\mathrm{M}=\\mathrm{Fe}, \\mathrm{Mn})$. Figure $5 \\mathrm{a}, \\mathrm{b}$ shows the evidence of magnetism for both $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ layers with asymmetric density states in different energy levels. It can be seen that the electronic density of $\\mathrm{MnPS}_{3}$ mainly stems from $\\mathrm{M}^{\\prime} d, \\mathrm{P}^{\\prime} p$ and $\\mathrm{S}^{\\prime} p$ states. Particularly, strong hybridization of $\\mathrm{Mn}^{\\prime} d, \\mathrm{P}^{\\prime} p$ and $\\mathrm{S}^{\\prime} p$ states is found between $-7 \\mathrm{eV}$ and $-1 \\mathrm{eV}$, while strong $\\mathrm{P}^{\\prime} p$ and weak $\\mathrm{Mn}^{\\prime} d$, and $\\mathrm{S}^{\\prime} p$ was witnessed between $4 \\mathrm{eV}$ and $5 \\mathrm{eV}$. However, near the Fermi level, strong S' $p$ and weak $\\mathrm{Mn}^{\\prime} d$ states exist, as shown in Figure 5a. Similarly for $\\mathrm{FePS}_{3}, \\mathrm{Fe}^{\\prime} d, \\mathrm{P}^{\\prime} p$ and $\\mathrm{S}^{\\prime} p$ states exist between $-7 \\mathrm{eV}$ and $-2 \\mathrm{eV}$, and strong $\\mathrm{P}^{\\prime} p$ and weak $\\mathrm{Mn}^{\\prime} d$, and $\\mathrm{S}^{\\prime} p$ appear between $4 \\mathrm{eV}$ and $6 \\mathrm{eV}$. Likewise, strong S' $p$ and a weak Fe'd states exist near the Fermi level, as shown in Figure $5 \\mathrm{~b}$. All these states (spin-up and spin-down) are asymmetric and contribute to the magnetic isotropic/anisotropic trend throughout the energy range. The $d$-orbitals of $\\mathrm{Mn}$ and Fe have the most obvious contribution of spinpolarization, which mainly contributes towards the magnetism of $\\mathrm{MPS}_{3}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_7dab45b11a3ede362147g-07_1268_2598_503_1553}\n\\end{center}\n\nFigure 5. (a,b) Projected density of states of $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}(\\mathbf{c}, \\mathbf{d})$ structure of $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ under incident electromagnetic wave $(\\mathbf{e}, \\mathbf{f})$ calculated dielectric function for $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$, respectively. The frequency-dependent dielectric functions have been calculated using parallel and perpendicular electric field component vectors along the c-axis, as shown in Figure $5 c, d$. The frequency-dependent dielectric functions in Figure 5e,f show a strong isotropic and anisotropic behavior in lower and higher energy ranges for $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$, respectively. It was found that $\\mathrm{MnPS}_{3}$ shows strong isotropic behavior for perpendicular and parallel polarization at lower and higher energy ranges. On the contrary, $\\mathrm{FePS}_{3}$ exhibits a strong anisotropic trend for both perpendicular and parallel polarization with an increased number of peaks for dielectric constants at the given energy range. Moreover, the calculated frequency-dependent dielectric functions show a similar trend between $5 \\mathrm{eV}$ to $40 \\mathrm{eV}$ and $60 \\mathrm{eV}$ to $100 \\mathrm{eV}$ with increased number peaks of $\\mathrm{FePS}_{3}$ for both perpendicular and parallel polarization as compared to $\\mathrm{MnPS}_{3}$, which clearly demonstrates the effect of isotropic and anisotropic trend on $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$, respectively.\n\nTable 2. Total energy calculations for ferromagnetic (FM) and anti-ferromagnetic (AFM) state and their difference for $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$.\n\n\\begin{center}\n\\begin{tabular}{cccc}\n\\hline\nMaterials & $\\mathbf{E}_{\\mathbf{0}}$ (FM Calculation) & $\\mathbf{E}_{\\boldsymbol{0}}$ (AFM Calculation) & $\\mathbf{d E}_{\\mathbf{0}}$ (FM-AFM) \\\\\n\\hline\n$\\mathrm{MnPS}_{3}$ & $114.92800 \\mathrm{eV}$ & $114.32689 \\mathrm{eV}$ & $0.601 \\mathrm{eV}$ \\\\\n$\\mathrm{FePS}_{3}$ & $164.99485 \\mathrm{eV}$ & $163.97464 \\mathrm{eV}$ & $1.02 \\mathrm{eV}$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\n\\section{Conclusions}\nHigh-quality single crystals of $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ were synthesized by using CVT. The EPR and VSM were used to corroborate the existence of antiferromagnetic behavior and to study isotropy/anisotropy in these materials. The probe for the magnetic character of $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$ was carried out at $120 \\mathrm{~K}, 200 \\mathrm{~K}$ and $300 \\mathrm{~K}$. The susceptibility showed a typical antiferromagnetic behavior in $\\mathrm{MnPS}_{3}$ with an isotropic trend, while an anisotropic behavior was witnessed for $\\mathrm{FePS}_{3}$. Moreover, our calculations further confirmed that the antiferromagnetic state was additionally stable than the ferromagnetic state for both $\\mathrm{MnPS}_{3}$ and $\\mathrm{FePS}_{3}$. The projected density of states (PDOS) manifested a vital irregularity between spin-up and spin-down channels of $\\mathrm{Mn}$ and $\\mathrm{Fe} 3 \\mathrm{~d}$ states, which is responsible for the primary contribution to the antiferromagnetic states near the Fermi level. The frequency-dependent dielectric function calculations have shown that $\\mathrm{MnPS}_{3}$ possessed strong isotropic behavior for both perpendicular polarization and parallel polarization at lower and higher energy ranges. On the contrary, $\\mathrm{FePS}_{3}$ exhibited strong anisotropic trend for both perpendicular as well as for parallel polarizations at the given energy range.\n\nAuthor Contributions: L.S. conceived and designed the experiments; Z.u.R. performed the experiments and analyzed the data; Z.M. performed the computational study, O.A.M, C.W. and Q.H helped in analysis of the data; W.Z. contributed in providing analysis tools; M.H. provided help in writing the paper.\n\nAcknowledgments: This work is partially supported by MOST (2017YFA0303500, 2014CB848900), NSFC (U1532112, 11574280), CAS Key Research Program of Frontier Sciences (QYZDB-SSW-SLH018) and CAS Interdisciplinary Innovation Team. Z.R., Z.M., O.A.M. and M.H. thank CSC fellowship. We would like to thank the Hefei Synchrotron Radiation Facility (ARPES, Photoemission and MCD End stations) and the USTC Center for Micro and Nanoscale Research and Fabrication for help in characterizations.\n\nConflicts of Interest: The authors declare no conflict of interest.\n\n\\section{References}\n\\begin{enumerate}\n  \\item Zhu, J.; Yang, Y.; Jia, R.; Liang, Z.; Zhu, W.; Rehman, Z.U.; Bao, L.; Zhang, X.; Cai, Y.; Song, L.; et al. Ion Gated Synaptic Transistors Based on 2D van der Waals Crystals with Tunable Diffusive Dynamics. Adv. Mater. 2018, 30. [CrossRef] [PubMed]\n\n  \\item Brec, R. Review on structural and chemical properties of transition metal phosphorous trisulfides MPS $_{3}$. Solid State Ion. 1986, 22, 3-30. [CrossRef]\n\n  \\item Tian, Y.; Gray, M.J.; Ji, H.; Cava, R.; Burch, K.S. Magneto Elastic Coupling in A Potential Ferromagnetic 2D Atomic Crystal. 2D Mater. 2016, 3. [CrossRef] 4. Nicolosi, V.; Chhowalla, M.; Kanatzidis, M.G.; Strano, M.S.; Coleman, J.N. Liquid Exfoliation of Layered Materials. Science 2013, 340. [CrossRef]\n\n  \\item Long, G.; Zhang, T.; Cai, X.; Hu, J.; Cho, C.-W.; Xu, S.; Shen, J.; Wu, Z.; Han, T.; Lin, J.; et al. Isolation and Characterization of Few-Layer Manganese Thiophosphite. ACS Nano 2017, 11, 11330-11336. [CrossRef] [PubMed]\n\n  \\item Zhang, X.; Zhao, X.; Wu, D.; Jing, Y.; Zhou, Z. MnPSe 3 Monolayer: A Promising 2D Visible-Light Photohydrolytic Catalyst with High Carrier Mobility. Adv. Sci. 2016, 3. [CrossRef] [PubMed]\n\n  \\item Lee, J.-U.; Lee, S.; Ryoo, J.H.; Kang, S.; Kim, T.Y.; Kim, P.; Park, C.-H.; Park, J.-G.; Cheong, H. Ising-Type Magnetic Ordering in Atomically Thin FePS . Nano Lett. 2016, 16, 7433-7438. [CrossRef] [PubMed]\n\n  \\item Du, K.-Z.; Wang, X.-Z.; Liu, Y.; Hu, P.; Utama, M.I.B.; Gan, C.K.; Xiong, Q.; Kloc, C. Weak Van der Waals stacking, Wide-Range Band Gap, and Raman Study on Ultrathin Layers of Metal Phosphorus Trichalcogenides. ACS Nano 2016, 10, 1738-1743. [CrossRef] [PubMed]\n\n  \\item Wang, X.; Du, K.; Liu, Y.Y.F.; Hu, P.; Zhang, J.; Zhang, Q.; Owen, M.H.S.; Lu, X.; Gan, C.K.; Sengupta, P. Raman Spectroscopy of Atomically Thin Two-Dimensional Magnetic Iron Phosphorus Trisulfide (FePS ${ }_{3}$ ) Crystals. 2D Mater. 2016, 3. [CrossRef]\n\n  \\item Chatterjee, I. Magnetic properties of layered antiferromagnets. Phys. Rev. B 1995, 51, 3937-3940. [CrossRef]\n\n  \\item De Groot, R.; Mueller, F.M.; van Engen, P.G.; Buschow, K.H.J. New class of materials: Half-metallic ferromagnets. Phys. Rev. Lett. 1983, 50. [CrossRef]\n\n  \\item Brataas, A.; Hals, K.M.D. Spin-orbit torques in action. Nat. Nanotechnol. 2014, 9, 86-88. [CrossRef] [PubMed]\n\n  \\item Wadley, P.; Howells, B.; Železný, J.; Andrews, C.; Hills, V.; Campion, R.P.; Novák, V.; Olejník, K.; Maccherozzi, F.; Dhesi, S.S. Electrical switching of an antiferromagnet. Science 2016, 351, 587-590. [CrossRef] [PubMed]\n\n  \\item Jungwirth, T.; Marti, X.; Wadley, P.; Wunderlich, J. Antiferromagnetic spintronics. Nat. Nanotechnol. 2016, 11, 231-241. [CrossRef] [PubMed]\n\n  \\item Van den Brink, A.; Vermijs, G.; Solignac, A.; Koo, J.; Kohlhepp, J.T.; Swagten, H.J.M.; Koopmans, B. Field-free magnetization reversal by spin-Hall effect and exchange bias. Nat.Commun. 2016, 7. [CrossRef] [PubMed]\n\n  \\item Taniguchi, H.; Suzuki, S.; Arakawa, T.; Yoshida, H.; Niimi, Y.; Kobayashi, K. Fabrication of thin films of two-dimensional triangular antiferromagnet $\\mathrm{Ag}_{2} \\mathrm{CrO}_{2}$ and their transport properties. AIP Adv. 2018,8 . [CrossRef]\n\n  \\item Joy, P.; Vasudevan, S. Magnetism in the layered transition-metal thiophosphates $\\mathrm{MPS}_{3}(\\mathrm{M}=\\mathrm{Mn}, \\mathrm{Fe}$, and $\\mathrm{Ni})$. Phys. Rev. B 1992, 46. [CrossRef]\n\n  \\item Wei, X.; Yan, F.; Shen, C.; Lv, Q.; Wang, K. Photodetectors based on junctions of two-dimensional transition metal dichalcogenides. Chin. Phys. B 2017,26. [CrossRef]\n\n  \\item Li, X.; Cao, T.; Niu, Q.; Shi, J.; Feng, J. Coupling the valley degree of freedom to antiferromagnetic order. Proc. Nat. Acad. Sci. USA 2013, 110, 3738-3742. [CrossRef] [PubMed]\n\n  \\item Lagadic, I.; Lacroix, P.G.; Clément, R. Layered $\\mathrm{MPS}_{3}(\\mathrm{M}=\\mathrm{Mn}, \\mathrm{Cd})$ thin films as host matrixes for nonlinear optical material processing. Chem. Mater. 1997, 9, 2004-2012. [CrossRef]\n\n  \\item Grasso, V. Low-dimensional materials: The MPX3. In NuovoCimentoRivistaSerie; EditriceCompositori: Bologna, Italy, 2002.\n\n  \\item Wildes, A.; Rønnow, H.M.; Roessli, B.; Harris, M.J.; Godfrey, K.W. Anisotropy and the critical behaviour of the quasi-2D antiferromagnet, MnPS $_{3}$. J. Magn. Magn. Mater. 2007, 310, 1221-1223. [CrossRef]\n\n  \\item Wildes, A.; Ronnow, H.M.; Roessil, B.; Harris, M.J.; Godfrey, K.W. Static and dynamic critical properties of the quasi-two-dimensional antiferromagnet $\\mathrm{MnPS}_{3}$. Phys. Rev. B 2006, 74. [CrossRef]\n\n  \\item Kuo, C.-T.; Neumann, M.; Balamurugan, K.; Ju Park, H.; Kang, S.; Shiu, H.W.; Kang, J.H.; Hong, B.H.; Han, M.; Won Noh, T.; et al. Exfoliation and Raman spectroscopic fingerprint of few-layer $\\mathrm{NiPS}_{3}$ van der Waals crystals. Sci. Rep. 2016, 6. [CrossRef] [PubMed]\n\n  \\item Nesbitt, H.; Banerjee, D. Interpretation of XPS Mn (2p) spectra of Mnoxyhydroxides and constraints on the mechanism of $\\mathrm{MnO}_{2}$ precipitation. Am. Mineral. 1998, 83, 305-315. [CrossRef]\n\n  \\item Jagličić, Z.; Mazej, Z. Antiferromagnetic $\\mathrm{CsCrF}_{5}$ and canted antiferromagnetism in $\\mathrm{RbCrF}_{5}$ and $\\mathrm{KCrF}_{5}$. J. Magn. Magn. Mater. 2017, 434, 112-117. [CrossRef]\n\n  \\item Yamashita, T.; Hayes, P. Analysis of XPS spectra of $\\mathrm{Fe}^{2+}$ and $\\mathrm{Fe}^{3+}$ ions in oxide materials. Appl. Surf. Sci. 2008, 254, 2441-2449. [CrossRef] 28. Wang, M.; Zeng, L.; Chen, Q. Controlled synthesis of $\\mathrm{Co}_{3} \\mathrm{O}_{4}$ nanocubes under external magnetic fields and their magnetic properties. Dalton Trans. 2011, 40, 597-601. [CrossRef] [PubMed]\n\n  \\item Mørup, S.; Madsen, D.E.; Frandsen, C.; Bahl, C.R.H.; Hansen, M.F. Experimental and theoretical studies of nanoparticles of antiferromagnetic materials. J. Phys. Condens. Matter 2007, 19. [CrossRef]\n\n  \\item Ewing, G. Analytical Handbook Instrumentation; Marcel Dekker: New York, NY, USA, 1997.\n\n  \\item Heczko, O.; Straka, L.; Lanska, N.; Ullakko, K.; Enkovaara, J. Temperature dependence of magnetic anisotropy in Ni-Mn-Ga alloys exhibiting giant field-induced strain. J. Appl. Phys. 2002, 91, 8228-8230. [CrossRef]\n\n  \\item Ma, Y.W.; Yi, J.B.; Ding, J.; Van, L.H.; Zhang, H.T.; Ng, C.M. Inducing ferromagnetism in $\\mathrm{ZnO}$ through doping of nonmagnetic elements. Appl. Phys. Lett. 2008, 93. [CrossRef]\n\n  \\item Thang, X. Electron Paramagnetic Resonance Studies of Point Defects in AlGaN and SiC; Linköping University Electronic Press: Linköping, Sweden, 2015; Volume 1670.\n\n  \\item Kresse, G.; Furthmüller, J. Efficient iterative schemes for ab initio total-energy calculations using a plane-wave basis set. Phys. Rev. B Condens. Matter 1996, 54, 11169-11186. [CrossRef] [PubMed]\n\n  \\item Blochl, P.E. Projector augmented-wave method. Phys. Rev. B Condens. Matter 1994, 50, 17953-17979. [CrossRef] [PubMed]\n\n  \\item Kresse, G.; Joubert, D. From ultrasoft pseudopotentials to the projector augmented-wave method. Phys. Rev. B 1999, 59, 1758-1775. [CrossRef]\n\n  \\item Perdew, J.P.; Burke, K.; Ernzerhof, F. Generalized gradient approximation made simple. Phys. Rev. Lett. 1996, 77, 3865-3868. [CrossRef] [PubMed]\n\n  \\item Monkhorst, H.J.; Pack, J.D. Special points for Brillouin-zone integrations. Phys. Rev. B 1976, 13. [CrossRef]\n\n  \\item Da Silva, J.L.; Ganduglia-Pirovano, M.V.; Sauer, J.; Bayer, V.; Kresse, G. Hybrid functionals applied to rare-earth oxides: The example of ceria. Phys. Rev. B 2007, 75. [CrossRef]\n\n  \\item Wen, X.-D.; Martin, R.L.; Roy, L.E.; Scuseria, G.E.; Rudin, S.P.; Batista, E.R.; McCleskey, T.M.; Scott, B.L.; Bauer, E.; Joyce, J.J.; et al. Effect of spin-orbit coupling on the actinide dioxides $\\mathrm{AnO}_{2}(\\mathrm{An}=\\mathrm{Th}, \\mathrm{Pa}, \\mathrm{U}, \\mathrm{Np}$, $\\mathrm{Pu}$, and Am): A screened hybrid density functional study. J. Chem. Phys. 2012, 137. [CrossRef] [PubMed]\n\n\\end{enumerate}\n\n\\end{document}", "record_id": "2023_09_22_7dab45b11a3ede362147g"}