{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{QSAR Modeling and Molecular Docking Analysis of Some Active Compounds against Mycobacterium tuberculosis Receptor (Mtb CYP121) }\n\n\n\\author{Shola Elijah Adeniji (D, Sani Uba, and Adamu Uzairu\\\\\nDepartment of Chemistry, Ahmadu Bello University, Zaria, Nigeria\\\\\nCorrespondence should be addressed to Shola Elijah Adeniji; shola4343@gmail.com}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nReceived 28 January 2018; Revised 26 February 2018; Accepted 13 March 2018; Published 10 May 2018\n\nAcademic Editor: Nongnuch Vanittanakom\n\nCopyright $@ 2018$ Shola Elijah Adeniji et al. This is an open access article distributed under the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.\n\nA quantitative structure-activity relationship (QSAR) study was performed to develop a model that relates the structures of 50 compounds to their activities against M. tuberculosis. The compounds were optimized by employing density functional theory (DFT) with B3LYP/6-31G*. The Genetic Function Algorithm (GFA) was used to select the descriptors and to generate the correlation model that relates the structural features of the compounds to their biological activities. The optimum model has squared correlation coefficient $\\left(R^{2}\\right)$ of $0.9202$, adjusted squared correlation coefficient $\\left(R_{\\text {adj }}\\right)$ of $0.91012$, and leave-one-out (LOO) crossvalidation coefficient $\\left(Q_{\\mathrm{cv}}^{2}\\right)$ value of $0.8954$. The external validation test used for confirming the predictive power of the built model has $R^{2}$ pred value of $0.8842$. These parameters confirm the stability and robustness of the model. Docking analysis showed the best compound with high docking affinity of $-14.6 \\mathrm{kcal} / \\mathrm{mol}$ which formed hydrophobic interaction and hydrogen bond with amino acid residues of $M$. tuberculosis cytochromes (Mtb CYP121). QSAR and molecular docking studies provide valuable approach for pharmaceutical and medicinal chemists to design and synthesize new anti-Mycobacterium tuberculosis compounds.\n\n\\section{Introduction}\nMycobacterium tuberculosis is a bacterial species responsible for causing tuberculosis (TB). It mainly affects the lungs and other parts of the body such as spine, kidney, and brain unless urgent treatment is provided. Tuberculosis remains one of the most prevalent infectious bacterial diseases, resulting in the death of $1.4$ million people worldwide [1]. There are drugs like isoniazid, rifampicin, ciprofloxacin, and ethambutol available as a cure for tuberculosis.\n\nHowever, due to the emergence of multidrug-resistant (MDR) and extensively drug-resistant (XDR) tuberculosis, this poses a big challenge towards the successful treatment of tuberculosis [2]. This led to development of new therapeutics against diverse strains of $M$. tuberculosis [3]. New synthesized 1,2,4-Triazole derivative compounds demonstrate tuberculosis inhibition activity [4]. Synthesis of novel molecules is typically developed using a trial-and-error approach, which is time-consuming and costly. Quantitative structure-activity relationship (QSAR) plays a crucial part in novel drug design via a ligand-based approach [5]. The key success of the QSAR method is the possibility to predict the properties of new chemical compounds without the need to synthesize and test them. This technique is broadly utilized for the prediction of physicochemical properties in the chemical, industrial, pharmaceutical, biological, and environmental spheres [6]. Moreover, the QSAR strategies save resources and accelerate the process of developing new molecules for use as drugs, materials, and additives or for whatever purposes [7]. Meanwhile molecular docking is a computational method used to determine the binding strength between the active site residues and specific molecule(s) [8]. Molecular docking is expedient tool used in the drug discovery field to investigate the binding compatibility of molecules (ligands) to target (receptor) [9].\n\nThe aim of this research was to develop QSAR model to predict the activity of 1,2,4-Triazole derivatives as potent antiMycobacterium tuberculosis compounds and to elucidate the interaction between the inhibitor molecules and Mycobacterium tuberculosis target site.\n\n\\section{Materials and Methods}\n2.1. Data Collection. Fifty molecules of 1,2,4-Triazole derivatives as potent antitubercular agents that were used in this study were obtained from the literature [4].\n\n2.2. Biological Activities (BA). The biological activities of 1,2,4-Triazole derivatives against Mycobacterium tuberculosis in aerobic active stage were initially expressed in percentage (\\%) and then converted to logarithm unit using (1) in order to increase the linearity and approach normal distribution of the activity values. The observed structures and the biological activities of these compounds were presented in Table 1.\n\n\\[\n\\begin{gathered}\n\\mathrm{pBA}=\\log \\left[\\left(\\frac{\\text { molecular weight }_{(\\mathrm{g} / \\mathrm{mol})}}{\\text { Dose }_{(\\mathrm{g} / \\mathrm{mol})}}\\right)\\right. \\\\\n\\left.\\cdot\\left(\\frac{\\text { percentage }(\\%)}{100-\\text { percentage }(\\%)}\\right)\\right] .\n\\end{gathered}\n\\]\n\n2.3. Geometry Optimization. The chemical structures of the molecules were drawn with ChemDraw Ultra Version 12.0. Each molecule was first preoptimized with the molecular mechanics (MMFF) and further reoptimized with density functional theory (DFT) utilizing the B3LYP and 6-31G ${ }^{*}$ basis set $[10,11]$ with the aid of Spartan 14 Version 1.1.0 software.\n\n2.4. Molecular Descriptor Calculation. Molecular descriptors are mathematical values that describe the properties of a molecule. Descriptors calculation for all the 50 molecules of 1,2,4-Triazole derivatives was done using PaDEL-Descriptor Version $2.20$ software. A total of 1876 molecular descriptors were calculated.\n\n2.5. Normalization and Data Pretreatment. The descriptors' values were normalized using (2) in order to give each variable the same opportunity at the onset to influence the model [12].\n\n\\[\nX=\\frac{X_{1}-X_{\\min }}{X_{\\max }-X_{\\min }},\n\\]\n\nwhere $X_{i}$ is the value of each descriptor for a given molecule and $X_{\\max }$ and $X_{\\min }$ are the maximum and minimum value for each column of descriptors $X$. The normalized data were subjected to pretreatment using data pretreatment software in order to remove noise and redundant data.\n\n2.6. Training and Test Set. The dataset was split into training set and test set by employing Kennard and Stone's algorithm. The training set comprises $70 \\%$ of the dataset which was used to build the model, while the remaining $30 \\%$ of the dataset (test set) was used to validate the built model. 2.7. Relative Importance of Each Descriptor in the Model. Absolute value of the mean effect of each descriptor was used to evaluate the relative importance and contribution of the descriptor to the model. The mean effect is defined as\n\n\\[\n\\mathrm{ME}=\\frac{\\beta_{j} \\sum_{i}^{n} D_{j}}{\\sum_{j}^{m}\\left(\\beta_{j} \\sum_{i}^{n} D_{j}\\right)},\n\\]\n\nwhere ME is the mean effect of a descriptor $j$ in a model, $\\beta_{j}$ is the coefficient of the descriptor $j$ in that model, $D_{j}$ is the value of each descriptor in the data matrix for each molecule in the training set, $m$ is the number of descriptors that appear in the model, and $n$ is the number of molecules in the training set [13].\n\n2.8. Degree of Contribution of Selected Descriptors. Contribution of each descriptor in the model was measured by calculating their standardized regression coefficients $\\left(b_{j}^{s}\\right)$ using (6).\n\n\\[\nb_{j}^{s}=\\frac{S_{j} b_{j}}{S_{y}},\n\\]\n\nwhere $b_{j}$ is the regression coefficient of descriptor $j . S_{j}$ and $S_{y}$ are the standard deviations for each descriptor and activity, respectively. Statistical property $b_{j}^{s}$ allows one to assign a greater importance to those molecular descriptors that exhibit larger absolute standardized coefficients\n\n2.9. Internal Validation of Model. Internal validation of the model was carried out using Materials Studio Version 8 software by employing the Genetic Function Approximation (GFA) method. The models were estimated using the LOF. The LOF is measured using a slight variation of the original Friedman formula, so that the best fitness score can be received. LOF is expressed as follows [14]:\n\n\\[\n\\text { LOF }=\\frac{\\text { SEE }}{(1-(C+d \\times p) / M)^{2}},\n\\]\n\nwhere SSE is the sum of squares of errors, $C$ is the number of terms in the model, $d$ is a user-defined smoothing parameter, $p$ is the total number of descriptors contained in the model, and $M$ is the amount of data in the training set. SEE is defined as [15]\n\n\\[\n\\mathrm{SEE}=\\sqrt{\\frac{\\left(Y_{\\exp }-Y_{\\text {pred }}\\right)^{2}}{N-P-1}} .\n\\]\n\nThe square of the correlation coefficient $\\left(R^{2}\\right)$ defines the fraction of the total variation attributed to the model. The closer the value of $R^{2}$ to $1.0$, the better the model generated. $R^{2}$ is expressed as\n\n\\[\nR^{2}=1-\\left[\\frac{\\sum\\left(Y_{\\text {exp }-Y_{\\text {pred }}}\\right)^{2}}{\\sum\\left(Y_{\\text {exp }-}-\\bar{Y}_{\\text {training }}\\right)^{2}}\\right],\n\\]\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-03_228_2588_194_1911}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-04_228_2588_297_1808}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-05_227_2589_211_1888}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-06_228_2588_338_1762}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-07_227_2584_324_1765}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-08_228_2588_319_1786}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-09_227_2584_476_1629}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-10_228_2588_411_1694}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-11_228_2588_381_1719}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-12_231_2580_456_1628}\n\\end{center}\n\nTABLE 2: Minimum recommended value of validation parameters for a generally acceptable QSAR model.\n\n\\begin{center}\n\\begin{tabular}{lcc}\n\\hline\nValidation parameter & Name & Value \\\\\n\\hline\n$R^{2}$ & Coefficient of determination & $\\geq 0.6$ \\\\\n$P_{(95 \\%)}$ & Confidence interval at 95\\% confidence level & $<0.05$ \\\\\n$Q_{\\mathrm{cv}}^{2}$ & Cross-validation coefficient & $>0.5$ \\\\\n$R^{2}-Q_{\\mathrm{cv}}^{2}$ & Difference between $R^{2}$ and $Q_{\\mathrm{cv}}^{2}$ & $\\leq 0.3$ \\\\\n$N_{\\text {ext. test set }}$ & Minimum number of external test sets & $\\geq 5$ \\\\\n$R^{2}$ test & Coefficient of determination for external test set & $\\geq 0.6$ \\\\\n$c R_{p}^{2}$ & Coefficient of determination for $Y$-randomization & $>0.5$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nwhere $Y_{\\text {exp }}, Y_{\\text {pred }}$, and $\\bar{Y}_{\\text {training }}$ are the experimental activity, the predicted activity, and the mean experimental activity of the samples in the training set, respectively.\n\nValue of $R^{2}$ varies directly with the increase in number of descriptors. Thus, $R^{2}$ is not reliable to measure the goodness of fit of the model. Therefore, $R^{2}$ is adjusted for the number of explanatory variables in the model. The adjusted $R^{2}$ is defined as\n\n\\[\nR_{\\text {adj }}^{2}=\\frac{R^{2}-k(n-1)}{n-p+1},\n\\]\n\nwhere $k$ is the number of independent variables in the model and $n$ is the number of descriptors.\n\nThe strength of the QSAR equation to predict bioactivity of a compound was determined using the leave-one-out cross-validation method. The revised formula for crossvalidation regression coefficient $\\left(Q_{\\mathrm{cv}}^{2}\\right)$ is\n\n\\[\nQ_{\\mathrm{cv}}^{2}=1-\\left[\\frac{\\sum\\left(Y_{\\text {pred }-Y_{\\text {exp }}}\\right)^{2}}{\\sum\\left(Y_{\\text {exp }-\\bar{Y}_{\\text {training }}}\\right)^{2}}\\right],\n\\]\n\nwhere $Y_{\\text {pred }}, Y_{\\text {exp }}$, and $\\bar{Y}_{\\text {training }}$ are the predicted, experimental, and mean values of experimental activity of the training set.\n\n2.10. External Validation of Model. External validation of model was assessed by $R_{\\text {test }}^{2}$ value. The closer the value of $R_{\\text {test }}^{2}$ to $1.0$, the better the model generated.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-13_1912_2060_322_850}\n\\end{center}\n\nwhere $Y$ pred $_{\\text {test }}$ and $Y_{\\text {exp }_{\\text {test }}}$ are the predicted and experimental activity test set, while $\\bar{Y}_{\\text {training }}$ represents mean values of experimental activity of the training set.\n\n2.11. Y-Randomization Test. $Y$-Randomization test is another useful external validation parameter to confirm that the built QSAR model is strong and is not inferred by chance. The $Y$-Randomization test was performed on the training set data [16]. For the built model to pass the $Y$-Randomization test, $c R_{p}^{2}$ should be more than $0.5$.\n\n\\[\nc R_{p}^{2}=R \\times\\left[R^{2}-\\left(R_{r}\\right)^{2}\\right]^{2},\n\\]\n\nwhere $c R_{p}^{2}$ is coefficient of determination for $Y$-Randomization, $R$ is coefficient of correlation for $Y$-Randomization, and $R_{r}$ is average \" $R$ \" of random models.\n\n2.12. Evaluation of the Applicability Domain of the Model. Assessment of the applicability domain of a QSAR model is an important approach to confirm that the model built is able to make good predictions within the chemical space for which it was developed [16]. The leverage approach was employed to describe the applicability domain of the QSAR model [17]. Leverage of a given chemical compound is defined as follows:\n\n\\[\nh i=X_{i}\\left(X^{T} X\\right)^{-1} X_{i}^{T},\n\\]\n\nwhere $h i$ is the leverage of each compound, $X_{i}$ is the descriptor row-vector of the query compound $i$, and $X$ is the $n \\times k$ descriptor matrix of the training set compounds used to build the model. As a prediction tool, the warning leverage $\\left(h^{*}\\right)$ is the limit of normal values for $X$ outliers and is defined as\n\n\\[\nh^{*}=3 \\frac{(d+1)}{m},\n\\]\n\nwhere $m$ is the number of training compounds and $d$ is the number of descriptors in the model. The Williams plot, a plot of standardized residual versus leverage value, was employed to elucidate the relevance area of the model in terms of chemical space. Data is said to be an outlier if the standardized cross-validated residual produced by the model is greater than $\\pm 3$.\n\n2.13. Quality Assurance of the Model. The fitting ability, stability, robustness, reliability, and predictive ability of the developed models were evaluated by internal and external validation parameters. The validation parameters were compared with the minimum recommended value for a generally acceptable QSAR model [17] shown in Table 2.\n\n2.14. Docking Studies. Molecular docking study was carried out in order to elucidate which of the 1,2,4-Triazole derivatives has the best binding affinity against Mtb CYP121. The structure of Mtb CYP121 used in the study was obtained from protein data bank with PDB code 51BG. The prepared ligand and receptor were shown in Figure 1. The optimized structures of 1,2,4-Triazole derivatives initially saved as SDF files were converted to PDB files using Spartan $14 \\mathrm{~V}$ 1.1.4.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-14_278_1013_339_1001}\n\\end{center}\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-14_278_1013_1188_1693}\n\\end{center}\n\n(b)\n\nFIgURE 1: (a) Prepared structure of Mtb CYP121. (b) 3D structures of the prepared ligands.\n\nThe prepared ligands were docked with prepared structures of Mtb CYP121 using AutoDock Vina incorporated in PyRx software. The docked results were compiled, visualized, and analyzed using Discovery Studio Visualizer.\n\n\\section{Results and Discussion}\nQSAR was performed to investigate the structure-activity relationship of 50 compounds as potent antitubercular agents. The nature of model in a QSAR study is expressed by its fitting ability, stability, robustness, reliability, and forecast capacity.\n\nExperimental and predicted activities for 1,2,4-Triazole derivatives were presented in Table 3. The low residual value between experimental and predicted activity indicates that the model is of high predictability.\n\nThe genetic algorithm-multiple linear regression (GAMLR) investigation led to the selection of six descriptors that were used to assemble a linear model for calculating predictive activity on Mycobacterium tuberculosis. Five QSAR models were built using Genetic Function Algorithm (GFA), but due to the statistical significance, model 1 was selected and reported as given below:\n\n\\[\n\\begin{aligned}\n\\mathrm{pBA}= & -0.307001458 \\text { (AATS7s) } \\\\\n& +1.528715398 \\text { (nHBint3) } \\\\\n& +3.976720227 \\text { (minHCsatu) } \\\\\n& +0.016199645 \\text { (TDB9e) } \\\\\n& +0.089381479 \\text { (RDF90i) } \\\\\n& -0.107407822(\\text { RDF110s) }+4.057082751 .\n\\end{aligned}\n\\]\n\n\\[\n\\begin{aligned}\n& N_{\\text {train }}=35, R^{2}=0.92023900, R_{\\text {adj }}=0.91017400, Q_{\\mathrm{cv}}^{2} \\\\\n& =0.89538600 \\text {, and the external validation for the test } \\\\\n& \\text { set was found to be } R^{2} \\text { pred }=0.8842 .\n\\end{aligned}\n\\]\n\nAll the validation parameters for this mode were reported in Table 4 and were all in agreement with parameters presented in Table 2, which actually confirmed the robustness of the model.\n\nThe QSAR model generated in this research was compared with the models obtained in the literature $[18,19]$ as shown below:\n\n\\[\n\\begin{aligned}\n& \\text { pMIC }= 4.77374(+/-0.03903) \\\\\n&-0.18609(+/-0.04924) \\text { AATS4i } \\\\\n&+0.50382(+/-0.05235) \\text { SCH- } 3 \\\\\n&-0.44712(+/-0.06573) \\text { AVP-1 } \\\\\n&-0.22376(+/-0.05623) \\text { maxHCsats } \\\\\n&-0.18403(+/-0.04374) \\text { PSA. } \\\\\n& N_{\\text {train }}= 16, R^{2}=0.9184, Q_{\\mathrm{cv}}^{2}=0.84987, \\text { and } R^{2} \\text { pred } \\\\\n&=0.79343[18] . \\\\\n& \\text { pIC50 }=-2.040810634 * \\mathrm{nCl}-19.024890361 \\\\\n& * \\text { MATS2m }+1.855704759 * R D F 140 \\mathrm{~s} \\\\\n&+6.739013671 . \\\\\n& N_{\\text {train }}=27, R^{2}=0.9480, R_{\\text {adj }}=0.9350, Q_{\\mathrm{cv}}^{2}= \\\\\n& 0.87994 \\text { and } R^{2} \\text { pred }=0.76907[19] .\n\\end{aligned}\n\\]\n\nTABLE 3: Experimental, predicted, and residual values for 1,2,4-Triazole derivatives.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-15_301_2602_152_1915}\n\\end{center}\n\nTABLE 3: Continued.\n\n\\begin{center}\n\\begin{tabular}{lccc}\n\\hline\nS/number (molecules) & Experimental activity $(\\mathrm{pBA})$ & Predicted activity $(\\mathrm{pBA})$ & Residual \\\\\n\\hline\n$\\mathbf{4 8}$ & $6.1213$ & $5.9165$ & $0.2048$ \\\\\n$\\mathbf{4 9}$ & $5.4406$ & $5.2695$ & $0.1711$ \\\\\n$\\mathbf{5 0}$ & $4.9074$ & $4.8495$ & $0.0579$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nTABLE 4: Validation of the genetic function approximation from Materials Studio.\n\n\\begin{center}\n\\begin{tabular}{lcr}\n\\hline\nS/number &  & Equation \\\\\n\\hline\n$\\mathbf{1}$ & Friedman LOF & $0.40847300$ \\\\\n$\\mathbf{2}$ & $R$-squared & $0.92023900$ \\\\\n$\\mathbf{3}$ & Adjusted $R$-squared & $0.91017400$ \\\\\n$\\mathbf{4}$ & Cross-validated $R$-squared $\\left(Q_{\\mathrm{cv}}^{2}\\right)$ & $0.89538600$ \\\\\n$\\mathbf{5}$ & Significant regression & Yes \\\\\n$\\mathbf{6}$ & Significance-of-regression $F$-value & $58.41835200$ \\\\\n$\\mathbf{7}$ & Critical SOR $F$-value $(95 \\%)$ & $2.45854700$ \\\\\n$\\mathbf{8}$ & Replicate points & 0 \\\\\n$\\mathbf{9}$ & Computed experimental error & $0.00000000$ \\\\\n$\\mathbf{1 0}$ & Lack-of-fit points & 28 \\\\\n$\\mathbf{1 1}$ & Min expt. error for nonsignificant LOF (95\\%) & $0.24688800$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nFrom the above models, it could be seen that maxHCsats and 3D-radial distribution function (RDF) descriptors were also observed in the model generated in this research. This indicates that these descriptors have great influence on the activities of the inhibitory compounds against Mycobacterium tuberculosis. The validation parameters reported in this work and those reported in the literature were all in agreement with parameters presented in Table 2 , which actually confirmed the robustness of the model.\n\nDescriptive statistics of the activity values of the training and test set data reported in Table 5 show that test set value range (8.2854 to $4.9074)$ was within the training set value range (8.0899 to $4.7441$ ). Also, the mean and standard deviation of the test set activity value (6.4989 and 0.93) were approximately similar to those of the training set value (6.6222 and 0.96). This indicates that the test set is interpolative within the training. Therefore, Kennard and Stone's algorithm employed in this study was able to generate a test set that is a good reflection of the training set.\n\nThe name and symbol of the descriptors used in the QSAR optimization model were reported in Table 6. The presence of the three $2 \\mathrm{D}$ and three $3 \\mathrm{D}$ descriptors in the model suggests that these types of descriptors are able to characterize better anti-Mycobacterium tuberculosis activities of the compounds. Pearson's correlation matrix and statistics of the six descriptors employed in the QSAR model were reported in Table 7 , which shows clearly that the correlation coefficients between each pair of descriptors are very low; thus, it can be inferred that there exists no significant intercorrelation among the descriptors used in building the TABLE 5: Descriptive statistics of the inhibition data.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-16_1446_2189_1059_1914}\n\\end{center}\n\nmodel. The absolute $t$-statistics value for each descriptor is greater than 2 at $95 \\%$ significant level, which indicates that the selected descriptors were good. The estimated Variance Inflation Factor (VIF) values for all the descriptors were less than 4 , which imply that the model generated was statistically significant and the descriptors were orthogonal. TABLE 6: List of some descriptors used in the QSAR optimization model.\n\n\\begin{center}\n\\begin{tabular}{lcr}\n\\hline\nS/number & Descriptors symbols & Name of descriptor(s) \\\\\n\\hline\n$\\mathbf{1}$ & AATS7s & Average Moreau-Broto Autocorrelation-lag 7/weighted by I-state \\\\\n$\\mathbf{2}$ & nHBint3 & Count of E-state descriptors of strength for potential hydrogen bonds of path length 3 \\\\\n$\\mathbf{3}$ & minHCsatu & Minimum atom-type H E-state: $\\mathrm{H}$ on C sp3 bonded to unsaturated C \\\\\n$\\mathbf{4}$ & TDB9e & 3D topological distance based autocorrelation-lag 9/weighted by Sanderson electronegativities \\\\\n$\\mathbf{5}$ & RDF90i & 3D \\\\\n$\\mathbf{6}$ & RDF110s & Radial distribution function-090/weighted by relative first ionization potential \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nTABLE 7: Pearson's correlation matrix and statistics for descriptor used in the QSAR optimization model.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-17_765_1167_165_1913}\n\\end{center}\n\nTABLE 8: Specification of entered descriptors in genetic algorithm-multiple regression model.\n\n\\begin{center}\n\\begin{tabular}{lccc}\n\\hline\nDescriptors & Standard regression coefficient $\\left(b_{j}\\right)$ & Mean effect $($ ME) & $p$ value (confidence interval) \\\\\n\\hline\nAATS7s & $-0.2769$ & $-0.31421$ & $0.000527$ \\\\\nnHBint3 & $0.67675$ & $0.153246$ & $3 E-12$ \\\\\nminHCsatu & $0.987436$ & $0.58264$ & $8.84 E-11$ \\\\\nTDB9e & $0.338438$ & $0.351968$ & $4.48 E-06$ \\\\\nRDF90i & $1.097495$ & $0.34097$ & $3.25 E-10$ \\\\\nRDF110s & $-0.49948$ & $-0.11461$ & $5.62 E-06$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nThe mean effect (ME) values and standard regression coefficient $\\left(b_{j}^{s}\\right)$ reported in Table 8 provide important information on the effect of the molecular descriptors and the degree of contribution in the developed model. The signs and the magnitude of these descriptors combined with their mean effects indicate their individual strength and direction in influencing the activity of a compound. The null hypothesis says that there is no significant relationship between the descriptors and the activities of the inhibitor compounds. The $p$ values of the descriptors at $95 \\%$ confidence limit shown in Table 8 are all less than $0.05$. This implies that the alternative hypothesis is accepted. Hence, there is a relationship between the descriptors used in generating the model and the activities of the inhibitor compounds which take preference over the null hypothesis.\n\n$Y$-Randomization parameter test was reported in Table 9. The low $R^{2}$ and $Q^{2}$ values for several trials confirm that the developed QSAR model is robust, while the $c R_{p}^{2}$ value greater than $0.5$ affirms that the created model is powerful and is not inferred by chance.\n\n3.1. Interpretation of Selected Descriptors. AATS7s is average Moreau-Broto Autocorrelation-lag 7/weighted by I-state autocorrelation descriptor. It is based on spatial dependent autocorrelation function that measures the strength of the relationship between observations (atomic or molecular properties) and space separating them (lag). This descriptor is obtained by taking the molecule atoms as the set of discrete points in space and an atomic property as the function evaluated at those points. When this descriptor is calculated on molecular graph, the lag coincides with the topological distance between any pair of the vertices. AATS7s is defined on the molecular graphs using atomic masses $(m)$, Sanderson electronegativity $(e)$, and inductive effect of pairs of atoms TABLE 9: $Y$ - Randomization parameters test.\n\n\\begin{center}\n\\begin{tabular}{lccc}\n\\hline\nModel & $R$ & $R^{2}$ & $Q^{2}$ \\\\\n\\hline\nOriginal & $0.962302$ & $0.926026$ & $0.895386$ \\\\\nRandom 1 & $0.387394$ & $0.150074$ & $-0.28301$ \\\\\nRandom 2 & $0.534646$ & $0.285847$ & $-0.15518$ \\\\\nRandom 3 & $0.357333$ & $0.127687$ & $-0.43633$ \\\\\nRandom 4 & $0.509588$ & $0.25968$ & $-0.08884$ \\\\\nRandom 5 & $0.231807$ & $0.053735$ & $-0.60188$ \\\\\nRandom 6 & $0.140884$ & $0.019848$ & $-0.61556$ \\\\\nRandom 7 & $0.513288$ & $0.263465$ & $-0.11043$ \\\\\nRandom 8 & $0.548099$ & $0.300412$ & $-0.062$ \\\\\nRandom 9 & $0.36673$ & $0.134491$ & $-0.25601$ \\\\\nRandom 10 & $0.505524$ & $0.255554$ & $-0.12398$ \\\\\n\\hline\nRandom models parameters &  &  &  \\\\\nAverage $r$ & $0.409529$ &  &  \\\\\nAverage $r^{2}$ & $0.185079$ &  &  \\\\\nAverage $Q^{2}$ & $-0.27332$ &  &  \\\\\n$c R_{p}^{2}$ & $0.837983$ &  &  \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\n7 bonds apart as the weighting scheme. These observations suggested that atomic masses and electronic distribution of the atoms that made up the molecule had significant effect on the antitubercular activity of the dataset. In addition, the signs of the regression coefficients for each descriptor indicated the direction of influence of the descriptors in the models such that positive regression coefficient associated with a descriptor will augment the activity profile of a compound, while the negative coefficient will diminish the activity of the compound.\n\nElectrotopological state atom-type descriptor nHBint3 represents count of $\\mathrm{E}$-state descriptors of strength for potential hydrogen bonds of path length 3. It is a spatial dependent 2D autocorrelation descriptor with the incorporation of Moran coefficient (index) in the measurement of the strength of the relationship between observations and space separating them. This Moran autocorrelation descriptor contained in the model reported in this study was defined on the molecular graphs using atomic masses $(m)$, Sanderson electronegativity (e), and inductive effect of pairs of atom 3 bonds apart as the weighting scheme. These observations supported the claim that atomic masses and electronic distribution had significant effect on the antitubercular activities of the molecules The positive mean effect of this descriptor indicates that the inhibitory activity of 1,2,4-Triazole derivatives will increase with hydrogen bonds of path length 3 .\n\nminHCsatu (minimum atom-type $\\mathrm{H}$ E-state: $\\mathrm{H}$ on C sp3 bonded to unsaturated C) is a 2D electrotopological state (E-state indices) atom-type descriptor. In general, Estate indices encode the intrinsic electronic state of each atom as perturbed by the electronic influences of all other atoms in the molecule within the context of the topological character of the molecule. maxHCsatu favors the addition of $-\\mathrm{CH} 3$ to unsaturated $\\mathrm{C}$ atom, for example, in benzene ring. Positive contribution of minHCsatu indicates that the inhibitory activity of 1,2,4-Triazole derivatives will increase with increase in the molecular descriptor.\n\nTDB9e (3D topological distance based autocorrelationlag 9/weighted by Sanderson electronegativities) is positively correlated to the anticonvulsant activity, meaning that increase in its value augments the activity of the studied compounds. The descriptor measures the strength of the connection between atomic charges 9 bonds apart. The number of rings in the molecular system tends to increase the values of this descriptor as observed for molecules. This may be due to increase in the amount of $\\pi$-electrons in the molecular system, bringing about increase in the charge difference between atoms 9 bonds apart. The positive mean effect indicates a positive impact on the activity of the inhibitory compounds, which means that increasing the value of this descriptor produces higher activity of these compounds.\n\nRDF90i and RDF110s are 3D radial distribution functions at $2.5$ and $7.0$ interatomic distance weighted by atomic masses. The radial distribution function is probability distribution to find an atom in a spherical volume of radius. RDF descriptors are independent of the size and rotation of the entire molecule. They describe the steric hindrance or the structure-activity properties of a molecule. The RDF descriptor provides valuable information about the bond distances, ring types, planar and nonplanar systems, and atom types. The presence of these descriptors in the model suggested the occurrence of a linear relationship between antitubercular activity and the 3D molecular distribution of atomic masses in the molecules calculated at radius of $2.0 \\AA$ and $7.0 \\AA$ from the geometrical centers of each molecule. RDF90i with positive mean effect (MF) indicates positive impact on the activity, while RDF110s with negative\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-19_241_632_216_956}\n\\end{center}\n\nFIGURE 2: Plot of predicted activity against experimental activity of training set.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-19_779_1289_184_998}\n\\end{center}\n\nFIGURE 3: Plot of predicted activity against experimental activity of test set.\n\nmean effect (MF) indicates negative contribution on the activity.\n\nPredicted activity against experimental activity of training and test set was shown in Figures 2 and 3. The $R^{2}$ value of $0.9202$ for training set and $R^{2}$ value of $0.8842$ for test set recorded in this study were in agreement with GFA-derived $R^{2}$ value reported in Table 2. This confirms the stability, reliability, and robustness of the model. Plot of standardized residual versus experimental activity shown in Figure 4 indicates a symmetric distribution or random scattering of data points above and below the standardized residual line equal to zero. Also, all the data points were within the boundary defined by standardized residual of $\\pm 2$. Thus, it implies that there was no systemic error in model developed as the spread of residuals was pragmatic on both sides of zero [20].\n\nThe standardized residuals in the dataset were plotted against their leverages for every compound, leading to discovery of outliers and influential molecules in the models. The Williams plot of the standardized residuals versus the leverage value is shown in Figure 5. From our result, it is evident that no outlier is found, since all the compounds for both the training and test set were within the applicability domain of the square area except for three compounds that are structurally influential molecules (i.e., compounds 50, 39, and 36). These three compounds are said to be structurally influential molecules, since their leverage values are greater than the warning leverage $\\left(h^{*}=0.60\\right)$. Their high leverage\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-19_237_924_1078_1895}\n\\end{center}\n\nFIGURE 4: Plot of standardized residual activity versus experimental activity.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-19_1061_1723_1081_1892}\n\\end{center}\n\nFigUrE 5: The Williams plot of the standardized residuals versus the leverage value.\n\nvalues are responsible for swaying the performance of the model. This was attributed to strong differences in their chemical structures compared to other compounds in the dataset.\n\n3.2. Molecular Docking. Molecular docking study was carried out between the target (Mtb CYP121) and 1,2,4-Triazole derivatives. All the compounds were found to inhibit the receptor by occupying the active sites of the target protein (Mtb CYP121).\n\nFor target protein, binding affinity values for all the compounds range from $-5.1$ to $-14.6 \\mathrm{kcal} / \\mathrm{mol}$ as reported in Table 10. However, four ligands (compounds $7,8,13$, and 14) have higher binding score, which ranges from $-10.0$ to $14.6 \\mathrm{kcal} / \\mathrm{mol}$, which were greater than their co-ligands.\n\nThese four ligands were visualized and analyzed in Discovery Studio Visualizer as shown in Figure 6. Binding\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-20_265_929_326_977}\n\\end{center}\n\n(7a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-20_1005_1719_313_978}\n\\end{center}\n\n(8a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-20_1824_2505_369_1025}\n\\end{center}\n\n(13a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-20_260_928_1103_1762}\n\\end{center}\n\n(7b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-20_1013_1710_1040_1759}\n\\end{center}\n\n(8b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-20_1812_2507_1055_1755}\n\\end{center}\n\n(13b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-21_259_891_385_1047}\n\\end{center}\n\n(14a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-21_260_906_1084_1716}\n\\end{center}\n\n(14b)\n\nFigure 6: (7a) and (7b) show the 3D and 2D interactions between Mtb CYP121 and ligand 7. (8a) and (8b) show the 3D and 2D interactions between Mtb CYP121 and ligand 8. (13a) and (13b) show the 3D and 2D interactions between Mtb CYP121 and ligand 13. (14a) and (14b) show the 3D and 2D interactions between Mtb CYP121 and ligand 14.\n\nTABLE 10: Binding affinity of 1,2,4-Triazole derivatives with $M$. tuberculosis target (Mtb CYP121).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-21_1234_2596_152_1915}\n\\end{center}\n\nTABLE 10: Continued.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-22_293_1785_152_1915}\n\\end{center}\n\naffinity, hydrogen bond, and hydrophobic bond of ligands 7, 8, 13, and 14 with $M$. tuberculosis target (Mtb CYP121) are reported in Table 11. Ligand (compound 7) formed hydrophobic interactions with VAL83 PRO285, VAL78, and ALA167 of the target site. In addition, ligand 7 also forms hydrogen bonds $(2.16131 \\AA$ ) with GLN385. Ligand 8 made three hydrogen bonds $(2.82894,2.34089$, and $2.47314 \\AA$ ) with ALA337, HIS343, and ALA233 of the target, while hydrophobic interactions were observed with PHE280, ALA233, CYS345, MET86, ALA233, and PRO346. Ligand 13 made two hydrogen bonds ( $2.34218$ and $3.0328 \\AA$ ) with ASN74 and GLN385, while VAL78, ALA233, PRO285, ALA233, PRO346, and ALA167 form the hydrophobic interaction. Ligand 14 formed hydrophobic interaction with LEU164, VAL228, VAL78, ALA233, PRO285, ALA233, PRO346, ALA167, and ALA233, while two hydrogen bonds (2.36479 and $3.03627 \\AA$ A) were formed between ASN74 and GLN385 of the target.\n\n\\section{Conclusion}\nThe model with $2 \\mathrm{D}$ and 3D descriptors is of higher excellence and presents a satisfactory correlation with the antiMycobacterium tuberculosis activity. The combination of 2D and 3D descriptors produces a better model to predict the anti-Mycobacterium tuberculosis activities of these compounds. The QSAR model generated met the criteria for minimum recommended value of validation parameters for a generally acceptable QSAR model. The molecular docking analysis has shown that nearly all the 1,2,4-Triazole derivatives potentially inhibit Mtb CYP121. However, compounds $7,8,13$, and 14 have higher bind score ranging from $-10.03$ to $-11.02 \\mathrm{kcal} / \\mathrm{mol}$. These four compounds were able to be docked deeply within the binding pocket region of the Mtb CYP121, forming a hydrogen bond and hydrophobic interactions with amino acid of the target. The QSAR model generated provides a valuable approach for ligand base design,\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-23_228_2588_750_1350}\n\\end{center}\n\nwhile the molecular docking studies provide a valuable approach for structure base design. These two approaches will be of great help for pharmaceutical and medicinal chemists to design and synthesize new anti-Mycobacterium tuberculosis compounds.\n\n\\section{Conflicts of Interest}\nThe authors declare that they have no conflicts of interest.\n\n\\section{References}\n[1] St. Cole, R. Brosch, J. Parkhill et al., \"Deciphering the biology of Mycobacterium tuberculosis from the complete genome sequence,\" Nature, vol. 393, pp. 537-544, 1998.\n\n[2] G. Lamichhane, J. S. Freundlich, S. Ekins, N. Wickramaratne, S. T. Nolan, and W. R. Bishai, \"Essential metabolites of mycobacterium tuberculosis and their mimics,\" mBio, vol. 2, no. 1, 2011.\n\n[3] M. M. Madkour, Tuberculosis, Springer, Berlin, Germany, 2004.\n\n[4] D. Sarkar, S. R. Deshpande, S. P. Maybhate et al., \"1,2,4-Triazole Derivatives and Their Anti-Microbial Activity,\" 2016.\n\n[5] C. Hansch and A. Leo, Substituent Constants for Correlation Analysis in Chemistry and Biology, Wiley, 1979.\n\n[6] K. Y. Wong, A. G. Mercader, L. M. Saavedra, B. Honarparvar, G. P. Romanelli, and P. R. Duchowicz, \"QSAR analysis on tacrinerelated acetylcholinesterase inhibitors,\" Journal of Biomedical Science, vol. 21, no. 1, 2014.\n\n[7] M. Larif, S. Chtita, A. Adad, R. Hmamouchi, M. Bouachrine, and T. Lakhlifi, \"Predicting biological activity of Anticancer Molecules 3-ary 1-4-hydroxyquinolin-2-(1H)-one by DFTQSAR models,\" International Journal of Clinical and Experimental Medicine, vol. 3, pp. 32-42, 2013.\n\n[8] M. A. Lill and M. L. Danielson, \"Computer-aided drug design platform using PyMOL,\" Journal of Computer-Aided Molecular Design, vol. 25, no. 1, pp. 13-19, 2011.\n\n[9] P. C. D. Hawkins, A. G. Skillman, and A. Nicholls, \"Comparison of shape-matching and docking as virtual screening tools,\" Journal of Medicinal Chemistry, vol. 50, no. 1, pp. 74-82, 2007.\n\n[10] A. D. Becke, \"Becke's three parameter hybrid method using the LYP correlation functional,\" The Journal of Chemical Physics, vol. 98, pp. 5648-5652, 1993.\n\n[11] C. Lee, W. Yang, and R. G. Parr, \"Development of the ColleSalvetti correlation-energy formula into a functional of the electron density,\" Physical Review B, vol. 37, no. 2, p. 785, 1988.\n\n[12] P. Singh, \"Quantitative structure-activity relationship study of substituted-[1,2,4] oxadiazoles as slp1 agonists,\" Journal of Current Chemical and Pharmaceutical Sciences, vol. 3, 2013.\n\n[13] N. Minovski, Š. Župerl, V. Drgan, and M. Novič, \"Assessment of applicability domain for multivariate counter-propagation artificial neural network predictive models by minimum Euclidean distance space analysis: A case study,\" Analytica Chimica Acta, vol. 759, pp. 28-42, 2013.\n\n[14] J. H. Friedman, \"Multivariate adaptive regression splines,\" The Annals of Statistics, vol. 19, no. 1, pp. 1-67, 1991.\n\n[15] U. Abdulfatai, A. Uzairu, and S. Uba, \"Quantitative structure activity relationship study of anticonvulsant activity of a\\_substituted acetamido-N-benzylacetamide derivatives,\" Cogent Chemistry, vol. 2, Article ID 1166538, 2016.\n\n[16] A. Tropsha, P. Gramatica, and V. K. Gombar, \"The importance of being earnest: validation is the absolute essential for successful application and interpretation of QSPR models,\" Molecular Informatics, vol. 22, pp. 69-77, 2003.\n\n[17] R. Veerasamy, H. Rajak, A. Jain, S. Sivadasan, C. P. Varghese, and R. K. Agrawal, \"Validation of QSAR models-strategies and importance,\" International Journal of Drug Design and Discovery, vol. 3, pp. 511-519, 2011.\n\n[18] G. M. Eric, A. Uzairu, and P. A. Mamza, \"A Quantitative structure-activity relationship (qsar) study of the anti-tuberculosis activity of some quinolones,\" Journal of Scientific Research and Reports, vol. 10, pp. 1-15, 2016.\n\n[19] A. I. Ogadimma and U. Adamu, \"Analysis of selected chalcone derivatives as mycobacterium tuberculosis inhibitors,\" Open Access Library Journal, vol. 3, pp. 1-13, 2016.\n\n[20] M. Jalali-Heravi and A. Kyani, \"Use of computer-assisted methods for the modeling of the retention time of a variety of volatile organic compounds: A PCA-MLR-ANN approach,\" Journal of Chemical Information and Computer Sciences, vol. 44, no. 4, pp. 1328-1335, 2004.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-25_324_620_151_479}\n\\end{center}\n\nThe Scientific World Journal\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_a0271d2dc7b0f2506498g-25_788_2154_164_852}\n\nGastroenterology Research and Practice $=$\n\n\\section{Hindawi}\nSubmit your manuscripts at \\href{http://wwW.hindawi.com}{wwW.hindawi.com}\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_a0271d2dc7b0f2506498g-25_2164_2610_164_852}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-25_1000_1257_869_1214}\n\\end{center}\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_a0271d2dc7b0f2506498g-25_330_669_1228_1561}\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_a0271d2dc7b0f2506498g-25_330_1256_869_1561}\n\nJournal of\n\nDiabetes Research\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_a0271d2dc7b0f2506498g-25_722_2614_868_1568}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-25_326_776_1578_1911}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-25_789_1234_1579_1915}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-25_1244_1697_1579_1915}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_a0271d2dc7b0f2506498g-25_1706_2157_1579_1915}\n\\end{center}\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_a0271d2dc7b0f2506498g-25_2162_2613_1578_1917}\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_a0271d2dc7b0f2506498g-25_326_2612_1578_1916}\n\n\n\\end{document}", "record_id": "2023_09_22_a0271d2dc7b0f2506498g"}