{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{PAPER }\n\n\\author{}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nView Article Online\n\nView Journal | View Issue\n\nCheck for updates\n\nCite this: RSC Adv., 2018, 8, 28447 Received 18th April 2018\n\nAccepted 9th July 2018\n\nDOI: $10.1039 / c 8 r a 03306 d$\n\n\\href{http://rsc.li/rsc-advances}{rsc.li/rsc-advances}\n\n\\section{Synthesis of silver sulfide nanoparticles and their photodetector applicationsiं}\n\\begin{abstract}\nMyung Hyun Kang, ${ }^{a}$ Sung Ho Kim, ${ }^{a}$ Seunghun Jang, ${ }^{b}$ Ji Eun Lim, ${ }^{\\text {H Hyunju Chang, }}$ Ki-jeong Kong, ${ }^{b}$ Sung Myung (D) $^{* a}$ and Joung Kyu Park (DD *a \n Silver sulfide nanoparticles ( $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs) are currently being explored as infrared active nanomaterials that can provide environmentally stable alternatives to heavy metals such as lead. In this paper, we describe the novel synthesis of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs by using a sonochemistry method and the fabrication of photodetector devices through the integration of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs atop a graphene sheet. We have also synthesized $\\mathrm{Li}$-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs that exhibited a significantly enhanced photodetector sensitivity via their enhanced absorption ability in the UV-NIR region. First-principles calculations based on a density functional theory formalism indicated that Li-doping produced a dramatic enhancement of NIR photoluminescence of the $\\mathrm{Ag}_{2} \\mathrm{~S} \\mathrm{NPS}$. Finally, high-performance photodetectors based on CVD graphene and $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were demonstrated and investigated; the hybrid photodetectors based on $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S} \\mathrm{NPs}$ exhibited a photoresponse of $2723.2$ and $4146.0 \\mathrm{~A} \\mathrm{~W}^{-1}$ respectively under a light exposure of $0.89 \\mathrm{~mW} \\mathrm{~cm}^{-2} \\mathrm{at}^{2}$ $550 \\mathrm{~nm}$. Our novel approach represents a promising and effective method for the synthesis of ecofriendly semiconducting NPs for photoelectric devices.\n\\end{abstract}\n\n\\section{Introduction}\nUltraviolet (UV), visible, and near infrared (NIR) imaging with nanoparticles (NPs) has been extensively investigated owing to their utility in many applications, such as electroluminescent devices, optical modulators, photodetectors, and biological fluorophores. ${ }^{1-9}$ Recently, quantum dot NPs, such as PbS and PbSe, have particularly emerged as some of the most promising new materials for the development of advanced photoelectric devices, because of low-cost manufacturing, solution processability, and their superior photoelectric properties including unique absorption and emission of light in the NIR regions. ${ }^{10-15}$ However, leadcontaining NPs are highly toxic and responsible for extensive environmental contamination and health problems in various parts of the world. ${ }^{16,17}$ In order to overcome these limitations, the $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs have been extensively studied as attractive NIR-absorbing NPs for photovoltaics, photoconductors, and IR detectors due to their high biocompatibility and unique absorption ability in the UV-NIR regions, which can be used as multispectral photodetectors in UV, visible, and NIR spectrum because of their light absorption in a broad wavelength range. ${ }^{18-27}$ However, the development of a facile and easy methods for the preparation of the high-quality and monodisperse $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs is still required for\n\n${ }^{a}$ Advanced Materials Division, Korea Research Institute of Chemical Technology, Daejeon, Korea.E-mail: \\href{mailto:parkjk@krict.re.kr}{parkjk@krict.re.kr}\n\n${ }^{b}$ Center for Molecular Modeling and Simulation, Korea Research Institute of Chemical Technology, Daejeon, Korea\n\n$\\dagger$ Electronic supplementary information (ESI) available. See DOI: $10.1039 / \\mathrm{crra03306 \\textrm {d }}$ routine industrial applications including photoelectric devices and photodetectors.\n\nIn this study, we demonstrate the facile preparation of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and one-pot synthesis of Li-doped $\\mathrm{Ag}_{2}$ S NPs via ultrasonic irradiation, which resulted in a dramatic enhancement of their absorption and emission capabilities in the NIR region. The effect of Li ion doping on the electronic structure of the $\\mathrm{Ag}_{2} \\mathrm{~S}$ system was also investigated by first-principles calculations, which indicated that the Li-doped $\\mathrm{Ag}_{2}$ S NPs could enhance the photoluminescence of semiconducting nanocrystals. Finally, hybrid photodetectors based on transparent CVD graphene nanosheets and $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were successfully fabricated. These photodetectors based on pristine $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs showed photoresponses of $2723.2$ and $4146.0 \\mathrm{~A} \\mathrm{~W}^{-1}$, respectively, under a light exposure of $0.89 \\mathrm{~mW} \\mathrm{~cm}^{-2}$ at $550 \\mathrm{~nm}$. The proposed synthesis and doping methods constitute a facile and efficient approach for fabricating graphene-NP-based hybrid two-dimensional (2D) photoelectric devices for various applications, including flexible devices and advanced phototransistors.\n\n\\section{Results and discussion}\nThe facile synthesis of $10 \\mathrm{~nm} \\mathrm{Ag} \\mathrm{Ag}_{2} \\mathrm{~S}$ NPs was performed by using a sonochemical method, in which the decomposition of raw materials is induced by ultrasound under ambient conditions (Fig. 1a). Silver nitrate $\\left(\\mathrm{AgNO}_{3}\\right)$ in 1-dodecanethiol was sonicated to generate localized hot spots within the acoustic cavitation of collapsing bubbles during ultrasonic irradiation (a)\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_e8d1bc2fb9f3dce5f341g-2_171_623_188_990}\n\nFig. 1 Synthesis of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs. Schematic illustration of the synthesis of (a) $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and (b) Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPS by using ultrasonic irradiation.\n\n(reaction time: $10 \\mathrm{~min}$, power: $50 \\%$, temperature: $\\left.\\sim 160{ }^{\\circ} \\mathrm{C}\\right)(\\mathrm{see}$ Fig. S1 in ESI $\\dagger$ ). In order to improve NIR photodetector sensitivity, Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were also synthesized using a method similar to that used for pristine $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs by adding the appropriate amount of $\\mathrm{Li}$ in the reaction bottle (Fig. 1b). Such photosensitive materials can lead to an enhancement of the absorption ability in the broad wavelength range, resulting in an overall improvement of their photodetector performance.\n\nTransmission electron microscopy (TEM) analysis was used to characterize the structure and morphology of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs. The TEM images of the as-prepared $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs confirmed the monodispersity and narrow size distribution of the NPs (Fig. 2a) that can be attributed to the effective separation of the nucleation and growth processes during ultrasonic irradiation at $160{ }^{\\circ} \\mathrm{C}$. This result was similar to that reported in a previous study..$^{28}$ (a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e8d1bc2fb9f3dce5f341g-2_1546_1769_202_443}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e8d1bc2fb9f3dce5f341g-2_1776_2215_210_440}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e8d1bc2fb9f3dce5f341g-2_1548_1773_457_679}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e8d1bc2fb9f3dce5f341g-2_1768_1996_441_685}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e8d1bc2fb9f3dce5f341g-2_1553_2001_681_993}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e8d1bc2fb9f3dce5f341g-2_1991_2229_436_991}\n\\end{center}\n\nFig. 2 Synthesis of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs. (a) Representative TEM images of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs with a $10 \\mathrm{~nm}$ size. (b) Optical images of the dispersion of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs in chloroform, hexane, toluene, and ethyl acetate. (c) XRD patterns of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs in terms of Li concentrations. (d) TEM images for $0.3 \\mathrm{mmol} \\mathrm{Li}$-doped (right), $0.5 \\mathrm{mmol} \\mathrm{Li}$ doped (middle), and $0.7 \\mathrm{mmol}$ Li-doped (left) $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs. (e) UV-Vis-NIR absorption spectra (left) and PL emission spectra under an excitation of $850 \\mathrm{~nm}$ (right). Significantly, the $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were well dispersed in various organic solvents due to the presence of dodecanethiol coated on the NP surface (Fig. 2b). In the XRD patterns of the $\\mathrm{Ag}_{2} \\mathrm{~S} \\mathrm{NPs}$ doped with different amounts of $\\mathrm{Li}^{+}$, most of the peaks corresponded to the monoclinic $\\mathrm{Ag}_{2} \\mathrm{~S}$ phase (JCPDS no. 014-0072) (Fig. 2d). The TEM images of Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs for different $\\mathrm{Li}^{+}$ amounts revealed spherical monodisperse NPs; Li contents did not affect particle morphology and size (Fig. 2c). The photoluminescence (PL) excitation and emission spectra of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs as a function of the Li concentration are shown in Fig. 2e. Unlike general quantum dots, involving $\\mathrm{PbSe}$ and $\\mathrm{PbS}$, these NPs could be effectively excited across the UV-NIR region (See Fig. $\\mathrm{S} 2$ in $\\mathrm{ESI} \\dagger$ ). It has been reported that the $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs emits efficiently under the various excitation ranges, which makes them promising candidates for photodetectors requiring unique absorption in the various wavelength regions (from UV to NIR). As the content of $\\mathrm{Li}^{+}$increased, the emission intensities of the $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs increased up to $0.05 \\mathrm{mmol}$ and exhibited an emission peak at $1250 \\mathrm{~nm}$ (Fig. 2e). The Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were found to display a remarkable enhancement of the emission intensity (up to two orders) compared to that of the undoped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs. It is well known that even at very small concentrations, $\\mathrm{Li}^{+}$ions play an important role as co-dopants in increasing the luminescent efficiency of phosphors. ${ }^{28}$ In the XPS spectrum, only $\\mathrm{Ag}$ and $\\mathrm{S}$ peaks are observed and Li $1 \\mathrm{~S}$ peak is unable to distinguish with $\\mathrm{Ag} 4 \\mathrm{P}$ at around $55 \\mathrm{eV}$ because $\\mathrm{Li} 1 \\mathrm{~S}$ peak and Ag 4P peak overlap each other (see Fig. S3 in ESI $\\dagger$ ). But ICP analysis confirmed the existence of Li in these Ag2S NPs (see Fig. $\\mathrm{S} 4$ in ESI $\\dagger$ ).\n\nTo understand the effect of $\\mathrm{Li}$ ion doping on the electronic structures of the $\\mathrm{Ag}_{2} \\mathrm{~S}$ system, we performed first-principles calculations based on the density functional theory formalism for the $\\mathrm{Li}$ interstitials and substitutions in crystalline $\\mathrm{Ag}_{2} \\mathrm{~S}$. Fig. 3 (left) shows the optimized atomic geometries of (a) $3 \\times 2$ $\\times 1 \\mathrm{Ag}_{2} \\mathrm{~S}$ supercell (321-pristine), (c) $3 \\times 2 \\times 1 \\mathrm{Ag}_{2} \\mathrm{~S}$ supercell with a $\\mathrm{Li}$ interstitial $\\left(321-\\mathrm{Li}_{\\mathrm{i}}-1\\right)$, and (e) $3 \\times 2 \\times 1 \\mathrm{Ag}_{2} \\mathrm{~S}$ supercell with two Li interstitials $\\left(321-\\mathrm{Li}_{\\mathrm{i}}-2_{\\text {near }}\\right)$. As shown in Fig. 2d, since the $\\mathrm{Li}$ contents did not affect the structural properties of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs, not only interstitial doping but also substitution were considered in our calculations. The Li concentration was about $0.12 \\mathrm{wt} \\%$ for the case of $321-\\mathrm{Li}_{\\mathrm{i}}-1$, which corresponded to the experimental conditions. Although a Li interstitial was added in the interspace of the $\\mathrm{Ag}_{2} \\mathrm{~S}$ cell, its crystal structure was well preserved, as shown in Fig. 3c. Furthermore, when an additional $\\mathrm{Li}$ atom was appended, a local amorphous structure in the doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ began to appear (Fig. 3e). Additionally, the calculations for the Li substitutions at the Ag sites in the $3 \\times 2$ $\\times 1 \\mathrm{~A} \\mathrm{Ag}_{2} \\mathrm{~S}$ supercell were also carried out (See Fig. S5 in ESI $\\dagger$ ).\n\nSince $\\mathrm{Li}^{+}$ions $\\left(0.9 \\AA\\right.$ ) have a smaller ionic radius than $\\mathrm{Ag}^{+}$ ions $\\left(1.3 \\AA\\right.$ ) in the $\\mathrm{Ag}_{2} \\mathrm{~S}$ crystal, regardless of the number (per unit-cell) of Li substitutions, the crystal structures of doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ systems with $\\mathrm{Li}$ substitutions at the $\\mathrm{Ag}$ sites were well maintained. ${ }^{29}$ Likewise, the electronic structure of $\\mathrm{Ag}_{2} \\mathrm{~S}$ hardly changed upon Li substitution (See Fig. S5 in ESI $\\dagger$ ). However, the Li interstitial in the $\\mathrm{Ag}_{2} \\mathrm{~S}$ crystal caused a significant change in the electronic structure. Fig. 3 (right) shows the calculated band structures and projected density of states (PDOS) of (b) 321-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_e8d1bc2fb9f3dce5f341g-3_168_964_169_995}\n\nFig. 3 Calculations for the pristine and Li doped (interstitials) $3 \\times 2 \\times 1$ $\\mathrm{Ag}_{2} \\mathrm{~S}$. Calculated optimized atomic geometries for the (a) 321-pristine, (c) $321-L i_{i}-1$, and (e) $321-L_{i}-2_{\\text {near. }}$ The gray, yellow, and green balls represent the $\\mathrm{Ag}, \\mathrm{S}$, and $\\mathrm{Li}$ atoms, respectively. Calculated band structures and PDOSs for (b) 321-pristine, (d) 321-Li$i_{i}-1$, and (f) 321-Li $i_{i}-$ $2_{\\text {near }}$. The Fermi levels of all calculated systems were set at zero.\n\npristine, (d) 321- $\\mathrm{Li}_{\\mathrm{i}}-1$, and (f) $321-\\mathrm{Li}_{\\mathrm{i}}-2_{\\text {near. }}$. As shown in the band structures of Fig. $3 \\mathrm{~b}$ and $\\mathrm{d}$, the bottom of the conduction band shifted below the Fermi level by the Li interstitial doping. As a result, 321- $\\mathrm{Li}_{\\mathrm{i}}-1$ exhibited a metallic band gap. The Li impurity provides a partial $2 \\mathrm{~s}$ electron to the pristine $\\mathrm{Ag}_{2} \\mathrm{~S}$ system, which leads the change in band structure from a semiconducting to a metallic band gap. ${ }^{30}$\n\nIn the case of the $321-\\mathrm{Li}_{\\mathrm{i}}-2_{\\text {near }}$ system with two $\\mathrm{Li}$ interstitials, it could be confirmed that the bottom of the conduction band was reduced to a lower energy level than that of $321-\\mathrm{Li}_{\\mathrm{i}}-1$ by an additional Li 2 s partial electron (Fig. 3d and f). In order to check the effect of the Li-Li interaction on the electronic structure of the Li doped- $\\mathrm{Ag}_{2} \\mathrm{~S}$ system, the calculations for the $3 \\times 2 \\times 1$ $\\mathrm{Ag}_{2} \\mathrm{~S}$ supercells with two Li interstitials (or two Li substitutions) were performed by varying the $\\mathrm{Li}-\\mathrm{Li}$ interdistance (See Fig. S6 or S5c-f in ESI $\\dagger$ ). However, no noticeable influence of the electronic structure on the interaction between two Li interstitials (or two Li substitutions) in the $\\mathrm{Ag}_{2} \\mathrm{~S}$ system was observed.\n\nBased on the results obtained from our calculations, we proposed the following mechanism for the photoluminescence enhancement and quenching in Fig. 2e, as shown in Fig. 4. Extra carriers in $\\mathrm{Li}$ interstitial doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ are accumulated within the crystal, which further enhances its metallic property. By increasing the Li doping concentration, extra electrons in metallic NPs begin to migrate to original semiconducting NP outside (Step 2 in Fig. 4), thus positively charged metallic NPs can enhance the photoluminescence of the semiconducting NPs.\n\nHowever, this phenomenon takes place only up to optimal doping conditions (Step 3 in Fig. 4). Above a certain doping concentration, the absolute number of semiconducting NPs\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_e8d1bc2fb9f3dce5f341g-3_165_670_1073_1909}\n\\end{center}\n\nFig. 4 Mechanism of photoluminescence enhancement and quenching Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs. Schematic diagram for the mechanism of the photoluminescence enhancement and quenching in Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs by increasing Li doping concentration (from Step 1 to Step 5 , along the black arrow direction). The blue-sky and red balls represent the semiconducting and metallic $\\mathrm{Ag}_{2} \\mathrm{~S}$ NP. The blue and red wave arrows indicate the photoluminescence excitation source and light emission, respectively.\n\nparticipating in the photoluminescence process are reduced compared to that of metallic NPs, and thereby the total luminescence of the sample begins to decrease rather than increase (from Step 4 to Step 5 in Fig. 4). A similar mechanism of photoluminescence enhancement and quenching has been already proposed in a previous study on Ag-doped CdSe NP. ${ }^{31}$\n\nIn addition, $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were successfully employed for the fabrication of hybrid photodetectors based on CVD graphene and photosensitive NPs. Recently, carbon-based materials, such as carbon nanotubes, graphene oxide, and graphene have drawn considerable attention due to their superior optical, electrical, and mechanical properties. ${ }^{32}$ Among carbon materials, graphene and graphene-related materials have been proposed as strong candidates for various optoelectronic applications, such as ultra-broadband photodetectors and solar cells. ${ }^{33}$ However, their low optical absorption and the short recombination rate have limited their application to graphene-based optoelectronic devices. First, 1-octadecyltrichlorosilane (OTS) was utilized as self-assembled monolayer (SAM) molecules to achieve the uniform assembly of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs. In this case, a UV/ozone treatment of the $\\mathrm{SiO}_{2}$ surface was carried out, and the UV-treated $\\mathrm{SiO}_{2}$ substrate was placed in the OTS solution to cover the $\\mathrm{SiO}_{2}$ surface. When the OTS-coated $\\mathrm{SiO}_{2}$ substrate was placed in the solution of methylterminated $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs, the $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were assembled on the neutral-charged OTS molecular layer. CVD-grown graphene nanosheets were transferred on the top of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs using a PMMA-assisted wet transfer method. Finally, Au/Cr acting as source and drain electrodes were deposited using a shadow mask, while 1-butyl-3-methylimidazolium $\\left(\\mathrm{BmimPF}_{6}\\right)$ was used as the ionic liquid. $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were used as photosensitive materials. As shown in the image in Fig. 5a, the channel length and width of the device were $100 \\mu \\mathrm{m}$ and $500 \\mu \\mathrm{m}$, respectively. The SEM image in Fig. $5 \\mathrm{a}$ and atomic force microscopy (AFM) image showed that the $\\mathrm{NP}$ density on the $\\mathrm{SiO}_{2}$ substrate was uniform (See Fig. S8 in $\\mathrm{ESI}_{\\dagger}^{\\dagger}$ ), and the NP density was\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_e8d1bc2fb9f3dce5f341g-4_170_762_162_990}\n\nFig. 5 Photodetectors based on graphene and $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs (a) a schematic diagram of the structure of a photodetector based on graphene and $\\mathrm{Ag}_{2}$ S NPs (left). Optical image of the photodetectors (middle). SEM image of graphene on $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs (right). (b) The transfer characteristics of a transistor based on graphene and $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs under various light exposing conditions. (c) A schematic energy band diagram of the Fermi level variation of graphene and $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs. (d) Threshold voltage of the devices as a function of light power. (e) Photocurrent of photodetector based graphene- $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs (left) and graphene Lidoped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs (right) under cyclic light exposure. Here, a light source of $0.89 \\mathrm{~W} \\mathrm{~m}^{-2}$ at $550 \\mathrm{~nm}, 1.65 \\mathrm{~W} \\mathrm{~m}^{-2}$ at $350 \\mathrm{~nm}$, and $0.38 \\mathrm{~W} \\mathrm{~m}^{-2}$ at $800 \\mathrm{~nm}$ was used for the measurements. (f) Photoresponsitivity of photodetectors based graphene- $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and graphene Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs obtained by light exposure of $0.89 \\mathrm{~W} \\mathrm{~m}^{-2}$ at $550 \\mathrm{~nm}, 1.65 \\mathrm{~W}$ $\\mathrm{m}^{-2}$ at $350 \\mathrm{~nm}$, and $0.38 \\mathrm{~W} \\mathrm{~m}^{-2}$ at $800 \\mathrm{~nm}$.\n\napproximately $150 \\mu \\mathrm{m}^{-2}$. The transfer curve $\\left(I_{\\mathrm{DS}}-V_{\\mathrm{G}}\\right)$ of pristine graphene devices at $V_{\\mathrm{DS}}=0.1 \\mathrm{~V}$ exhibited a charge-neutral Dirac point at a near-zero gate voltage $\\left(V_{\\mathrm{G}}\\right)$ and an asymmetric hole and electron conduction (see Fig. S9 in $\\mathrm{ESI} \\dagger$ ). In the case of devices based on $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and graphene, the Dirac voltage showed a positive shift compared with that of pristine graphene devices, and this positive shift was increased with increase of the illumination power. The electrical band structures provide a good explanation of the difference between the photodetectors based on graphene and $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs, as shown in Fig. 5c. The energy-band bending at the interface between a surface of graphene and $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs also occurred. The direction of the built-in electric field was formed from the graphene to the $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs. The photo-generated electrons (or holes) in the $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs moved within the graphene sheet with the passage of the energy band bending at the interface under the light illumination. ${ }^{34-36}$ The photodetector showed an increase of current level under the exposure to a light source. Here, holes transfer from $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs to graphene resulted in an increase in the photocurrent (Fig. 5c). Fig. $5 \\mathrm{~d}$ shows the $\\mathrm{Ag}_{2} \\mathrm{~S}$-graphene photodetector under a light exposure of $0.00,0.23,0.38,0.50,0.76$, and $0.89 \\mathrm{~mW} \\mathrm{~cm}^{-2}$ exhibited a Dirac voltage of $2.2,2.4,2.6,2.9,3.0$ and $3.5 \\mathrm{~V}$, respectively.\n\nThe photoresponse characteristics of hybrid photodetectors were evaluated by measuring the time-dependent photocurrent under various illumination conditions, such as $0.89 \\mathrm{~W} \\mathrm{~m}^{-2}$ at $550 \\mathrm{~nm}, 1.65 \\mathrm{~W} \\mathrm{~m}^{-2}$ at $350 \\mathrm{~nm}$, and $0.38 \\mathrm{~W} \\mathrm{~m}{ }^{-2}$ at $800 \\mathrm{~nm}$. First, in the case of photodevices based on pristine $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs, the current through the graphene channel increased under light exposure. Moreover, we observed that the photocurrent under the light exposure at 350 - and $550 \\mathrm{~nm}$ wavelengths was larger than that under $800 \\mathrm{~nm}$, as shown in Fig. 5e. In addition, as previously mentioned, Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs possess superior light absorption properties than pristine $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs, while photodetectors based on graphene and $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs exhibit a larger photocurrent than $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs. Fig. $5 \\mathrm{f}$ shows the photoresponse of our devices under the various exposing conditions. For example, hybrid photodetectors based on $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and $\\mathrm{Li}-$ doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs displayed a photoresponse of $2723.2$ and 4146.0 $\\mathrm{A} \\mathrm{W}^{-1}$, respectively, under a light exposure of $0.89 \\mathrm{~mW}$ $\\mathrm{cm}^{-2}$ at $550 \\mathrm{~nm}$. In order to investigate the stability of the NPs, the photo and thermal stability of NPs was studied by illuminating the NPs using UV (365 $\\mathrm{nm})$ and heat-treated temperatures for various times. The PL emission intensities of the samples does not show much reduction in PL emission intensities, which shows the NPs have high photo and thermal stability. Moreover, to investigate the long-term air-stability, graphene photodetectors with based a graphene transistor with $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were placed in an environmental chamber, with a relative humidity and temperature of $50 \\%$ and $25{ }^{\\circ} \\mathrm{C}$, respectively. Our photodetectors exhibited a similar trend with NPs data for 90 days, possibly due to charge trapping from water molecules on the graphene surface, which shows high reliability and stability of the NPs as well as photodetector devices (see Fig. S10 and S11 in ESI $\\dagger$ ).\n\n\\section{Experimental}\n\\section{Materials}\nSilver nitrate $\\left(\\mathrm{AgNO}_{3}, 99 \\%\\right), \\mathrm{Li}_{2} \\mathrm{CO}_{3}(98 \\%)$, and 1-dodecanethiol (DDT) were purchased from Sigma Aldrich. Chloroform and ethyl acetate were used to disperse and to isolate the NPs. All chemicals were used without further purification.\n\n\\section{Synthesis of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and $\\mathrm{Li}$-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs}\nThe $\\mathrm{Ag}_{2} \\mathrm{~S}$ and Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were synthesized by ultrasonication. For the synthesis of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs, $\\mathrm{AgNO}_{3}$ was added to a $20 \\mathrm{~mL}$ vial containing $10 \\mathrm{~mL}$ of DDT. The solution was treated by ultrasound irradiation for $10 \\mathrm{~min}$ in air atmosphere. The resulting suspension was centrifuged with ethyl acetate several times to remove any by-products and dried in an electric oven at $80^{\\circ} \\mathrm{C}$. The Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were synthesized in the same way, upon addition of the appropriate amount of lithium to the reaction bottle.\n\n\\section{Characterization of $\\mathrm{Ag}_{2} \\mathrm{~S}$ and Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S} \\mathrm{NPs}$}\nThe absorption spectra of solutions containing $0.01 \\mathrm{~g}$ of $\\mathrm{Ag}_{2} \\mathrm{~S}$ and Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs (in $10 \\mathrm{~mL}$ of chloroform) were measured using a SolidSpec-3700 UV-Vis-NIR spectrophotometer from Shimadzu. The photoluminescence (PL) spectra were measured by a Fluorolog3 with TCSPC mode (HORIBA Scientific). All samples were excited by a CW $450 \\mathrm{~W}$ xenon source, and directed to a single-grating spectrometer. The PL spectra were obtained using a InP/InGaAs detector equipped with an $\\mathrm{LN}$ cooler. All TEM images were acquired on a JOEL JEM-2100F transmission electron microscope operating at $200 \\mathrm{KV}$. The TEM samples were prepared by drop-casting very thin nanoparticle solutions onto a 200 mesh copper grid with a carbon film (Ted Pella). Xray diffraction spectroscopy (XRD) for the NPs was performed using a Rigaku D/MAX-220 V X-ray diffractometer equipped with Cu K-alpha $(1.540598 \\AA$ A) source.\n\n\\section{Computational details}\nThe atomic and electronic structures of the pristine and $\\mathrm{Li}$ doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ systems were examined using the Vienna ab initio simulation package (VASP). ${ }^{37,38}$ The exchange correlation functional was approximated using the PBEsol (Perdew-BurkeErnzerhof revised for solids) expression. ${ }^{39}$ The electron-ion interactions were modeled using the projector augmented wave (PAW) method. ${ }^{40}$ The electronic wave functions were expanded in a basis set of plane waves using a kinetic energy cutoff of $500 \\mathrm{eV}$. Geometry relaxation steps were performed under the criterion that ionic forces were reduced below $0.02 \\mathrm{eV}^{\\circ}{ }^{-1}$. Doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ systems with interstitial and substitutional $\\mathrm{Li}$ atoms were analyzed using a unit cell $(1 \\times 1 \\times 1)$ and $3 \\times 2 \\times 1$ supercells with $10 \\times 5 \\times 5$ and $4 \\times 3 \\times 5 k$-point meshes, respectively. The crystal data of $\\beta-\\mathrm{Ag}_{2} \\mathrm{~S}$ were consistent with earlier reports and were used as the lattice parameters of the pristine $\\mathrm{Ag}_{2} \\mathrm{~S}$ system in this work. ${ }^{41,42}$ The pristine $\\mathrm{Ag}_{2} \\mathrm{~S}$ system possessed a monoclinic crystal structure (space group $P 2_{1} / c, a=$ $4.231 \\AA, b=6.930 \\AA, c=9.526 \\AA, \\beta=125.48^{\\circ}$ ), as shown in Fig. S7a in ESI. $\\dagger$\n\nFabrication of photodetectors based on $\\mathrm{Ag}_{2} \\mathrm{~S}$ (or Li-doped $\\operatorname{Ag}_{2} \\mathrm{~S}$ NPs) and graphene\n\nFirst, a $\\mathrm{SiO}_{2}$ surface was subjected to a UV/ozone treatment at atmospheric pressure, and then the UV-treated $\\mathrm{SiO}_{2}$ substrate was placed in an OTS solution $(1 / 500$ by volume ratio in anhydrous hexane). After the OTS-coated $\\mathrm{SiO}_{2}$ substrate was placed in a $0.16 \\mathrm{wt} \\%$ solution of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ (total solution of $0.1 \\mathrm{~g}$ NPs under $50 \\mathrm{~mL} \\mathrm{CHCl}_{3}$ ) usually for about 5 minutes, the $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were assembled on the OTS molecular layer. CVDgrown graphene nanosheets were transferred on top of the $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs using a PMMA-assisted wet transfer method. $\\mathrm{Au} / \\mathrm{Cr}$ (as source/drain electrodes) were deposited using a shadow mask. In our study, Cr $(7 \\mathrm{~nm}$ )/Au (70 $\\mathrm{nm}$ ), 1-butyl-3-methylimidazolium, and $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were used as the source/drain electrodes, ionic liquid, and photosensitive materials, respectively.\n\n\\section{Conclusion}\nIn summary, the facile preparation of $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs was successfully achieved for the development of high-performance optoelectronic devices. These materials showed enhancements of absorption and emission in the NIR region through a one-step process upon ultrasonic irradiation. The effect of Li ion doping on the electronic structure of the $\\mathrm{Ag}_{2} \\mathrm{~S}$ was also investigated by first-principles calculations, which indicated that the Li-doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs could have enhanced the NIR photoluminescence and absorption abilities. Finally, hybrid photodetectors based on transparent CVD graphene nanosheets and $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs were successfully fabricated. These photodetectors based on pristine $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs and $\\mathrm{Li}-$ doped $\\mathrm{Ag}_{2} \\mathrm{~S}$ NPs showed photoresponses of $2723.2$ and $4146.0 \\mathrm{~A}$ $\\mathrm{W}^{-1}$, respectively, under a light exposure of $0.89 \\mathrm{~mW} \\mathrm{~cm}^{-2}$ at $550 \\mathrm{~nm}$. This approach provides a facile high-quality synthesis method for NPs as well as a doping method for the fabrication of advanced hybrid photoelectric devices such as advanced photo-transistors, and solar cells.\n\n\\section{Conflicts of interest}\nThere are no conflicts to declare.\n\n\\section{Acknowledgements}\nM. H. K., S. H. K., and S. J. contributed equally to this work. This research was funded by the Korean Ministry of Science and Technology through KK-1607-C11, BS.K18M201, KNI1801, IJ1705, IJ18-07, KK1802-C00. This research was also supported by Nano/Material Technology Development Program through the National Research Foundation of Korea (NRF) funded by the Ministry of Education, Science and Technology (NRF2017M3D9A1073502).\n\n\\section{Notes and references}\n1 F. Guo, B. Yang, Y. Yuan, Z. Xiao, Q. Dong, Y. Bi and J. Huang, Nat. Nanotechnol., 2012, 7, 798-802.\n\n2 K. Liu, M. Sakurai and M. Aono, Sensors, 2010, 10, 86048634.\n\n3 G. Konstantatos, J. Clifford, L. Levina and E. Sargent, Nat. Photonics, 2007, 1, 531-534.\n\n4 S. W. Shin, K. H. Lee, J. S. Park and S. J. Kang, ACS Appl. Mater. Interfaces, 2015, 7, 19666-19671.\n\n5 E. H. Sargent, Adv. Mater., 2005, 17, 515-522.\n\n6 N. Tessler, V. Medvedev, M. Kazes, S. Kan and U. Banin, Science, 2002, 295, 1506-1508.\n\n7 L. Bakueva, G. Konstantats, L. Levina, S. Musikhin and E. H. Sargent, Appl. Phys. Lett., 2004, 84, 3459-3461.\n\n8 B. L. Wehrenberg and P. Guyot-Sionnest, J. Am. Chem. Soc., 2003, 125, 7806-7807.\n\n9 X. Gao, Y. Cui, R. M. Levenson, L. W. K. Chung and S. Nie, Nat. Biotechnol., 2004, 22, 969-976.\n\n10 R. Saran and R. J. Curry, Nat. Photonics, 2016, 10, 81-92.\n\n11 G. Konstantatos, I. Howard, A. Fischer, S. Hoogland, J. Clifford, E. Klem, L. Levina and E. H. Sargent, Nature, 2006, 442, 180-183.\n\n12 S. A. Mcdonald, Nat. Mater., 2005, 4, 138-142.\n\n13 G. Konstantatos and E. H. Sargent, Nat. Nanotechnol., 2010, $5,391-400$.\n\n14 K. Szendrei, F. Cordella, M. V. Kovalenko, M. Böberl, G. Hesser, M. Yarema, D. Jarzab, O. V. Mikhnenko, A. Gocalinska, M. Saba, F. Quochi, A. Mura, G. Bongiovanni, P. W. M. Blo, W. Heiss and M. A. Loi, Adv. Mater., 2009, 21, 683-687. 15 M. Böberl, M. V. Kovalenko, S. Gamerith, E. J. W. List and W. Heiss, Adv. Mater., 2007, 19, 3574-3578.\n\n16 Y. Cao, H. Liu, Q. Li, Q. Wang, W. Zhang, Y. Chen, D. Wang and Y. Cai, J. Inorg. Biochem., 2013, 126, 70-75.\n\n17 Q. Li, X. Hu, Y. Bai, M. Alattar, D. Ma, Y. Cao, Y. Hao, L. Wang and C. Jiang, Food Chem. Toxicol., 2013, 60, 213217.\n\n18 Y. Zhang, G. Hong, Y. Zhang, G. Chen, F. Li, H. Dai and Q. Wang, ACS Nano, 2012, 6, 3695-3702.\n\n19 Y. Zhang, Y. Zhang, G. Hong, W. He, K. Zhou, K. Yang, F. Li, G. Chen, Z. Liu, H. Dai and Q. Wang, Biomaterials, 2013, 34, 3639-3646.\n\n20 C. Li, Y. Zhang, M. Wang, Y. Zhang, G. Chen, L. Li, D. Wu and Q. Wang, Biomaterials, 2014, 35, 393-400.\n\n21 E. Cassette, M. Helle, L. Benzdetnaya, F. Marchal, B. Dubertret and T. Pons, Adv. Drug Delivery, 2013, 65, 719731.\n\n22 G. Chen, F. Tian, Y. Zhang, Y. Zhang, C. Li and Q. Wang, Adv. Funct. Mater., 2014, 24, 2481-2488.\n\n23 P. Jiang, C. Zhu, Z. Zhang, Z. Tian and D. Pang, Biomaterials, 2012, 33, 5130-5135.\n\n24 S. S. Dhumure and C. D. Lokhande, Sol. Energy Mater. Sol. Cells, 1992, 28, 159-166.\n\n25 S. S. Dhumure and C. D. Lokhande, Sol. Energy Mater. Sol. Cells, 1993, 29, 183-194.\n\n26 G. Hodes, J. Manassen and D. Cahen, Nature, 1976, 261, 403404.\n\n27 S. Kitova, J. Eneva, A. Panov and H. Haefke, J. Imaging Sci. Technol., 1994, 38, 484-488. 28 J. K. Park, S. M. Park, C. H. Kim, H. D. Park and S. Y. Choi, J. Electrochem. Soc., 2003, 150, H27-H31.\n\n29 R. D. Shannon, Acta Crystallogr., 1976, A32, 751-767.\n\n30 W. Wan, Q. Zhang, Y. Cui and E. Wang, J. Phys.: Condens. Matter, 2010, 22, 415501-415600.\n\n31 A. Sahu, M. S. Kang, A. Kompch, C. Notthoff, A. W. Wills, D. Deng, M. Winterer, C. D. Frisbie and D. J. Norris, Nano Lett., 2012, 12, 2587-2594.\n\n32 A. K. Geim and K. S. Novoselov, Nat. Mater., 2007, 6, 183-191.\n\n33 F. Bonaccorso, Z. Sun, T. Hasan and A. C. Ferrari, Nat. Photonics, 2010, 4, 611-622.\n\n34 Q. Nian, L. Gao, Y. Hu, B. Deng, J. Tang and G. J. Cheng, ACS Appl. Mater. Interfaces, 2017, 9, 44715-44723.\n\n35 Z. Sun, Z. Liu, J. Li, G. Tai, S.-P. Lau and F. Yan, Adv. Mater., $2012,24,5878-5883$.\n\n36 G. Konstantatos, M. Badioli, L. Gaudreau, J. Osmond, M. Bernechea, F. P. G. Arquer, F. Gatti and F. H. L. Koppens, Nat. Nanotechnol., 2012, 7, 363-368.\n\n37 G. Kresse and J. Hafner, Phys. Rev. B: Condens. Matter Mater. Phys., 1993, 47, 558-561.\n\n38 G. Kresse and J. Furthmuller, Phys. Rev. B: Condens. Matter Mater. Phys., 1996, 54, 11169-11186.\n\n39 J. P. Perdew, A. Ruzsinszky, G. I. Csonka, O. A. Vydrov, G. E. Scuseria, L. A. Constantin, X. Zhou and K. Burke, Phys. Rev. Lett., 2008, 100, 136406.\n\n40 P. E. Blöchl, Phys. Rev. B: Condens. Matter Mater. Phys., 1994, 50, 17953-17979.\n\n41 S. Kashida, N. Watanabe, T. Hasegawa, H. Iida, M. Mori and S. Savrasov, Solid State Ionics, 2003, 158, 167-175.\n\n42 R. Sadanaga and S. Sueno, J. Mineral. Soc. Jpn., 1967, 5, 124.\n\n\n\\end{document}", "record_id": "2023_09_22_e8d1bc2fb9f3dce5f341g"}