{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{HHS Public Access }\n\n\n\\author{Ruwini D. Rajapaksha $^{\\dagger}$, Matthias Banet $^{\\ddagger}$, Cody Champion $^{\\S}$, Liliya V. Crolova $^{\\dagger}$, Snezna\\\\\nRogelj $^{\\S}$, Pabitra Choudhury\", and Mahinda I. Ranasinghe ${ }^{*}, \\dagger$\\\\\n${ }^{\\dagger}$ Department of Chemistry, New Mexico Institute of Mining and Technology, 801 Leroy Place,\\\\\nSocorro, New Mexico 87801, United States\\\\\n${ }^{\\ddagger}$ Department of Physics, New Mexico Institute of Mining and Technology, 801 Leroy Place,\\\\\nSocorro, New Mexico 87801, United States\\\\\n§department of Biology, New Mexico Institute of Mining and Technology, 801 Leroy Place,\\\\\nSocorro, New Mexico 87801, United States\\\\\n\"Chemical and Materials Engineering Departments, New Mexico Institute of Mining and\\\\\nTechnology, 801 Leroy Place, Socorro, New Mexico 87801, United States}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nAuthor manuscript\n\nJ Phys Chem A. Author manuscript; available in PMC 2019 July 18.\n\nPublished in final edited form as:\n\nJ Phys Chem A. 2018 February 01; 122(4): 937–945. doi:10.1021/acs.jpca.7b09638.\n\n\\section{Spectroscopic Study of a Photoactive Antibacterial Agent: 2,3- Distyrylindole}\n\n\n\\begin{abstract}\nOptical properties and fluorescence decay dynamics of a photoactive indole based antibacterial chromophore system, 2,3-distyrylindole (23DSI), were investigated using various spectroscopic characterization techniques. Experimental studies were done by utilizing steady-state UV-vis spectroscopy, steady-state fluorescence spectroscopy, time-resolved fluorescence upconversion spectroscopy, and time-correlated single-photon counting spectroscopy. Our studies show that the 23DSI molecule has a multiphoton absorption property as indicated by two- and three-photon absorption in the both the solution and the solid phases. The ultrafast time-resolved fluorescence upconversion studies show that this molecule undergoes a fast decay process with an average time constant of $34 \\mathrm{ps}$, a single exponential decay, and an average fluorescence lifetime of $1 \\mathrm{~ns}$. The compound 23DSI did not show any signs of singlet oxygen production. The density functional theory (DFT) calculations showed that the 23DSI molecule has conjugated electron densities that are responsible for multiphoton absorption. The chlorine-substituted styryl groups, attached to the central indole ring facilitate the excellent electron delocalization within the molecule. This optimal electron delocalization, combined with the good electron conjugation in the 23DSI molecule is important for efficient multiphoton absorption and is in excellent agreement with experimental observations. Both the optical spectrum and emission spectrum using DFT calculations are also surprisingly well matched with the experimentally measured UV-vis spectrum and the emission\n\\end{abstract}\n\n*Corresponding Author: M. I. Ranasinghe. \\href{mailto:mahinda.ranasinghe@nmt.edu}{mahinda.ranasinghe@nmt.edu}. Phone: (575) 835-5192.\n\nThe authors declare no competing financial interest.\n\nASSOCIATED CONTENT\n\nSupporting Information\n\nThe Supporting Information is available free of charge on the ACS Publications website at DOI: 10.1021/acs.jpca.7b09638. Geometry optimized distyrylindole molecule, frontier molecular orbitals of the optimized ground-state geometry of 23DSI, the emission spectra of 23DSI in the oxygen- and nitrogen-saturated environments, and Mulliken charges of individual atoms of both the ground state and excited state of the 23DSI molecule (PDF) spectrum, respectively. Combined experimental and theoretical studies suggest that excited electrons initially relax to the singlet state (S1) by internal conversion (IC) and subsequently relax back to their ground state by emitting absorbed energy as fluorescence emission. The outstanding multiphoton absorption capabilities of this 23DSI molecule support its potential application in both biological imaging and photodynamic inactivation (PDI).\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_ddfb75e0fb765dc682bbg-02_489_1029_297_1449}\n\\end{center}\n\n\\section{INTRODUCTION}\nHeterocyclic compounds and their chemistry have drawn great interest among synthetic chemists. ${ }^{1-5}$ Different libraries of compounds can be synthesized using the same heterocyclic scaffold. ${ }^{2,3}$ Novel classes of compounds, having absolutely novel biological, chemical, and physical properties, can be designed and synthesized using these fused heterocyclic compounds by placing them in different combinations. ${ }^{3-6}$ Heterocyclic compounds having a fused aromatic ring containing a pyrrole are known as \"indoles\".5 This class of heterocycles is very interesting as it has applications in the fields of biology, medicine, ${ }^{7-14}$ and organic photovoltaics ${ }^{15,16}$ and as fluorescent dyes.17 Indole derivatives are well-known for antiviral activity and current clinical studies are evaluating these types of compounds.14 Although indole-based heterocyclic compounds have promising applications in photodynamic inactivation, the photochemistry of indole-derived compounds is not fully understood and needs to be properly investigated. It is crucial to characterize these molecules to understand their photophysical properties, dynamics, and kinetics before using them in above-mentioned applications.\n\nIn this article we report the spectroscopic and the theoretical investigation of 23DSI which is shown in Figure 1. Our spectroscopic findings are further supported by our theoretical calculations. The detailed synthetic procedure of this molecule can be found in a previous publication.7 A detailed account of the photoactivated antibacterial activities of this compound will be published in a separate paper. For our current study, we explored the complete photophysical dynamics of this molecule in detail, by utilizing common spectroscopic techniques such as steady-state UV-vis spectroscopy, steady-state fluorescence spectroscopy, ultrafast time-resolved fluorescence upconversion spectroscopy, and time-correlated single-photon counting (TCSPC) spectroscopy. These studies are necessary to get a complete insight into the photophysical dynamics of this molecule. Our experiments established that this molecule displays excellent multiphoton absorption properties that are valuable in fluorescence microscopy,18 3-D optical storage,19 optical power limiting, ${ }^{20-22}$ photodynamic therapy (PDT), ${ }^{23,24}$ and photodynamic inactivation (PDI). ${ }^{25-27}$ Among all these applications, we are currently interested in exploring the potential of this molecule to be used in PDI. In PDI, the photosensitizer absorbs light and generates reactive oxygen species (ROS) by initiating phototoxic reactions. ${ }^{26}$ During these reactions either the charge (type I) or the energy (type II) is transferred to a substrate or to the molecular oxygen to generate ROS.28 In PDT, the ground-state $\\left(\\mathrm{S}_{0}\\right)$ photosensitizer populates the short-lived singlet excited state $\\left(\\mathrm{S}_{1}\\right)$ by absorbing light of an appropriate wavelength. The photosensitizer can return to the $\\mathrm{S}_{0}$ by emitting the absorbed light as fluorescence or undergo nonradiative internal conversion. However, the populated $\\mathrm{S}_{1}$ state can populate the long-lived triplet excited state ( $\\mathrm{T}_{1}$ ) via the intersystem crossing (ISC).\n\n24,29-31 The photodynamic reactions arise at the photosensitizer's $T_{1}$ state where chemicaly reactive species can further be generated. As reported in the literature, this occurs via two distinct processes. The first process (type I) involves an electron or hydrogen tranfer between the $\\mathrm{T}_{1}$ photosensitizer and the other molecules, whereas the second (type II) produces a highly reactive singlet oxygen via exchange of the electron spin of $T_{1}$ state photosensitizer and the tripletstate oxygen molecule. ${ }^{24,29-31}$ We initially believed that the underlying PDI mechanism of this indole derivative belongs to the second type in which the generation of singlet oxygen is dominant. In spite of the potent PDI-like signature of our biological assay outcomes, our thorough spectroscopic experiments for singlet oxygen production of this photosensitizer ultimately did not detect any singlet oxygen emission. In this research article, we are therefore focusing on the spectroscopic and theoritical characterization of this fascinating indole derivative 23DSI.\n\n\\section{EXPERIMENTAL SECTION}\n\\section{Spectroscopic Studies}\nThe spectroscopic studies were carried out with a $1 \\mathrm{mM}$ solution of 23DSI in dimethyl sulfoxide (DMSO) for the solution phase studies and $1 \\mathrm{mg}$ of compound was used for the solid phase analysis. For solid phase analysis, a thin film of the sample was prepared using a polymer matrix. The detailed procedure for the thin film preparation is as follows: $5.0 \\mathrm{~g}$ of poly(vinyl butyral-co-vinyl alcohol-co-vinyl acetate) polymer was dissolved by stirring the polymer sample in $15.0 \\mathrm{~mL}$ of dichloromethane in a beaker inside a glovebox. When the mixture became homogeneous, $1 \\mathrm{mg}$ of solid 23DSI was added and stirred further until it dissolved completely. The polymer/sample mixture was poured into a watch glass with a diameter of $75 \\mathrm{~mm}$. The watch glass diameter is important because it produces a thin film with $3 \\mathrm{~mm}$ thickness. The mixture was allowed to dry under a $\\mathrm{N}_{2}$ atmosphere overnight, and the thin film was separated from glass by adding water. The absorption spectra were taken using the Carry $60 \\mathrm{UV}$-vis spectrophotometer, and the fluorescence measurements were taken using the SHIMADZU RF-5301PC spectrofluorometer. The time-resolved fluorescence upconversion studies for the 23DSI molecule were performed utilizing the NEWPORT time-resolved fluorescence spectrometer (TRFLS). The detailed description of the TRFLS can be found in another research paper we published.32 Briefly, the TRFLS is a hybrid instrument capable of masuring fluorescence upconversion and timecorrelated single- photon counting (TCSPC). The fundamental output beam from the oscillator (Spectra Physics Mai Tai HP) is split into two. One portion is sent to generate a second or third harmonic used as our excitation beam (Spectra Physics/GWU UHG), and the residual served as the gate for upconversion. The gate beam is passed to a computer-controlled translation stage (Newport ILS250CC) while it makes four passes up and down the stage that result in a maximum delay time of $3.3 \\mathrm{~ns}$. The gate beam is focused by an antireflection coated lens (New-port AR.16) onto the upconversion crystal (BBO, type I). The fluorescence beam enters the TRFLS enclosure separately and is focused onto the sample. The fluorescence and the gate beams cross at a small angle in the upconversion crystal. The resulting upconverted beam is filtered and focused onto a computer-controlled monochromator. The upconverted light is detected and resolved as a particular wavelength by a PMT. The single photons are counted by a time-correlated single-photon counting board (Becker \\& Hackle) and displayed in the TRFLS software or recorded in a file during data acquisition. The time-resolved fluorescence upconversion experiments were carried out as follows: $1.0 \\mathrm{~mL}$ of $1 \\mathrm{mM}$ 23DSI solution was placed into a rotating cell (50 rpm). The gate beam was set to $800 \\mathrm{~nm}$ and a 400 nm excitation beam was generated using SHG. All samples were excited at an excitation power of $35 \\mathrm{~mW}$. The upconverted signal was generated by mixing the fluorescence and the fundamental frequencies in the nonlinear crystal.\n\nFor all samples, upconversion spectra were generated for parallel polarizations of excitation by doing at least five scans for the first $50 \\mathrm{ps}$. All the scans for a given wavelength were added, averaged, and normalized. The decay fit was done by deconvoluting the decay with the instrumental response function (IRF) and fitting into the first order decay equation, shown in the eq 1 . The $A_{1}$ is the amplitude associated with decay and $\\tau_{1}$ is the time constant.\n\n\\[\ny=A_{1} \\exp \\left(\\frac{-x}{\\tau_{1}}\\right)+y_{0}\n\\]\n\nThe fluorescence lifetime $\\left(\\tau_{\\mathrm{FL}}\\right)$ of the 23DSI sample was measured using Horiba Fluorolog TCSPC instrumentation. The sample was excited using a $360 \\mathrm{~nm}$ nano LED diode and emitted fluorescence was collected at $512 \\mathrm{~nm}$. The lifetime was calculated by fitting into a single exponential decay function mentioned above in the eq 1 .\n\n\\section{Computational Studies}\nThe theoretical investigation was performed to study the optical properties of this distyrylindole molecule utilizing the Gaussian 09 computational package ${ }^{33-35}$ and the Vienna Ab initio Simulation Package (VASP). ${ }^{36-38}$ Gauss View 05 molecular building package was used to build the molecule. The ground-state geometry optimization using Gaussian 09 was done using the post Hartree-Fock ab initio method, MØller-Plesset perturbation theory (MP2) with the 6-31G(d,p) diffused basis set. The calculations were performed in the solvent phase using DMSO as a solvent. For solvent phase calculations in Gaussian 09, the polarizable continuum model (PCM) with self-consistent reaction field (SCRF) method was employed.39 The optimized 23DSI molecule is shown in Figure S1 and the generated frontier molecular orbitals for the HOMO and LUMO for ground-state optimized geometry is shown in Figure S2 in the Supporting Information. Further, the excited-state geometry optimization was performed using the configuration interaction singles (CIS) method and the emission was calculated by using the energy difference of vertical excitation. This is shown in the eq 2.\n\n\\[\n\\Delta E_{\\text {emission }}=E(R)_{\\mathrm{GS}}-E(R)_{\\mathrm{ES}}\n\\]\n\nIn eq $2, E(R)_{\\mathrm{gs}}$ is the energy of ground-state optimized geometry, $E(R)$ Es is the energy of the excited-state optimized geometry, and $\\Delta \\mathrm{E}_{\\text {emission }}$ is the calculated emission energy from vertical excitation of this 23DSI molecule. The VASP calculations were performed to study the optical properties of this molecule. The energy cutoff of $400 \\mathrm{eV}$ was used. The periodic boundary conditions (PBC) were applied by creating a $20 \\AA \\times \\mathrm{X} 20.1 \\AA \\times 19.9 \\AA$ supercell. We selected these dimensions to approximately match the experimental concentrations of the molecule. The Perdew-Burk-Ernzerhof (PBE) form of the generalized gradient approximation (GGA) was used to describe the exchange and the correlation interactions. ${ }^{40}$ The van der Waals interactions were accounted for by Grimme (DFT-D2) functionals. ${ }^{41,42}$ The optical spectrum was calculated using the relaxed geometry of this molecule by using the hybrid Heyd-Scuseria-Ernzerhof (HSE06) functionals. ${ }^{43-45}$\n\n\\section{RESULTS AND DISCUSSION}\nThe steady-state absorption and emission spectra of 23DSI in the solution phase and in the solid phase are shown in Figure 2. Both absorption spectra show three distinct absorption bands. The solution phase study shows the absorption maxima at 235, 335, and $400 \\mathrm{~nm}$ whereas the solid phase study shows 260, 335, and $400 \\mathrm{~nm}$. The shift of the $235 \\mathrm{~nm}$ peak to $260 \\mathrm{~nm}$ in the solid phase may be due to the matrix effects and the scattering in the thin film. These three absorption bands may be due to the excellent $\\pi$-conjugation of this molecule, which provides three distinct excited states. Excitations at each and all of these absorption wavelengths yielded the same fluorescence emission at around $512 \\mathrm{~nm}$ for distyrylindole in the solution phase (DMSO) and in the solid phase (thin film).\n\nAccording to the absorption spectra in Figure 2, the distyrylindole molecule can direct excitation in three possible excitation wavelengths, 235, 335, and $400 \\mathrm{~nm}$. Excitation of those excitation wavelengths, as well as the second- and the third-order wavelengths of the direct excitation wavelengths, surprisingly showed two- and three-photon absorptions in both the solution and the solid phase studies. We believe that the strong multiphoton absorption of this molecule emerges from the optimal electron donor-acceptor ability of this molecule enabled by the increased $\\pi$-molecular orbital overlap of the chlorine-substituted styryl group in the indole ring. The two-photon absorption spectra for the sample in the solid phase and in the solution phase are shown in Figures 3 and 4, respectively. Further, the threephoton absorption spectra for the solid phase and the solution phase are shown in Figures 5 and 6 , respectively.\n\nAccording to Figures 3-6, this new indole derivative 23DSI shows excellent multiphoton absorption property for two- and three-photon absorptions. This information is further supported by our theoretical calculations. These calculations, shown in Figure S2 in the Supporting Information, demonstrate that the electron densities are centered not only on the indole group in the HOMO level but also around the two double bonds in the distyryl part of the molecule at the LUMO level. To gain further insight into the electronic effects, we computed Mulliken charges of individual atoms of both the ground state and excited state of the distyrylindole molecule. We also calculated the quantitative charge difference of the ground state and excited state.46 The results are summarized in Table S1 in the Supporting Information. The charge difference results (Table S1) clearly indicate that the indole group loses a total $0.0337$ charge to the distyryl group (which gains a similar amount of charge), a clear indication of charge transfer from the indole group to the distyryl group during the excitation process. The above information implies that electrons can easily transfer from the indole group to the styryl group. The chlorine-substituted distyryl group further provides greater electron delocalization via an increase in $\\pi$-orbital overlap between rings and thereby enables the excellent $\\pi$-conjugation within the molecule. The theoretical results indicate the presence of a polarizable $\\pi$-conjugated system which is responsible for the multiphoton absorption of this 23DSI indole derivative. Moreover, this distyrylindole molecule can be excited in the NIR region and still yield fluorescence around $512 \\mathrm{~nm}$. These types of light upconverting compounds are ideal for PDT and biological imaging. ${ }^{47-50}$ Molecules having NIR absorption are particularly useful for PDT and imaging studies because NIR penetrates well through human cells and tissues while causing a little damage or photobleaching. 47,49,51-53 Because 23DSI absorbs NIR light and exhibits the multiphoton absorption property, this unique molecule offers rich applications for biological imaging and photodynamic inactivation.\n\nThis promise led us to investigate the potential applications of 23DSI for PDI, and our extensive biological outcomes will be reported in a separate article. As mentioned before, we were particularly interested in defining the nature of the photosensitizer activity of this molecule toward singlet oxygen production. Thus, an experiment was carried out and showed a slight decrease of FL intensity in the prescence of oxygen. For this experiment we selected four solvents in which 23DSI shows good solubility. The selected solvents were DMSO, ethanol, dichloromethane (DCM), and toluene. Solvents were selected on the basis of the polarity of the solvents as well as their capability of dissolving/absorbing oxygen. Both nitrogen- and oxygen-saturated samples were employed, and FL emission was measured by exciting the samples at $400 \\mathrm{~nm}$. The FL emissions of four solvents in the prescence of nitrogen and oxygen are shown in Figure S3 in the Supporting Information. Figure S3 clearly shows that the FL intensity of 23DSI decreases in the oxygen-saturated environment as compared to the case in the nitrogen-saturated environment. Though the observed change is very small, such a change can indeed be due to energy transfer to molecular oxygen and production of singlet oxygen. Thus, to confirm our hypothesis of singlet oxygen production, a singlet oxygen emission experiment was carried out using the control singlet oxygen producers rose bengal and tris(2,2'-bipyridine)-ruthenium(II) hexafluorophosphate, $\\left[\\mathrm{Ru}(\\mathrm{bpy})_{3}\\right]\\left[\\mathrm{PF}_{6}\\right]_{2}$. The 23DSI did not show any singlet oxygencharacteristic emission at all. We believe that the short fluorescence lifetime, strong fluorescence emission, and the strong multiphoton absorption may prevent or even interfere with the detection of the singlet oxygen emission of this molecule. Alternatively for all its photosensitizing activities, 23DSI may simply not generate any singlet oxygen. An additional comprehensive discussion regarding this singlet oxygen emission study will be reported in a separate article.\n\nFurther, the ultrafast time-resolved fluorescence upconversion spectroscopy was performed to study the photophysical dynamics and any energy transfer processes of this compound. For that, $50 \\mu \\mathrm{M}$ solution of the sample in the above selected solvents were used. The obtained fluorescence decay graphs are shown in Figure 7, and the calculated decay parameters are listed in Table 1. As shown in Figure 7, distyrylindole shows a single exponential decay that can be fitted into a single exponential decay function after deconvultion with the instrumental response function (IRF). This suggests that the emission from the excited singlet $\\left(\\mathrm{S}_{1}\\right)$ state to the ground state $\\left(\\mathrm{S}_{0}\\right)$ follows a first order decay. The TRFL studies did not imply the precence of any energy transfer processes and also showed a single exponential decay. Further, these results support the notion that no energy transfer processes are occurring and that 23DSI does not possess any singlet oxygen-producing photosensitizing activity. Given these observations, and the observations from those multiphoton absorption studies, we believe that all these higher excitations relax to $\\mathrm{S}_{1}$ state and then further relax to $\\mathrm{S}_{0}$ by emitting green light as fluorescence with emission maxima of $512 \\mathrm{~nm}$.\n\nAs shown in Table 1, 23DSI shows a very fast decay with an average time constant of $\\sim 34$ ps. 23DSI in DMSO shows the lowest time constant, and 23DSI in toluene shows the highest reliable time. As we can see in the Figure 7, this may be due to the high scattering and the high noise level in the fluorescence deacy graph when ethanol is the solvent. Nonetheless, all solvents show time constants in the range 30-40 ps. The fluorescence lifetime was further calculated using the TCSPC spectroscopy using excitation at $360 \\mathrm{~nm}$ and detection of the emitted photon at the $512 \\mathrm{~nm}$. These calculated lifetimes are presented in Table 2.\n\nAs reported in Table 2, distyrylindole shows $\\sim 1$ ns lifetime, demonstrating a fast decay from $\\mathrm{S}_{1}$ to $\\mathrm{S}_{0}$. Therefore, lifetime data also support our conclusion that 23DSI is not an effective photosensitizer in terms of singlet oxygen production.\n\nWe also calculated the optical spectrum using hybrid functionals. The calculated optical spectrum is identical to that of the experimentally observed UV-vis spectrum shown in Figure 8. Both theoretical and experimental results (Figure 8) confirm the three possible exitations of 23DSI at 235, 335, and $400 \\mathrm{~nm}$. These three possible excitations further confirm the experimentally observed multiphoton absorption of the 23DSI molecule, as shown in Figures 3-6. We also calculated the energy difference between the ground-state singlet geometry and the excited-state singlet geometry to estimate the vertical excitation energy. The energy difference was found to be $242.35 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$. This vertical excitation energy of $242.35 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$ is equvalent to the emission wavelength of $493.93 \\mathrm{~nm}$ and agrees with the experimental maximum emission wavelength of $512 \\mathrm{~nm}$. As shown in Figure 2, it is important to note that we observed the same emission for all three different excitations. This may be due to the depopulation of electrons from the higher excited states to the singlet excited state in the first step via internal conversion and then final relaxation back to the ground state from the excited singlet state by emission of fluorescence at $512 \\mathrm{~nm}$. According to our excited-state calculations, the energy of the first excited singlet state $\\left(\\mathrm{S}_{1}\\right)$ of the 23DSI molecule is $287.91 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$, whereas the calculated energy for first excited triplet state $\\left(\\mathrm{T}_{1}\\right.$ ) is $232.45 \\mathrm{~kJ} \\mathrm{~mol}^{-1}$. According to these calculations, the depopulation of the $\\mathrm{S}_{1}$ state of 23DSI to the ground state by fluorescence emission may be the process that is prominent over that of the population of the $\\mathrm{T}_{1}$ state via intersystem crossing (ISC). The energy difference between the $T_{1}$ state of distyrylindole and the $S_{1}$ state of singlet oxygen $(\\sim 95 \\mathrm{~kJ}$ $\\mathrm{mol}^{-1}$ ) is $\\sim 137 \\mathrm{~kJ} \\mathrm{~mol}^{-1} .30$ Although the energy barrier may favor the transfer energy from the $T_{1}$ state of distyrylindole to the $S_{1}$ state of molecular oxygen to produce reactive singlet oxygen species, the very fast decay of the $\\mathrm{S}_{1}$ state of the 23DSI molecule is not favorable to populate the $T_{1}$ state of 23DSI. This low ISC quantum efficiency of 23DSI may lead to the observed lack of singlet oxygen production upon photoactivation of 23DSI.\n\n\\section{CONCLUSION}\nWe have successfully characterized 2,3-distyrylindole by various spectroscopic techniques as well as theoretical calculations. The steady-state spectroscopic studies have demonstrated that the distyrylindole molecule has a multiphoton absorbing property that displays the twoand the three-photon absorption capacity in the solid and in the liquid phases. TRFL upconversion spectroscopic studies show that this molecule possesses fast decay dynamics and a short single exponential decay lifetime. The TCSPC spectroscopic studies show that this molecule has an average lifetime of $1 \\mathrm{~ns}$. Experimental studies show a slight decrease of PL intensities when exposed to the oxygen environment. However, our singlet oxygen emission experiments clearly show that singlet oygen is not produced upon photoexcitation of this molecule. Moreover, TRFL studies confirm an absence of the energy transfer process that would result in a decrease in the intensity in an oxygen-saturated environment. The DFT calculations show that multiphoton absorption of this molecule is possible due to the delocalized electron densities and overlap of $\\pi$-molecular orbitals. The excited-state calculations using CIS show the possibility of excitation of this molecule for several singlet and triplet excited states. Both theoretical and experimental optical spectra clearly indicate that emission occurs near $512 \\mathrm{~nm}$. The excited-state energy calculations suggest that the depopulation of the $S_{1}$ state via fluorescence emission is more efficient than the population of the $\\mathrm{T}_{1}$ state of the molecule via ISC. Because of that, there is a very low probability of energy transfer processes from the $T_{1}$ state of the photosensitizer to the $S_{1}$ state of molecular oxygen. Hence there is no effective production of singlet oxygen species as confirmed by our singlet oxygen emission experiments. Nonetheless, for the multiphoton absorption at the NIR range, this molecule has a great potential to be used in biological imaging and PDI applications.\n\n\\section{Supplementary Material}\nRefer to Web version on PubMed Central for supplementary material.\n\n\\section{ACKNOWLEDGMENTS}\nThe authors thank the NSF for funding support through NM-EPSCOR solar energy nexus (\\#IIA-1301346) and the National Institute of General Medical Sciences (Grant P20GM103451). A NMT start up grant also contributed to establishing the \"ultrafast laser spectroscopy lab\". S.R. and L.V.F. acknowledge their NMT Presidential Research Support. The authors thank Dr. Sally Pias for allowing us to use her computer cluster for some of our calculations and Dr. Rodolfo Tello-Aburto for helping us to carry out freeze-pump-thaw experiments. We thank Prof. Michael D. Heagy and Prof. Martin L. Kirk for letting us use their instruments for fluorescence lifetime measurements and NIR emission detection, respectively. Finally, we thank the writing center at the Department of Communication, Liberal Arts, Social Sciences, at NMT for helping us on language correctiuons of this manuscript.\n\n\\section{REFERENCES}\n(1). Ghose AK; Viswanadhan VN; Wendoloski JJ A Knowledge-Based Approach in Designing Combinatorial or Medicinal Chemistry Libraries for Drug Discovery. 1. A Qualitative and Quantitative Characterization of Known Drug Databases. J. Comb. Chem 1999, 1, $55-68$. [PubMed: 10746014]\n\n(2). Padwa A; Pearson WH The Chemistry of Heterocyclic Compounds, Synthetic Applications of 1,3Dipolar Cycloaddition Chemistry Toward Heterocycles and Natural Products; John Wiley \\& Sons, 2003; Vol. 59.\n\n(3). Paquette LA Principles of Modern Heterocyclic Chemistry; Benjamin, 1968.\n\n(4). Wong HN; Hou XL; Yeung KS; Huang H Modern Heterocyclic Chemistry; Wiley-VCH Verlag GmbH \\& Co KGaA, 2011; pp 533-592.\n\n(5). Sundberg R The Chemistry of Indoles; Academic Press Inc: New York, 1970.\n\n(6). Newkome GR; Paudler WW Contemporary Heterocyclic Chemistry: Syntheses, Reactions and Applications; Wiley-Interscience:, 1982.\n\n(7). Daly S; Hayden K; Malik I; Porch N; Tang H; Rogelj S; Frolova LV; Lepthien K; Kornienko A; Magedov IV Unprecedented C-2 Arylation of Indole with Diazonium Salts: Syntheses of 2,3Disubstituted Indoles and Their Antimicrobial Activity. Bioorg. Med. Chem. Lett 2011, 21, 4720–4723. [PubMed: 21752646]\n\n(8). Folkes LK; Wardman P Enhancing the Efficacy of Photodynamic Cancer Therapy by Radicals from Plant Auxin (Indole-3-Acetic Acid). Cancer Res. 2003, 63, 776-779. [PubMed: 12591725]\n\n(9). Guo L; Chan MS; Xu D; Tam DY; Bolze F; Lo PK; Wong MS Indole-Based Cyanine as a Nuclear RNA-Selective Two-Photon Fluorescent Probe for Live Cell Imaging. ACS Chem. Biol 2015, 10, 1171-1175. [PubMed: 25689264]\n\n(10). Kaushik N; Kaushik N; Attri P; Kumar N; Kim C; Verma A; Choi E Biomedical Importance of Indoles. Molecules 2013, 18, 6620. [PubMed: 23743888]\n\n(11). Kochanowska-Karamyan AJ; Hamann MT Marine Indole Alkaloids: Potential New Drug Leads for the Control ofDepression and Anxiety. Chem. Rev 2010, 110, 4489-4497. [PubMed: 20380420]\n\n(12). Kuo CC; Hsieh HP; Pan WY; Chen CP; Liou JP; Lee SJ; Chang YL; Chen LT; Chen C-T; Chang JY A Novel Synthetic Indole Compound with Antimitotic Activity in Human Cancer Cells, Exerts Effective Antitumoral Activity. Cancer Res. 2004, 64, 4621–4628. [PubMed: 15231674]\n\n(13). Lancianesi S; Palmieri A; Petrini M Synthetic Approaches to 3-(2-Nitroalkyl) Indoles and Their Use to Access Tryptamines and Related Bioactive Compounds. Chem. Rev 2014, 114, 71087149. [PubMed: 24905229]\n\n(14). Zhang M-Z; Chen Q; Yang G-F A Review On Recent Developments of Indole-Containing Antiviral Agents. Eur. J. Med. Chem 2015, 89, 421-441. [PubMed: 25462257]\n\n(15). de Miguel G; Marchena M; Ziółek M; Pandey SS; Hayase S; Douhal A Femto- to Millisecond Photophysical Characterization of Indole-Based Squaraines Adsorbed on TiO2 Nanoparticle Thin Films. J. Phys. Chem. C 2012, 116, 12137-12148.\n\n(16). Kato S.-i.; Furuya T; Kobayashi A; Nitani M; Ie Y; Aso Y; Yoshihara T; Tobita S; Nakamura Y $\\pi$-Extended Thiadiazoles Fused with Thienopyrrole or Indole Moieties: Synthesis, Structures, and Properties. J. Org. Chem 2012, 77, 7595-7606. [PubMed: 22873490]\n\n(17). Beverina L; Crippa M; Salice P; Ruffo R; Ferrante C; Fortunati I; Signorini R; Mari CM; Bozio R; Facchetti A; et al. Indolic Squaraines as Two-Photon Absorbing Dyes in the Visible Region: X-ray Structure, Electrochemical, and Nonlinear Optical Characterization. Chem. Mater 2008, 20, 3242-3244.\n\n(18). Denk W; Strickler JH; Webb WW Two-Photon Laser Scanning Fluorescence Microscopy. Science 1990, 248, 73-76. [PubMed: 2321027] (19). Day D; Gu M; Smallridge A Use of Two-Photon Excitation for Erasable-Rewritable ThreeDimensional Bit Optical Data Storage in a Photorefractive Polymer. Opt. Lett 1999, 24 (14), 948-950. [PubMed: 18073905]\n\n(20). He GS; Gvishi R; Prasad PN; Reinhardt BA Two-photon Absorption Based Optical Limiting and Stabilization in Organic Molecule-Doped Solid Materials. Opt. Commun 1995, 117, 133-136.\n\n(21). He GS; Tan L-S; Zheng Q; Prasad PN Multiphoton Absorbing Materials: Molecular Designs, Characterizations, and Applications. Chem. Rev 2008, 108, 1245-1330. [PubMed: 18361528]\n\n(22). Wang SX; Zhang LD; Su H; Zhang ZP; Li GH; Meng GW; Zhang J; Wang YW; Fan JC; Gao T Two-Photon Absorption and Optical Limiting in Poly(styrene maleic anhydride)/TiO2 Nanocomposites. Phys. Lett. A 2001, 281, 59-63.\n\n(23). Sternberg ED; Dolphin D; Brückner C Porphyrin-Based Photosensitizers for Use in Photodynamic Therapy. Tetrahedron 1998, 54, 4151-4202.\n\n(24). Sharman WM; Allen CM; van Lier JE Photo-dynamicTherapeutics: Basic Principles and Clinical Applications. Drug Discovery Today 1999, 4, 507–517. [PubMed: 10529768]\n\n(25). Moan J; Pettersen EO; Christensen T The Mechanism of Photodynamic Inactivation of Human Cells in vitro in the Presence of Haematoporphyrin. Br. J. Cancer 1979, 39, 398-407. [PubMed: 220998]\n\n(26). Maisch T; Baier J; Franz B; Maier M; Landthaler M; Szeimies R-M; Bäumler W The Role of Singlet Oxygen and Oxygen Concentration in Photodynamic Inactivation of Bacteria. Proc. Natl. Acad. Sci. U. S. A 2007, 104, 7223-7228. [PubMed: 17431036]\n\n(27). Lim ME; Lee Y.-l.; Zhang Y; Chu JJH Photodynamic Inactivation of Viruses Using Upconversion Nanoparticles. Biomaterials 2012, 33, 1912-1920. [PubMed: 22153019]\n\n(28). Foote CS Definition of Type I and TypeE II Photosensitized Oxidation. Photochem. Photobiol 1991, 54, 659-659. [PubMed: 1798741]\n\n(29). Nyman ES; Hynninen PH Research Advances in the Use of Tetrapyrrolic Photosensitizers for Photodynamic Therapy. J. Photochem. Photobiol., B 2004, 73, 1–28. [PubMed: 14732247]\n\n(30). DeRosa MC; Crutchley RJ Photosensitized Singlet Oxygen and Its Applications. Coord. Chem. Rev 2002, 233-234, 351-371.\n\n(31). Mocanu MN; Yan F Ultrasound-Assisted Interaction Between Chlorin-e6 and Human Serum Albumin: pH Dependence, Singlet Oxygen Production, and Formulation Effect. Spectrochim. Acta, Part A 2018, 190,208-214.\n\n(32). Rajapaksha RD; Ranasinghe MI The Shell Thickness and Surface Passivation Dependence of Fluorescence Decay Kinetics in CdSe/ZnS Core-Shell and CdSe Core Colloidal Quantum Dots. J. Lumin 2017, 192, 860-866.\n\n(33). Frisch M; Trucks G; Schlegel HB; Scuseria G; Robb M; Cheeseman J; Scalmani G; Barone V; Mennucci B; Petersson G Gaussian 09, Revision A.02; Gaussian Inc.: Wallingford, CT, 2009.\n\n(34). Barone V; Bloino J; Biczysko M Vibrationally-Resolved Electronic Spectra in GAUSSIAN 09, Revision A.02; Gaussian Inc.: Wallingford, CT, 2009.\n\n(35). Baboul AG; Curtiss LA; Redfern PC; Raghavachari K Gaussian-3 Theory Using Density Functional Geometries and Zero-Point Energies. J. Chem. Phys 1999, 110, 7650-7657.\n\n(36). Sheppard D; Xiao P; Chemelewski W; Johnson DD; Henkelman G A Generalized Solid-State Nudged Elastic Band Method. J. Chem. Phys 2012, 136, 074103. [PubMed: 22360232]\n\n(37). Giannozzi P; Baroni S; Bonini N; Calandra M; Car R; Cavazzoni C; Ceresoli D; Chiarotti GL; Cococcioni M; Dabo I A Modular and Open-Source Software Project for Quantum Simulations of Materials. J. Phys.: Condens. Matter 2009, 21, 395502. [PubMed: 21832390]\n\n(38). Hafner J Materials Simulations Using VASP-A Quantum Perspective to Materials Science. Comput. Phys. Commun 2007, 177, 6-13.\n\n(39). Tapia O; Goscinski O Self-Consistent Reaction Field Theory of Solvent Effects. Mol. Phys 1975, 29, 1653-1661.\n\n(40). Perdew JP; Burke K; Ernzerhof M Generalized Gradient Approximation Made Simple. Phys. Rev. Lett 1996, 77, 3865-3868. [PubMed: 10062328]\n\n(41). Grimme S Semiempirical GGA-Type Density Functional Constructed with a Long-Range Dispersion Correction. J. Comput. Chem 2006, 27, 1787–1799. [PubMed: 16955487] (42). Grimme S; Antony J; Ehrlich S; Krieg H A Consistent and Accurate Ab initio Parametrization of Density Functional Dispersion Correction (DFT-D) for the 94 Elements H-Pu. J. Chem. Phys 2010, 132, 154104. [PubMed: 20423165]\n\n(43). Ramzan M; Li Y; Chimata R; Ahuja R Electronic, Mechanical and Optical Properties of $\\mathrm{Y}_{2} \\mathrm{O}_{3}$ with Hybrid Density Functional (HSE06). Comput. Mater. Sci 2013, 71, 19-24.\n\n(44). Choudhury P; Ravavarapu L; Dekle R; Chowdhury S Modulating Electronic and Optical Properties of Monolayer $\\mathrm{MoS}_{2}$ Using Nonbonded Phthalocyanine Molecules. J. Phys. Chem. C 2017, 121, 2959-2967.\n\n(45). Feng J; Xiao B Crystal Structures, Optical Properties, and Effective Mass Tensors of CH3NH3PbX3 (X = I and Br) Phases Predicted from HSE06. J. Phys. Chem. Lett 2014, 5, 12781282. [PubMed: 26274484]\n\n(46). Jacquemin D; Bahers TL; Adamo C; Ciofini I What is the \"Best\" Atomic Charge Model to Describe Through-space Charge-transfer Excitations? Phys. Chem. Chem. Phys 2012, 14 (16), 5383-5388. [PubMed: 22426115]\n\n(47). Hilderbrand SA; Weissleder R Near-Infrared Fluorescence: Application to in vivo Molecular Imaging. Curr. Opin. Chem. Biol 2010, 14,71–79. [PubMed: 19879798]\n\n(48). Idris NM; Gnanasammandhan MK; Zhang J; Ho PC; Mahendran R; Zhang Y In vivo photodynamic Therapy Using Upconversion Nanoparticles as Remote-Controlled Nanotransducers. Nat. Med 2012, 18, 1580–1585. [PubMed: 22983397]\n\n(49). Weissleder R A Clearer Vision for in vivo Imaging. Nat. Biotechnol 2001, 19, 316-316. [PubMed: 11283581]\n\n(50). Wang M; Mi C-C; Wang W-X; Liu C-H; Wu Y-F; Xu ZR; Mao C-B; Xu S-K Immunolabeling and NIR-Excited Fluorescent Imaging of HeLa Cells by Using NaYF4:Yb,Er Upconversion Nanoparticles. ACS Nano 2009, 3, 1580–1586. [PubMed: 19476317]\n\n(51). Starkey JR; Rebane AK; Drobizhev MA; Meng F; Gong A; Elliott A; McInnerney K; Spangler CW New Two-Photon Activated Photodynamic Therapy Sensitizers Induce Xenograft Tumor Regressions After Near-IR Laser Treatment Through the Body of the Host Mouse. Clin. Cancer Res 2008, 14, 6564-6573. [PubMed: 18927297]\n\n(52). Belfield KD; Schafer KJ; Liu Y; Liu J; Ren X; Stryland EWV Multiphoton-Absorbing Organic Materials for Microfabrication, Emerging Optical Applications and Non-Destructive ThreeDimensional Imaging. J. Phys. Org. Chem 2000, 13, 837-849.\n\n(53). Belfield KD; Bondar MV; Hernandez FE; Masunov AE; Mikhailov IA; Morales AR; Przhonska OV; Yao S Two-Photon Absorption Properties of New Fluorene-Based Singlet Oxygen Photosensitizers. J. Phys. Chem. C 2009, 113, 4706-4711.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_ddfb75e0fb765dc682bbg-12_202_936_652_1679}\n\\end{center}\n\nFigure 1.\n\n2,3-Distyrylindole molecule. Absorption\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_ddfb75e0fb765dc682bbg-13_340_1026_445_1133}\n\\end{center}\n\n\\section{Emission}\na) DMSO\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_ddfb75e0fb765dc682bbg-13_312_718_1226_1885}\n\\end{center}\n\nb) Thinfilm\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_ddfb75e0fb765dc682bbg-13_781_1176_1232_1869}\n\\end{center}\n\nFigure 2.\n\nAbsorption and emission spectra of the 23DSI molecule. The left figure shows the absorption spectra of the 23DSI molecule in the solid phase, as a thin film (black graph) and the solution phase, in DMSO (red graph). On the right, (a) shows the emission of 23DSI in DMSO for the three distinct excitations and (b) shows the emission of 23DSI in a thin film for the three distinct excitations.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_ddfb75e0fb765dc682bbg-14_205_1099_434_1892}\n\nFigure 3.\n\nTwo-photon absorption of 23DSI in the solid phase (thin film). The black graphs show the direct excitation wavelengths $235,300,335,360$, and $400 \\mathrm{~nm}$, respectively. The red graphs show the two-photon absorption of 23DSI at the wavelengths $470,600,670,720$, and 800 nm, respectively.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_ddfb75e0fb765dc682bbg-15_202_954_428_1894}\n\nFigure 4.\n\nTwo-photon absorption of 23DSI in the solution phase (DMSO). The black graphs show the direct excitation wavelengths $235,300,335,360$, and $400 \\mathrm{~nm}$, respectively. The red graphs show the two-photon absorption of 23DSI at the wavelengths $470,600,670,720$, and 800 nm, respectively.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_ddfb75e0fb765dc682bbg-16_199_798_424_1907}\n\\end{center}\n\nFigure 5.\n\nThree-photon absorption of 23DSI in the solid phase (thin film). The black graphs show the direct excitation wavelengths 235,300 , and $230 \\mathrm{~nm}$, respectively. The red graphs show the three-photon absorption of 23DSI at wavelengths 705,900 , and $690 \\mathrm{~nm}$, respectively.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_ddfb75e0fb765dc682bbg-17_201_851_427_1905}\n\nFigure 6.\n\nThree-photon absorption of 23DSI in the solution phase (DMSO). The black graphs show the direct excitation wavelengths 235, 300, and $230 \\mathrm{~nm}$, respectively. The red graphs show the three-photon absorption of 23DSI at wavelengths 705,900 , and $690 \\mathrm{~nm}$, respectively.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_ddfb75e0fb765dc682bbg-18_202_1174_449_1885}\n\nFigure 7.\n\nFluorescence-decay graphs generated from the time-resolved fluorescence upconversion studies for different solvents. All samples were excited at $400 \\mathrm{~nm}$, and the emitted fluorescence was detected at $512 \\mathrm{~nm}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_ddfb75e0fb765dc682bbg-19_198_821_608_1712}\n\\end{center}\n\nFigure 8.\n\nTheoretically calculated UV-vis spectrum using DFT calculation (black graph) and experimentally observed UV-vis spectrum for 23DSI molecule (red graph). Table 1\n\nCalculated Decay Parameter for 23DSI in Different Solvents Using Ultrafast, Time-Resolved Fluorescence Upconversion Spectroscopy\n\n\\begin{center}\n\\begin{tabular}{lcccc}\nsolvent & $\\boldsymbol{\\tau}_{\\mathbf{1}} / \\mathbf{p s}$ & \\% error & $\\boldsymbol{A}$ & \\% error \\\\\nDCM & $34.86$ & $1.64$ & $0.80$ & $0.78$ \\\\\nDMSO & $28.09$ & $3.42$ & $0.42$ & $1.37$ \\\\\nethanol & $38.79$ & $9.83$ & $0.37$ & $4.95$ \\\\\ntoluene & $35.68$ & $3.88$ & $0.72$ & $1.91$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\n\\section{Table 2}\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_ddfb75e0fb765dc682bbg-21_340_701_58_771}\n\\end{center}\n\n$a_{\\text {The average fluorescence lifetime was calculated using three trials. }}$\n\n\n\\end{document}", "record_id": "2023_09_22_ddfb75e0fb765dc682bbg"}