{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{PAPER }\n\n\\author{}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nView Article Online\n\nView Journal | View Issue\n\nD) Check for updates\n\nCite this: RSC Adv., 2018, 8, 7196 Received 14th November 2017 Accepted 2nd February 2018 DOI: $10.1039 / \\mathrm{c} 7 \\mathrm{ra} 12400 \\mathrm{~g}$\n\n\\href{http://rsc.li/rsc-advances}{rsc.li/rsc-advances}\n\n\\section{Density functional theory calculations for evaluation of phosphorene as a potential anode material for magnesium batteries}\n\\begin{abstract}\nXinpeng Han, ${ }^{a}$ Cheng Liu, ${ }^{\\text {J Jie Sun, }}$ (D) ${ }^{* a}$ Austin D. Sendek (DD $^{b}$ and Wensheng Yang (D) ${ }^{c}$ We have systematically investigated black phosphorus and its derivative - a novel 2D nanomaterial, phosphorene - as an anode material for magnesium-ion batteries. We first performed Density Functional Theory (DFT) simulations to calculate the Mg adsorption energy, specific capacity, and diffusion barriers on monolayer phosphorene. Using these results, we evaluated the main trends in binding energy and voltage as a function of $\\mathrm{Mg}$ concentration. Our studies revealed the following findings: (1) Mg bonds strongly with the phosphorus atoms and exists in the cationic state; (2) $\\mathrm{Mg}$ diffusion on phosphorene is fast and anisotropic with an energy barrier of only $0.09 \\mathrm{eV}$ along the zigzag direction; (3) the theoretical specific capacity is $865 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1}$ with an average voltage of $0.833 \\mathrm{~V}$ (vs. $\\left.\\mathrm{Mg} / \\mathrm{Mg}^{2+}\\right)$, ideal for use as an anode. Given these results, we conclude that phosphorene is a very promising anode material for Mg-ion batteries. We then expand our simulations to the case of bulk black phosphorus, where we again find favorable binding energies. We also find that bulk black phosphorous must overcome a structural stress of $0.062 \\mathrm{eV}$ per atom due to a volumetric expansion of $33 \\%$ during magnesiation. We found that the decrease in particle size is good to increase its specific capacity.\n\\end{abstract}\n\n\\section{Introduction}\nAs one of the most successful means for electrochemical energy storage, Li-ion batteries (LIBs) power most of the electronic devices used in today's information-rich mobile society. ${ }^{1}$ Recently, they have also been tested with success in hybrid, plug-in hybrid, and electric vehicles (EVs). ${ }^{2}$ Moreover, as the integration of intermittent renewable energy on the electrical grid increases, the demand for large-scale, inexpensive and efficient energy storage systems is increasing accordingly. ${ }^{3,4}$ However, LIBs are not ideal due to the high cost and scarcity of lithium. Sodium-ion batteries (SIBs) ${ }^{5-7}$ and magnesium-ion batteries (MIBs) ${ }^{8-11}$ have been proposed as potential alternatives for LIBs because of their low cost, large resources and availability, as shown in Table 1 . While SIBs are attractive and are in fact already used for large-scale energy storage, ${ }^{12,13}$ their low gravimetric and volumetric capacities mean they are not suitable for the applications which require high energy density, such as electric vehicles and portable electronics. On the other hand, MIBs are currently emerging as a viable next generation rechargeable battery technology, ${ }^{9,10}$ with several companies in fact already working towards commercialization. MIBs have\n\n${ }^{a}$ School of Chemical Engineering and Technology, Tianjin University, Tianjin, China. E-mail: \\href{mailto:jies@tju.edu.cn}{jies@tju.edu.cn}\n\n${ }^{b}$ Department of Applied Physics, Stanford University, Stanford, California 94305, USA 'State Key Laboratory of Chemical Resource Engineering, Beijing University of Chemical Technology, Beijing 100029, P. R. China several advantages over LIBs and SIBs: (i) the divalent nature of the $\\mathrm{Mg}$ ion results in the storage of up to two electrons per $\\mathrm{Mg}$ atom versus only one for $\\mathrm{Li}$ and $\\mathrm{Na}$, leading to a higher theoretical volumetric capacity, and a specific capacity comparable to those of $\\mathrm{Li}$; (ii) the atomic radius of $\\mathrm{Mg}$ is smaller than $\\mathrm{Na}$ and is comparable to Li, resulting in fast diffusion; and (iii) $\\mathrm{Mg}$ can be electrodeposited rather smoothly without the dendrite formation problem ${ }^{14-19}$ that plagues metallic $\\mathrm{Li}$ and $\\mathrm{Na}$.\n\nMost work on $\\mathrm{Mg}$ batteries focuses on the development of cathode materials while simply using metallic Mg anodes. ${ }^{10,20,21}$ Despite this work, the cycling abilities of MIBs remain poor. Much of this poor performance is rooted in problems with the reaction of $\\mathrm{Mg}$ metal with electrolyte species, resulting in the formation of a passivating surface film ${ }^{22,23}$ that inhibits any electrochemical reaction. In addition, electrode-electrolyte interactions also limit the achievable battery voltage. ${ }^{23}$ Thus, identifying superior anode materials to $\\mathrm{Mg}$ metal is a critical step in improving MIBs. Even though phosphorus has been\n\nTable 1 Comparison of metallic $\\mathrm{Li}, \\mathrm{Na}$, and $\\mathrm{Mg}$ anode for $\\mathrm{Li}-, \\mathrm{Na}$-, and Mg-ion batteries, respectively\n\n\\begin{center}\n\\begin{tabular}{llll}\n\\hline\n & $\\mathrm{Li}$ & $\\mathrm{Na}$ & $\\mathrm{Mg}$ \\\\\n\\hline\nIonic radius (pm) & 128 & 166 & 141 \\\\\nVolumetric capacity $(\\mathrm{mA} \\mathrm{h} \\mathrm{cm}$ &  &  &  \\\\\nGravimetric capacity $\\left(\\mathrm{mA} \\mathrm{h} \\mathrm{g}^{-1}\\right)$ & 2062 & 1130 & 3832 \\\\\nPrice $\\left(\\mathrm{S} \\mathrm{kg}^{-1}\\right)$ & 3830 & 1165 & 2205 \\\\\nAmount in Earth's crust & 1500 & 300 & 35 \\\\\n & $0.0065 \\%$ & $2.36 \\%$ & $2.33 \\%$ \\\\\n\\end{tabular}\n\\end{center}\n\nreported as attractive anode for $\\operatorname{LIBs}^{24-28}$ and SIBs, ${ }^{29-34}$ the experimental and theoretical research has not focused on phosphorus as an anode for Mg-ion batteries.\n\nWhen allowed to proceed to completion, phosphorus undergoes a conversion reaction with $\\mathrm{Mg}$ to form $\\mathrm{Mg}_{3} \\mathrm{P}_{2}$, delivering a high theoretical specific capacity of $2596 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1}$ with a large volumetric expansion of $277 \\%$. As reported in experiments in LIBs and SIBs,,$^{25,29}$ the breaking of $\\mathrm{P}-\\mathrm{P}$ bonds upon reaction with $\\mathrm{Mg}$ is very exothermic and difficult to reverse, resulting in a huge irreversible capacity. To solve these problems, we can use layer-structure black phosphorus as anode and stop the reaction after intercalation, which does not require the breaking of $\\mathrm{P}-\\mathrm{P}$ bonds and has minimal volumetric expansion, thus allowing longer life cycling.\n\nHere, we report the theoretical studies of two new candidates for MIB anodes: bulk black phosphorus and monolayer phosphorene, ${ }^{35,36}$ which is exfoliated from black phosphorus. Although many important literatures about theoretical investigations of MIBs have been reported recently, ${ }^{37-39}$ the theoretical research has not focused on black phosphorus as an anode for MIBs. We use DFT to analyze $\\mathrm{Mg}$ adsorption and diffusion in both of these materials. We find that bulk black phosphorus and monolayer phosphorene can store $\\mathrm{Mg}$ atoms via insertion and adsorption with a binding energy of $-1.366 \\mathrm{eV}$ and $-0.716 \\mathrm{eV}$, respectively, which is larger than the binding energy of the $\\mathrm{Mg}_{2}$ dimer $(-0.134 \\mathrm{eV})$, indicating a strong interaction between $\\mathrm{Mg}$ ion with phosphorene. The bulk and monolayer materials deliver a theoretical specific capacity of 433 and $865 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1}$, respectively. Moreover, we find $\\mathrm{Mg}$ diffusion in phosphorene shows a strong directional anisotropy because of the puckered structure, with fast $\\mathrm{Mg}$ diffusion along the zigzag direction. Furthermore, our results reveal that the $\\mathrm{Mg}$ storage in phosphorene and black phosphorus has good stability. Due to these factors, and the large active surface area and space available for $\\mathrm{Mg}$ diffusion, we conclude phosphorene is a promising candidate for $\\mathrm{Mg}$-ion battery anodes.\n\n\\section{Computational details}\nFirst-principles calculations are performed within the densityfunctional theory (DFT) framework, as implemented in CASTEP package ${ }^{\\mathbf{4 0 , 4 1}}$ (in the Materials Studio version 5.5). The electron exchange and correlation interaction is described by the generalized gradient approximation (GGA) method using Perdew-Burke-Ernzerhof (PBE) pseudopotentials. The following valence electron configurations are used: $P\\left(3 s^{2} 3 p^{3}\\right)$ and $\\operatorname{Mg}\\left(2 \\mathrm{~s}^{2} 2 \\mathrm{p}^{6} 3 \\mathrm{~s}^{2}\\right)$. After checking for convergence, $500 \\mathrm{eV}$ was chosen as the cut-off energy of the plane-wave basis for the Kohn-Sham states. All atomic positions and lattice vectors were fully optimized using a conjugate gradient algorithm to obtain the unstrained configuration. Atomic relaxation was performed until the change of total energy was less than $0.01 \\mathrm{meV}$ and all the forces on each atom were smaller than $0.01 \\mathrm{eV}^{\\circ}{ }^{-1}$. For calculating the charge density difference between $\\mathrm{Mg}$ atoms and phosphorene layer, the orbital calculations were performed in the $\\mathrm{DMol}^{3}$ package. For the $\\mathrm{Mg}$ adsorption and diffusion studies, we use a supercell containing $3 \\times 3$ primitive cells of phosphorene, resulting in a $\\mathrm{Mg} / \\mathrm{P}$ ratio of $0.028$. We introduce a vacuum space of $25 \\AA$ between adjacent layers to avoid mirror interactions, and use $5 \\times 5 \\times 1$ (monolayer phosphorene) and $5 \\times 5 \\times 5$ (bulk black phosphorus) $K$-point meshes for the structure relaxation, denser meshes of $15 \\times 15 \\times 1$ (monolayer) and $15 \\times$ $15 \\times 15$ (bulk) for energy calculation, respectively. For $\\mathrm{Mg}$ diffusion in phosphorene, we perform minimum energy path profiling using PBE method as implemented in the CASTEP transition state tools. The structural convergence criteria were similar to that used in the above-mentioned structure optimization.\n\n\\section{Results and discussion}\n\\subsection{Adsorption of $\\mathrm{Mg}$ on phosphorene surface}\nAs illustrated in Fig. 1a, the $\\mathrm{Mg}$ atoms are first loaded to phosphorene surface then diffuse along armchair or zigzag direction on the surface. As a consequence, we examine the surface loading (adsorption process) of an $\\mathrm{Mg}$ atom on the phosphorene surface. We explore the phosphorene surface for $\\mathrm{Mg}$ binding by placing one $\\mathrm{Mg}$ atom at different sites above phosphorene before performing the structural relaxation and find that the most stable binding site is above the groove between two P \"slifftops\" as shown in Fig. 1b and c. Specifically, the distance between $\\mathrm{Mg}$ and $\\mathrm{P} 1$ atom is $2.731 \\AA$, and the distances between $\\mathrm{Mg}$ and the $\\mathrm{P} 2 / \\mathrm{P} 3$ atoms is $2.881 \\AA$ A. As an electrode material, it is essential for monolayer phosphorene to attract $\\mathrm{Mg}$ with a relatively strong binding energy. The binding energy $\\left(E_{\\mathrm{b}}\\right)$ can be evaluated with the following expression:\n\n\\[\nE_{\\mathrm{b}}=E_{\\text {total }}-E_{\\mathrm{P}}-E_{\\mathrm{Mg}}\n\\]\n\nwhere $E_{\\text {total }}, E_{\\mathrm{P}}$, and $E_{\\mathrm{Mg}}$ are the total energy of Mg-adsorbed phosphorene, the energy of the phosphorene layer alone, and the energy of a $\\mathrm{Mg}$ atom, respectively. According to this definition, a more negative value of $E_{\\mathrm{b}}$ indicates a more energetically favorable (exothermic) reaction. From our calculation, the value of $E_{\\mathrm{b}}$ for $\\mathrm{Mg}$ on monolayer phosphorene is $-0.716 \\mathrm{eV}$, which is much larger than the $\\mathrm{Mg}_{2}$ dimer binding energy $(-0.134 \\mathrm{eV})$ and the binding energy of $\\mathrm{Mg}$ on graphene $(-0.005$ $\\mathrm{eV}$ ). This indicates that incident $\\mathrm{Mg}$ would be adsorbed on the surface of phosphorene, and that clustering of $\\mathrm{Mg}$ atoms is unfavorable at low $\\mathrm{Mg}$ concentration. Furthermore, the main crystal planes of $\\mathrm{Mg}$ metal are ( $\\left(\\begin{array}{lll}1 & 0 & 1\\end{array}\\right),\\left(\\begin{array}{lll}0 & 0 & 2\\end{array}\\right),\\left(\\begin{array}{lll}1 & 0 & 0\\end{array}\\right)$ and ( $\\left.\\begin{array}{lll}1 & 0 & 2\\end{array}\\right)$, respectively. The binding energies of $\\mathrm{Mg}$ atom loading on the above-mentioned specific $\\mathrm{Mg}$ surfaces are $-0.92 \\mathrm{eV},-1.07 \\mathrm{eV}$, $-0.99 \\mathrm{eV}$ and $-0.39 \\mathrm{eV}$, respectively. Although the first three values are little higher than that of $\\mathrm{Mg}$ atom loading on phosphorene $(-0.716 \\mathrm{eV})$, the reactive potential of $\\mathrm{Mg}$ atom loading on $\\mathrm{Mg}$ metal is $0 \\mathrm{~V}$ (vs. $\\mathrm{Mg} / \\mathrm{Mg}^{2+}$ ) much lower than on phosphorene (average voltage, $0.833 \\mathrm{~V}$ vs. $\\mathrm{Mg} / \\mathrm{Mg}^{2+}$ ). Thus, the former reaction cannot compete with the latter at the potential above $0 \\mathrm{~V} v \\mathrm{~s} . \\mathrm{Mg} / \\mathrm{Mg}^{2+}$.\n\nThe spatial distribution of the charge difference between $\\mathrm{Mg}$ and phosphorene is illustrated in Fig. 1d. The large charge\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_4eeeb89f0a6f52e58610g-3_168_540_316_1736}\n\nb\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_4eeeb89f0a6f52e58610g-3_543_874_353_810}\n\\end{center}\n\nc\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_4eeeb89f0a6f52e58610g-3_874_1178_356_808}\n\\end{center}\n\ne\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_4eeeb89f0a6f52e58610g-3_546_1252_887_1751}\n\\end{center}\n\nFig. 1 (a) Schematic of Mg surface loading (adsorption process), diffusion along armchair and zigzag directions on phosphorene surface; (b) top view and (c) side view of the most stable binding site of Mg loading onto the monolayer phosphorene surface; (d) charge density difference between Mg and phosphorene, in which blue color means charge deficient and yellow color means charge sufficient; (e) total potential energy of $\\mathrm{Mg}$ on phosphorene surface with respect to $\\mathrm{Mg}-$ phosphorene distance.\n\ndeficiency at $\\mathrm{Mg}$ and charge excess around nearby $\\mathrm{P}$ atoms indicates strong electron transfer from Mg to phosphorene. According to Bader charge population analysis, Mg possesses a unit positive charge with its $3 \\mathrm{~s}^{2}$ electron being completely transferred to phosphorene and thus exists in the cationic state. To test the distance dependence of the binding energy, we move the $\\mathrm{Mg}$ atom vertically away from the phosphorene surface, with the separation distance to the phosphorene surface running from $2.07 \\AA$ (the most stable binding site) to about $1.1 \\mathrm{~nm}$. The change of binding energy with respect to the Mg-phosphorene surface distance is shown in Fig. 1e. For distances larger than 7 $\\AA$ A, the energy is effectively zero. This means that beyond $7 \\AA$ A the total energy of the complex system does not change because $\\mathrm{Mg}$ has no interactions with phosphorene; it essentially can be treated as an isolated $\\mathrm{Mg}$ atom and an isolated phosphorene sheet. Within about 5 Aे, however, the energy decreases dramatically, indicating a strong attractive interaction between $\\mathrm{Mg}$ and $\\mathrm{P}$ atoms. It is clear that there is no energy barrier in the Mg loading process.\n\n\\subsection{Diffusion of $\\mathrm{Mg}$ on phosphorene surface}\nThe charging and circuit rate performance of the MIBs is mainly determined by the Mg mobility on the electrode material. Hence it is desirable to quantify the diffusion of $\\mathrm{Mg}$ on the surface of phosphorene. Distinct from the uniform $\\mathrm{sp}^{2}$ hybridization of $\\mathrm{C}$ atoms in graphene, phosphorene has a puckered structure with its atoms arranged in a honeycomb lattice when seen from the top view as shown in Fig. 1a-c. This structural anisotropy plays an important role in the migration of $\\mathrm{Mg}$ atoms on its surface. Considering the symmetry of the primitive cell, there are only two unique (high-symmetry) paths connecting equilibrium sites. As illustrated in Fig. 2, these two diffusive pathways fall along the zigzag direction (Fig. 2a-c) and the armchair direction (Fig. 2d-f). Along the zigzag direction, the migration barrier is only $0.09 \\mathrm{eV}$ (in Fig. 2c), while for the armchair direction the barrier is $0.56 \\mathrm{eV}$ (in Fig. 2f). Thus Mg diffusion in phosphorene shows a strong directional anisotropy due to this puckered structure.\n\nCompared with the previous study of Sn anode for Mg ion insertion, ${ }^{42}$ the Mg diffusion barrier in $\\alpha$-Sn and $\\beta$-Sn are $0.395 \\mathrm{eV}$ and $0.435 \\mathrm{eV}$, respectively, which are much larger than the $\\mathrm{Mg}$ diffusion barrier in phosphorene along the zigzag direction $(0.09 \\mathrm{eV})$. Another example, the Li diffusion barrier are $0.25 \\mathrm{eV}$ in $\\operatorname{MoS}_{2}$ and $0.327 \\mathrm{eV}$ in graphene ${ }^{43}$ respectively, which are much higher than $0.09 \\mathrm{eV}$ in phosphorene.\n\nThe temperature-dependent molecular transition rate can be evaluated by the Arrhenius equation from which the diffusion constant $(D)$ of $\\mathrm{Mg}$ follows:\n\n\\[\nD \\sim \\exp \\left(\\frac{-E_{\\mathrm{a}}}{k_{\\mathrm{B}} T}\\right)\n\\]\n\na\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_4eeeb89f0a6f52e58610g-4_218_1516_330_975}\\\\\nenergy profiles of Mg diffusion along armchair direction on phosphorene surface. d\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_4eeeb89f0a6f52e58610g-4_186_1527_1038_1733}\n\\end{center}\n\nFig. 2 (a) and (b) Schematic and (c) energy profiles of Mg diffusion along zigzag direction on phosphorene surface; (d) and (e) schematic and (f)\n\nwhere $E_{\\mathrm{a}}$ and $k_{\\mathrm{B}}$ are the activation energy (diffusion barrier) and Boltzmann's constant, and $T$ is the environmental temperature. According to eqn (2), the diffusion mobility of $\\mathrm{Mg}$ along the zigzag direction of the phosphorene surface is $8.9 \\times 10^{7}$ faster than that along the armchair direction at room temperature, indicating that without an external electrical field, the large energy barrier $(0.56 \\mathrm{eV})$ along the armchair direction essentially prevents $\\mathrm{Mg}$ diffusion along this direction at room temperature. The binding position corresponding to the saddle point along the armchair path is labeled as a red arrow at the top of a $\\mathrm{P}$ atom as shown in Fig. 2e and f. Hence the high diffusion barrier is due to the phosphorus \"slifftop\" between two adjacent grooves that makes the Mg diffusion extremely difficult. The remarkably quasi-one-dimensional $\\mathrm{Mg}$ diffusion observed is similar to $\\mathrm{Li}$ diffusion in monolayer phosphorene, ${ }^{44}$ which is clearly absent in other $2 \\mathrm{D}$ materials (e.g. $\\mathrm{MoS}_{2}$ and graphene). Amazingly, our calculations show that at room temperature the $\\mathrm{Mg}$ diffusion mobility in phosphorene (zigzag direction) is estimated to be $7.6 \\times 10^{6}, 2.1 \\times 10^{10}$, and $2.6 \\times 10^{15}$ times faster than that in $\\mathrm{Sn}, \\mathrm{Ge}$ and $\\mathrm{Si}^{45}$ respectively. Therefore, an extremely high-rate capability is expected for phosphorene-based Mg-ion batteries.\n\n\\subsection{Theoretical capacity and voltage profile of magnesiation}\n in phosphoreneIn this work, we consider a series of higher configurations with stoichiometry of $\\operatorname{Mg}_{x} \\mathrm{P}(x=0.0278,0.0556,0.0833,0.125,0.25$ and 0.5), as shown in Fig. 3a, with one $\\mathrm{Mg}$ atom binded on one side of a $3 \\times 3$ supercell, two $\\mathrm{Mg}$ atoms binded on one side of 3 $\\times 3$ supercell, three $\\mathrm{Mg}$ atoms binded on one side of $3 \\times 3$ supercell, two $\\mathrm{Mg}$ atoms binded on one side of $2 \\times 2$ supercell, one $\\mathrm{Mg}$ atom binded on one side of $1 \\times 1$ supercell, and two $\\mathrm{Mg}$ atoms binded on the two sides of $1 \\times 1$ supercell, respectively. We only consider $\\mathrm{Mg}$ bonded on both sides of the phosphorene for the case of high $\\mathrm{Mg}$ concentration, as we anticipate local electronic distortions fall of rapidly with distance and thus are unlikely to affect the total energy at low concentration - hence it should not matter what side of the layer the $\\mathrm{Mg}$ is on. In the case of $\\mathrm{MgP}_{2}$, the reason why we set up the $\\mathrm{Mg}$ atoms on both sides a\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_4eeeb89f0a6f52e58610g-5_172_1170_336_1816}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_4eeeb89f0a6f52e58610g-5_1203_1832_1028_1837}\n\\end{center}\n\nFig. 3 (a) Configurations of schematics of $M_{x} P$ with $M g$ binded on one side of phosphorene $(x=0.0278-0.25)$, and two side of phosphorene $(x$ = 0.5); (b) binding energies with respect to $\\mathrm{Mg}$ concentration; (c) calculated voltage profile with respect to $\\mathrm{Mg}$ content from 0 to $0.5$.\n\nof phosphorene instead of just one side is analyzed in Fig. 4. The binding energy of $\\mathrm{MgP}_{2}$ with the $\\mathrm{Mg}$ on two sides is $-0.589 \\mathrm{eV}$ (Fig. 4c and d), slightly smaller than that of $\\mathrm{MgP}_{36}$ $(-0.716 \\mathrm{eV})$. Compare this to a binding energy of $3.60 \\mathrm{eV}$ for $\\mathrm{MgP}_{2}$ with the $\\mathrm{Mg}$ on one side (Fig. $4 \\mathrm{a}$ and $\\mathrm{b}$ ); this positive value indicates a very difficult reaction. This instability can be attributed to the pronounced electrostatic repulsive interactions between adjacent $\\mathrm{Mg}$ cations, which have a separation distance of $1.781 \\AA$, much shorter than that in Mg metal (3.197 A). Thus, forcing higher concentrations of $\\mathrm{Mg}$ insertion into phosphorene (i.e. more than one $\\mathrm{Mg}$ atom on one side of the primitive cell, $x>0.5$ ) will cause $\\mathrm{P}-\\mathrm{P}$ bond breaking, disrupting the layered structure. As reported in the experiments in LIBs and SIBs, ${ }^{25,29}$ the breaking of P-P bonds cannot be rebuilt and hence the lithiation/delithiation or sodiation/desodiation process becomes irreversible. As a consequence, we limit our consideration to $\\mathrm{Mg}$ concentrations for which $x \\leq 0.5$, equal to a capacity of $865 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1}$. The absolute value of the binding energy in $\\operatorname{Mg}_{x} \\mathrm{P}$ decreases with increasing $x$. For all the concentrations (Fig. 3b), Mg has a binding energy lower than $-0.59 \\mathrm{eV}$. Notably, the slight discontinuity (from $x=0.0833$ to $0.125)$ indicates that the complex becomes less stable due to the pronounced electrostatic repulsive interactions between\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_4eeeb89f0a6f52e58610g-6_185_859_379_995}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_4eeeb89f0a6f52e58610g-6_173_683_1098_1672}\n\\end{center}\n\nd\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_4eeeb89f0a6f52e58610g-6_731_897_1117_1675}\n\\end{center}\n\nFig. 4 (a) Top and (b) side views of the schematics of $\\mathrm{MgP}_{2}$ with $\\mathrm{Mg}$ binded on one side; (c) top and (d) side views of the schematics of MgP with Mg binded on two side.\n\nadjacent $\\mathrm{Mg}$ cations. This phenomenon also exists for lithiation $^{44}$ and sodiation $^{46}$ in phosphorene.\n\nOpen-circuit-voltage data is widely used for characterizing the performance of batteries. In theory, the open circuit voltage curve can be obtained by calculating the average voltage over parts of the $\\mathrm{Mg}$ composition domain. The average voltage of $\\mathrm{Mg}_{x} \\mathrm{P}$ in the range of $x_{1} \\leq x \\leq x_{2}$ is given as\n\n\\[\nV=\\frac{-E\\left(\\mathrm{Mg}_{x_{2}} \\mathrm{P}\\right)-E\\left(\\mathrm{Mg}_{x_{1}} \\mathrm{P}\\right)-\\left(x_{2}-x_{1}\\right) E(\\mathrm{Mg})}{2\\left(x_{2}-x_{1}\\right) e}\n\\]\n\nwhere $E\\left(\\operatorname{Mg}_{x_{1}} \\mathrm{P}\\right), E\\left(\\mathrm{Mg}_{x_{2}} \\mathrm{P}\\right)$, and $E(\\mathrm{Mg})$ are the energy of $\\mathrm{Mg}_{x_{1}} \\mathrm{P}$, $\\mathrm{Mg}_{x_{2}} \\mathrm{P}$, and metallic $\\mathrm{Mg}$, respectively, and $e$ is the fundamental charge. ${ }^{40,44,45}$ By using a series of $\\mathrm{Mg} / \\mathrm{P}$ ratios ( $x$ values) for which we calculate the binding energy, the average insertion potential and the charge voltage profiles at these concentrations can be predicted; this is shown in Fig. 3c. There is a dramatic drop from $4.8 \\mathrm{~V}$ when $x<0.03$, and then the voltage profile becomes a gently sloping curve. The average voltage of the $\\mathrm{Mg}$ storage in phosphorene is estimated to be $0.833 \\mathrm{~V}\\left(\\right.$ vs. $\\left.\\mathrm{Mg} / \\mathrm{Mg}^{2+}\\right)$, suitable for the application as anode in MIBs.\n\n\\subsection{Theoretical capacity of magnesiation in black phosphorus}\nWe have also loaded $\\mathrm{Mg}$ atoms into the interlayers of bulk black phosphorus by placing one $\\mathrm{Mg}$ atom at different sites before structural optimization and found that the most stable binding site is as shown in the insert (at II state) of Fig. 5a. We note that this site is close to the equilibrium monolayer site but displaced slightly. For the case of $\\mathrm{Mg}$ insertion into the interlayers of black phosphorus, the binding energy $\\left(E_{\\mathrm{b}}\\right)$ can be evaluated as following\n\n\\[\nE_{\\mathrm{b}}=E_{\\mathrm{total}}-E_{\\mathrm{P}}-E_{\\mathrm{Mg}}\n\\]\n\nwhere $E_{\\text {total }}, E_{\\mathrm{P}}$, and $E_{\\mathrm{Mg}}$ are the total energy of $\\mathrm{Mg}$-intercalated bi-layer black phosphorus, the energy of bi-layer black phosphorus (from a black phosphorus crystal with an original interlamellar spacing of $3.07 \\AA$ ) , and the energy of a $\\mathrm{Mg}$ atom, respectively. From our calculation, the value of $E_{\\mathrm{b}}$ for $\\mathrm{Mg}$ insertion in bi-layer black phosphorus is a very energetically unfavorable value of $2.676 \\mathrm{eV}$ when the original channel size is $3.07 \\AA$.\n\nHowever, in reality the layers will expand to accommodate the $\\mathrm{Mg}$ atom. Thus we optimize the distance between the two phosphorene layers symmetrically around the $\\mathrm{Mg}$ atom, with the interlayer channel size running from 3 Å to $6 \\AA$. The change of binding energy with respect to channel size is shown in Fig. 5a. As the channel increases, the binding energy drops dramatically. The weak binding seen for an interlayer channel size $<4 \\AA$ indicates that the complex becomes less stable due to the pronounced electrostatic repulsive interactions between the positively charged $\\mathrm{Mg}$ and the negatively charged phosphorene layer. The channel size of $4.84 \\AA$ has the most stable binding, corresponding to a $33 \\%$ volumetric expansion compared to the original black phosphorus crystal. In this case, the binding energy of $\\mathrm{Mg}$ inserted in bi-layered black phosphorus is $-1.366 \\mathrm{eV}$, slightly less than double the binding energy of the monolayer. As shown in Fig. 5c, the distance from the $\\mathrm{Mg}$ atom to the surface of the top phosphorene layer $\\mathrm{P} 1$ atom is $2.724 \\AA$, and the distance to the $\\mathrm{P} 2 / \\mathrm{P} 3$ atoms is $2.780 \\AA$. The distance from $\\mathrm{Mg}$ to the surface of the lower phosphorene layer P4/P5 atoms are $3.388 \\AA$, and $\\mathrm{P} 6$ is $2.736 \\AA$. The spatial distribution of the charge difference between $\\mathrm{Mg}$ and black phosphorus is illustrated in Fig. 5d. The large charge deficiency at $\\mathrm{Mg}$ and charge excess around nearby $\\mathrm{P}$ atoms indicate that, again, $\\mathrm{Mg}$. exists in the cationic state. Additionally, we have studied the effect of $\\mathrm{Mg}$ concentration in Fig. 5b. The absolute value of the binding energy in $\\operatorname{Mg}_{x} \\mathrm{P}$ decreases with increasing $x(0<x<$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_4eeeb89f0a6f52e58610g-7_170_734_336_1734}\n\nC\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_4eeeb89f0a6f52e58610g-7_769_1203_438_958}\n\\end{center}\n\nd\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_4eeeb89f0a6f52e58610g-7_764_1208_1134_1689}\n\\end{center}\n\nFig. 5 (a) Total potential energy of Mg inserted into 2-layer phosphorene with respect to phosphorene-phosphorene distance (insert I, Mg inserted with the original channel size of $3.07 \\mathrm{~A}$; insert II, Mg inserted with the most stable channel size of $4.84$ A); (b) binding energies with respect to the Mg concentration; (c) the most stable binding site of Mg inserting onto the 2-layer black phosphorus; (d) charge density difference between $\\mathrm{Mg}$ and 2-layer black phosphorus.\n\n0.25). For most of the concentrations, $\\mathrm{Mg}$ has a binding energy lower than $-0.8 \\mathrm{eV}$. This indicates the final product of $\\mathrm{MgP}_{4}$ is stable, contributing to a theoretical capacity of $433 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1}$.\n\nIn addition, we investigate the effect of black phosphorus particle size on $\\mathrm{Mg}$ insertion. In the primitive cell, the volumetric expansion of $33 \\%$ requires the crystal overcome a structural stress of $0.062 \\mathrm{eV}$. If one $\\mathrm{Mg}$ atom can insert in a black phosphorus nanoflake, the area $(S)$ of the nanoflake was evaluated as following,\n\n\\[\nS=-\\frac{E_{\\text {bind }}}{E_{\\text {expansion }}} \\times a \\times b\n\\]\n\nwhere $E_{\\text {bind }}$ and $E_{\\text {expansion }}$ are the binding energy of $\\mathrm{Mg}$ with both of the upper and lower phosphorene layers, and the binding energy of only two phosphorene layers with a vacuum spacing of $4.84 \\AA$, respectively; $a$ and $b$ are the lattice parameters of black phosphorus. As a consequence, the optimized flake area $S$ for complete intercalation is $3.19 \\mathrm{~nm}^{2}$, corresponding to a circular flake diameter of $2 \\mathrm{~nm}$. Thus, using large sized particles will result in $\\mathrm{Mg}$ incompletely inserting into black phosphorus.\n\n\\section{Conclusions}\nTo conclude, our results demonstrate that phosphorene and bulk black phosphorus can store $\\mathrm{Mg}$ via adsorption and insertion while satisfying the crucial requirement of preserving the $\\mathrm{P}-\\mathrm{P}$ bond. Phosphorene and bulk black phosphorus deliver high theoretical capacities of $865 \\mathrm{~mA} \\mathrm{~h}^{-1}$ and $433 \\mathrm{~mA} \\mathrm{~h} \\mathrm{~g}^{-1}$, respectively, which are double of that of LIBs and SIBs (Table 2). Due to its puckered structure, the diffusion of $\\mathrm{Mg}$ on phosphorene is highly anisotropic with diffusion along the zigzag direction being highly energetically favorable, while diffusion along the armchair direction is essentially prohibited. The average voltage of the $\\mathrm{Mg}$ adsorption in phosphorene is estimated to be $0.833 \\mathrm{~V}$, suitable for the application as anode in MIBs. We also find that $\\mathrm{Mg}$ intercalation in bulk black phosphorus is accompanied by a volumetric expansion of $33 \\%$. To compensate for the stress of this volumetric expansion, decreasing the particle size can improve the Mg-storage performance.\n\nTable 2 Specific capacities and volumetric expansion of black $P$ and phosphorene anode for $\\mathrm{Li}-, \\mathrm{Na}-$, and $\\mathrm{Mg}$-ion batteries, respectively\n\n\\begin{center}\n\\begin{tabular}{lll}\n\\hline\n & Volumetric expansion & Theoretical specific capacity $\\left(\\mathrm{mA} \\mathrm{h} \\mathrm{g}^{-1}\\right)$ \\\\\n\\hline\nSmall-size BP to $\\mathbf{M g P}_{\\mathbf{4}}$ & $\\mathbf{1 2 8 \\%}$ & $\\mathbf{4 3 3}$ \\\\\nSmall-size BP to $\\mathrm{LiP}_{4}$ & $120 \\%$ & 216 \\\\\nSmall-size BP to $\\mathrm{NaP}_{4}$ & $131 \\%$ & 216 \\\\\nPhosphorene to $\\mathbf{M g P}_{2}$ & $\\mathbf{2 9 0} \\%$ & $\\mathbf{8 6 5}$ \\\\\nPhosphorene to $\\mathrm{LiP}_{2}$ & $238 \\%$ & 433 \\\\\nPhosphorene to $\\mathrm{NaP}_{2}$ & $310 \\%$ & 433 \\\\\n\\end{tabular}\n\\end{center}\n\n\\section{Conflicts of interest}\nThere are no conflicts to declare.\n\n\\section{Acknowledgements}\nWe acknowledge the support by the U.S. Department of Energy, Office of Basic Energy Sciences, Materials Sciences and Engineering Division, under Contract DE-AC02-76-SFO0515. W. Y. acknowledges support from the National Natural Science Foundation of China under 51272020 and 21236003. H. W. L. acknowledges support from the Basic Science Research Program through the National Research Foundation of Korea (NRF) funded by the Ministry of Education, Science and Technology under NRF-2012R1A6A3A03038593.\n\n\\section{Notes and references}\n1 R. V. Noorden, Nature, 2014, 507, 26-28.\n\n2 L. Lu, X. Han, J. Li, J. Hua and M. Ouyang, J. Power Sources, 2013, 226, 272-288.\n\n3 J. Tarascon, Nat. Chem., 2010, 2, 510.\n\n4 Z. Yang, J. Zhang, M. C. Kintner-Meyer, X. Lu, D. Choi, J. P. Lemmon and J. Liu, Chem. Rev., 2011, 111, 3577-3613.\n\n5 S. W. Kim, D. H. Seo, X. Ma, G. Ceder and K. Kang, Adv. Energy Mater., 2012, 2, 710-721.\n\n6 V. Palomares, P. Serras, I. Villaluenga, K. B. Hueso, J. Carretero-González and T. Rojo, Energy Environ. Sci., 2012, 5, 5884-5901.\n\n7 M. D. Slater, D. Kim, E. Lee and C. S. Johnson, Adv. Funct. Mater., 2013, 23, 947-958.\n\n8 D. Aurbach, Z. Lu, A. Schechter and Y. Gofer, Nature, 2000, $407,724$.\n\n9 D. Aurbach, Y. Gofer, Z. Lu, A. Schechter, O. Chusid, H. Gizbar, Y. Cohen, V. Ashkenazi, M. Moshkovich and R. Turgeman, J. Power Sources, 2001, 97, 28-32.\n\n10 P. Novák, R. Imhof and O. Haas, Electrochim. Acta, 1999, 45, 351-367.\n\n11 C. Pei, F. Xiong, J. Sheng, Y. Yin, S. Tan, D. Wang, C. Han, Q. An and L. Mai, ACS Appl. Mater. Interfaces, 2017, 9, 17060-17066.\n\n12 H. Pan, Y.-S. Hu and L. Chen, Energy Environ. Sci., 2013, 6, 2338-2360.\n\n13 B. Dunn, H. Kamath and J.-M. Tarascon, Science, 2011, 334, 928-935.\n\n14 W. Xu, J. Wang, F. Ding, X. Chen, E. Nasybulin, Y. Zhang and J.-G. Zhang, Energy Environ. Sci., 2014, 7, 513-537.\n\n15 G. Zheng, S. W. Lee, Z. Liang, H.-W. Lee, K. Yan, H. Yao, H. Wang, W. Li, S. Chu and Y. Cui, Nat. Nanotechnol., 2014, 9, 618-623.\n\n16 K. Yan, H.-W. Lee, T. Gao, G. Zheng, H. Yao, H. Wang, Z. Lu, Y. Zhou, Z. Liang and Z. Liu, Nano Lett., 2014, 14, 6016-6022.\n\n17 N. Sa, T. L. Kinnibrugh, H. Wang, G. Sai Gautam, K. W. Chapman, J. T. Vaughey, B. Кey, T. T. Fister, J. W. Freeland and D. L. Proffit, Chem. Mater., 2016, 28, 2962-2969.\n\n18 N. Wu, Z. Z. Yang, H. R. Yao, Y. X. Yin, L. Gu and Y. G. Guo, Angew. Chem., Int. Ed., 2015, 54, 5757-5761.\n\n19 L. Wang, K. Asheim, P. E. Vullum, A. M. Svensson and F. Vullum-Bruer, Chem. Mater., 2016, 28, 6459-6470.\n\n20 J.-S. Kim, W.-S. Chang, R.-H. Kim, D.-Y. Kim, D.-W. Han, K.-H. Lee, S.-S. Lee and S.-G. Doo, J. Power Sources, 2015, 273, 210-215.\n\n21 S. H. Lee, R. A. DiLeo, A. C. Marschilok, K. J. Takeuchi and E. S. Takeuchi, ECS Electrochem. Lett., 2014, 3, A87-A90.\n\n22 S. Su, Z. Huang, Y. NuLi, F. Tuerxun, J. Yang and J. Wang, Chem. Commun., 2015, 51, 2641-2644.\n\n23 J. Muldoon, C. B. Bucur, A. G. Oliver, T. Sugimoto, M. Matsui, H. S. Kim, G. D. Allred, J. Zajicek and Y. Kotani, Energy Environ. Sci., 2012, 5, 5941-5950.\n\n24 Z. Yu, J. Song, M. L. Gordin, R. Yi, D. Tang and D. Wang, Adv. Sci., 2015, 2, 1400020.\n\n25 J. Sun, G. Zheng, H.-W. Lee, N. Liu, H. Wang, H. Yao, W. Yang and Y. Cui, Nano Lett., 2014, 14, 4573-4580.\n\n26 C. M. Park and H. J. Sohn, Adv. Mater., 2007, 19, 2465-2468.\n\n27 W.-C. Chang, K.-W. Tseng and H.-Y. Tuan, Nano Lett., 2017, 17, 1240-1247.\n\n28 Z. Z. Luo, Y. Zhang, C. Zhang, H. T. Tan, Z. Li, A. Abutaha, X. L. Wu, Q. Xiong, K. A. Khor and K. Hippalgaonkar, Adv. Energy Mater., 2017, 7, 1601285.\n\n29 J. Song, Z. Yu, M. L. Gordin, S. Hu, R. Yi, D. Tang, T. Walter, M. Regula, D. Choi and X. Li, Nano Lett., 2014, 14, 63296335.\n\n30 Y. Kim, Y. Park, A. Choi, N. S. Choi, J. Kim, J. Lee, J. H. Ryu, S. M. Oh and K. T. Lee, Adv. Mater., 2013, 25, 3045-3049.\n\n31 W.-J. Li, S.-L. Chou, J.-Z. Wang, H.-K. Liu and S.-X. Dou, Nano Lett., 2013, 13, 5480-5484.\n\n32 W. Li, S. Hu, X. Luo, Z. Li, X. Sun, M. Li, F. Liu and Y. Yu, Adv. Mater., 2017, 29, 1605820.\n\n33 J. Sun, H.-W. Lee, M. Pasta, H. Yuan, G. Zheng, Y. Sun, Y. Li and Y. Cui, Nat. Nanotechnol., 2015, 10, 980-985.\n\n34 J. Sun, H.-W. Lee, M. Pasta, Y. Sun, W. Liu, Y. Li, H. R. Lee, N. Liu and Y. Cui, Energy Storage Mater., 2016, 4, 130-136.\n\n35 E. S. Reich, Nature, 2014, 506, 19.\n\n36 H. O. Churchill and P. Jarillo-Herrero, Nat. Nanotechnol., $2014,9,330-331$.\n\n37 L. D. Chen, J. K. Nørskov and A. C. Luntz, J. Phys. Chem. C, 2015, 119, 19660-19667.\n\n38 L. F. Wan and D. Prendergast, J. Phys. Chem. C, 2018, 122, 398-405.\n\n39 P. Canepa, S.-H. Bo, G. S. Gautam, B. Кey, W. D. Richards, T. Shi, Y. Tian, Y. Wang, J. Li and G. Ceder, Nat. Commun., $2017,8,1759$.\n\n40 C. Zhang, M. Shao, F. Ning, S. Xu, Z. Li, M. Wei, D. G. Evans and X. Duan, Nano Energy, 2015, 12, 231-239.\n\n41 S.-T. Zhang, H. Yan, M. Wei, D. G. Evans and X. Duan, J. Phys. Chem. C, 2012, 116, 3421-3431. 42 Z. Wang, Q. Su, J. Shi, H. Deng, G. Q. Yin, J. Guan, M. P. Wu, Y. L. Zhou, H. L. Lou and Y. Q. Fu, ACS Appl. Mater. Interfaces, $2014,6,6786-6789$.\n\n43 C. Zhang, M. Yu, G. Anderson, R. R. Dharmasena and G. Sumanasekera, Nanotechnology, 2017, 28, 075401. 44 W. Li, Y. Yang, G. Zhang and Y.-W. Zhang, Nano Lett., 2015, 15, 1691-1697.\n\n45 O. I. Malyi, T. L. Tan and S. Manzhos, J. Power Sources, 2013, 233, 341-345.\n\n46 K. Hembram, H. Jung, B. C. Yeo, S. J. Pai, S. Kim, K.-R. Lee and S. S. Han, J. Phys. Chem. C, 2015, 119, 15041-15046.\n\n\n\\end{document}", "record_id": "2023_09_22_4eeeb89f0a6f52e58610g"}