{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Growth Behavior and Electronic Structure of Noble Metal-Doped Germanium Clusters }\n\n\n\\author{Sofiane MAHTOUT Ma $^{*}$, Chaouki SIOUANI ${ }^{\\mathrm{a}}$ and Franck RABILLOUD ${ }^{\\mathrm{b}^{*}}$\\\\\n${ }^{a}$ Laboratoire de Physique Théorique, Faculté des Sciences Exactes, Université de Bejaia,\\\\\n06000 Bejaia, Algérie\\\\\n'buniv Lyon, Université Claude Bernard Lyon 1, CNRS, Institut Lumière Matière, F-69622,\\\\\nVilleurbanne, France\\\\\nCorresponding authors: mahtout\\_sofiane@yahoo.fr,franck.rabilloud@univ-lyon1.fr}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\n\n\n\\section{To cite this version:}\nS. Mahtout, C. Siouani, Franck Rabilloud. Growth Behavior and Electronic Structure of Noble Metal-Doped Germanium Clusters. Journal of Physical Chemistry A, 2018, 122, pp.662-677. 10.1021/acs.jpca.7b09887 . hal-02290276\n\n\\section{HAL Id: hal-02290276 \n https: / univ-lyon1.hal.science/hal-02290276}\nSubmitted on 16 Jan 2020\n\nHAL is a multi-disciplinary open access archive for the deposit and dissemination of scientific research documents, whether they are published or not. The documents may come from teaching and research institutions in France or abroad, or from public or private research centers. L'archive ouverte pluridisciplinaire HAL, est destinée au dépôt et à la diffusion de documents scientifiques de niveau recherche, publiés ou non, émanant des établissements d'enseignement et de recherche français ou étrangers, des laboratoires publics ou privés.\n\n\\section*{Growth Behavior and Electronic Structure of Noble Metal-Doped Germanium Clusters }\n\n\n\\begin{abstract}\n: Structures, energetics and electronic properties of noble metal-doped germanium $\\left(\\mathrm{MGe}_{\\mathrm{n}}\\right.$ with $\\left.\\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}, \\mathrm{Au} ; \\mathrm{n}=1-19\\right)$ clusters are systematically investigated by using the density-functional theory (DFT) approach. The endohedral structures in which the metal atom is encapsulated inside a germanium cage appear at $\\mathrm{n}=10$ when the dopant is $\\mathrm{Cu}$, and $\\mathrm{n}=12$ for $\\mathrm{M}=\\mathrm{Ag}$ and $\\mathrm{Au}$. While Cu doping enhances the stability of the corresponding germanium frame, the binding energies of $A_{g G e}$ and $A u G e_{n}$ are always lower than those of pure germanium clusters. Our results highlight the great stability of the $\\mathrm{CuGe}_{10}$ cluster in a $D_{4 d}$ structure, and to a lesser extent that of AgGe 15 and AuGe 15 which exhibits a hollow cage-like geometry. The sphere-type geometries obtained for $\\mathrm{n}=10-15$ present a peculiar electronic structure in which the valence electrons of the noble metal and Ge atoms are delocalized and exhibit a shell structure associated with the quasi-spherical geometry. It is found that the coinage metal is able to give both s- and d-type electrons to be reorganized together with the valence electrons of Ge atoms through a pooling of electrons. The cluster size dependence of the stability, the frontier orbital energy gap, the vertical ionization potentials, and electron affinities are given.\n\\end{abstract}\n\n\\section{Introduction}\nGermanium is an important element in the field of semiconductor materials and the microelectronic industry. Pure and metal-doped germanium clusters have been intensively studied during the last decades in both theoretical and experimental fields, as this class of materials which exhibits size and shape dependent properties provides a rich source to discover new nanostructures with new physical and chemical properties. Their structure and specific properties have been the object of intense researches in order to better understand the stability and growth patterns and to explore the possibility of applications in nanotechnology. Doping $\\mathrm{Ge}_{\\mathrm{n}}$ clusters with a metal atom is expected to significantly change the chemical and physical properties and modify the framework. For example, the dopant atom may stabilize germanium cage structures and induced a large electronic gap.\n\nA large number of investigations on a transition metal encapsulating $\\mathrm{Ge}_{\\mathrm{n}}$ clusters have been carried out ${ }^{1-33}$. Zhao and Wang ${ }^{1}$ have systematically investigated geometries, stabilities, and electronic properties of $\\operatorname{FeGe}_{n}(n=9-16)$ clusters. They found that the doping with one Fe atom contributes to enhance the stability of the germanium clusters and the electron charges always transfer from $\\mathrm{Fe}$ atom to the neighboring Ge atoms. In the case of $\\mathrm{MnGe}_{\\mathrm{n}}(\\mathrm{n}=2-16)$ clusters, the same authors ${ }^{2}$ shown that the dopant Mn atom contributes to increase the stabilities of the germanium clusters while the magnetic moment that mainly originates from the unpaired electrons of the $3 \\mathrm{~d}$ state was not quenched when $\\mathrm{Mn}$ is embedded in $\\mathrm{Ge}_{\\mathrm{n}}$ clusters. Lu and Nagase ${ }^{3}$ have showed that $\\operatorname{MGe}_{12}(\\mathrm{M}=\\mathrm{W}$, Os, Zn) exhibits a higher chemical stability among $\\mathrm{MGe}_{\\mathrm{n}}$ with $\\mathrm{M}=\\mathrm{Hf}, \\mathrm{W}$, Os, $\\mathrm{Ni}$, and $\\mathrm{Zn}$, while $\\mathrm{Ni}$ doped $\\mathrm{Ge}_{\\mathrm{n}}$ clusters have higher stability as compared to $\\mathrm{Mn}$ and Co doped $\\mathrm{Ge}_{\\mathrm{n}}$ clusters ${ }^{4}$. For Chromium doped germanium clusters, there are conflicting results. A study has concluded than the $\\mathrm{Cr}$ atom tends to be located at exohedral positions and do not show tendency to fall into the center of Ge outer frame $^{5}$, while a more recent investigation suggested than $\\mathrm{CrGe}_{10}$ and $\\mathrm{CrGe}_{14}$ might be endohedral structures resulting in a quenching of the Cr magnetic moment ${ }^{6}$. However large magnetic moments are found in small $\\operatorname{CrGe}_{n}{ }^{0,+}(n=1-5)$ clusters ${ }^{7}$. Deng et al. ${ }^{8}$ have investigated the structural, electronic and magnetic properties of $\\operatorname{VGe}_{n}^{-/ 0}(n=3-12)$ clusters. They found an electron transfer from Ge atoms to the $\\mathrm{V}$ atom and related the minimization of the magnetic moments to the structural pattern. In the case of $\\mathrm{TM} @ \\mathrm{Ge}_{\\mathrm{n}}(\\mathrm{TM}=\\mathrm{Ti}, \\mathrm{Zr}$ and $\\mathrm{Hf}$; $\\mathrm{n}=1-20$ ) clusters, Kumar et al..$^{9}$ found that the clusters having 20 valence electrons turn out to be relatively more stable in both the neutral and the anionic series. Also, the TM atom is adsorbed endohedrally in the pure germanium cage for $n>9$ and the spin on the TM atom is quenched for clusters with $n>7$. Similarly, Bandyopadhyay and $\\operatorname{Sen}^{10}$ have showed that $\\mathrm{NiGe}_{\\mathrm{n}}$ clusters having 20 valence electrons are relatively more stable in both neutral and cationic species. Wang and $\\operatorname{Han}^{11-14}$ investigated $\\mathrm{CuGe}_{\\mathrm{n}}(\\mathrm{n}=2-13), \\mathrm{NiGe}_{\\mathrm{n}}(\\mathrm{n}=1-13), \\mathrm{WGe}_{\\mathrm{n}}$ $(n=1-17)$ and $M_{0} \\mathrm{Ge}_{n}(n=9-15)$ clusters. They show that the doping with $\\mathrm{Cu}$ atom decreases the binding energies while the doping with $\\mathrm{Ni}$ or $\\mathrm{W}$ strengthens the stability of germanium clusters. Studying the properties of neutral and cationic $\\operatorname{MoGe}_{n}(n=1-20)$ clusters, Trivedi et al. ${ }^{15}$ have showed that clusters containing more than nine germanium atoms are able to absorb a Mo atom endohedrally into a germanium cage and the spin magnetic moment of the Mo atom is quenched in all Mo-doped $\\mathrm{Ge}_{\\mathrm{n}}$ clusters. The most stable structures of $\\mathrm{Mo}_{2} \\mathrm{Ge}_{\\mathrm{n}}(\\mathrm{n}=9$ 13) clusters have one Mo atom inside a $\\mathrm{Ge}_{\\mathrm{n}}$ cage and another Mo atom on the surface at smaller cluster sizes while the $\\mathrm{Mo}_{2}$ dimer is completely encapsulated into the germanium clusters when the cluster size increases to $15^{14}$. For $\\mathrm{CoGe}_{\\mathrm{n}}$ clusters, the magnetic moment is not quenched, the doping of the Co atom generally enhances the stability of the host $\\mathrm{Ge}_{\\mathrm{n}}$ clusters and the Co atom is completely falls into the center of the Ge outer frame from $n=9^{16 \\text { - }}$ ${ }^{17}$. Singh et al. ${ }^{18}$ have reported from $a b$ initio calculations that thorium encapsulation can be used to stabilize highly symmetric cages of germanium with 16 and 20 atoms. $\\mathrm{Bi}_{2} \\mathrm{Ge}_{\\mathrm{n}-2}(\\mathrm{n}=3$ 8,12 ) clusters ${ }^{19}$ have been found to be characterized by high stability and symmetry and relatively large highest occupied-lowest unoccupied molecular orbital energy gaps (HOMOLUMO gaps). $\\mathrm{ZrGe}_{\\mathrm{n}}$ clusters ${ }^{20}$ have been predicted to stabilize cage-like structures for $\\mathrm{n} \\geq 13$. Structural and electronic properties of Ruthenium doped germanium clusters have been performed using a particle swarm optimization metaheuristic coupled with density functional theory computations by Jin et $\\mathrm{al}^{21}$. They found that there is an inherent tendency of the formation of an endohedral cage of $\\mathrm{RuGe}_{n}$ clusters with increasing stability as the size increase. More recently, we found that the vanadium atom in $\\mathrm{VGe}_{\\mathrm{n}}$ can largely contribute to strengthen the stability of the framework from $n=7$, while the cage-like $\\mathrm{VGe}_{14}$ cluster with a high symmetry and a high stability exhibits a peculiar electronic structure in which the valence electrons of $\\mathrm{V}$ and $\\mathrm{Ge}$ atoms are delocalized and exhibit a shell structure associated with the quasi-spherical geometry. This cluster is proposed to be a good candidate to be used as the building blocks for developing new materials ${ }^{22}$. In experiment, the anion photoelectron spectroscopy has been performed for some germanium clusters containing transition or lanthanide-metal atom ${ }^{23}$.\n\nAlthough the doping of $\\mathrm{Ge}_{\\mathrm{n}}$ with a transition metal atom have been intensively studied, there is no systematic investigation on the doping by a noble metal atom in literature to the best of our knowledge. However some recent studies have considered small clusters in a limited size range. Li et al. ${ }^{24}$ have studied the size-selective effects of geometrical structures and electronic properties on neutral and anionic $\\operatorname{AuGe}_{n}{ }^{0 /-}(n=1-13)$ clusters. Their results indicate that the addition of an extra electron to neutral cluster may enhance its kinetic stability. Recently, the photoelectron spectroscopy of small AuGe $\\mathrm{e}^{-}$clusters revealed an electronic structure and a very high detachment energy for AuGe ${ }_{12}{ }^{-}$compatible with a highsymmetry geometry like $I_{h}$ structure $^{25}$. Bandyopadhyay ${ }^{26}$ has reported endohedral structures for $\\mathrm{CuGe}_{\\mathrm{n}}$ clusters with $\\mathrm{n}>7$, while the doping of $\\mathrm{Ge}_{9}$ and $\\mathrm{Ge}_{10}$ with several types of metal atoms including noble metals have been also considered ${ }^{27-29}$. Interestingly, the global minimum of $\\mathrm{CuGe}_{10}{ }^{+}$clusters were presented to be a magic cluster with $D_{4 d}$ symmetry and 40 valence electrons that satisfy the jellium electron shell model ${ }^{30}$. The authors also proposed a concept of doubly spherical aromatic based on a counting rule for both pi-type and sigma-type valence electrons ${ }^{28}$.\n\nHere we present a systematic investigation of the geometry, relative stabilities, and electronic properties of coinage metal germanium doped clusters $\\mathrm{MGe}_{n}(\\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}, \\mathrm{Au} ; \\mathrm{n}=1$ - 19) in the framework of the density-functional theory (DFT). We aim to highlight the modifications in the properties of $\\mathrm{Ge}_{\\mathrm{n}}$ clusters due to the doping atom, and to study the role of the nature of the dopant coinage metal atom. It is hoped that this work would be useful to understand the influence of different noble metal on the properties of germanium clusters and could provide powerful guidelines for future experimental studies. The present paper is organized as follows: In Section 2, we describe our theoretical approach. The structural and energetic properties of $\\mathrm{MGe}_{n}$ clusters ( $\\left.n=1-19\\right)$ clusters are presented sections 3 , following by a discussion about the electronic properties.\n\n\\section{Computational methodology}\nSpin polarized calculations are carried out by generalized gradient approximation (GGA) with PBE exchange-correlation functional ${ }^{34}$. Self-consistent field procedures are carried out with a convergence criterion of $10^{-4}$ a.u. on the energy and electron density. Calculations have been performed by using the method of norm-conserving Troullier-Martins nonlocal pseudo-potentials ${ }^{35}$ in the Kleinman-Bylander projectors ${ }^{36}$ as implemented in SIESTA packages ${ }^{37}$. We used a double zeta basis plus polarization orbitals (DZP) for dopant atoms species (Cu, Ag, Au) and double zeta basis (DZ) for Ge atoms. In order to avoid interaction between neighboring clusters, a large cubic cell of $40 \\AA$ edge lengths with a periodic boundary condition is taken. The k grid integration has been carried using the $\\Gamma$ point approximation. The atomic positions have been optimized by the conjugate gradients dynamics algorithm until the residual forces are smaller than $10^{-3} \\mathrm{eV} / \\AA$, and without any symmetry constraints. Further analysis of the electronic properties and molecular orbitals have been performed with the software Gaussian09 38 using PBE and the Gaussian-type basis sets cc-pvtz for Ge and LanL2DZ for coinage metal atoms.\n\nThe number of geometric isomers or local minima increases exponentially with the cluster size. For this reason, lots of putative isomers including some high and low symmetries were relaxed for each cluster size. Amongst them, some initial structures of $\\mathrm{Ge}_{\\mathrm{n}+1}$ and metaldoped $\\mathrm{Ge}_{\\mathrm{n}}$ clusters were taken from literature ${ }^{5,10-11,22,39-40}$. Also, the putative structures of $\\mathrm{MGe}_{\\mathrm{n}}$ were obtained by local relaxation after the substitution of one Ge atom by $\\mathrm{M}$ atom in several isomers of the original pure $\\mathrm{Ge}_{n+1}$ cluster. The different initial positions of the $\\mathrm{Ge}$ atom in the $\\mathrm{Ge}_{\\mathrm{n}+1}$ clusters lead to different $\\mathrm{MGe}_{\\mathrm{n}}$ isomers. But the search for the lowest isomer cannot include a global optimization procedure of the potential energy surface, and we cannot be sure that a more stable structure than those found in our calculations does not exist. In the next section, we only show the best calculated structures for each cluster size. The spin state of all clusters is found to be singlet or doublet for even and odd number of electrons respectively. In order to check the reliability of our computational method, the dimers $\\mathrm{Ge}_{2}, \\mathrm{Cu}_{2}, \\mathrm{Au}_{2}$ and $A g_{2}$ dimers were first considered. The bond lengths of $\\mathrm{Ge}_{2}, \\mathrm{Ag}_{2}, \\mathrm{Au}_{2}$ and $\\mathrm{Cu}_{2}$ were calculated to be $2.450,2.595,2.627$, and $2.280 \\AA$ respectively. These values are in good agreement with the experimental data of $2.57$ (Ref [41]) and 2.44 A (Ref [42]) for $\\mathrm{Ge}_{2}, 2.53 \\AA$ for $\\mathrm{Ag}_{2}$ (Ref [43]), $2.47 \\AA$ for $\\mathrm{Au}_{2}$ (Ref [44]), and $2.22 \\AA$ for $\\mathrm{Cu}_{2}$ (Ref [45]). The binding energy per atom, calculated to be $1.44,1.07,1.37$ and $1.13 \\mathrm{eV}$ for $\\mathrm{Ge}_{2}, \\mathrm{Ag}_{2}, \\mathrm{Au}_{2}$ and $\\mathrm{Cu}_{2}$ respectively, are also in good agreement with both theoretical and experimental data ${ }^{11,26,46-47}$.\n\n\\section{Results}\n\\section{3a Structural properties}\nThe lowest energy been structures of pure $\\mathrm{Ge}_{\\mathrm{n}}$ clusters have already reported in the literature ${ }^{22}$. Shortly, the lowest-energy isomer of the trimer $\\mathrm{Ge}_{3}$ presents a $D_{3 h}$ triangular geometry, while that of $\\mathrm{Ge}_{4}$ is a rhombus structure with $D_{2 h}$ symmetry. The triangular bipyramid framework with $D_{3 h}$ symmetry is found to be the global minimum structure of the $\\mathrm{Ge}_{5}$ pentamer. The hexamer $\\mathrm{Ge}_{6}$ has two lowest-energy isomers quasi-degenerate, the first one is a bicapped quadrilateral structure with $C_{2 v}$ symmetry and the second one shows a bicapped rectangular geometry with $D_{4 h}$ symmetry. The most stable isomer of the heptamer $\\mathrm{Ge}_{7}$ adopts a structure having $C_{2}$ point group symmetry. The ground state structure of $G_{8}$ cluster can be seen as a capped pentagonal bipyramid with $C_{s}$ symmetry. The $\\mathrm{Ge}_{9}$ cluster forms a capped cube like structure with $C_{4 v}$ symmetry. For $G_{10}$, the most stable structure is a capped irregular pentagonal prism structure with $C_{1}$ symmetry. Ge 11 is a caped pentagonal structure with $C_{2 v}$ point group symmetry. $\\mathrm{Ge}_{12}$ displays a compact and nearly spherical structure with $C_{2 v}$ symmetry. For the clusters size range between 13 and 16, a prolate geometry with $C_{1}$ point group symmetry is always favored. The lowest-energy structure of $\\mathrm{Ge}_{17}$ presents a nearly spherical shape with $C_{s}$ symmetry while a prolate-like structure with $C_{2}$ symmetry is observed in the case of $\\mathrm{Ge}_{18}$. The ground state isomer for $\\mathrm{Ge}_{19}$ has a prolate shape with $C_{2 v}$ point group symmetry, while the best structure of $\\mathrm{Ge}_{20}$ adopts a cage like structure with lower symmetry.\n\nWe now discuss optimized geometries for the three systems $\\mathrm{MGe}_{\\mathrm{n}}(\\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}, \\mathrm{Au})$ in the size range of $n=1$ to 19 . The lowest energy structures together with some low-lying isomers are presented in Figure 1, 2 and 3 for $A_{g G e}, A_{n} e_{n}$ and $C u G e_{n}$ respectively. Meanwhile, the corresponding symmetry group, binding energy per atom, HOMO-LUMO gap, vertical ionization potential, vertical electronic affinity, and average bond lengths $a_{\\text {Ge-Ge }}$ and $a_{\\text {Ge-M }}(\\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}, \\mathrm{Au})$ are summarized in Table 1,2 and 3 for $\\mathrm{AgGe}_{\\mathrm{n}}, \\mathrm{AuGe}_{\\mathrm{n}}$ and $\\mathrm{CuGe}_{\\mathrm{n}}$ respectively.\n\nBoth AgGe and AuGe dimers have a binding energy per atom of $0.813 \\mathrm{eV}$ which is $0.372 \\mathrm{eV}$ less stable than the dimer CuGe. The bond lengths are calculated to be 2.591, $2.645$ and $2.333 \\AA$ for AgGe, AuGe and CuGe respectively. For CuGe, our present data are very near to those predicted by Bandyopadhyay ${ }^{26}$.\n\nFor small clusters, the lowest-energy isomers are similar whatever the nature of the doping atom $\\mathrm{M}=\\mathrm{Ag}$, Au, or $\\mathrm{Cu}$. A triangular structure with $\\mathrm{C}_{2 \\mathrm{v}}$ symmetry is found for $\\mathrm{MGe}_{2}$ and a planar rhombus with $\\mathrm{C}_{2 \\mathrm{v}}$ symmetry is found for $\\mathrm{MGe}_{3}$. For $\\mathrm{CuGe}_{\\mathrm{n}}(\\mathrm{n}=1-3)$ clusters our results are similar to those reported by Bandyopadhyay ${ }^{26}$. The best isomer of $\\mathrm{MGe}_{4}$ can be seen as a distorted $\\mathrm{Ge}_{4}$ rhombus with a capped dopant on one face. For $\\mathrm{MGe}_{5}$ clusters, the metal $\\mathrm{M}$ atom is capping a Ge ${ }_{5}$ triangular pyramid. Up to size $\\mathrm{n}=8$, the structures of $\\mathrm{MGe}_{\\mathrm{n}}$ clusters are roughly similar for $\\mathrm{M}=\\mathrm{Ag}$, Au and $\\mathrm{Cu}$. The substitution of one germanium atom by one noble metal atom in the capped bi-pyramid pure $\\mathrm{Ge}_{8}$ structure gives the optimized ground state structure of $\\mathrm{MGe}_{7}$ with $\\mathrm{M}$ atom capping a pentagonal by-pyramid. The structure of $\\mathrm{MGe}_{8}$ can be seen as $\\mathrm{MGe}_{6}$ on which two additional Ge atoms are localized on surface, or alternatively it can also be seen as a distorted cube-like $\\mathrm{MGe}_{7}$ structure with a capping $\\mathrm{Ge}$ atom.\n\nStarting from $n=9$, the optimized structures of Cu-doped $\\mathrm{Ge}_{\\mathrm{n}}$ clusters differ from those of Ag- and Au-doped $\\mathrm{Ge}_{\\mathrm{n}}$. A prolate-like structure with the $\\mathrm{M}$ atom located out of the frame of germanium cluster is obtained as the best isomer of $\\mathrm{MGe}_{9}$ clusters. $\\mathrm{Cu}$ atom is highly coordinated to the neighboring Ge atoms in CuGe ${ }_{9}$ comparatively to $\\mathrm{Ag}$ and $\\mathrm{Au}$ atoms in AgGe 9 and AuGe $_{9}$ clusters. The endohedral structures in which the metal atom is encapsulated inside a germanium cage appear at $\\mathrm{n}=10$ when the dopant is $\\mathrm{Cu}$, and $\\mathrm{n}=12$ for $\\mathrm{M}=\\mathrm{Ag}$ and Au. Indeed, the lowest-energy structure of $\\mathrm{CuGe} \\mathrm{e}_{10}$ is a $D_{4 d}$ symmetry cage-like structure with $\\mathrm{Cu}$ atom highly coordinated at the center of the cage. This structure has been already found previously ${ }^{27}$. CuGe ${ }_{11}$ has also a cage-like structure with a Cu atom highly coordinated. In contrast, Ag and Au atoms are still in peripheral position in MGe Mo-11. All $^{\\text {Als }}$ ground states isomers of $\\mathrm{MGe}_{12}$ are high symmetry cage-like structures with $\\mathrm{M}$ atom highly coordinated at the center of the germanium cage. The lowest-energy isomer of $\\mathrm{CuGe}_{12}$ belongs to the high-symmetry $D_{5 d}$ point group while that of $A_{g G e} 12$ and $A G e_{12}$ clusters has a $D_{2 d}$ symmetry. The latter can be described as a biccapped pentagonal prism and were previously proposed by $\\mathrm{Li}$ et al. $^{48}$ as a putative structure for $A^{4} \\mathrm{Ge}_{12}$, lying below the hexagonal prism with $C_{s}$ symmetry (isomer $e$ ) well known to be the ground state for several transition metal Ge doped clusters ${ }^{22,49}$. The isoelectronic cluster $\\mathrm{RuGe}_{12^{3-}}$ is also found to lie in the $D_{2 h}$ structure $^{50}$. Previous works on the anion $\\mathrm{AuGe}_{12}{ }^{-}$have furnished conflicting results since Li et al. ${ }^{24}$ has predicted a $D_{2 d}$ structure to be the lowest-isomer with hybrid DFT + MP2 level calculations, while Lu et al. ${ }^{25}$ obtained a $I_{h}$-symmetry structure using DFT + CCSD calculations. The latter is in better agreement with the photoelectron spectroscopy results ${ }^{25}$. In our calculation, we find that the $I_{h}$-symmetry structure is the most stable isomer for the anion while the neutral $A u G e_{12}$ cluster adopts a $D_{2}$-symmetry structure. For AgGe $A_{12}$, the $D_{5 d}$ symmetry structure is found to be stable but lying $0.09 \\mathrm{eV}$ above the $D_{2 d}$ structure.\n\nFrom $n=13$ to $n=19$, Cu occupies an endohedral position for each size. Ag and Au are generally located in a cage-like structure with some exceptions for AgGe ${ }_{15,16,18}$ and AuGe $_{15,18}$, where the metal atom prefers a peripheral position with a low number of coordination. Interestingly, the most stable isomer of $\\mathrm{MGe}_{14}$ is a cage belonging a high symmetry $D_{4 h}$ point group for the three metal $\\mathrm{M}=\\mathrm{Ag}, \\mathrm{Au}$, Cu. A high $\\mathrm{O}_{h}$ symmetry have been previously predicted to be highly stable for $\\mathrm{W}$ - or $\\mathrm{V}$-encapsulated $\\mathrm{Ge}_{14}$ clusters ${ }^{13,22}$ but for noble metal atom the $O_{h}$ symmetry structure was found to relax in a $D_{4 h}$ symmetry geometry. As we can see clearly from Tables 1 and 2, the average Ge-Ag and Ge-Au bond lengths are larger than the average Ge-Ge bond length. In contrast, the average Ge-Cu bond length is smaller than the average Ge-Ge bond length as we can see from Table 3. These parameters can significantly affect the stability and others properties of each $\\mathrm{MGe}_{\\mathrm{n}}$ species.\n\n\\section{3b Energetics}\nThe binding energy par atom of $\\mathrm{MGe}_{\\mathrm{n}}$ clusters is defined as\n\n\\[\nE_{b}\\left(M G e_{n}\\right)=\\left(n E(G e)+E(M)-E\\left(M e_{n}\\right)\\right) /(n+1),\n\\]\n\nwhere $E(\\mathrm{Ge})$ is the total energy of free Ge atom, $E(\\mathrm{M})$ the total energy of free $\\mathrm{M}=\\mathrm{Ag}, \\mathrm{Au}$, $\\mathrm{Cu}$ atom and $E\\left(\\mathrm{MGe}_{n}\\right)$ is the total energy of the $\\mathrm{MGe}_{n}$ cluster. The calculated binding energies for all clusters are reported in Table 1, 2 and 3, and their evolution with the cluster size $n$ is shown in Figure 4 for the best isomers of each system. For comparison, the evolution of binding energy of their corresponding ground state pure germanium clusters is also plotted. As expected, the binding energy generally increases with increasing size, which means that these clusters can continuously gain energy during the growth process. This is likely associated to the increase in the average number of neighbors per atom. The binding energy par atom of all systems increases rapidly from $n=1$ to $n=6$, then a slow and non-monotonic growth is observed. The Cu doping atom enhances the stability of the corresponding $\\mathrm{Ge}_{\\mathrm{n}}$ frame from $n=10$, i.e. when $\\mathrm{CuGe}_{\\mathrm{n}}$ clusters adopt cage-like structures with Cu atom highly coordinated at central position. In contrast, the binding energies of $\\mathrm{AgGe}_{\\mathrm{n}}$ and $\\mathrm{AuGe}_{\\mathrm{n}}$ are always lower than those of pure germanium clusters, $\\mathrm{AgGe}_{\\mathrm{n}}$ clusters being slightly more stable than gold-doped clusters. This behavior can be due to the nature of the bonding involving $\\mathrm{Cu}, \\mathrm{Ag}$ and Au species, since copper presents a stronger covalent character than Ag and $\\mathrm{Au}$ and a greater ability to make chemical bonds ${ }^{51}$. For copper-doped clusters, a pronounced value of binding energy is observed at $n=10$ and 12 in which $\\mathrm{Cu}$ is encapsulated in a quasi-perfect $\\mathrm{Ge}_{n}$ cage. The binding energies per atom for $\\mathrm{CuGe}_{10}$ and $\\mathrm{CuGe}_{12}$ are calculated to be $3.080$ and $3.099 \\mathrm{eV}$ respectively. They are somewhat similar to the binding energy of 3.058-3.179 eV calculated for $\\mathrm{VGe}_{10-15}$ cage-like structures ${ }^{22}$. For $\\mathrm{AgGe}_{\\mathrm{n}}$ and $A_{u G e} e_{n}$, the largest value is obtained at $n=15$, with $3.019$ and $2.997 \\mathrm{eV} /$ atom respectively, and corresponding to a peculiar hollow cage-like geometry where the metal atom is inserted into the germanium structure without having a particular position.\n\nIn cluster physics, the second-order difference in energy $\\left(\\Delta_{2} E\\right.$ ) can well reflect the relative stabilities of the corresponding clusters. It is generally compared with the relative abundances determined in mass spectroscopy experiments. For the ground-state $\\mathrm{MGe}_{n}$ clusters, it can be calculated as\n\n\\[\n\\Delta_{2} E=E\\left(M G e_{n+1}\\right)+E\\left(M G e_{n-1}\\right)-2 E\\left(M G e_{n}\\right),\n\\]\n\nwhere $E$ is the total energy of the ground state cluster. In Figure 05 , we show the variation of $\\Delta_{2} \\mathrm{E}$ as a function of the size $\\mathrm{n}$. The plots show some pronounced positive peaks at $\\mathrm{n}=5,8,12$ and 15 for all $\\mathrm{MGe}_{\\mathrm{n}}(\\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}, \\mathrm{Au})$ clusters. A relative high stability is found for $\\mathrm{CuGe}_{10}$, $\\mathrm{CuGe}_{12}, A_{g G e}, A_{10} \\mathrm{Age}_{12}, A_{g G e}, A_{15} G_{12}$ and $A_{16}$ A $_{15}$. It is mainly due to the metalgermanium bonds since the corresponding initial pure germanium clusters do not show a peculiar stability.\n\nThe chemical activity of clusters can be characterized by the measurement of the HOMO-LUMO gap. In general, a large HOMO-LUMO gap implies a low chemical activity and a high chemical stability, while the latter decreases as the HOMO-LUMO gap decreases. The calculated HOMO-LUMO gaps for all $\\mathrm{AgGe}_{n}, \\mathrm{AuGe}_{n}$ and $\\mathrm{CuGe}_{n}$ clusters are reported in Table 1,2 and 3 respectively. Their evolution as a function of the size for the ground states structures is plotted in Figure 06. The decreasing tendency with increasing size is strong for pure germanium clusters but less significant for metal-doped $\\mathrm{Ge}_{n}$ clusters. As expected, the gap of $\\mathrm{MGe}_{n}$ is lower than that of the pure $\\mathrm{Ge}_{\\mathrm{n}+1}$ cluster, except for sizes $\\mathrm{n}=10$, indicating that the metal dopant in the germanium clusters generally increases the chemical activity of clusters. Values oscillate in the $0.15-1.3 \\mathrm{eV}$ range but the evolution with the cluster size shows a non-monotonic behavior. Pronounced value of HOMO-LUMO gaps are observed at $n$ $=4,6,13,15$ and 18 for $\\mathrm{AgGe}_{n}$ and at $n=4,6,10,1316$ and 18 for $\\mathrm{AuGe}_{n}$ and at $n=5,10$, 13,16 for $\\mathrm{CuGe}_{\\mathrm{n}}$ clusters which indicate that these clusters have a higher stability and a low reactivity than their neighbors. Particularly, the high relative value of $1.324 \\mathrm{eV}$ for $\\mathrm{CuGe}_{10}$ reflects the chemical stability of this cluster which may likely be a good candidate to be used as a building block for developing new materials.\n\nThe vertical electroaffinity (VEA) and vertical ionization potential (VIP) are defined as $V E A=E\\left(M G e_{n}\\right)-E\\left(M G e_{n}^{-}\\right)$and VIP $=E\\left(M G e_{n}^{+}\\right)-E\\left(M G e_{n}\\right)$, where $E\\left(M G e_{n}^{-}\\right)$and $E\\left(M G e_{n}^{+}\\right)$are the energy of the corresponding anionic and cationic clusters calculated at the geometry of the neutral system. The obtained calculated VEA and VIP are reported in Tables 1, 2 and 3, while their evolutions as a function of the cluster size are plotted in Figure 07 and Figure 08 together with those of $\\mathrm{Ge}_{\\mathrm{n}+1}$ clusters. These data could be compared to experiment even if to our knowledge no experimental data are available nowadays. The VEA values present a non-monotonic increasing with the cluster size, while the VIP values present a nonmonotonic decreasing with the cluster size. Both VEA and VIP are relatively few dependent on the nature of the doping metal, even if values for copper-doped clusters are often slightly larger than those for Ag- and Au-doped clusters. CuGe ${ }_{12}$, with its highly $D_{5 d}$ symmetry structure, presents the highest values.\n\n\\section{Discussion}\nOur results highlight a great stability for $\\mathrm{CuGe}_{10}$ cluster in an endohedral structure. This is line with the experimental mass spectrometric stability investigation by Lievens et al. ${ }^{52}$ that exhibited remarkably high abundance for $\\mathrm{CuGe}_{10}{ }^{+}$and interpreted it in terms of peculiarly stable dopant-encapsulated cage-like structures. In Ref [27], the 42 valence electrons (4 from Ge and 1 for $\\mathrm{Cu}$ ) in $\\mathrm{CuGe}_{10^{-}}$are found to be distributed in the following energy sequence of electronic shell model $\\left[1 \\mathrm{~S}^{2} 1 \\mathrm{P}^{6} 1 \\mathrm{D}^{10} 1 \\mathrm{~F}^{2} 2 \\mathrm{~S}^{2} 1 \\mathrm{~F}^{8} 2 \\mathrm{P}^{2} 1 \\mathrm{~F}^{4} 2 \\mathrm{P}^{4} 1 \\mathrm{G}^{2}\\right.$ ]. In our work, the d electrons of $\\mathrm{Cu}$ are found to participate as well to the delocalized orbitals and then 51 electrons (4 from $\\mathrm{Ge}$ and 11 from $\\mathrm{Cu}$ ) are in the delocalized electronic shells with the following filling $\\left[1 \\mathrm{~S}^{2} 1 \\mathrm{P}^{6} 1 \\mathrm{D}^{10} 2 \\mathrm{D}^{10} 2 \\mathrm{~S}^{2} 1 \\mathrm{~F}^{14} 2 \\mathrm{P}^{6} 1 \\mathrm{G}^{1}\\right]$. Due to a lowering symmetry $\\left(D_{4 d}\\right.$ instead of $K_{h}$ for a sphere), some shells are splitting subshells. However one can expect that the number of electrons fit with shell closings numbers for the cation $\\mathrm{CuGe}_{10}{ }^{+}$, and such an organization contributes to the high stability of the cluster through the pooling of electrons. Density of states (DOS) together with representative Kohn-Sham orbitals are given in Figure 9 for CuGe ${ }_{10,12,14}$. All molecular orbitals can be found in Supporting Information. We can easily distinguish the orbitals associated to S, P, D, F, G supershells. For the endohedral structure corresponding to the lowest-energy isomer of $\\mathrm{CuGe}_{n}$, with $\\mathrm{n}>14$, we were not able to assign a symmetry character of molecular orbitals, and we think the supershell filling is no more valid. The great values of VIP and VEA calculated for $\\mathrm{CuGe}_{12}$ is due to the high symmetry $\\left(D_{5 d}\\right)$ of its geometrical structure resulting to a large gap between two successive electronic shells (Figure 9).\n\nWe show in figure 10 the density of states (DOS) for the lowest-energy isomer of AgGe $_{12,14,15}$, and $\\mathrm{AuGe}_{12,14,15}$. These structures are of sphere-type where the germanium cage encapsulates the metal atom resulting in a high symmetry structure, except for $n=15$, where the metal atom is inserted into the germanium structure without having a particular position, resulting in a hollow cage-like geometry. Our above results highlight a relative high stability for $\\mathrm{n}=15$. As a matter of fact, the electronic configuration of AgGe ${ }_{15}$ and $\\mathrm{AuGe}_{15}$, $\\left[1 \\mathrm{~S}^{2} 1 \\mathrm{P}^{6}\\right.$ $2 \\mathrm{~S}^{2} 1 \\mathrm{D}^{10} 1 \\mathrm{~F}^{14} 3 \\mathrm{~S}^{2} 2 \\mathrm{D}^{10} 2 \\mathrm{P}^{6} 1 \\mathrm{G}^{18} 1 \\mathrm{H}^{1}$ ] see Table 4 , fits well with shell closings numbers with a single excess electron, similarly to the configuration found for $\\mathrm{CuGe}_{10}$. The high stability of the three clusters, $\\mathrm{CuGe}_{10}, \\mathrm{AgGe}_{15}$ and $\\mathrm{AuGe}_{15}$, can be explained by such organization. The Kohn-Sham molecular orbitals of $\\mathrm{AgGe}_{15}$ and $\\mathrm{AuGe}_{15}$ are showed in Supporting Information, we can note that the molecular orbitals $1 \\mathrm{~F}, 2 \\mathrm{D}$, and $1 \\mathrm{G}$ are mixed. It is very significant that the coinage metal is able to give both s- and d-type electrons to be reorganized together with the valence electrons of Ge atoms through a pooling of electrons. To the best of our knowledge, that has never been reported previously. And it is in line with the recent photoelectron spectroscopy results on small $\\mathrm{AuGe}_{n}{ }^{-}$which has suggested strong interactions between the $5 \\mathrm{~d}$ orbitals of the Au atom and the $4 \\mathrm{~s} 4 \\mathrm{p}$ hybridized orbitals of the Ge atoms ${ }^{25}$.\n\nThe electron shell configuration of endohedral cage-like structure $\\mathrm{MGe}_{n}(\\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}$, $\\mathrm{Au} ; \\mathrm{n}=10,12,14)$ and hollow cages of $A g G e_{15}$ and $\\mathrm{AuGe}_{15}$ are given in Table 4. The density of states together with Kohn-Sham molecular orbitals can be found in Supporting information. The orbitals character can be easily identified for all cages, even if some mixing were found for $2 \\mathrm{D}$-, and $1 \\mathrm{G}$-type orbitals in case of low-symmetry geometries.\n\n\\section{Conclusion}\nWe have performed a systematic investigation on the coinage metal-doped germanium $\\left(\\mathrm{MGe}_{n}\\right.$ with $\\left.\\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}, \\mathrm{Au} ; \\mathrm{n}=1-19\\right)$ clusters by using first-principles DFT calculations. Doping with $\\mathrm{Cu}$ atom enhances the stability of the corresponding germanium frame when $\\mathrm{CuGe}_{\\mathrm{n}}$ clusters adopt cage-like structures with $\\mathrm{Cu}$ atom highly coordinated at central position. In contrast, the binding energies of $A g G e_{n}$ and $A u G e_{n}$ are always lower than those of pure germanium clusters. The endohedral structures in which the metal atom is encapsulated inside a germanium cage appear at $n=10$ when the dopant is $C u$, and $n=12$ for $M=A g$ and $A u$. Our results highlight the great stability of the $\\mathrm{CuGe}_{10}$ cluster in $D_{4 d}$ structure which exhibits a large binding energy, a large frontier orbital energy gap, and a relative small electron affinity. AgGe $_{15}$ and AuGe$_{15}$ which exhibit a hollow cage-like geometry where the metal atom is inserted into the germanium structure without having a particular position present a relative high stability as well. The sphere-type structures obtained for $n=10-15$ present a peculiar electronic structure in which the valence electrons of the noble metal and Ge atoms are delocalized and exhibit a shell structure associated with the quasi-spherical geometry. Each Ge gives 4 electrons while each coinage atom gives 11 electrons. It is very significant that the coinage metal is able to give both s- and d-type electrons to be reorganized together with the valence electrons of Ge atoms through a pooling of electrons. We hope that the present study will motivate appropriate experimental investigations probing the electronic properties and the stability of noble metal-doped germanium clusters.\n\n\\section{Acknowledgement}\nFR thanks the Pôle Scientifique de Modélisation Numérique (PSMN) at Lyon, France, and the GENCI-IDRIS (Grant i2016086864) center for generous allocation of computational time.\n\nSupporting Information. Density of states for the most stable and low-lying isomers of $\\mathrm{CuGe}_{10,12,14}, \\mathrm{AgGe}_{12,14,15}$, and $\\mathrm{AuGe}_{12,14,15}$, together with Kohn-Sham molecular orbitals.\n\n\\section{References}\n[1] Zhao, W. J.; Wang, Y. X. Geometries, stabilities, and electronic properties of $\\mathrm{FeGe}_{\\mathrm{n}}(\\mathrm{n}=$ 9-16) clusters: Density-functional theory investigations. Chem. Phys. 2008, 352, 291-296.\n\n[2] Zhao, W. J.; Wang, Y. X. Geometries, stabilities, and magnetic properties of $\\mathrm{MnGe}_{\\mathrm{n}}(\\mathrm{n}=$ 2-16) clusters: Density-functional theory investigations. J. Mol. Str.: THEOCHEM 2009, 901, 18-23.\n\n[3] Lu, J.; Nagase, S. Metal-doped germanium clusters $\\mathrm{MGe}_{\\mathrm{n}}$ at the sizes of $n=12$ and 10 : Divergence of growth patterns from the $\\mathrm{MSi}_{n}$ clusters. Chem. Phys. Lett. 2003, 372, 394-398.\n\n[4] Kapila, N.; Jindal, V. K.; Sharma, H. Structural, electronic and magnetic properties of Mn, Co, Ni in $\\mathrm{Ge}_{\\mathrm{n}}$ for (n=1-13). Physica B 2011, 406, 4612-4619.\n\n[5] Kapila, N.; Garg, I.; Jindal, V. K.; Sharma, H. First principle investigation into structural growth and magnetic properties in $\\mathrm{Ge}_{\\mathrm{n}} \\mathrm{Cr}$ clusters for $\\mathrm{n}=1-13$. J. Magnetism and Magnetic Mat. 2012 324, 2885-2893.\n\n[6] Dhaka, K.; Bandyopadhyay, D. Study of the electronic structure, stability and magnetic quenching of $\\mathrm{CrGe}_{\\mathrm{n}}(\\mathrm{n}=1-17)$ clusters: a density functional investigation. RSC ADVANCES 2015, 5, 83004-83012.\n\n[7] Hou, X.-J.; Gopakumar, G.; Lievens, P.; Nguyen, M. T. Chromium-doped germanium clusters $\\mathrm{CrGe}_{\\mathrm{n}}(\\mathrm{n}=1-5)$ : geometry, electronic structure, and topology of chemical bonding. $J$. Phys. Chem. A 2007, 111, 13544-13553.\n\n[8] Deng, X.-J.; Kong, X.-Y.; Xu, H.-G.; Xu, X.-L.; Feng, G.; Zheng, W.-J. Photoelectron spectroscopy and density functional calculations of $\\operatorname{VGe}_{n}^{-}(n=3-12)$ Clusters. J. Phys. Chem. C 2015, 119, 11048-11055.\n\n[9] Kumar, M.; Bhattacharyya, N.; Bandyopadhyay, D. Architecture, electronic structure and stability of $\\mathrm{TM}_{\\mathrm{M}} \\mathrm{Ge}_{\\mathrm{n}}(\\mathrm{TM}=\\mathrm{Ti}, \\mathrm{Zr}$ and Hf; $\\mathrm{n}=1-20)$ clusters: a density functional modeling. J. Mol. Model. 2012, 18, 405-418.\n\n[10] Bandyopadhyay, D.; Sen, P. Density functional investigation of structure and stability of $\\mathrm{Ge}_{\\mathrm{n}}$ and $\\mathrm{Ge}_{\\mathrm{n}} \\mathrm{Ni}(\\mathrm{n}=1-20)$ clusters: validity of the electron counting rule. J. Phys. Chem. A 2010, 114, 1835-1842.\n\n[11] Wang, J.; Han, J.-G. A computational investigation of copper-doped germanium and germanium clusters by the density-functional theory. J. Chem. Phys. 2005, 123, 244303.\n\n[12] Wang, J.; Han, J.-G. A Theoretical Study on Growth Patterns of Ni-Doped Germanium Clusters. J. Phys. Chem. B 2006, 11, 7820-7827.\n\n[13] Wang, J.; Han, J.-G. Geometries and electronic properties of the tungsten-doped germanium clusters: $\\mathrm{We}_{\\mathrm{n}}(\\mathrm{n}=1-17)$. J. Phys. Chem. A 2006, 110, 12670-12677.\n\n[14] Wang, J.; Han, J.-G. Geometries, stabilities, and vibrational properties of bimetallic Mo Mo $_{2}-$ doped $\\operatorname{Ge}_{\\mathrm{n}}(\\mathrm{n}=9-15)$ clusters: a density functional investigation. J. Phys. Chem. A 2008, 112, 3224-3230.\n\n[15] Trivedi, R.; Dhaka, K.; Bandyopadhyay, D. Study of electronic properties, stabilities and magnetic quenching of molybdenum-doped germanium clusters: a density functional investigation, RSC Adv. 2014, 4, 64825-64834.\n\n[16] Jing, Q.; Tian, F.-Y.; Wang, Y.-X. No quenching of magnetic moment for the $\\mathrm{Ge}_{n} \\mathrm{Co}$ ( $n=1-13)$ clusters: First-principles calculations. J. Chem. Phys. 2008, 128, 124319.\n\n[17] Deng, X.-J.; Kong, X. Y.; Xu X-L; Xu H-G; Zheng W-J, Structural and magnetic properties of $\\mathrm{CoGe}_{n}^{-}(\\mathrm{n}=2-11)$ clusters: photoelectron spectroscopy and density functional calculations. Chem. Phys. Chem. 2014, 15, 3987-3993.\n\n[18] Kumar Singh, A.; Kumar, V.; Kawazoe Y. Thorium encapsulated caged clusters of germanium: Th@Ge $\\mathrm{Ge}_{\\mathrm{n}} \\mathrm{n}=16,18$, and 20. J. Phys. Chem. B 2005, 109, 15187-15189. [19] Zdetsis, A. D. Silicon-bismuth and germanium-bismuth clusters of high stability. J. Phys. Chem. A 2009, 113, 12079-12087.\n\n[20] Jaiswal, S.; Kumar, V. Growth behavior and electronic structure of neutral and anion $\\mathrm{ZrGe}_{n}(\\mathrm{n}=1-21)$ clusters. Comp. Theo. Chem. 2016, 1075, 87-97.\n\n[21] Jin, Y.; Tian, Y.; Kuang, X.; Lu, C.; Cabellos, J.L.; Mondal, S.; Merino, G. Structural and electronic properties of ruthenium-doped germanium clusters. J. Phys. Chem. C, 2016, 120, 8399-8404.\n\n[22] Siouani, C.; Mahtout, S.; Safer, S.; Rabilloud, F. Structure, Stability, and electronic and magnetic properties of $\\operatorname{VGe}_{\\mathrm{n}}(\\mathrm{n}=1-19)$ clusters. J. Phys. Chem. A 2017, 121, 3540-3554.\n\n[23] Atobe, J.; Koyasu, K.; Furuse, S.; Nakajima, A. Anion photoelectron spectroscopy of germanium and tin clusters containing a transition-or lanthanide-metal atom; $\\mathrm{MGe}_{\\mathrm{n}}{ }^{-}(\\mathrm{n}=8-20)$ and $\\operatorname{MSn}_{n}^{-}(\\mathrm{n}=15-17)(\\mathrm{M}=\\mathrm{Sc}-\\mathrm{V}, \\mathrm{Y}-\\mathrm{Nb}$, and Lu-Ta). Phys. Chem. Chem. Phys. 2012, 14, 9403-9410.\n\n[24] Li, X.; Su, K.; Yang, X.; Song, L.; Yang, L. Size-selective effects in the geometry and electronic property of bimetallic Au-Ge nanoclusters. Comp. Theo. Chem. 2013, 1010, 32-37. [25] Lu, S.-J.; Hu, L.-R.; Xu, X.-L.; Xu, H.-G.; Chen, H. ; Zheng W.-J. Transition from exohedral to endohedral structures of $\\operatorname{AuGe}_{n}(n=2-12)$ clusters: photoelectron spectroscopy and $a b$ initio calculations. Phys. Chem. Chem. Phys. 2016, 18, 20321.\n\n[26] Bandyopadhyay, D.; Architectures, electronic structures, and stabilities of Cu-doped $\\mathrm{Ge}_{n}$ clusters: density functional modeling. J Mol Model. 2012, 18, 3887-902.\n\n[27] Tai, T. B.; Nguyen, M. T.; Enhanced stability by three-dimensional aromaticity of endohedrally doped clusters $\\mathrm{X}_{10} \\mathrm{M}^{0 /-}$ with $\\mathrm{X}=\\mathrm{Ge}$, Sn, $\\mathrm{Pb}$ and $\\mathrm{M}=\\mathrm{Cu}$, Ag, Au. J. Phys. Chem. A 2011, 115, 9993-9999.\n\n[28] Tai, T. B.; Nguyen, H. M. T.; Nguyen, M. T. The group 14 cationic clusters by encapsulation of coinage metals $\\mathrm{X}_{10} \\mathrm{M}^{+}$, with $\\mathrm{X}=\\mathrm{Ge}, \\mathrm{Sn}, \\mathrm{Pb}$ and $\\mathrm{M}=\\mathrm{Cu}$, Ag, Au: Enhanced stability of 40 valence electron systems. Chem. Phys. Lett. 2011, 502, 187-193.\n\n[29] Qin, W.; Lu, W.-C.; Xia, L.-H.; Zhao, L.-Z.; Zang, Q.-J.; Wang, C. Z.; Ho, K. M. Structures and stability of metal-doped $\\mathrm{Ge}_{n} \\mathrm{M}(\\mathrm{n}=9,10)$ clusters. AIP Advances 2015, 5, 067159.\n\n[30] Brack, M. The physics of simple metal clusters: self-consistent jellium model and semiclassical approaches. Rev. Mod. Phys. 1993, 65, 677.\n\n[31] Samanta, P. N.; Das, K. K. Electronic structure, bonding, and properties of $\\mathrm{Sn}_{\\mathrm{m}} \\mathrm{Ge}_{\\mathrm{n}}(\\mathrm{m}+$ $\\mathrm{n} \\leq 5$ ) clusters: A DFT study. Comp. Theo Chem 2012, 980, 123-132.\n\n[32] Tang, C.; Liu, M.; Zhu, W.; Deng, K. Probing the geometric, optical, and magnetic properties of 3d transition-metal endohedral $\\mathrm{Ge}_{12} \\mathrm{M}(\\mathrm{M}=\\mathrm{Sc}-\\mathrm{Ni})$ clusters. Comp. Theo. Chem. 2011, 969 56-60.\n\n[33] Goswami, S.; Saha, S.; Yadav, R. K. Structural, electronic and vibrational properties of $\\mathrm{Ge}_{\\mathrm{x}} \\mathrm{C}_{\\mathrm{y}}(\\mathrm{x}+\\mathrm{y}=2-5)$ nanoclusters: A B3LYP-DFT study. Physica $E$ 2015, 74, 175-192.\n\n[34] Perdew, J.P.; Burke, K.; Ernzerhof, M. Generalized Gradient Approximation Made Simple. Phys. Rev. Lett. 1996, 77, 3865-3868.\n\n[35] Troullier, N.; Martins, J. L. Efficient pseudopotentials for plane-wave calculations. Phys. Rev. B 1991, 43, 1993.\n\n[36] Kleinman L.; Bylander, D.M. Efficacious form for model pseudopotentials. Phys. Rev. Lett. 1982, 48, 1425.\n\n[37] Ordejón, P.; Artacho E.; Soler, J. M. Self-consistent order-N density-functional calculations for very large systems. Phys. Rev. B (Rapid Comm.) 1996, 53, 10441; Soler, J. M. ; Artacho, .; Gale, J. D.; García, A.; Junquera, J.; Ordejón, P.; Sánchez-Portal, D. The SIESTA method for ab initio order-N materials simulation. J. Phys.: Condens. Mat. 2002, 14, 2745.\n\n[38] Frisch M.J. et al., Gaussian09, Revision D.01, Gaussian Inc., Wallingford CT, 2013. [39] Shi, S.; Liu, Y.; Zhang, C.; Deng, B.; Jiang, G. A computational investigation of aluminum-doped germanium clusters by density functional theory study. Comp. Theo. Chem. 2015, 1054, 8-15.\n\n[40] Deutsch, P.W.; Curtiss, L.A.; Blaudeau, J.P. Binding energies of germanium clusters $\\mathrm{Ge}_{\\mathrm{n}}$ (n =2-5), Chem. Phys. Lett. 1997, 270, 413-418.\n\n[41] Nagendran, S.; Sen, S.S.; Roesky, H.W.; Koley, D.; Grubmüller, H.; Pal A.; HerbstIrmer R.R Ge(I) Ge(I)R compound (R = PhC(NtBu) 2 ) with a Ge-Ge single bond and a comparison with the gauche conformation of hydrazine. Organometallics 2008, 27, 5459 5463.\n\n[42] Gadiyak, G.V.; Morokov, Y.N.; Mukhachev, A.G.; Chernov, S.V. Electron density functional method for molecular system calculations. J. Struct. Chem. 1982, 22, 670-674.\n\n[43] Beutel, V.; Kramer, H. G.; Bhale, G.L.; Kuhn, M.; Weyers, L.; Demtroder, W. High resolution isotope selective laser spectroscopy of $\\mathrm{Ag}_{2}$ molecules. J. Chem. Phys. 1992, 98, 2699.\n\n[44] Simard, B.; Hackett, P. A. High resolution study of the $(0,0)$ and $(1,1)$ bands of the $\\mathrm{A0}_{\\mathrm{u}}{ }^{+}-\\mathrm{X}_{\\mathrm{g}}{ }^{+}$system of $\\mathrm{Au}_{2} . \\mathrm{J}$. Mol. Spectros. 1990, 142, 310-318.\n\n[45] Ram, R. S.; Jarman, C. N.; Bernath, P. F. Fourier transform emission spectroscopy of the copper dimer. J. Mol. Spectrosc. 1992, 156, 468-486.\n\n[46] Kingcade, J.E.; Nagarathna-Naik, H. M.; Shim, I.; Gingerich, K. A. Electronic structure and bonding of the molecule $\\mathrm{Ge}_{2}$ from all-electron ab initio calculations and equilibrium measurements. J. Phys. Chem. 1986, 90, 2830-2834.\n\n[47] Rabilloud, F. Structure and stability of coinage metal fluoride and chloride clusters $\\left(\\mathrm{M}_{\\mathrm{n}} \\mathrm{F}_{\\mathrm{n}}\\right.$ and $\\mathrm{M}_{\\mathrm{n}} \\mathrm{Cl}_{\\mathrm{n}}, \\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}$, or $\\mathrm{Au} ; \\mathrm{n}=1-6$ ). J. Comp. Chem. 2012, 33, 2083-2091.\n\n[48] Li, X.-J.; Su, K.-H. Structure, stability and electronic property of the gold-doped germanium clusters: $\\operatorname{AuGe}_{\\mathrm{n}}(\\mathrm{n}=2-13)$. Theor. Chem. Acc. 2009, 124, 345.\n\n[49] Goicoechea, J. M.; McGrady, J. E. On the structural landscape in endohedral silicon and germanium clusters, M@Si 12 and $\\mathrm{M} @ \\mathrm{Ge}_{12}$. Dalton Trans. 2015, 44, 6755-6766.\n\n[50] Espinoza-Quintero G.; Duckworth, J. C. A.; Myers, W. K.; McGrady, J. E.; Goicoechea, J. M. Synthesis and characterization of [Ru@Ge12 $]^{3-}$ : An endohedral 3-connected cluster. J. Am. Chem. Soc. 2014, 136, 1210-1213.\n\n[51] L'Hermite, J.M.; Rabilloud, F.; Marcou, L.; Labastie, P. Metastable fragmentation of silver bromide clusters. Eur. Phys. J. D 2001, 14, 323-330.\n\n[52] Neukermans, S.; Wang, X.; Veldeman, N.; Janssens, E.; Silverans, R. E.; Lievens, P. Mass spectrometric stability study of binary $\\mathrm{MS}_{\\mathrm{n}}$ clusters $(\\mathrm{S}=\\mathrm{Si}, \\mathrm{Ge}, \\mathrm{Sn}, \\mathrm{Pn}$, and $\\mathrm{M}=\\mathrm{Cr}$, Mn, Cu, Zn). Int. J. Mass Spectrometry 2006, 252, 145-150. Table 1. Symmetry group, Binding energy per atom $E_{b}$ (eV/atom), HOMO-LUMO gap $\\triangle E(\\mathrm{eV}$ ), Vertical Ionization Potential (VIP) (eV), Vertical Electronic Affinity (VEA) (eV), and average bond length age-Ge and $\\mathrm{a}_{\\mathrm{Ge}-\\mathrm{Ag}}$ for $\\operatorname{AgGe}_{\\mathrm{n}}(\\mathrm{n}=1-19)$ clusters.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-13_370_2646_317_1688}\n\\end{center}\n\nTable 2. Symmetry group, Binding energy per atom $E_{b}$ (eV/atom), HOMO-LUMO gap $\\triangle E(e V)$, Vertical Ionization Potential (VIP) $(\\mathrm{eV}$ ), Vertical Electronic Affinity (VEA) ( $\\mathrm{eV}$ ), and average bond length $\\mathrm{a}_{\\mathrm{Ge} \\text {-Ge }}$ and $\\mathrm{a}_{\\mathrm{Ge}-\\mathrm{Au}}$ for $\\mathrm{AuGe}_{\\mathrm{n}}(\\mathrm{n}=1-19)$ clusters.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-14_415_2657_334_1716}\n\\end{center}\n\nTable 3. Symmetry group, Binding energy per atom $E_{b}$ (eV/atom), HOMO-LUMO gap $\\triangle E(e V)$, Vertical Ionization Potential (VIP) $(\\mathrm{eV}$ ), Vertical Electronic Affinity (VEA) (eV), and average bond length $\\mathrm{a}_{\\mathrm{Ge}-\\mathrm{Ge}}$ and $\\mathrm{a}_{\\mathrm{Ge}-\\mathrm{Cu}}$ for $\\mathrm{CuGe}_{\\mathrm{n}}(\\mathrm{n}=1-19)$ clusters.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-15_420_2624_340_1716}\n\\end{center}\n\nTable 4. Electron shell configuration in endohedral cage-like structures $\\mathrm{MGe}_{\\mathrm{n}}(\\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}$, $\\mathrm{Au} ; \\mathrm{n}=10,12,14)$ and hollow cages of AgGe $\\mathrm{Ag}_{15}$ and $\\mathrm{AuGe}_{15}$.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-16_380_1613_525_1536}\n\\end{center}\n\nTOC\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-17_327_1192_228_1399}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-18_208_402_227_955}\n\\end{center}\n\n$\\operatorname{AgGe}_{2}\\left(\\mathrm{C}_{2 \\mathrm{v}}\\right)$ -b-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-18_433_629_224_966}\n\n-b-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-18_601_1095_206_918}\n\n$\\operatorname{AgGe}_{8}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$ -a-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-18_1182_1393_227_435}\n\\end{center}\n\n$\\underset{\\text {-b- }}{A_{1}} \\operatorname{AgG}_{8}\\left(C_{1}\\right)$\n\n-b-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-18_824_1100_740_966}\n\n$\\operatorname{AgGe}_{8}\\left(\\mathrm{C}_{1}\\right)$\n\n-C-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-18_577_1739_242_1496}\n\n$\\operatorname{AgGe}_{7}\\left(C_{1}\\right)$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-18_842_888_1025_1168}\n\\end{center}\n\n-a-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-18_924_1154_1002_1218}\n\n-d-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-18_1166_1392_1019_1493}\n\\end{center}\n\n$\\operatorname{AgGe}_{9}\\left(\\mathrm{C}_{1}\\right)$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-18_1401_2023_497_1485}\n\n-a-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-18_2023_2361_503_1489}\n\n$\\operatorname{AgGe}_{13}\\left(\\mathrm{C}_{1}\\right)$\n\ne-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-18_2368_2596_226_1194}\n\n-C-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-18_2372_2630_1182_1466}\n\n$\\operatorname{AgGe}_{14}\\left(\\mathrm{C}_{1}\\right)$\n\n-a-\n\n-b-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-19_166_1490_182_1856}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-19_1496_1850_911_1185}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-19_1488_1865_250_504}\n\\end{center}\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-19_1493_1819_573_889}\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-19_1488_1864_250_1184}\n\n-e-\n\n$-\\mathrm{f}-$\n\nFigure 1. Ground-state structures and their corresponding isomers for $\\operatorname{AgGe}_{n}(n=1-19)$ clusters. For each size, the lowest-energy isomer is indicated in bold characters.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-20_196_674_246_1010}\n\n$\\operatorname{AuGe}_{5}\\left(\\mathrm{C}_{2 \\mathrm{v}}\\right)$\n\n-a-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-20_670_952_241_695}\n\n-b-\n\n$\\mathrm{AuGe}_{6}\\left(\\mathrm{C}_{2 \\mathrm{v}}\\right)$\n\n$-\\mathrm{C}-$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-20_716_950_704_1014}\n\n$-a-$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_1017_1222_251_457}\n\\end{center}\n\n$\\mathrm{AuGe}_{\\mathbf{8}}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$ -a-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_1301_1555_267_464}\n\\end{center}\n\n$\\mathrm{AuGe}_{9}\\left(\\mathrm{C}_{2 \\mathrm{v}}\\right)$\n\n-C-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-20_1016_1222_495_1025}\n\n$\\mathrm{AuGe}_{8}\\left(\\mathrm{C}_{1}\\right)$\n\n$\\mathrm{AuGe}_{8}\\left(\\mathrm{C}_{2}\\right)$\n\n-b-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_1356_1562_521_735}\n\\end{center}\n\n$\\mathrm{AuGe}_{9}\\left(\\mathrm{C}_{1}\\right)$\n\n-d-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_1680_1883_251_480}\n\\end{center}\n\n$\\mathrm{AuGe}_{10}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n$-\\mathrm{C}-$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-20_2012_2512_250_474}\n\n$\\underset{\\text {-b- }}{\\operatorname{AuGe}_{12}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)}$\n\n$\\mathrm{AuGe}_{13}\\left(\\mathrm{C}_{2 \\mathrm{v}}\\right)$\n\n-a-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_1369_1555_762_1014}\n\\end{center}\n\nAuGe $_{9}\\left(C_{1}\\right)$\n\n-e-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-20_1669_1885_492_988}\n\n$\\mathrm{AuGe}_{11}\\left(\\mathrm{C}_{1}\\right)$\n\n-a-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-20_1882_2212_518_956}\n\n$\\mathrm{AuGe}_{12}\\left(\\mathrm{C}_{1}\\right)$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_2333_2533_537_782}\n\\end{center}\n\n$\\operatorname{AuGe}_{13}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n-b-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-20_174_400_1068_1608}\n\n$\\mathrm{AuGe}_{3}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n-b-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-20_428_902_1004_1572}\n\n$\\mathrm{AuGe}_{7}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n-b-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_1032_1218_1068_1285}\n\\end{center}\n\n$\\mathrm{AuGe}_{8}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n$-\\mathrm{d}-$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_621_944_1256_1513}\n\\end{center}\n\n-C-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-20_1004_2206_778_1534}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_2217_2534_792_1035}\n\\end{center}\n\n$\\operatorname{AuGe}_{13}\\left(C_{1}\\right)$\n\n-c- $\\mathrm{AuGe}_{9}\\left(\\mathrm{C}_{1}\\right)$\n\n-f-\n\n$\\operatorname{AuGe}_{11}\\left(\\mathrm{C}_{1}\\right)$\n\n-C-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_1388_1599_1271_1533}\n\\end{center}\n\n-a-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-20_1683_2273_1088_1558}\n\n-e-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_2299_2527_1062_1262}\n\\end{center}\n\n$\\underset{\\text { AuGe }}{\\operatorname{Au}-}\\left(\\mathrm{C}_{1}\\right)$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_2326_2529_1274_1553}\n\\end{center}\n\n$\\mathrm{AuGe}_{13}\\left(\\mathrm{C}_{1}\\right)$\n\n-e-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_320_617_1575_1806}\n\\end{center}\n\n$\\mathrm{AuGe}_{6}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n-a-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_717_905_1569_1812}\n\\end{center}\n\n$\\mathrm{AuGe}_{7}\\left(\\mathrm{C}_{2 \\mathrm{v}}\\right)$\n\n$-\\mathrm{d}-$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_1005_1211_1615_1800}\n\\end{center}\n\n$\\underset{\\text {-b- }}{\\mathrm{AuGe}_{9}}\\left(\\mathrm{C}_{1}\\right)$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-20_1353_1548_1568_1802}\n\\end{center}\n\n$\\mathrm{AuGe}_{10}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n-b-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-20_1656_2522_1548_1828}\n\n$\\mathrm{AuGe}_{13}\\left(\\mathrm{C}_{1}\\right)$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-21_190_752_240_1186}\n\n$A_{u G e} \\mathbf{e}_{15}\\left(C_{s}\\right)$\n\n$-\\mathbf{c}-$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-21_754_1210_490_1104}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-21_180_425_1188_1553}\n\\end{center}\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-21_424_752_1201_1483}\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-21_180_752_1188_1552}\n\n$A_{u G e} G_{16}\\left(C_{1}\\right)$\n\n-b-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-21_183_411_1567_1808}\n\\end{center}\n\n$\\mathrm{AuGe}_{15}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n-b-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-21_508_760_1477_1813}\n\\end{center}\n\n$\\mathrm{AuGe}_{16}\\left(\\mathrm{C}_{1}\\right)$\n\n-C-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-21_845_1131_1114_1804}\n\n$\\mathrm{AuGe}_{17}\\left(\\mathrm{C}_{1}\\right)$\\\\\n-d-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-21_1209_1543_1048_1356}\n\\end{center}\n\n$-b-$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-21_1211_1953_637_1375}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-21_1121_1552_1438_1806}\n\\end{center}\n\n-a-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-21_1590_1950_243_642}\n\\end{center}\n\nFigure 2. Ground state structures and their corresponding isomers for $\\mathrm{AuGe}_{n}(n=1-19)$ clusters. For each size, the lowest-energy isomer is indicated in bold characters.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-22_320_532_267_919}\n\n$\\underset{-b-}{\\mathrm{CuGe}_{2}}\\left(\\mathrm{C}_{2 v}\\right)$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_578_730_264_433}\n\\end{center}\n\n$\\mathrm{CuGe}_{4}\\left(\\mathrm{C}_{3 \\mathrm{v}}\\right)$\n\n$-\\mathrm{C}^{-}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_862_999_253_478}\n\\end{center}\n\n$\\mathrm{CuGe}_{6}\\left(\\mathrm{C}_{1}\\right)$\n\n$-\\mathrm{d}-$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_1109_1301_251_480}\n\\end{center}\n\n$\\mathrm{CuGe}_{8}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n-C-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-22_1451_1685_246_804}\n\n$\\mathrm{CuGe}_{10}\\left(\\mathrm{C}_{1}\\right)$\n\n-a-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_594_725_712_875}\n\\end{center}\n\n$\\mathrm{CuGe}_{5}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n-b-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_815_1012_698_912}\n\\end{center}\n\n$\\mathrm{CuGe}_{7}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n-b-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_1061_1304_818_1009}\n\\end{center}\n\n$\\mathrm{CuGe}_{9}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n$-a-$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_590_735_914_1142}\n\\end{center}\n\n$\\mathrm{CuGe}_{5}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n-C-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_847_1004_927_1141}\n\\end{center}\n\n$\\mathrm{CuGe}_{7}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n$-\\mathrm{C}^{-}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_1089_1309_1074_1268}\n\\end{center}\n\n$\\mathrm{CuGe}_{9}\\left(\\mathrm{C}_{1}\\right)$\n\n-b-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_1403_1635_838_1035}\n\\end{center}\n\n$\\mathrm{CuGe}_{10}\\left(\\mathrm{C}_{1}\\right)$\n\n-b-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_1738_1963_246_503}\n\\end{center}\n\n$\\mathrm{CuGe}_{11}\\left(\\mathrm{C}_{1}\\right)$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-22_1412_1982_728_1280}\n\n-c-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_551_728_1165_1371}\n\\end{center}\n\n$\\mathrm{CuGe}_{6}\\left(\\mathrm{C}_{5 \\mathrm{v}}\\right)$\n\n$-\\mathrm{a}^{-}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_842_1002_1158_1378}\n\\end{center}\n\n$\\mathrm{CuGe}_{7}\\left(\\mathrm{C}_{2 \\mathrm{v}}\\right)$\n\n-d-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_2100_2275_249_505}\n\\end{center}\n\n$\\mathrm{CuGe}_{12}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n-d- $\\mathrm{CuGe}_{11}\\left(\\mathrm{C}_{2 \\mathrm{v}}\\right)$\n\n-d-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-22_1728_2282_514_1278}\n\n$\\mathrm{CuGe}_{12}\\left(\\mathrm{C}_{1}\\right)$\n\n$\\mathrm{Ge}_{12}\\left(\\mathrm{C}_{1}\\right)$\\\\\n$-\\mathrm{e}-$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_2077_2274_708_1005}\n\\end{center}\n\n$\\mathrm{CuGe}_{13}\\left(\\mathrm{C}_{1}\\right)$\n\na-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_2059_2333_1001_1284}\n\\end{center}\n\n-b-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_1055_1309_1254_1579}\n\\end{center}\n\n$\\mathrm{CuGe}_{9}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n$-\\mathrm{C}-$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_1413_1643_1313_1588}\n\\end{center}\n\n$\\mathrm{CuGe}_{10}\\left(\\mathrm{C}_{1}\\right)$\\\\\n$-\\mathrm{d}-$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-22_1745_2339_1272_1512}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_343_445_1615_1806}\n\\end{center}\n\n$\\mathrm{CuGe}_{4}\\left(\\mathrm{C}_{1}\\right)$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_485_731_1589_1803}\n\\end{center}\n\n$\\mathrm{CuGe}_{6}\\left(\\mathrm{C}_{\\mathrm{s}}\\right)$\n\n-C-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_831_1002_1590_1802}\n\\end{center}\n\n$\\mathrm{CuGe}_{8}\\left(\\mathrm{C}_{1}\\right)$\n\n$-\\mathrm{b}-$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_1069_1306_1615_1812}\n\\end{center}\n\n$\\mathrm{CuGe}_{9}\\left(\\mathrm{C}_{1}\\right)$\n\n-d-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-22_1393_1696_1600_1803}\n\\end{center}\n\n-a-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-22_1748_2340_1506_1812}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-23_310_638_230_490}\n\\end{center}\n\n-a-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-23_678_1298_238_1192}\n\n\\begin{itemize}\n  \\item C-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-23_1258_1662_243_1169}\n\\end{itemize}\n\n$\\mathrm{CuGe}_{17}\\left(\\mathrm{C}_{1}\\right)$\\\\\n-b-\n\nCuGeris (C)\n\n-a-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-23_1676_1979_251_480}\n\\end{center}\n\n$\\mathrm{CuGe}_{17}\\left(\\mathrm{C}_{1}\\right)$\n\n-C-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-23_666_2028_503_1485}\n\n$\\mathrm{CuGe}_{16}\\left(\\mathrm{C}_{1}\\right)$\n\n-a-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-23_1000_1590_1189_1483}\n\n$\\mathrm{CuGe}_{18}\\left(\\mathrm{C}_{1}\\right)$\n\n-b-\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-23_311_642_1508_1782}\n\\end{center}\n\n$-a-$\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-23_687_1249_1478_1826}\n\n-C-\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-23_1334_1942_1496_1804}\n\n$\\mathrm{CuGe}_{19}\\left(\\mathrm{C}_{2 \\mathrm{v}}\\right)$\n\nFigure 3. Ground state structures and their corresponding isomers for $\\mathrm{CuGe}_{n}(n=1-19)$ clusters. For each size, the lowest-energy isomer is indicated in bold characters.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-24_389_1161_519_1541}\n\\end{center}\n\nFigure 4. Size dependence of the binding energy per atoms for the ground state structures of $\\mathrm{MGe}_{n}$ $(\\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}, \\mathrm{Au})$ clusters.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-25_455_1231_497_1541}\n\\end{center}\n\nFigure 5. Second energy differences $\\left(\\Delta_{2} E\\right)$ for the ground state structures of $M_{n}(M=C u, A g$, Au) clusters.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-26_298_1073_516_1544}\n\\end{center}\n\nFigure 6. Size dependence of the HOMO-LUMO gap for the ground state structures of $\\mathrm{MGe}_{n}$ $(\\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}, \\mathrm{Au})$ clusters.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-27_325_1100_512_1542}\n\\end{center}\n\nFigure 7. Size dependence of the vertical electron affinity for the ground state structures of $\\mathrm{MGe}_{\\mathrm{n}}$ $(\\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}, \\mathrm{Au})$ clusters.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-28_298_1073_515_1539}\n\\end{center}\n\nFigure 8. Size dependence of the vertical ionization potential for the ground state structures of $\\mathrm{MGe}_{\\mathrm{n}}(\\mathrm{M}=\\mathrm{Cu}, \\mathrm{Ag}, \\mathrm{Au})$ clusters. Figure 9. Density of states for the most stable isomer of $\\mathrm{CuGe}_{10,12,14}$ together with some representative Kohn-Sham molecular orbitals. More molecular orbitals are given in Supporting Information.\\\\\n\\includegraphics[max width=\\textwidth]{2023_09_22_f7714e3a468c91c6f56ag-29_552_2142_275_1785}Figure 10. Density of states of the lowest-energy isomer of cage-like $\\mathrm{MGe}_{\\mathrm{n}}(\\mathrm{M}=\\mathrm{Ag}, \\mathrm{Au} ; \\mathrm{n}=12$, 14,15 ), i.e. an endohedral structure for $n=12$ and 14 , and a hollow cage for $n=15$. Kohn-Sham molecular orbitals are given in Supporting Information.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_f7714e3a468c91c6f56ag-30_584_1182_249_1367}\n\n\n\\end{document}", "record_id": "2023_09_22_f7714e3a468c91c6f56ag"}