{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{bbold}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\n\\title{Re polymers }\n\n\n\\author{Shuzhong $\\mathrm{He}^{1}$, Masakazu Mukaida ${ }^{2,3}$, Kazuhiro Kirihara ${ }^{2}$, Lingyun Lyu ${ }^{3}$ and\\\\\nQingshuo Wei ${ }^{2,3,4, *(\\mathbb{D}}$\\\\\n1 School of Pharmaceutical Sciences, Guizhou University, Guiyang 550025, China; pmc.szhe@gzu.edu.cn\\\\\n2 Nanomaterials Research Institute, Department of Materials and Chemistry, National Institute of Advanced\\\\\nIndustrial Science and Technology (AIST), 1-1-1 Higashi, Tsukuba 305-8565, Japan;\\\\\nmskz.mukaida@aist.go.jp (M.M.); kz-kirihara@aist.go.jp (K.K.)\\\\\n3 AIST-UTokyo Advanced Operando-Measurement Technology Open Innovation\\\\\nLaboratory (OPERANDO-OIL), National Institute of Advanced Industrial Science and Technology,\\\\\n1-1-1 Higashi, Tsukuba 305-8565, Japan; jessica0107.lyu@aist.go.jp\\\\\n4 Precursory Research for Embryonic Science and Technology (PRESTO), Japan Science and Technology\\\\\nAgency, 4-1-8 Honcho, Kawaguchi 332-0012, Japan\\\\\n* Correspondence: qingshuo.wei@aist.go.jp; Tel.: +81-29-861-3385}\n\\date{}\n\n\n\\begin{document}\n\\maketitle\nArticle\n\n\\section{Reversible Protonic Doping in Poly(3,4-Ethylenedioxythiophene)}\nReceived: 6 September 2018; Accepted: 23 September 2018; Published: 25 September 2018\n\ncheck for updates\n\n\\begin{abstract}\nIn this study, poly(3,4-ethylenedioxythiophene), a benchmark-conducting polymer, was doped by protons. The doping and de-doping processes, using protonic acid and a base, were fully reversible. We predicted possible doping sites along the polymer chain using density functional theory (DFT) calculations. This study sheds potential light and understanding on the molecular design of highly conductive organic materials.\n\\end{abstract}\n\nKeywords: organic semiconductor; oxidative doping; protonic doping\n\n\\section{Introduction}\nPrevious studies have successfully used conducting polymers, as active materials, in different electronic devices such as organic light-emitting diodes (OLEDs), organic solar cells (OSCs), thin film transistors (TFTs), thermoelectrics, batteries, and biosensors [1]. Among the different types of conducting polymers, poly(3,4-ethylenedioxythiophene) (PEDOT) has received the most attention, both academically and in practical applications [2]. It is widely applied as a hole-transporting layer in OLEDs and OSCs and as a source-drain-gate electrode for TFTs. Oxygen reduction catalysts also use PEDOT as a replacement for $\\mathrm{Pt}$ in fuel cells [3]. More recently, PEDOT has been used as a thermoelectric material to directly convert heat into electricity [4-9]. The solution-processable PEDOT film was able to provide high electrical conduction $(>4000 \\mathrm{~S} / \\mathrm{cm})$, and single-crystal PEDOT nanowires, synthesized under geometrically-confined conditions, provided electrical conduction as high as $8000 \\mathrm{~S} / \\mathrm{cm}$ [10-12]. It is reasonable to believe that the highly conductive PEDOT films were doped at the high levels. However, doping mechanisms are still not well understood. This lack of understanding places limitations on the design of highly conductive organic materials, on further improvements to PEDOT system applications in various devices (e.g., optimization of the thermoelectric properties of PEDOT based materials), and on the understanding of how oxygen reduction mechanisms work in a wide $\\mathrm{pH}$ range [3,13].\n\nPrevious studies have identified two different doping mechanisms in $p$-type conducting polymers [14,15]. The first is oxidative doping, a chemical oxidation reaction, based on a charge transfer from the host to the dopant. Conducting polymers doped with $\\mathrm{I}_{2}, \\mathrm{FeCl}_{3}, \\mathrm{SbCl}_{5}$, and tetracyanoquinodimethane (TCNQ) are based on oxidative doping mechanisms [15]. The second is protonic doping, which has been studied in nitrogen-containing organic semiconductors (e.g., polyaniline) [16-18]. Protons interact at the nitrogen sites in these polymers, and the charge delocalizes within the polymer chains, providing electronic conductivity. PEDOT is known to be synthesized using $\\mathrm{Fe}^{3+}$ or peroxodisulfate as an oxidant and has no nitrogen sites in it [19]. Therefore, in general, it is believed that PEDOT is oxidatively doped by oxidizing agents.\n\nUsing spectroscopic analysis to monitor the amount of oxidizing agents during polymerization, previous studies have reported that one positive charge exists for every three thiophene rings. The maximum carrier concentration via oxidation is approximately $3 \\times 10^{20} \\mathrm{~cm}^{-3}$, assuming that the weight ratio between PEDOT and the dopant polystyrene sulfonate (PSS) is 1:2.5 [2]. Using the maximum carrier density, for a film with an electrical conductivity of $4000 \\mathrm{~S} / \\mathrm{cm}$, the calculated carrier mobility is greater than $80 \\mathrm{~cm}^{2}$ /Vs. This value was too high, even when compared with single-crystal organic semiconductors [20,21], and indicates that PEDOT carrier concentrations should be much larger than the value that is obtained when only considering oxidative doping. In other words, there is a possible presence of protonic doping in the PEDOT system. In this study, we show that there is protonic doping in PEDOT and that the doping/de-doping process is fully reversible in a solid state. Using density functional theory (DFT) calculations, we propose the possible doping sites in the polymer chains. This study is not only important for PEDOT applications but could also contribute toward the molecular design of highly conductive organic materials.\n\n\\section{Experimental Section}\n\\subsection{Materials}\nPEDOT:PSS (Clevios PH1000) was purchased from H.C. Starck (Goslar, Germany). Sulfuric acid, potassium hydroxide and ethylene glycol were purchased from TCI Chemicals (Tokyo, Japan).\n\n\\subsection{Film Preparation}\nAn aqueous PEDOT:PSS solution containing 3\\% EG was used as the ink. Adding EG to the PEDOT:PSS solution (or treating the PEDOT/PSS film by EG) improved the crystallinity of PEDOT and the ordering of the PEDOT nanocrystals in the solid films [22]. The PEDOT/PSS film was first spin coated onto glass and annealed at $150^{\\circ} \\mathrm{C}$ for $10 \\mathrm{~min}$ in air. The film treatment was then carried out by immersing the film in different solutions for $5 \\mathrm{~min}$ and then drying it in air at $150^{\\circ} \\mathrm{C}$ for $5 \\mathrm{~min}$.\n\n\\subsection{Characterization}\nThe film thickness was measured using a surface profilometer (Surfcoder ET 200, Kosaka Laboratory Ltd., Tokyo, Japan). The conductivity was also cross-checked using a four-probe conductivity meter (MCP-T600, Mitsubishi Chemical Corporation, Tokyo, Japan). The ultraviolet-visible-near-infrared (UV-Vis-NIR) spectra were acquired using a UV-Vis-NIR spectrometer (Solidspec-3700, Shimadzu, Kyoto, Japan). The FTIR spectra were acquired using an ALPHA FTIR Spectrometer from Bruker, Yokohama, Japan. The Seebeck coefficient was measured using a laboratory-built apparatus, and the technique used to measure the Seebeck coefficient is reported in a previous study [23,24]. All calculations were performed using the Gaussian 09 Rev. E. 01 program.\n\n\\section{Results and Discussion}\nWe focused on color changes in the PEDOT/PSS film during fabrication under varying conditions. Figure 1 displays the ultraviolet-visible-near-infrared (UV-Vis-NIR) spectra for a 50-nm PEDOT/PSS film. In this figure, the black line represents the as-prepared sample. After treatment in a solution of $1 \\mathrm{M}$ $\\mathrm{H}_{2} \\mathrm{SO}_{4}$, the film's absorption increased at wavelengths larger than $1200 \\mathrm{~nm}$ and decreased at wavelengths lower than $1200 \\mathrm{~nm}$, resulting in a more transparent film. However, when we treated the as-prepared PEDOT/PSS film in a solution of $\\mathrm{KOH}$ we observed trends that were opposite to those for the $\\mathrm{H}_{2} \\mathrm{SO}_{4}$ treatment: The film's absorption decreased at wavelengths higher than $1200 \\mathrm{~nm}$, polaron absorption occurred at approximately $950 \\mathrm{~nm}$, and neutral-state absorption at approximately $650 \\mathrm{~nm}$, resulting in a blue film. The free-standing PEDOT/PSS films treated with $\\mathrm{KOH}$ became IR transparent, and the $\\mathrm{C}=\\mathrm{O}$, $\\mathrm{C}-\\mathrm{H}$, and $-\\mathrm{SO}_{3}{ }^{-}$vibrations were observable (Figure 2). This result suggested that the number of free carriers in the film increased after $\\mathrm{H}_{2} \\mathrm{SO}_{4}$ treatment and decreased after $\\mathrm{KOH}$ treatment. Please note that the PEDOT film is much thinner on $\\mathrm{KBr}$ substrates and is partly transparent in the IR range which makes the FTIR measurement on doped PEDOT/PSS films possible [25]. We could not observe other peaks such as the free $\\mathrm{SO}^{4-}$ in our samples, which may relate to lower transmittance of our samples.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d90e94cbd96e4b6ddb8bg-03_667_1412_524_1532}\n\\end{center}\n\nFigure 1. Absorption spectra of films synthesized from PEDOT/PSS (poly(3,4-ethylenedioxythiophene)/polystyrene sulfonate): $\\mathrm{H}_{2} \\mathrm{SO}_{4}$-treated PEDOT/PSS and $\\mathrm{KOH}$-treated PEDOT/PSS.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d90e94cbd96e4b6ddb8bg-03_1585_2350_518_1532}\n\\end{center}\n\nFigure 2. FTIR spectra of a free-standing PEDOT/PSS film before (red dotted line) and after (solid line) $1 \\mathrm{M} \\mathrm{KOH}$ treatment.\n\nIt is well known that acid treatment can enhance the electrical conductivity of PEDOT [11,12,26,27]. This is mainly attributed to the removal of the insulating PSS $^{-}$and the morphological change of the film. In this study, we firstly compared the film absorption in the UV range of four samples: PEDOT/PSS without any additional treatment (PH1000), $\\mathrm{PEDOT} / \\mathrm{PSS}$ treated with $\\mathrm{H}_{2} \\mathrm{SO}_{4}\\left(\\mathrm{PH} 1000 \\rightarrow \\mathrm{H}_{2} \\mathrm{SO}_{4}\\right)$, PEDOT/PSS treated with EG $\\left(\\mathrm{PH} 1000 \\rightarrow\\right.$ EG), and PEDOT/PSS treated with EG and $\\mathrm{H}_{2} \\mathrm{SO}_{4}(\\mathrm{PH} 1000$ $\\rightarrow \\mathrm{EG} \\rightarrow \\mathrm{H}_{2} \\mathrm{SO}_{4}$ ). This experiment was conducted using the same film with an alignment mark to avoid the effect of film thickness on the absorbance measurement. As shown in Figure 3a, after $\\mathrm{H}_{2} \\mathrm{SO}_{4}$ treatment, the absorption of PEDOT/PSS at $225 \\mathrm{~nm}$ decreased suggesting the removal of the insulating PSS $^{-}$, whereas, the electrical conductivity significantly increased to ca. $2000 \\mathrm{~S} / \\mathrm{cm}$ (Table 1). A similar tendency was observed in the EG treated films. In Figure 3b, after EG treatment, the absorption of PEDOT/PSS decreased and the electrical conductivity increased to ca. $1000 \\mathrm{~S} / \\mathrm{cm}$. Interestingly, when we further treated this film using $\\mathrm{H}_{2} \\mathrm{SO}_{4}$, the absorption in the UV range did not show a significant change, suggesting the amount of $\\mathrm{PSS}^{-}$remained constant. On the other hand, the electrical conductivity further increased to ca. $2000 \\mathrm{~S} / \\mathrm{cm}$, which was almost identical to the film treated with $\\mathrm{H}_{2} \\mathrm{SO}_{4}\\left(\\mathrm{PH} 1000 \\rightarrow \\mathrm{H}_{2} \\mathrm{SO}_{4}\\right)$. These results suggest that, besides the removal of the insulating PSS $^{-}$, the treatment of $\\mathrm{H}_{2} \\mathrm{SO}_{4}$ also enhanced the electrical conductivity of the films.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_d90e94cbd96e4b6ddb8bg-04_914_1438_340_1738}\n\nFigure 3. Absorption spectra of: (a) PEDOT/PSS films and $\\mathrm{H}_{2} \\mathrm{SO}_{4}$-treated PEDOT/PSS films; (b) PEDOT films, EG-treated PEDOT/PSS films and $\\mathrm{H}_{2} \\mathrm{SO}_{4}-\\mathrm{EG}$-treated PEDOT/PSS films.\n\nTable 1. Summary of the electrical conductivity for different samples.\n\n\\begin{center}\n\\begin{tabular}{cc}\n\\hline\nSample Name & Electrical Conductivity $\\mathbf{( S / c m )}$ \\\\\n\\hline\n$\\mathrm{PH} 1000$ & $2.5 \\pm 1.2$ \\\\\n$\\mathrm{PH} 1000 \\rightarrow \\mathrm{H}_{2} \\mathrm{SO}_{4}$ & $2118 \\pm 102$ \\\\\n$\\mathrm{PH} 1000 \\rightarrow \\mathrm{EG}$ & $971 \\pm 166$ \\\\\n$\\mathrm{PH} 1000 \\rightarrow \\mathrm{EG} \\rightarrow \\mathrm{H}_{2} \\mathrm{SO}_{4}$ & $1968 \\pm 150$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nAnother possible mechanism of acid treatment is that the charge transportation is enhanced by the cations. Since PEDOT is a p-type semiconductor, the Coulombic interaction between PSS $^{-}$and moving carriers may be screened by a cation. To confirm this effect, we treated the films using $\\mathrm{Li}_{2} \\mathrm{SO}_{4}$, $\\mathrm{Na}_{2} \\mathrm{SO}_{4}$, and $\\mathrm{K}_{2} \\mathrm{SO}_{4}$. As shown in Table 2, the electrical conductivity was not significantly enhanced, like it was by $\\mathrm{H}_{2} \\mathrm{SO}_{4}$, suggesting that protons played an important role in the electrical conductivity enhancement. As an assumption here, we believed that protons enhanced the carrier concentration in the PEDOT/PSS films which caused the electrical conductivity to increase.\n\nTable 2. Summary of the electrical conductivity for different samples.\n\n\\begin{center}\n\\begin{tabular}{cc}\n\\hline\nSample Name & Electrical Conductivity (S/cm) \\\\\n\\hline\n$\\mathrm{PH} 1000 \\rightarrow \\mathrm{Li}_{2} \\mathrm{SO}_{4}$ & $3.7 \\pm 0.5$ \\\\\n$\\mathrm{PH} 1000 \\rightarrow \\mathrm{EG} \\rightarrow \\mathrm{Li}_{2} \\mathrm{SO}_{4}$ & $950 \\pm 120$ \\\\\n$\\mathrm{PH} 1000 \\rightarrow \\mathrm{Na}_{2} \\mathrm{SO}_{4}$ & $2.4 \\pm 0.3$ \\\\\n$\\mathrm{PH} 1000 \\rightarrow \\mathrm{EG} \\rightarrow \\mathrm{Na}_{2} \\mathrm{SO}_{4}$ & $932 \\pm 77$ \\\\\n$\\mathrm{PH} 1000 \\rightarrow \\mathrm{K}_{2} \\mathrm{SO}_{4}$ & $2.4 \\pm 0.1$ \\\\\n$\\mathrm{PH} 1000 \\rightarrow \\mathrm{EG} \\rightarrow \\mathrm{K}_{2} \\mathrm{SO}_{4}$ & $998 \\pm 167$ \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\nDirect measurement of the PEDOT carrier concentration and mobility using the Hall effect is challenging because it is a disordered system [28]. To confirm carrier concentration changes during the $\\mathrm{KOH}$ and $\\mathrm{H}_{2} \\mathrm{SO}_{4}$ treatments, we analyzed the thermopower of the films (i.e., the Seebeck coefficient). The Seebeck coefficient is sensitive to the film's carrier density but less sensitive to the film's morphology [29]. Recent studies have shown that the thermoelectric performance of PEDOT can be optimized using acid or base treatments, although these mechanisms are not clear [6,7,30]. Comparing the film's Seebeck coefficient after each different treatment is a conclusive experiment to understand relative carrier number changes in the film. We measured the Seebeck coefficient using a home-made setup (details are reported in previous research). The PEDOT/PSS film Seebeck coefficients were measured for temperature differences between 1 and $8 \\mathrm{~K}$. The values of $S$ were calculated from the slopes of the $\\Delta V$ versus $\\Delta T$ plots. As shown in Figure 4 , the as-prepared PEDOT/PSS films (PH1000 with EG) yielded a Seebeck coefficient of $18 \\mu \\mathrm{V} / \\mathrm{K}$, which is close to those of the films reported in previous studies [29]. The electrical conductivity was $\\sim 1000 \\mathrm{~S} / \\mathrm{cm}$. After treatment with $1 \\mathrm{M} \\mathrm{H}_{2} \\mathrm{SO}_{4}$, the Seebeck coefficient decreased to $\\sim 10 \\mu \\mathrm{V} / \\mathrm{K}$ and the electrical conductivity increased to $2025 \\mathrm{~S} / \\mathrm{cm}$. This suggested that the number of holes in the PEDOT/PSS film increased after acid treatment. When treated with a $1 \\mathrm{M} \\mathrm{KOH}$ solution, we obtained an increased Seebeck coefficient of $35 \\mu \\mathrm{V} / \\mathrm{K}$ for the film and a decreased electrical conductivity of $53 \\mathrm{~S} / \\mathrm{cm}$. With higher concentrations of $\\mathrm{KOH}$, we observed Seebeck coefficients as high as $142 \\mu \\mathrm{V} / \\mathrm{K}$ with much lower electrical conductivity (i.e., smaller than $1 \\mathrm{~S} / \\mathrm{cm}$ ). This suggested that the carrier concentration significantly decreased after treatment with a base. The $\\mathrm{KOH}$ treatment did not change the amount of PSS $^{-}$in the film, as shown in Supporting Information (Figure S1). This carrier concentration change trend is consistent with observations made using UV-Vis-NIR, as shown in Figure 1. Table 3 summarizes the film's electrical conductivity and Seebeck coefficients using $\\mathrm{KOH}$ and $\\mathrm{H}_{2} \\mathrm{SO}_{4}$ treatments.\n\nTable 3. Summary of the electrical conductivity and Seebeck coefficients for different samples.\n\n\\begin{center}\n\\begin{tabular}{ccc}\n\\hline\nSample Name & Electrical Conductivity $\\mathbf{( S / c m )}$ & Seebeck Coefficient $(\\boldsymbol{\\mu} \\mathbf{V} / \\mathbf{K})$ \\\\\n\\hline\nAs prepared (PH1000-EG) & 1012 & 18 \\\\\n$1 \\mathrm{M} \\mathrm{H}_{2} \\mathrm{SO}_{4}$ treated & 2025 & 10 \\\\\n$1 \\mathrm{M} \\mathrm{KOH}_{2}$ treated & 53 & 35 \\\\\n$5 \\mathrm{M} \\mathrm{KOH}$ treated & $0.9$ & 142 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d90e94cbd96e4b6ddb8bg-05_1750_2499_478_1549}\n\\end{center}\n\nFigure 4. Seebeck coefficient measurements for PEDOT/PSS films treated under varying conditions.\n\nIf protons interact with polymer chains similar to polyaniline, the doping/de-doping process using $\\mathrm{H}^{+}$and $\\mathrm{OH}^{-}$should be reversible with the same type of film that was employed herein [16]. To confirm protonic doping reversibility for PEDOT/PSS films, we monitored film absorption at $1600 \\mathrm{~nm}$, the Seebeck coefficient, and the electrical conductivity during $\\mathrm{H}_{2} \\mathrm{SO}_{4} / \\mathrm{KOH}$ treatment cycles. As shown in Figure 5a, the Seebeck coefficient decreased during the $\\mathrm{H}_{2} \\mathrm{SO}_{4}$ treatment, and the electrical conductivity (Figure 5b) and absorption at wavelengths greater than $1200 \\mathrm{~nm}$ (Figure $5 \\mathrm{c}$ ) increased. On the contrary, when we treated the film with $\\mathrm{KOH}$, the Seebeck coefficient increased, whereas electrical conductivity and absorption at wavelengths greater than $1200 \\mathrm{~nm}$ decreased. It is worth noting that the doping and de-doping processes are fully reversible when using the same film. This suggests that protons are capable of reacting with polymer chains even when in a solid state.\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d90e94cbd96e4b6ddb8bg-06_734_1299_682_1465}\n\\end{center}\n\n(b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d90e94cbd96e4b6ddb8bg-06_1316_1870_654_1465}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d90e94cbd96e4b6ddb8bg-06_1886_2454_658_1466}\n\\end{center}\n\nFigure 5. Reversibility of doping and de-doping performed on a poly(3,4-ethylenedioxythiophene)/polystyrene sulfonate (PEDOT/PSS) film with $\\mathrm{H}_{2} \\mathrm{SO}_{4}$ and $\\mathrm{KOH}$ treatments. (a) Seebeck coefficient, (b) electrical conductivity, and (c) film absorbance at $1600 \\mathrm{~nm}$. We experimentally confirmed that the proton concentration affects the PEDOT carrier concentration. However, it is not clear how to obtain the doping sites from the experiment because PEDOT is not soluble in the solvent after film formation. DFT methods were used to understand proton-PEDOT integration mechanisms [31]. First, we optimized octa-EDOT at the B3LYP/6-31G(d) theory level (The number of repeating units in PEDOT is between 6 to 10; we chose octamater for our calculations), as shown in Figure 6a. We subsequently optimized adducts with protons independently bound to C- (Figure 6b), S- (Figure 6c,d), and O- (Figure 6e,f) atoms in the octa-EDOT compound. The relative energies determined from the optimized structures showed that, compared with adduct formation at other positions, the adduct formation at the $\\alpha$-position of thiophene is the most favorable at a minimum of $\\sim 50 \\mathrm{Kcal} / \\mathrm{mol}$. This is consistent with current knowledge of the reactivity of thiophene as the $\\alpha$-position is known to be active and the HOMO electron density at the $\\alpha$-position is known to be high [32,33]. It is important to note that there are not a small number of $\\alpha$-positions on the end-thiophene, because the PEDOT molecular weight is low, which suggests that only protonation at the end-thiophene $\\alpha$-position could provide a high carrier density. Adducts with protons bound to the S-atom in the middle thiophene rings are a second favorable position (Figure $6 c$ ). Recent studies have shown that polythiophene with a much larger molecular weight (i.e., a small amount of end-thiophene) is also able to be doped by protons, providing high electrical conductivity [34,35]. The probability of adduction formation with protons bound to $\\mathrm{O}$-atoms is unlikely. There are significant structural changes to adducts with protons bound to $\\mathrm{O}-$ atoms (e.g., the proton is far from oligothiophene or a thiophene ring opens, as shown in Figure $6 e, f)$. In the $\\pi$-conjugated backbone, protons bound to carbon have $\\mathrm{sp}^{3}$ bonds which break the conjugation [36]. It is important to point out that protonic acid is not always used as a starting material during PEDOT synthesis. However, the polymerization process generates protonic acid.\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d90e94cbd96e4b6ddb8bg-07_1459_1739_378_1004}\n\\end{center}\n\n(c)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d90e94cbd96e4b6ddb8bg-07_1793_1982_405_988}\n\\end{center}\n\n$-225.27 \\mathrm{Kcal} / \\mathrm{mol}$ (b)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d90e94cbd96e4b6ddb8bg-07_1446_1740_1019_1665}\n\\end{center}\n\n(d)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d90e94cbd96e4b6ddb8bg-07_1768_1990_1028_1628}\n\\end{center}\n\n$-219.68 \\mathrm{Kcal} / \\mathrm{mol}$\n\n(e)\n\n(f)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d90e94cbd96e4b6ddb8bg-07_2103_2329_387_1007}\n\\end{center}\n\n$-212.28 \\mathrm{Kcal} / \\mathrm{mol}$\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_d90e94cbd96e4b6ddb8bg-07_2119_2376_1067_1691}\n\\end{center}\n\nFigure 6. Ground-state geometry optimizations of: (a) octa-EDOT, adducts with $\\mathrm{H}^{+}$on (b) carbon of the end-thiophene, (c) sulfur of the middle thiophene, (d) sulfur of the end-thiophene, (e) oxygen of the middle thiophene, and (f) oxygen of the end-thiophene. The $\\mathrm{H}^{+}$atoms are light-blue in color and are indicated by blue arrows. Optimized structures were calculated using density functional theory (DFT) at the B3LYP/6-31G(d) theory level. Relative energies are shown under each diagram. Finally, it is important to point out that the reversible change of electrical conductivity [37] and Seebeck coefficient [7] during acid/base treatment has been reported by Ouyang's group [7] and Okuzaki's group [37], although there are differences in the proposed mechanisms. Okuzaki's group suggested that $\\mathrm{OH}^{-}$treatment of PEDOT/PSS films disrupts $\\pi-\\pi$ stacking of PEDOT nanocrystals and therefore the electrical conductivity decreases. The addition of $\\mathrm{H}_{2} \\mathrm{SO}_{4}$ then restores this structure, and hence the conductivity increased again. Ouyang's group suggested that there is a strong Coulombic attraction between $\\mathrm{OH}^{-}$and $\\mathrm{PEDOT}^{+}$, so the charge carriers become more localized after $\\mathrm{OH}^{-}$ treatment. Experimental results support both mechanisms. Their reports also reflected the fact that doping in PEDOT/PSS is still not fully understood, and thus, we trust that the protonic doping of PEDOT proposed in this paper is not in contradiction to the proposed mechanisms by pioneering groups. It is known that the carrier localization is strongly dependent on carrier concentration in the doped organic semiconductors [38]. A decrease in carrier concentration after $\\mathrm{OH}^{-}$treatment could also make the remaining charge carriers more localized due to Coulombic interaction.\n\n\\section{Conclusions}\nIn conclusion, we showed that: Protons dope PEDOT; protonic doping/de-doping is fully reversible; adducts with protons bound at the end-thiophene $\\alpha$-position are most favorable, based on DFT calculations; adducts with protons bound to the S-atom in the middle thiophene ring are also possible; and the use of protonated EDOT moieties, as an end group to prepare organic conductors, is a promising approach toward synthesizing highly conductive organic materials.\n\nSupplementary Materials: The following are available online at \\href{http://www.mdpi.com/2073-4360/10/10/1065/s1}{http://www.mdpi.com/2073-4360/10/10/1065/s1}.\n\nAuthor Contributions: Q.W. conceived and designed the experiments; S.H., M.M., and L.L. performed the experiments and analyzed the data; K.K. contributed reagents/materials/analysis tools; and S.H. wrote the paper. Authorship is limited to those who have contributed substantially to the work reported.\n\nAcknowledgments: This research was partly supported by JST, PRESTO, JPMJPR17R1. S.H. also acknowledges the financial support from Science and Technology Foundation of Guizhou (Grant No. J[2015]2047).\n\nConflicts of Interest: The authors declare no conflicts of interest.\n\n\\section{References}\n\\begin{enumerate}\n  \\item Forrest, S.R.; Thompson, M.E. Introduction: Organic Electronics and Optoelectronics. Chem. Rev. 2007, 107, 923-925. [CrossRef]\n\n  \\item Elschner, A.; Lovenich, W.; Merker, U.; Reuter, K. PEDOT: Principles and Applications of an Intrinsically Con-Ductive Polymer; CRC Press: Boca Raton, FL, USA, 2010.\n\n  \\item Winther-Jensen, B.; Winther-Jensen, O.; Forsyth, M.; MacFarlane, D.R. High Rates of Oxygen Reduction over a Vapor Phase-Polymerized PEDOT Electrode. Science 2008, 321, 671-674. [CrossRef] [PubMed]\n\n  \\item Bubnova, O.; Khan, Z.U.; Malti, A.; Braun, S.; Fahlman, M.; Berggren, M.; Crispin, X. Optimization of the thermoelectric figure of merit in the conducting polymer poly(3,4-ethylenedioxythiophene). Nat. Mater. 2011, 10, 429-433. [CrossRef] [PubMed]\n\n  \\item Wei, Q.; Mukaida, M.; Kirihara, K.; Naitoh, Y.; Ishida, T. Recent Progress on PEDOT-Based Thermoelectric Materials. Materials 2015, 8, 732-750. [CrossRef] [PubMed]\n\n  \\item Khan, Z.U.; Bubnova, O.; Jafari, M.J.; Brooke, R.; Liu, X.; Gabrielsson, R.; Ederth, T.; Evans, D.R.; Andreasen, J.W.; Fahlman, M.; et al. Acido-basic control of the thermoelectric properties of poly(3,4-ethylenedioxythiophene)tosylate (PEDOT-Tos) thin films. J. Mater. Chem. C 2015, 3, 10616-10623. [CrossRef] [PubMed]\n\n  \\item Zeng, F.; Pengcheng, L.; Donghe, D.; Jianyong, O. Significantly Enhanced Thermoelectric Properties of PEDOT:PSS Films through Sequential Post-Treatments with Common Acids and Bases. Adv. Energy Mater. $2017,7,1602116$.\n\n  \\item Kim, G.H.; Shao, L.; Zhang, K.; Pipe, K.P. Engineered doping of organic semiconductors for enhanced thermoelectric efficiency. Nat. Mater. 2013, 12, 719-723. [CrossRef] [PubMed] 9. Bubnova, O.; Khan, Z.U.; Wang, H.; Braun, S.; Evans, D.R.; Fabretto, M.; Hojati-Talemi, P.; Dagnelund, D.; Arlin, J.-B.; Geerts, Y.H.; et al. Semi-metallic polymers. Nat. Mater. 2014, 13, 190-194. [CrossRef] [PubMed]\n\n  \\item Cho, B.; Park, K.S.; Baek, J.; Oh, H.S.; Koo Lee, Y.-E.; Sung, M.M. Single-Crystal Poly(3,4-ethylenedioxythiophene) Nanowires with Ultrahigh Conductivity. Nano Lett. 2014, 14, 3321-3327. [CrossRef] [PubMed]\n\n  \\item Kim, N.; Kee, S.; Lee, S.H.; Lee, B.H.; Kahng, Y.H.; Jo, Y.-R.; Kim, B.-J.; Lee, K. Highly Conductive PEDOT:PSS Nanofibrils Induced by Solution-Processed Crystallization. Adv. Mater. 2014, 26, 2268-2272. [CrossRef] [PubMed]\n\n  \\item Mengistie, D.A.; Ibrahem, M.A.; Wang, P.-C.; Chu, C.-W. Highly Conductive PEDOT:PSS Treated with Formic Acid for ITO-Free Polymer Solar Cells. ACS Appl. Mater. Interfaces 2014, 6, 2292-2299. [CrossRef] [PubMed]\n\n  \\item Mitraka, E.; Jafari, M.J.; Vagin, M.; Liu, X.; Fahlman, M.; Ederth, T.; Berggren, M.; Jonsson, M.P.; Crispin, X. Oxygen-induced doping on reduced PEDOT. J. Mater. Chem. A 2017, 5, 4404-4412. [CrossRef] [PubMed]\n\n  \\item MacDiarmid, A.G. \"Synthetic Metals\": A Novel Role for Organic Polymers (Nobel Lecture). Angew. Chem. Int. Ed. 2001, 40, 2581-2590. [CrossRef]\n\n  \\item Lüssem, B.; Riede, M.; Leo, K. Doping of organic semiconductors. Phys. Status Solidi A $2013,210,9-43$. [CrossRef]\n\n  \\item Chiang, J.-C.; MacDiarmid, A.G. 'Polyaniline': Protonic acid doping of the emeraldine form to the metallic regime. Synth. Met. 1986, 13, 193-205. [CrossRef]\n\n  \\item Yu, H.-H.; Xu, B.; Swager, T.M. A Proton-Doped Calix[4]arene-Based Conducting Polymer. J. Am. Chem. Soc. 2003, 125, 1142-1143. [CrossRef] [PubMed]\n\n  \\item Yoo, J.E.; Lee, K.S.; Garcia, A.; Tarver, J.; Gomez, E.D.; Baldwin, K.; Sun, Y.; Meng, H.; Nguyen, T.-Q.; Loo, Y.-L. Directly patternable, highly conducting polymers for broad applications in organic electronics. Proc. Natl. Acad. Sci. USA 2010, 107, 5712-5717. [CrossRef] [PubMed]\n\n  \\item Aasmundtveit, K.E.; Samuelsen, E.J.; Pettersson, L.A.A.; Inganäs, O.; Johansson, T.; Feidenhans'l, R. Structure of thin films of poly(3,4-ethylenedioxythiophene). Synth. Met. 1999, 101, 561-564. [CrossRef]\n\n  \\item Podzorov, V.; Menard, E.; Rogers, J.A.; Gershenson, M.E. Hall Effect in the Accumulation Layers on the Surface of Organic Semiconductors. Phys. Rev. Lett. 2005, 95, 226601. [CrossRef] [PubMed]\n\n  \\item Takeya, J.; Yamagishi, M.; Tominari, Y.; Hirahara, R.; Nakazawa, Y.; Nishikawa, T.; Kawase, T.; Shimoda, T.; Ogawa, S. Very high-mobility organic single-crystal transistors with in-crystal conduction channels. Appl. Phys. Lett. 2007, 90, 102120. [CrossRef]\n\n  \\item Wei, Q.; Mukaida, M.; Naitoh, Y.; Ishida, T. Morphological Change and Mobility Enhancement in PEDOT:PSS by Adding Co-solvents. Adv. Mater. 2013, 25, 2831-2836. [CrossRef] [PubMed]\n\n  \\item Wei, Q.; Mukaida, M.; Kirihara, K.; Naitoh, Y.; Ishida, T. Thermoelectric Power Enhancement of PEDOT:PSS in High Humidity Conditions. Appl. Phys. Express 2014, 7, 031601. [CrossRef]\n\n  \\item Wei, Q.; Mukaida, M.; Kirihara, K.; Naitoh, Y.; Ishida, T. Polymer Thermoelectric Modules Screen-Printed on Paper. RSC Adv. 2014, 4, 28802-28806. [CrossRef]\n\n  \\item Reyes-Reyes, M.; Cruz-Cruz, I.; López-Sandoval, R. Enhancement of the Electrical Conductivity in PEDOT:PSS Films by the Addition of Dimethyl Sulfate. J. Phys. Chem. C 2010, 114, 20220-20224. [CrossRef]\n\n  \\item Xia, Y.; Ouyang, J. Significant Conductivity Enhancement of Conductive Poly(3,4-ethylenedioxythiophene): Poly(styrenesulfonate) Films through a Treatment with Organic Carboxylic Acids and Inorganic Acids. ACS Appl. Mater. Interfaces 2010, 2, 474-483. [CrossRef] [PubMed]\n\n  \\item Xia, Y.; Sun, K.; Ouyang, J. Solution-Processed Metallic Conducting Polymer Films as Transparent Electrode of Optoelectronic Devices. Adv. Mater. 2012, 24, 2436-2440. [CrossRef] [PubMed]\n\n  \\item Yuta, H.; Keisuke, I.; Hiroyasu, M.; Akihiko, F.; Terukazu, N.; Satoshi, I.; Takahiko, S. Mesoscopic 2D Charge Transport in Commonplace PEDOT:PSS Films. Adv. Electron. Mater. 2018, 4, 1700490.\n\n  \\item Wei, Q.; Mukaida, M.; Kirihara, K.; Ishida, T. Experimental Studies on the Anisotropic Thermoelectric Properties of Conducting Polymer Films. ACS Macro Lett. 2014, 3, 948-952. [CrossRef]\n\n  \\item Saxena, N.; Keilhofer, J.; Maurya, A.K.; Fortunato, G.; Overbeck, J.; Müller-Buschbaum, P. Facile Optimization of Thermoelectric Properties in PEDOT:PSS Thin Films through Acido-Base and Redox Dedoping Using Readily Available Salts. ACS Appl. Energy Mater. 2018, 1, 336-342. [CrossRef]\n\n  \\item Welch, G.C.; Bazan, G.C. Lewis Acid Adducts of Narrow Band Gap Conjugated Polymers. J. Am. Chem. Soc. 2011, 133, 4632-4644. [CrossRef] [PubMed]\n\n  \\item Miller, L.L.; Yu, Y. Synthesis of .beta.-Methoxy, Methyl-Capped .alpha.-Oligothiophenes. J. Org. Chem. 1995, $60,6813-6819$. [CrossRef] 33. Zhang, Y.; Tajima, K.; Hirota, K.; Hashimoto, K. Synthesis of All-Conjugated Diblock Copolymers by Quasi-Living Polymerization and Observation of Their Microphase Separation. J. Am. Chem. Soc. 2008, 130, 7812-7813. [CrossRef] [PubMed]\n\n  \\item Yueh, K.C.; Bumsu, L.; Martin, H.; Iain, M.; Eric, G.; Vitaly, P. Doping of Conjugated Polythiophenes with Alkyl Silanes. Adv. Funct. Mater. 2009, 19, 1906-1911.\n\n  \\item Patel, S.N.; Glaudell, A.M.; Kiefer, D.; Chabinyc, M.L. Increasing the Thermoelectric Power Factor of a Semiconducting Polymer by Doping from the Vapor Phase. ACS Macro Lett. 2016, 5, 268-272. [CrossRef]\n\n  \\item Han, C.C.; Elsenbaumer, R.L. Protonic acids: Generally applicable dopants for conducting polymers. Synth. Met. 1989, 30, 123-131. [CrossRef]\n\n  \\item Mochizuki, Y.; Horii, T.; Okuzaki, H. Effect of pH on Structure and Conductivity of PEDOT/PSS. Trans. Mat. Res. Soc. Jpn. 2012, 37, 307-310. [CrossRef]\n\n  \\item Coehoorn, R.; Pasveer, W.F.; Bobbert, P.A.; Michels, M.A.J. Charge-carrier concentration dependence of the hopping mobility in organic materials with Gaussian disorder. Phys. Rev. B 2005, 72, 155206. [CrossRef]\n\n\\end{enumerate}\n\n\\end{document}", "record_id": "2023_09_22_d90e94cbd96e4b6ddb8bg"}