{"text": "\\documentclass[10pt]{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage[T1]{fontenc}\n\\usepackage{hyperref}\n\\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan,}\n\\urlstyle{same}\n\\usepackage{amsmath}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage[version=4]{mhchem}\n\\usepackage{stmaryrd}\n\\usepackage{graphicx}\n\\usepackage[export]{adjustbox}\n\\graphicspath{ {./images/} }\n\n\\title{Flat-Band Electronic Structure and Interlayer Spacing Influence in Rhombohedral Four-Layer Graphene }\n\n\n\\author{Weimin Wang, ${ }^{1}$ Yuchen Shi, ${ }^{1}$ Alexei A. Zakharov, ${ }^{2}$ Mikael Syväjärvi, ${ }^{1}$ Rositsa Yakimova, ${ }^{1}$\\\\\nRoger I. G. Uhrberg, ${ }^{1}$ Jianwu Sun ${ }^{1, *}$\\\\\n1 Department of Physics, Chemistry and Biology (IFM), Linköping University, SE-58183,}\n\\date{}\n\n\n\\def\\AA{\\mathring{\\mathrm{A}}}\n\n\\begin{document}\n\\maketitle\nWeimin Wang, Yuchen Shi, A.A. Zakharov, Mikael Syväjärvi, Rositsa Yakimova, Roger Uhrberg and Jianwu Sun\n\nThe self-archived postprint version of this journal article is available at Linköping University Institutional Repository (DiVA):\n\n\\href{http://urn.kb.se/}{http://urn.kb.se/} resolve?urn=urn:nbn:se:liu:diva-151307\n\nN.B.: When citing this work, cite the original publication.\n\nWang, W., Shi, Y., Zakharov, A., Syväjärvi, M., Yakimova, R., Uhrberg, R., Sun, J ., (2018), Flat-Band Electronic Structure and Interlayer Spacing Influence in Rhombohedral Four-Layer Graphene, Nano letters (Print), 18(9), 5862-5866. https:// \\href{http://doi.org/}{doi.org/} 10.1021/ acs.nanolett.8b02530\n\nOriginal publication available at:\n\nhttps:// \\href{http://doi.org/}{doi.org/} 10.1021/acs.nanolett.8b02530\n\nCopyright: American Chemical Society\n\nhttp:// \\href{http://pubs.acs.org/}{pubs.acs.org/}\n\n\\section*{Flat-band Electronic Structure and Interlayer Spacing }\n\\section{Influence in Rhombohedral Four-layer Graphene}\n Linköping, Sweden${ }^{2}$ MAX IV laboratory, Fotongatan 2, SE-22484, Lund, Sweden\n\n\\begin{itemize}\n  \\item Corresponding Author: Jianwu Sun, Tel: 46-13282703, Email: \\href{mailto:jianwu.sun@liu.se}{jianwu.sun@liu.se}\n\\end{itemize}\n\n\\begin{abstract}\nThe stacking order of multilayer graphene significantly influences its electronic properties. The rhombohedral stacking sequence is predicted to introduce a flat band, which has high density of states and the enhanced Coulomb interaction between charge carriers, thus possibly resulting in superconductivity, fractional quantum Hall effect and many other exotic phases of matter. In this work, we comprehensively study the effect of the stacking sequence and interlayer spacing on the electronic structure of four-layer graphene, which was grown on a high crystalline quality 3C-SiC(111) crystal. The number of graphene layers and coverage were determined by low energy electron microscopy. First principles density functional theory calculations show distinctively different band structures for ABAB (Bernal), ABCA (rhombohedral) and ABCB (turbostratic) stacking sequences. By comparing with angle resolved photoelectron spectroscopy data, we can verify the existence of a rhombohedral stacking sequence and a nearly dispersionless electronic band (flat band) near the Fermi level. Moreover, we find that the momentum width, bandgap, and curvature of the flat-band region can be tuned by the interlayer spacing, which plays an important role in superconductivity and many other exotic phases of matter.\n\\end{abstract}\n\nKEYWORDS: Graphene, Rhombohedral stacking, flat-band, interlayer spacing, superconductor Recently, multilayer graphene has attracted much interest due to its stacking-dependent electronic properties. ${ }^{1-4}$ In particular, the rhombohedral stacking sequence is predicted to introduce a nearly dispersionless electronic band (flat band) near the Fermi level $\\left(\\mathrm{E}_{\\mathrm{F}}\\right){ }^{1}$ The flatness of this band depends on the number of layers in the rhombohedral multilayer graphene (RMG). ${ }^{1,4}$ Such a flat band would possibly result in superconductivity. ${ }^{3}$ For conventional superconductors, the critical temperature depends exponentially on the electronic density of states (DOS) at $\\mathrm{E}_{\\mathrm{F}}$. In an extreme case, the dispersionless band leads to a diverging DOS at $\\mathrm{E}_{\\mathrm{F}}$ in $\\mathrm{RMG}{ }^{4-6}$ Furthermore, the Coulomb interaction between electrons is increased in the flat-band. ${ }^{3,7}$ It is well known that Coulomb interaction plays a crucial role for the exotic properties of two-dimensional materials, such as the quantum spin Hall effect. ${ }^{8-9}$ Hence, the flat-band of RMG could also support new exotic electronic states.\n\nDifferent methods have been developed to fabricate graphene. Exfoliation from graphite can generate graphene flakes with a maximum size of $\\approx 10 \\mu \\mathrm{m}^{2}$, but this size is not sufficiently large for industrial device processing. Chemical vapor deposition of graphene has been achieved on metal surfaces, ${ }^{10}$ but it has compatibility problems with industrial semiconductor processes due to need of transfer to other substrates while maintaining large area as well as is challenged by domain sizes being limited by metal grain sizes. Sublimation growth of epitaxial graphene on $\\mathrm{SiC}$ has been developed to become a reliable method for fabricating large-area, low-defect-density single layer graphene on a semiconducting substrate. ${ }^{11-13}$ It has the largest application potential in electronics, gas storage, high performance sensors etc. ${ }^{14-18}$ Pioneering work has been done to grow graphene on various polytypes of silicon carbide $\\left(4 \\mathrm{H}-, 6 \\mathrm{H}\\right.$-, and 3C-SiC). ${ }^{13,19-21}$\n\nThe preparation of large-area homogeneous multilayer graphene is still a great challenge. ${ }^{21}$ The formation of a particular stacking order is strongly influenced by the substrate. ${ }^{22}$ Considering all substrates that have been used to support graphene growth, the 3C-SiC substrate is the most suitable one for growth of rhombohedral multilayer graphene due to its ABC stacking along the [111] direction. Coletti et al. reported angle resolved photoelectron spectroscopy (ARPES) data on tri-layer graphene on 3C-SiC, exhibiting the tendency toward large-area $\\mathrm{RMG},^{23}$ as tri-layer is just a beginning of an \"ABC\" stacking. ${ }^{1}$ Later, Pierucci et al. presented results of five-layer RMG on a thin $(12 \\mu \\mathrm{m})$ 3C-SiC crystal on $2^{\\circ}$ off-axis $6 \\mathrm{H}$-SiC. ${ }^{4}$ However, the small domains $(40-50$ nm) of RMG made the ARPES data fuzzy and the determination of stacking sequences was not conclusive.\n\nIn this letter, we report a successful synthesis of four-layer RMG on $4^{\\circ}$ off-axis 3C-SiC(111). We address the issue of the structural influence on the electronic structure of RMGs and propose a possible method to manipulate the width of the flat-band at EF. Direct characterizations of quality, coverage and number of layers were done via low energy electron microscopy (LEEM). The band structure of four-layer graphene measured by ARPES allows a direct comparison to the first principles density functional theory (DFT) calculation in order to determine the stacking sequence and interlayer spacing.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_70326f83ce0dcec87b50g-06_259_1241_346_824}\n\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_70326f83ce0dcec87b50g-06_259_717_823_1281}\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_70326f83ce0dcec87b50g-06_259_1237_822_1754}\n\nFigure 1. LEEM measurements of graphene grown on 3C-SiC(111). (a-c) LEEM images of graphene samples grown at $1800{ }^{\\circ} \\mathrm{C}$ for (a) $15 \\mathrm{~min}$, (b) $30 \\mathrm{~min}$ and (c) at $2000{ }^{\\circ} \\mathrm{C}$ for $30 \\mathrm{~min}$, measured with an electron energy of $5.48 \\mathrm{eV}, 5.88 \\mathrm{eV}$ and $2.89 \\mathrm{eV}$ at a field of view of $10 \\mu \\mathrm{m}, 15 \\mu \\mathrm{m}$ and $10 \\mu \\mathrm{m}$, respectively. (d-f) Electron reflectivity curves extracted from the labeled areas in (a-c). The number of minima in an electron reflectivity curve indicates the number of graphene layers.\n\nThe LEEM measurements were performed to characterize the thickness distribution of graphene grown on 3C-SiC(111) at different conditions. Figure $1 \\mathrm{a}-\\mathrm{c}$ are the results measured on the samples aimed for different number of layers. Based on the electron reflectivity curves (Figure 1d-e), one can determine the thickness of graphene in the field of view (FOV) labeled by colored arrows. ${ }^{24}$ The LEEM results show that the samples grown at $1800{ }^{\\circ} \\mathrm{C}$ for 15 and 30 minutes are covered to $91 \\%$ by monolayer graphene and to $87 \\%$ by bilayer graphene, respectively. Most importantly, the sample grown at $2000{ }^{\\circ} \\mathrm{C}$ for $30 \\mathrm{~min}$ is dominated by $4 \\mathrm{ML}$ graphene with a coverage of $70 \\%$. The large domain size of about ten micrometers enable the feasibility to experimentally determine stacking sequence and the electronic structure of the $4 \\mathrm{ML}$ graphene.\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_70326f83ce0dcec87b50g-07_568_938_340_1014}\n\n(a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_70326f83ce0dcec87b50g-07_1012_1395_325_656}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_70326f83ce0dcec87b50g-07_1018_1362_668_1023}\n\\end{center}\n\n(c)\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_70326f83ce0dcec87b50g-07_568_938_1091_1779}\n\n(b)\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_70326f83ce0dcec87b50g-07_1022_1384_1094_1782}\n\n(d)\n\nFigure 2. $\\pi$ band dispersion and constant energy contours obtained by ARPES. (a) Band structure of a 1 $\\mathrm{ML}$ graphene sample showing the linear dispersion. The Dirac point is located at a binding energy of $0.42$ eV below $E_{F}$. (b) Band structure of a $2 \\mathrm{ML}$ graphene sample indicating an AB stacking sequence. The Dirac point, $E_{D}$, is located at a binding energy of $0.34 \\mathrm{eV}$ below $E_{F}$. The energy difference between the top of the lowest $\\pi$ band and the Dirac point is $0.36 \\mathrm{eV}$. (c) Band structure of a $4 \\mathrm{ML}$ graphene sample showing a flatband at $E_{F}$ with a momentum width of $\\sim 0.07 \\AA^{-1}$. All constant energy contours were plotted at the binding energy of $-1.0 \\mathrm{eV}$. The number of bands and contours agree with the number of layers. (d) A second derivation of (c) shows the band dispersion clearer, which facilitates a comparison with DFT calculations shown in Figure 3. Note that the $\\pi$ band dispersion is symmetric in (a) and (b) along $\\mathrm{k}_{/ / \\mathrm{x}}$, but asymmetric along $\\mathrm{k}_{/ / \\mathrm{y}}$ in (c).\n\nFigure 2 a shows the typical linear $\\pi$ band dispersion and three-fold symmetric constant energy contour of $1 \\mathrm{ML}$ graphene around the $\\overline{\\mathrm{K}}$ point of surface Brillouin zone (SBZ). Due to the charge transfer from the $(6 \\sqrt{ } 3 \\times 6 \\sqrt{ } 3) \\mathrm{R} 30^{\\circ}$ carbon rich buffer layer, ${ }^{25}$ the Dirac point is shifted below $\\mathrm{E}_{\\mathrm{F}}$ by $0.42 \\mathrm{eV}$. The ARPES data of $2 \\mathrm{ML}$ graphene shows two $\\pi$ bands and two concentric contours. The position of the bands indicates an AB stacking (Figure 2b). The Dirac point is shifted by $0.08$ $\\mathrm{eV}$ towards $\\mathrm{E}_{\\mathrm{F}}$ compared to $1 \\mathrm{ML}$ graphene. The top of the lower $\\pi$ band and the Dirac point have an energy difference of $0.36 \\mathrm{eV}$. These values are consistent with the ARPES results measured on graphene grown on $6 \\mathrm{H}$ - and $4 \\mathrm{H}$-SiC substrates,, $425-27$ and can be explained by the model proposed by Kopylov et al. ${ }^{28}$ The electron transfer originates from the bulk $\\mathrm{SiC}$ or interface states between buffer layer and graphene. In Figure 2a, b, $\\pi$ bands were mapped along the direction perpendicular to $\\bar{\\Gamma} \\bar{K} \\bar{M}$ direction, which makes the bands symmetric at $\\overline{\\mathrm{K}}$. From the constant energy contour in Figure $2 \\mathrm{c}$, one can see that $\\pi$ bands along $\\mathrm{k} / \\mathrm{y}$ are better resolved than along $\\mathrm{k} / / \\mathrm{x}$. Hence, for the four-layer graphene sample, $\\pi$ bands were mapped along the $\\mathrm{k}_{/ / \\mathrm{y}}$ direction. The width of the flatband at $\\mathrm{E}_{\\mathrm{F}}$ is measured to be $\\sim 0.07 \\AA^{-1}$, which is quite close to the reported value of the flat band region of $0.08 \\AA^{-1}$ in five-layer graphene by Pierucci et al. ${ }^{4}$ To compare experimental results with DFT calculations to determine the stacking sequences, second derivation of the data in Figure 2c was implemented (Figure 2d). It shows that one band crosses $E_{F}$ and the other three bands coincide at a binding energy $\\left(\\mathrm{E}_{\\mathrm{C}}\\right)$ of $-0.45 \\mathrm{eV}$.\n\nWe performed band structure calculations of three possible stacking sequences after full relaxation, i.e., ABCA (rhombohedral), ABCB (turbostratic) and ABAB (Bernal) stacking shown in Figure 3. The major difference between Figure 3a, b, and c is that Bernal and turbostratic stacking have no band degeneracy at the $\\overline{\\mathrm{K}}$ point below $\\mathrm{E}_{\\mathrm{F}}$. Moreover, there is no observable flatband at $\\mathrm{E}_{\\mathrm{F}}$ for Bernal stacking. Hence, we can conclude that the experimental data are consistent with the presence of four-layer RMG. Since Pierucci et al. measured ARPES with a probe area of approximately $50 \\times 100 \\mu \\mathrm{m}^{2}$, the quality of the data was not satisfying due to small domains of RMG (40 - $50 \\mathrm{~nm}$ ). The size of the light spot in our experimental setup is about $1 \\mathrm{~mm}^{2}$, and four $\\pi$ bands are clearly observed in Figure 2c, indicating large domains and high coverage of fourlayer graphene on 3C-SiC(111), as confirmed by the LEEM results in Figure 1.\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_70326f83ce0dcec87b50g-09_493_1165_340_1817}\n\\end{center}\n\nFigure 3. Calculated band structure of four-layer graphene. (a) Calculated band structure of $A B C A$ stacking showing one flat valence band near $E_{F}$ and the other three valence bands coincide at a binding energy of $-0.30 \\mathrm{eV}$. The flat-band width is about $0.06 \\AA^{-1}$. (b, c) Calculated band structure of $A B C B$ and $A B A B$ stacking, respectively, showing two valence bands joined at $E_{F}$ and there are no other degenerate band at the $\\overline{\\mathrm{K}}$ point. The insets are atomic models of the corresponding stacking sequences. The bands were plotted along the $\\bar{\\Gamma} \\bar{K}$ direction of the SBZ. The red dashed line indicates the position of the $\\bar{K}$ point.\n\nThe electronic structure of four-layer RMG is illustrated in Figure 3a. The average interlayer spacing (Ds) was found to be $3.40 \\AA$ after full relaxation of all atomic positions. Yoo et al. reported an average Ds of $3.85 \\AA$ for four-layer graphene obtained by mechanical graphite cleavage. ${ }^{29}$ Agrinskaya et al. reported an average Ds of $3.39 \\AA$ for eight-layer graphene. ${ }^{30}$ Pierucci et al. reported $3.44$ A for five-layer graphene using scanning transmission electron microscopy. ${ }^{4}$ Kasper et al. have discussed the relationship between $\\mathrm{D}_{\\mathrm{S}}$ and number of bands. ${ }^{31}$ However, the influence of $\\mathrm{D}_{\\mathrm{S}}$ on the band structure of multilayer graphene has not been explored yet in the literature. (a)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_70326f83ce0dcec87b50g-10_302_663_347_1041}\n\\end{center}\n\n(f)\n\n(g)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_70326f83ce0dcec87b50g-10_756_1033_413_855}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_70326f83ce0dcec87b50g-10_257_474_1057_1496}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_70326f83ce0dcec87b50g-10_260_466_1499_1797}\n\\end{center}\n\n$\\begin{array}{cc}\\text { ய } & 0.0 \\\\ \\therefore \\frac{5}{0} & \\\\ \\hdashline & -0.5 \\\\ & -1.0\\end{array}$\n\n(e)\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_70326f83ce0dcec87b50g-10_492_733_1506_1801}\n\\end{center}\n\n(i) (h)\n\n\\[\n\\overline{\\mathbf{\\Gamma}} \\leftarrow \\overline{\\mathbf{K}} \\rightarrow \\overline{\\mathbf{M}}\n\\]\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_70326f83ce0dcec87b50g-10_786_1030_843_1147}\n\\end{center}\n\n\\begin{center}\n\\includegraphics[max width=\\textwidth]{2023_09_22_70326f83ce0dcec87b50g-10_778_1042_1152_1754}\n\\end{center}\n\nFigure 4. Band structure calculation of four-layer RMG as a function of interlayer spacing. (a) The blue axis and triangles are the flat-band widths extracted from band structure calculations. The red axis and spots are the binding energy positions where the three lower $\\pi$ bands coincide $\\left(E_{c}\\right)$. The dashed lines are guides to the eye showing the tendency of the change as a function of interlayer spacing. (b-e) Calculated band structure of four-layer RMG with interlayer spacings of $3.20,3.40,3.60$ and $3.80 \\AA$ A, respectively. The $\\mathrm{k}_{/ /}$range is same as in Figure 3. (f-i) Zoom-in plots of flat-bands close to $E_{F}$ from (b) to (e) respectively. The $\\mathrm{k}_{/ /}$range is $\\pm 0.75 \\AA^{-1}$ centered at the $\\overline{\\mathrm{K}}$ point, indicated by the red dashed lines.\n\nIn Figure 3a, the position of $\\mathrm{E}_{C}$ and flat-band width do not agree with experimental results, which leads to further investigation. There are four structural parameters for four-layer graphene: lattice constant (2.46 Å), atomic structure of each layer (honeycomb), stacking sequence (ABCA) and interlayer spacing $\\left(\\mathrm{D}_{\\mathrm{s}}\\right)$. Since the former three parameters are well defined, we thus performed band structure calculations of four-layer RMG as a function of $D_{s}$. The changes in the flat-band width (blue triangles) and position of $\\mathrm{E}_{C}$ (red spots) are two characteristic features displayed in Figure 4a. The dashed lines are guides to the eye, suggesting that $\\mathrm{E}_{\\mathrm{C}}$ moves towards $\\mathrm{E}_{\\mathrm{F}}$ and that the width of the flat-band decreases with increasing Ds. Figure 4b-e show the results with interlayer spacings of $3.20,3.40,3.60$, and $3.80 \\AA$, respectively. A detailed analysis of the calculated flatband is presented in Figure $4 \\mathrm{f}-\\mathrm{i}$. It shows clearly that the flat-band becomes narrower but flatter when $\\mathrm{D}_{\\mathrm{S}}$ increases. In order to achieve a high critical temperature superconductor, the possibility of increasing the DOS near $\\mathrm{E}_{\\mathrm{F}}$ is essential. Based on our theoretical results, we propose a possible way to increase the DOS through tuning the interlayer spacing. Noticeably, a phase transition from semimetal to semiconductor occurs when increasing the interlayer spacing. A band gap of $\\sim 4.5$ $\\mathrm{meV}$ is induced when $\\mathrm{D}_{\\mathrm{s}}$ equals $3.60 \\AA$. This indicates that the interlayer spacing also plays an important role for the electronic properties of graphene such as flat-band width and band gaps.\n\nIn conclusion, we report promising epitaxial growth of graphene on 3C-SiC(111) with different number of layers related to growth parameters. The high quality and large coverage of graphene with different thicknesses allowed reliable characterization by LEEM. We observed a flat-band with a width of $\\sim 0.07 \\AA^{-1}$ close to $\\mathrm{E}_{\\mathrm{F}}$. The PBE + DFT calculations, including vdW interaction, permit us to verify the existence of a rhombohedral stacking. Finally, we present detailed theoretical studies of the flat-band as a function of interlayer spacing that could shed light on the progress of superconductivity in rhombohedral multilayer graphene.\n\n\\section{Experimental methods.}\nBulk-like off-axis 3C-SiC(111) samples with a thickness of $~ 1 \\mathrm{~mm}$ were grown on $4^{\\circ}$ off-axis 4H-SiC substrates (SiCrystal) by the sublimation process. ${ }^{32-33}$ Then $300 \\sim 400 \\mu \\mathrm{m}$ thick freestanding 3C-SiC layers were obtained by polishing away the 4H-SiC substrates and the transition interface between $4 \\mathrm{H}$ and 3C-SiC.. To remove surface contaminations and oxides, the 3C-SiC substrates were chemically cleaned by acetone, ethanol, $\\mathrm{H}_{2} \\mathrm{O}: \\mathrm{NH}_{3}: \\mathrm{H}_{2} \\mathrm{O}_{2}$ (5:1:1), $\\mathrm{H}_{2} \\mathrm{O}$ : HCl: $\\mathrm{H}_{2} \\mathrm{O}_{2}$ (6:1:1) and hydrofluoric acid (HF). Before growth of graphene on 3C-SiC, we studied the as-grown substrates by atomic force microscopy (AFM) in order to select samples free from macroscopic defects and with a regular step structure corresponding to the off-cut angle of $4 \\mathrm{H}-\\mathrm{SiC}$ substrate. For the growth of monolayer and bilayer graphene, the samples were annealed during 15 and $30 \\mathrm{~min}$, respectively, in an inductively heated furnace at $1800{ }^{\\circ} \\mathrm{C}$ with a ramping rate of 25 ${ }^{\\circ} \\mathrm{C} / \\mathrm{min}$ in an 850 mbar argon atmosphere. For the growth of four-layer graphene, the sample was annealed at $2000^{\\circ} \\mathrm{C}$ during $30 \\mathrm{~min}$. The number of graphene layers was determined by LEEM measurements at beamline I311 at the MAX-lab synchrotron radiation laboratory, Lund, Sweden. The ARPES data were acquired at room temperature at Linköping University using a Phoibos 100 analyzer from Specs with a two-dimensional detector. The energy and angular resolutions were 50 meV and $0.3^{\\circ}$, respectively. A helium discharge lamp was used as light source, providing photons with an energy of $21.22 \\mathrm{eV}$. Both LEEM and ARPES measurements were carried out in ultrahigh vacuum (UHV). Clean samples were prepared in-situ by annealing at $600{ }^{\\circ} \\mathrm{C}$ to remove contaminations from them prior exposure to air. First-principles DFT calculations were used to investigate the band structure as a function of the stacking sequence of graphene. The structure was modelled by a periodic slab, which was built by ABCA, ABCB or ABAB stacking sequences of four-layer graphene with a theoretical lattice constant of $2.46 \\AA$. A vacuum spacing of $19 \\AA$ was included to avoid interaction between repeated slabs. The DFT calculations were performed using the functional of Perdew, Burke and Ernzerhof (PBE) and the projector augmented wave (PAW) method Vienna ab initio simulation package code (VASP). ${ }^{34}$ Structural relaxation was carried out using a k-point mesh of $(24 \\times 24 \\times 1)$. The Tkatchenko-Scheffler method is used to describe van der Waals $(\\mathrm{vdW})$ interactions. ${ }^{35}$ The energy cut-off of the plane wave basis set was $1000 \\mathrm{eV}$. The fully relaxed four-layer models were optimized until all residual forces were less than $10 \\mathrm{meV} / \\AA$. The momentum width of the calculated flat-band was measured within the energy range of $\\pm 10$ meV.\n\n\\section{ACKNOWLEDGMENTS}\nProf. Leif Johansson is gratefully acknowledged for inspiring discussion. Financial support was provided by the Swedish Research Council (Contract No. 621-2014-5461, No. 621-2014-4764, and No. 621-2014-5805), the Swedish Research Council for Environment, Agricultural Sciences and Spatial Planning (FORMAS, Grant No. 2016-00559), the Swedish Foundation for International Cooperation in Research and Higher Education (STINT, Grant No. CH2016-6722), ÅForsk foundation (Grant No. 16-399), and Stiftelsen Olle Engkvist Byggmästare (Grant No. 1890243).\n\n\\section{REFERENCES}\n(1) Yacoby, A. Tri and tri again. Nat. Phys. 2011, 7, 925.\n\n(2) Olsen, R.; van Gelderen, R.; Smith, C. M. Ferromagnetism in ABC-stacked trilayer graphene. Phys. Rev. B 2013, $87,115414$.\n\n(3) Kopnin, N. B.; Ijäs, M.; Harju, A.; Heikkilä, T. T. High-temperature surface superconductivity in rhombohedral graphite. Phys. Rev. B 2013, 87, 140503(R).\n\n(4) Pierucci, D.; Sediri, H.; Hajlaoui, M.; Girard, J. C.; Brumme, T.; Calandra, M.; VelezFort, E.; Patriarche, G.; Silly, M. G.; Ferro, G.; Souliere, V.; Marangolo, M.; Sirotti, F.; Mauri, F.; Ouerghi, A. Evidence for flat bands near fermi level in epitaxial rhombohedral multilayer graphene. ACS Nano 2015, 9, 5432.\n\n(5) Guinea, F.; Castro Neto, A. H.; Peres, N. M. R. Electronic states and Landau levels in graphene stacks. Phys. Rev. B 2006, 73, 245426.\n\n(6) Henni, Y.; Ojeda Collado, H. P.; Nogajewski, K.; Molas, M. R.; Usaj, G.; Balseiro, C. A.; Orlita, M.; Potemski, M.; Faugeras, C. Rhombohedral Multilayer Graphene: A Magneto-Raman Scattering Study. Nano Lett. 2016, 16, 3710.\n\n(7) Bao, W.; Jing, L.; Velasco, J.; Lee, Y.; Liu, G.; Tran, D.; Standley, B.; Aykol, M.; Cronin, S. B.; Smirnov, D.; Koshino, M.; McCann, E.; Bockrath, M.; Lau, C. N. Stacking-dependent band gap and quantum transport in trilayer graphene. Nat. Phys. $\\mathbf{2 0 1 1}, 7,948$.\n\nZhang, L.; Zhang, Y.; Camacho, J.; Khodas, M.; Zaliznyak, I. The experimental observation of quantum Hall effect of $1=3$ chiral quasiparticles in trilayer graphene. Nat. Phys. 2011, 7, 953.\n\nLui, C. H.; Li, Z. Q.; Mak, K. F.; Cappelluti, E.; Heinz, T. F. Observation of an electrically tunable band gap in trilayer graphene. Nat. Phys. 2011, 7, 944.\n\n(10) Sutter, P. W.; Flege, J. I.; Sutter, E. A. Epitaxial graphene on ruthenium. Nat. Mater. $\\mathbf{2 0 0 8}, 7,406$.\n\n(11) Lin, Y.-M.; Dimitrakopoulos, C.; Jenkins, K. A.; Farmer, D. B.; Chiu, H.-Y.; Grill, A.; Avouris, Ph. 100-GHz Transistors from Wafer-Scale Epitaxial Graphene. Science $\\mathbf{2 0 1 0}, 327,662$. (12) Riedl, C.; Starke, U.; Bernhardt, J.; Franke, M.; Heinz, K. Structural properties of the graphene-SiC(0001) interface as a key for the preparation of homogeneous largeterrace graphene surfaces. Phys. Rev. B 2007, 76, 245406.\n\n(13) Yazdi, G. R.; Vasiliauskas, R.; Iakimov, T.; Zakharov, A.; Syväjärvi, M.; Yakimova, R. Growth of large area monolayer graphene on 3C-SiC and a comparison with other SiC polytypes. Carbon 2013, 57, 477 .\n\n(14) Pearce, R.; Iakimov, T.; Andersson, M.; Hultman, L.; Spetz, A. L.; Yakimova, R. Epitaxially grown graphene based gas sensors for ultra sensitive $\\mathrm{NO}_{2}$ detection. Sens. Actuators B Chem. 2011, $155,451$.\n\n(15) Kim, K.; Choi, J. Y.; Kim, T.; Cho, S. H.; Chung, H. J. A role for graphene in siliconbased semiconductor devices. Nature 2011, 479, 338.\n\n(16) Singh, E.; Meyyappan, M.; Nalwa, H. S. Flexible Graphene-Based Wearable Gas and Chemical Sensors. ACS Appl. Mater. Interfaces 2017, 9, 34544.\n\n(17) Nag, A.; Mitra, A.; Mukhopadhyay, S. C. Graphene and its sensor-based applications: A review. Sens. Actuators A Phys. 2018, 270, 177.\n\n(18) Gadipelli, S.; Guo, Z. X. Graphene-based materials: Synthesis and gas sorption, storage and separation. Prog. Mater. Sci. 2015, 69, 1.\n\n(19) Emtsev, K. V.; Bostwick, A.; Horn, K.; Jobst, J.; Kellogg, G. L.; Ley, L.; McChesney, J. L.; Ohta, T.; Reshanov, S. A.; Rohrl, J.; Rotenberg, E.; Schmid, A. K.; Waldmann, D.; Weber, H. B.; Seyller, T. Towards wafer-size graphene layers by atmospheric pressure graphitization of silicon carbide. Nat. Mater. 2009, 8, 203.\n\n(20) Huang, H.; Chen, W.; Chen, S.; Wee A. T. S. Bottom-up Growth of Epitaxial Graphenen on 6H-SiC(0001). ACS Nano 2008, 2, 2513.\n\n(21) Virojanadara, C.; Syväjarvi, M.; Yakimova, R.; Johansson, L. I.; Zakharov, A. A.; Balasubramanian, T. Homogeneous large-area graphene layer growth on 6HSiC(0001). Phys. Rev. B 2008, 78, 245403.\n\n(22) Wu, Y. P.; Chou, H.; Ji, H. X.; Wu, Q. Z.; Chen, S. S.; Jiang W.; Hao, Y. F.; Kang, J. Y.; Ren, Y. J.; Piner, R. D.; Ruoff, R. S. Growth Mechanism and Controlled Synthesis of AB-Stacked Bilayer Graphene on Cu-Ni Alloy Foils. ACS Nano 2012, 6, 7731.\n\n(23) Coletti, C.; Forti, S.; Principi, A.; Emtsev, K. V.; Zakharov, A. A.; Daniels, K. M.; Daas, B. K.; Chandrashekhar, M. V. S.; Ouisse, T.; Chaussende, D.; MacDonald, A. H.; Polini, M.; Starke, U. Revealing the electronic band structure of trilayer graphene on SiC: An angle-resolved photoemission study. Phys. Rev. B 2013, 88, 155439.\n\n(24) Hibino, H.; Kageshima, H.; Maeda, F.; Nagase, M.; Kobayashi, Y.; Yamaguchi, H. Microscopic thickness determination of thin graphite films formed on SiC from quantized oscillation in reflectivity of low-energy electrons. Phys. Rev. B 2008, 77, 075413.\n\n(25) Ohta, T.; Bostwick, A.; Seyller T.; Horn, K.; Rotenberg E. Controlling the Electronic Structure of Bilayer Graphene. Science 2006, 313, 951.\n\n(26) Ohta, T.; Bostwick, A.; McChesney, J. L.; Seyller, T.; Horn, K.; Rotenberg, E. Interlayer interaction and electronic screening in multilayer graphene investigated with angle-resolved photoemission spectroscopy. Phys. Rev. Lett. 2007, 98, 206802.\n\n(27) Mammadov, S.; Ristein, J.; Krone, J.; Raidel, C.; Wanke, M.; Wiesmann, V.; Speck, F.; Seyller, T. Work function of graphene multilayers on $\\mathrm{SiC}(0001)$. 2D Mater. 2017, 4, 015043. Kopylov, S.; Tzalenchuk, A.; Kubatkin, S.; Fal'ko, V. I. Charge transfer between epitaxial graphene and silicon carbide. Appl. Phys. Lett. 2010, 97, 112109.\n\nYoo, E.; Kim, J.; Hosono, E.; Zhou, H.-S.; Kudo, T.; Honma, I. Large Reversible Li Storage of Graphene Nanosheet Families for Use in Rechargeable Lithium Ion Batteries. Nano Lett. 2008, 8, 2277.\n\nAgrinskaya, N. V.; Berezovets, V. A.; Kozub, V. I.; Kotousova, I. S.; Lebedev, A. A.; Lebedev, S. P.; Sitnikova, A. A. Structure and transport properties of nanocarbon films prepared by sublimation on a 6H-SiC surface. Semicond. 2013, 47, 301.\n\nKasper, Y.; Tuchin, A.; Bokova, A.; Bityutskaya, L. Numerical simulation of multilayer graphene structures based on quantum-chemical model. J. Phys. Conf. Ser. 2016, $741,012022$.\n\nJokubavicius, V.; Yazdi, G. R.; Liljedahl, R.; Ivanov, I. G.; Yakimova, R.; Syväjärvi, M. Lateral Enlargement Growth Mechanism of 3C-SiC on Off-Oriented 4H-SiC Substrates. Cryst. Growth Des. 2014, $14,6514$.\n\nJokubavicius, V.; Yazdi, G. R.; Liljedahl, R.; Ivanov, I. G.; Sun, J. W.; Liu, X. Y.; Schuh, P.; Wilhelm, M.; Wellmann, P.; Yakimova, R.; Syväjärvi, M. Single Domain 3C-SiC Growth on Off-Oriented 4H-SiC Substrates. Cryst. Growth Des. 2015, 15, 2940.\n\nKresse, G.; Joubert, D. From ultrasoft pseudopotentials to the projector augmentedwave method. Phys. Rev. B 1999, 59, 1758.\n\nTkatchenko, A.; Scheffler, M. Accurate molecular van der Waals interactions from ground-state electron density and free-atom reference data. Phys. Rev. Lett. 2009, 102, 073005.\n\nTable of Contents Graphic\\\\\n\\includegraphics[max width=\\textwidth, center]{2023_09_22_70326f83ce0dcec87b50g-15_1774_2086_606_1498}\n\n\n\\end{document}", "record_id": "2023_09_22_70326f83ce0dcec87b50g"}