{"text": "Hydrothermally Grown ZnO Micro/Nanotube Arrays and Their Properties\n\nabstract\nWe reported the optical and wettability properties of aligned zinc oxide micro/nanotube arrays, which were synthesized on zinc foil via a simple hydrothermal method. As-synthesized ZnO micro/nanotubes have uniform growth directions along the [0001] orientations with diameters in the range of 100-700 nm. These micro/nanotubes showed a strong emission peak at 387 nm and two weak emission peaks at 422 and 485 nm, respectively, and have the hydrophobic properties with a contact angle of 121°. Single ZnO micro/nanotube-based field-effect transistor was also fabricated, which shows typical n-type semiconducting behavior.\n\nIntroduction\nOne-dimensional (1-D) nanostructures become the focus of current research because of the unique properties related with their special structures, such as high surface-to-volume ratios, special compositions, etc. [1] [2] [3] [4] [5] [6] [7] [8] [9] [10] [11] [12] [13] [14] [15] . They play important roles in fabricating nanoscale functional electronic, optoelectronic, electrochemical, and mechanical devices. Among the numerous 1-D nanostructures, 1-D metal oxide nanostructures have been widely investigated and now have been widely used in many areas, such as catalysts, sensors, ceramics, transparent oxide conductive films (TOC) and electronic devices [16] [17] [18] [19] .\nWith a wide direct band gap of 3.37 eV and a large exciton binding energy of 60 meV, zinc oxide (ZnO) [20] has been attracting attention in both fundamental research and practical applications and has been considered as a promising material for gas sensors, varistors, and optical devices [5, 12] . Many kinds of 1-D ZnO nanostructures have been synthesized till now, such as nanowires, nanotubes, nanobelts, nanorings, nanonails and so on, by many groups including ours [21] [22] [23] [24] [25] [26] [27] [28] [29] [30] [31] [32] [33] [34] [35] [36] [37] [38] [39] [40] . It was found that the properties of 1-D ZnO nanostructures are affected by many factors, such as morphologies, compositions, and alignments [30] [31] [32] [33] [34] [35] [36] [37] [38] [39] [40] .\nIn this paper, we present a simple hydrothermal method for the synthesis of aligned ZnO micro/nanotube arrays on zinc foil. These micro/nanotubes have uniform growth directions along the [0001] orientations with diameters in the range of 100-700 nm. Room-temperature photoluminescence (PL) properties of these micro/nanotubes were investigated and they showed a strong emission peak at 387 nm and 2 weak emission peaks at 422 and 485 nm, respectively. As-synthesized ZnO micro/nanotube arrays also show hydrophobic properties with a contact angle of 121°. Finally, single micro/nanotube-based field-effect transistor was also fabricated to investigate their electronic transport properties.\n\nExperimental Section\nAll chemical reagents used in the experiment are of analytical grade and used without further purification. In a typical procedure, 5 mmol zinc acetate and equal amount of hexamethylenetetramine (HMT) were dissolved in 30 ml deionized water under stirring. And then 10 mL ammonia was put into the above mixed solution. Keeping stirring for 15 min, the transparent solution was transferred into a PTFE-lined autoclave with volume of 50 ml. A zinc foil after ultrasonic treatment was then put into the autoclave. After sealed, the autoclave was put in an oven and heated at 130°C for 7 h. After reaction, the foil was taken out of the autoclave and washed with water for several times and then dried in air.\nX-ray diffraction (XRD) pattern of the products was carried out on a D/max-rB of Kaisha X-ray diffractometer with 2h in the range of 30°-80°. Scanning electron microscopy (SEM) and energy dispersive spectrometry (EDS) were taken on a Hitachi S-4800 field-emission scanning electron microscope equipped with an energydispersion X-ray detector. The microstructures of the product were investigated using a high-resolution transmission electron microscope (HRTEM, JEM-3000F). Room-temperature photoluminescence (PL) was curried out with a SPEX FL-2T2 fluorophotometer with an excited wavelength of 325 nm. Water contact angle (CA) of the ZnO micro/nanotube arrays was measured by using a Dataphysics OCA20 contact angle system at ambient temperature. All the electrical measurements were carried out using a semiconductor parameter analyzer (Agilent 4156B apparatus). Fig. 1d . The brightness contrast between the center and the edge indicates the hollow tubular structure, in agreement with the SEM result. Figure 1e demonstrates a lattice-resolved HRTEM image taken from the ZnO nanotube. The clearly resolved lattice fringe is calculated to be around 0.52 nm, in accordance with the (0001) plane of hexagonal ZnO crystal. Several tens of nanotubes were investigated and they all give similar results, indicating that these nanotubes have preferred growth directions along the [0001] orientations. Besides ZnO micro/nanotubes, some ZnO nanowires with smaller diameters were also observed in Fig. 1a . To investigate the growth process, we performed experiments with short reaction time. Figure 1f is a SEM image of the product obtained with a reaction time of 2 h. High-density ZnO nanowires with diameters smaller than 100 nm are formed on the zinc foil. The result indicates that the final ZnO micro/nanotubes may grow on the base of small ZnO nanowires. In fact, the formation of micro/nanotubes from small nanowires has already been observed for several materials, such as ZnO and ZnS [13, 41] .\n\nResults and Discussion\nThe crystal structure of the products was also investigated using XRD and the pattern is shown in Fig. 2 . In this pattern, all the sharp diffraction peak can be indexed to hexagonal wurtzite ZnO phase (JCPDS card No.36-1451) except those small one labeled with asteroidal notation, which come from Zn foil used in the experiment. It gives another evidence for the formation of high purity ZnO product.\nDuring hydrothermal synthesis of 1-D nanostructures, it was always found that the salt ions existed in the solution and the pH values of the solution had great influences on the final products [42, 43] . Figure 3a , b is the SEM images of the product obtained when zinc chloride was used instead of zinc acetate. Flower-like ZnO nanostructures were found on a large scale on the zinc foil. Each flower has diameter of around 1 lm and is composed of numerous small ZnO nanowires. TEM analysis reveals that these small nanowires are single crystals with the growth directions along the [0001] orientations. Figure 3c is the SEM image of a product obtained under different pH value by using NaOH instead of HMT. Though ZnO nanoflowers were also obtained under this condition as those shown in Fig. 3b , high-magnification SEM image shown in Fig. 3d reveals that they have quite different microstructures. The nanoflowers obtained by using NaOH are composed of numerous ZnO nanoplates instead of nanowires in Fig. 3b . Typical ZnO nanoplate has a thickness of several tens of nanometers. It was thought that the strong pH values changed the growth rates of different crystal planes and thus resulted in the formation of different structures.\nTo investigate the optical properties of these micro/ nanotubes, room-temperature photoluminescence was conducted and a typical spectrum was shown in Fig. 4 . From this spectrum, it can be seen that the ZnO micro/ nanotube arrays show a sharp and strong emission peak centered at approximately 387 nm, which corresponds to the near-band-edge peak that is responsible for the recombination of free excitons through an exciton-exciton collision process [44, 45] . Besides the near-band-edge emission, another two emissions centered at around 422 and 485 nm were also observed in the spectrum, which are the deep-level emissions according to the literature. They are related to the singly ionized oxygen vacancies, and are Nanoscale Res Lett (2010) 5:570-575 571 resulted from the recombination of a photogenerated hole with a singly ionized charge state of specific defects [46, 47] . Wettability of nanostructures has attracted great interests in recent years and it is one of the most important properties of nanostructures, which is usually governed by both the chemical composition and the geometrical structure of the solid surfaces. Wettability of 1-D ZnO nanostructures with different morphologies has been studied and the results revealed that different ZnO nanostructures have quite different wettabilities, such as hydrophobic, superhydrophobic, or hydrophilic properties [48] [49] [50] [51] . We also studied the wettability of our aligned ZnO micro/nanotube arrays by checking the water contract angle on the surface. Figure 5 is a water contact angle picture. A contact angle of 121°is observed for the aligned ZnO micro/nanotube arrays, indicating that the product has a hydrophobic property, which may find applications in self-cleaning and photocatalytic fields. The high water contact angle is believed to be caused by the low surface energy of the (0001) plane at the micro/nanotube surface combined with the feature size of the sample [48] .\nSingle micro/nanotube-based field-effect transistors were then fabricated according to our previous reported technique [52] [53] [54] . Briefly, the synthesized ZnO micro/ nanotubes were first sonicated into a suspension in isopropanol (IPA) and then deposited onto a degenerately doped silicon wafer covered with 500 nm SiO 2 . Fig. 1 a, b SEM images Photolithography was then performed, followed by Ti/Au (5 nm/100 nm) deposition to pattern the source and drain electrodes on both ends of the ZnO micro/nanotubes. Figure 6a inset is a top view SEM image of the fabricated single-nanotube-device. The channel length between the source and the drain electrodes of the device is 2 lm. Figure 6a shows the typical gate-dependent current-voltage (I-V) curves obtained from the device in air. Linear current versus voltage was observed for the device, indicating the good Ohmic contacts to structure. The applied gate voltages to the device range from -20 to 20 V. The transport data clearly show decrease in conductance for V g \\ 0, whereas the conductance increases for V g [ 0, indicating that the present ZnO micro/nanotubes are of typical n-type semiconducting behavior. The gate effect is relative weak, which is believed to be caused by the existence of high-density defect sites within the micro/ nanotubes. The I ds -V g curve was also measured and the result was shown in Fig. 6b . For a given V ds , I ds decreases with increasing negative V g , also implies that the ZnO micro/nanotube are an n-type semiconducting material. \n\nConclusion\nIn summary, ZnO micro/nanotube arrays have been successfully synthesized via a simple hydrothermal method on a zinc foil substrate. As-synthesized micro/nanotubes are single crystals with growth directions along the [0001] orientations. These micro/nanotubes show strong nearband-edge emission at 387 nm and weak defects-related emissions at 422 and 485 nm, respectively. Contact angle result indicates they have good hydrophobic properties. Field-effect transistors were fabricated based on the ZnO micro/nanotubes, which show n-type semiconducting characteristics. Our results show that the hydrothermally synthesized ZnO micro/nanotubes may be used as selfcleaning photocatalysts as well as building blocks for nanoscale electronic and optoelectronic devices.\n", "record_id": "10222315"}