{"text": "Strain Relief Analysis of InN Quantum Dots Grown on GaN\n\nabstract\nWe present a study by transmission electron microscopy (TEM) of the strain state of individual InN quantum dots (QDs) grown on GaN substrates. Moiré fringe and high resolution TEM analyses showed that the QDs are almost fully relaxed due to the generation of a 60° misfit dislocation network at the InN/GaN interface. By applying the Geometric Phase Algorithm to plan-view high-resolution micrographs, we show that this network consists of three essentially non-interacting sets of misfit dislocations lying along the directions. Close to the edge of the QD, the dislocations curve to meet the surface and form a network of threading dislocations surrounding the system.\n\nIntroduction\nIndium Nitride (InN), with a band gap of *0.69 eV [1, 2] has become the focus of increased attention among the III-N compounds due to its potential for near-infrared optoelectronic devices or high efficiency solar cells [3] . Moreover, the combination of the intrinsic properties of InN with quantum phenomena [4] , resulting from the growth of self-assembled quantum dots (QDs), promises further applications. However, the fabrication of high quality crystalline InN is not straightforward; one of the main difficulties is the lack of a suitable substrate. Commercially available materials (e.g. Si, GaAs, InP) have a high lattice mismatch with InN, resulting in structures which contain high densities of dislocations, sub-grain boundaries, tilts and cracks.\nIn highly mismatched heterosystems, it is well-known that the strain is relieved by the generation of an array of geometrical misfit dislocations at the interface between the two materials in the very first stages of epitaxial growth [5, 6] . These defects do not form by the movement of threading dislocations on inclined glide planes as occurs in low-misfit systems, first described by Matthews [7] . The misfit dislocation (MD) network generated at the interface reduces the free energy in the system but may adversely affect the optoelectronic properties of the devices, particularly if they generate segments that thread through the epilayer. Thus, the understanding and control of the mechanisms involved in the relaxation of these heterosystems is of great importance.\nHere we present a study by transmission electron microscopy (TEM) of the strain state of individual InN QDs grown on GaN. An analysis of moiré fringes in planar view specimens, corroborated by high resolution TEM (HRTEM), shows that that the strain in the InN QDs is almost fully accommodated by a MD network at the InN/ GaN interface.\n\nExperimental\nInN quantum dots samples were grown by Metalorganic Vapor Phase Epitaxy (MOVPE) on GaN/sapphire substrates. A thick (*1 lm) buffer layer of GaN was grown on (0001) sapphire using the usual two-step process [8] at a temperature close to 1,000°C. The temperature was then lowered to 550°C and InN QDs were deposited using a V/III ratio of 15000 and NH 3 as a nitrogen precursor. Planar view (PVTEM) and cross-section (XTEM) samples were prepared by grinding and polishing, followed by ion milling in a Gatan PIPS, and the structural characterization was carried out in a JEOL2011 microscope operating at 200 kV.\n\nResults and Discussion\nCross-section and planar view TEM showed that the QDs had a well-defined truncated hexagonal pyramidal shape [9] , with an average diameter (d) of 73 ± 12 nm and an average height (h) of 12 ± 2 nm, giving a typical aspect ratio h:d of 1:6. The QD density was *4 10 8 cm À2 . In order to estimate the strain state of individual QDs, we have carried out a detailed analysis of the moiré fringe pattern seen in planar view TEM images. These patterns arise from the interference between electron beams diffracted from overlapping materials with different lattice parameters, and are widespread in heterosystems with a high lattice mismatch. An example is shown in the [0001] zone axis PVTEM image of Fig. 1 , where the three sets of fringes corresponding to the interference of 1 \" 100 f g planes can be seen in the area corresponding to the InN QD. The translational moiré fringe spacing, D m is given by\nwhere d QD InN is the distance between 1 \" 100 f g planes in the QD and d GaN the equivalent distance in the GaN buffer layer. We assume that the GaN substrate is strain-free, and therefore d GaN = 0.2762 nm. The average value of the moiré fringe spacing of a number of InN QDs was D m = 2.9 ± 0.2 nm, allowing an average value of d QD InN to be calculated [10] . The degree of plastic relaxation of the InN can be calculated using:\nwhere e r is the residual strain, f is the lattice mismatch and d InN is the natural distance between 1 \" 100 f g planes of InN. By simple substitution, we obtain d = 97 ± 6%, i.e. essentially complete strain relief.\nThis was confirmed using HRTEM micrographs taken with the beam direction parallel to ‹0001›, as shown in Fig. 2a . The inset shows a Fourier filtered image, where the interruptions in the lattice fringes due to the MDs are marked with white arrows. These MDs occur on average every 10.5 1 \" 100 ð Þplanes in GaN (equivalent to 9.5 1 \" 100 ð Þ planes of InN) giving an average distance between misfit dislocations q = 2.9 ± 0.2 nm. The degree of plastic relaxation can be expressed as d = q/|b r | [11] , where |b r | is the edge component of the Burgers vector of the dislocation. The magnitude of the Burgers vector is jbj ¼ ð ffiffi ffi 3 p =2Þa GaN , where a GaN is the natural lattice constant of GaN, 0.3189 nm; thus |b r |=0.2762 nm. Substituting, we obtain d ef = 0.0952. Since the theoretical mismatch between these two materials, f, is:\nit means that a 98% of the lattice mismatch is accommodated by the misfit dislocation network, consistent with the result obtained from moiré fringes. We note that the fraction of the misfit strain which is relieved by relaxation at the free surfaces of the island has to be very low, implying that the island formation mechanism has to differ notably from the Stranski-Krastanov model, found in other heteroepitaxial systems [12] .\nAlthough it is possible to measure the degree of plastic relaxation and thus infer the presence of a MD network, the exact configuration of this network is not obvious from Figs. 1 and 2a. For highly mismatched systems, cross sectional HRTEM is the most commonly used technique to characterize MDs, since their edge components can be seen as an extra half-plane in the material with the smaller lattice parameter. However, this information is incomplete; the screw component of the Burgers vector cannot be determined and other features such as changes in the line direction or interaction between dislocations cannot be seen. Planar view TEM can give a more complete characterization, but in high misfit systems such as InN/GaN the MDs are too closely spaced to be resolved using diffraction contrast. However, this problem may be overcome by processing HRTEM images using the Geometric Phase Algorithm (GPA) [13] , which produces quantitative strain maps with nm resolution [14, 15] . Working on the Fourier transform of the HRTEM image, we applied separate Bragg masks around the 1 \" 100 peaks of both InN and GaN, excluding the double diffraction spots that would lead to the formation of moiré fringes, but large enough to ensure that no relevant information is missed. Phase images were obtained taking the unstressed GaN of the substrate as reference. The exact procedure can be found elsewhere [16] . In the superposition of the resulting maps, Fig. 2b , a series of lines can be clearly observed, where the red lines correspond to areas with a large difference in lattice parameter relative to the GaN substrate, and therefore are related to three different sets of misfit dislocations running along the 1 \" 210 h i directions. We can also see that these MDs do not interact-i.e. a ''star of David'' network is present. No dislocation nodes are created which would lead to the ''honeycomb'' network, observed in other heteroepitaxial systems [17] . Moreover, the hexagonal and triangular areas correspond to those of sharp contrast in the HRTEM image, indicating good fit, as shown in Fig. 2b ; whereas the dislocation lines are related to the blurred areas and therefore indicate bad fit between the InN and the GaN substrate.\nIn addition, this analysis also reveals the behavior of the MDs close to the edge of the QD. Figure 3 corresponds to a magnified area of the stress map of the boundary of the QD, calculated using elastic theory [18] from the corresponding strain maps and elastic constants [19] . A regularly spaced set of red and blue lobular shapes can be distinguished, which are in good agreement with the stress components around an edge threading dislocation [18] . Therefore, we believe that these results show a network of threading dislocations surrounding the QD. This network was also confirmed by diffraction contrast PVTEM. Figure 4 shows a weak beam micrograph showing three InN QDs with the electron beam close to 0001 h i and g ¼ 1120. The network of threading dislocations can be clearly observed, and applying the invisibility criterion for dislocations, we can conclude that they must have at least an edge component of the Burgers vector, i.e., b ¼ 1=3h \" 12 \" 10i or b ¼ 1=3h \" 12 \" 13i. This result show the tendency of MDs at heterointerfaces to bend under the influence of the free surface, reducing their self energy [20] and forming a short segment of threading dislocation running towards the surface. Among the possible slip systems for these type of dislocations, the 1=3 \" 12 \" 10 h i \" 1010 f g system has the lowest d/|b| ratio, giving a line direction of [0001] . The proposed geometry is shown schematically in Fig. 5 ; a misfit dislocation runs along the h \" 12 \" 10i direction in the InN/GaN interface with a Burgers vector b ¼ 1=3h11 \" 20i; close to the boundary of the quantum dots it bends to lie parallel 0001 h i on a 10 \" 10 ð Þ prismatic plane.\nFrom the above results, we may describe the growth characteristics of InN films on GaN. Firstly, InN grows on GaN in a 3D growth mode, forming a dense and regular spacing MD network at the interface at an early stage. Threading dislocations do not appear to be present inside the dots. However, the MDs tend to curve away from the interface towards the lateral side of the pyramid close to the QD edge. This may explain the formation of 'walls' of threading dislocations where QDs come into contact and emphasize the role of the coalescence process in the threading dislocation generation [5] . \n\nConclusions\nIn summary, we have estimated the degree of plastic relaxation in individual InN quantum dots on GaN using moiré fringe analysis and Fourier filtered HRTEM images. This shows that they are almost fully relaxed due to the presence of a misfit dislocation network at the InN/GaN interface. The geometric phase algorithm, applied to high resolution PVTEM images, allowed us to develop a complete characterization of this network, revealing that it consists of a set of three families of 60°MDs lying along the three main 1 \" 210 h i directions without interaction between them. The network consists of a mosaic of hexagonal and triangular areas of good fit between the two materials, separated by MDs that, in spite of their high density, do not generate threading dislocations inside the QD. When they are close to the boundary of the quantum dot, the dislocations bend due to the free surface forces, thus forming a network of threading dislocations surrounding the QD. \n", "record_id": "11093908"}