{"text": "A Silicon Nanocrystal Schottky Junction Solar Cell produced from Colloidal Silicon Nanocrystals\n\nabstract\nSolution-processed semiconductors are seen as a promising route to reducing the cost of the photovoltaic device manufacture. We are reporting a single-layer Schottky photovoltaic device that was fabricated by spin-coating intrinsic silicon nanocrystals (Si NCs) from colloidal suspension. The thin-film formation process was based on Si NCs without any ligand attachment, exchange, or removal reactions. The Schottky junction device showed a photovoltaic response with a power conversion efficiency of 0.02%, a fill factor of 0.26, short circuit-current density of 0.148 mA/cm2, and open-circuit voltage of 0.51 V.\n\nIntroduction\nAlthough current commercial silicon solar cells can reach 10-20% power conversion efficiency (PCE), current solar cell manufacturing processes require high temperatures, vacuum technologies, and high-grade materials, all of which increase cost. As a result, current commercial solar cells remain expensive compared to fossil fuels, around 25-50 cents per kilowatt hour in the USA [1] . Organic solar cells, which are made from carbon-containing compounds, are usually made in solution so that they can be produced with low-cost printing or coating techniques.\nLiquid-phase coating processing can bring down manufacturing costs by avoiding high temperature and high vacuum methods. However, stability and carrier transport are challenges for organic solar cells. Current solar cells are expected to last for 20-30 years at temperatures between -20 and 90°C, which organic solar cells may not be able to achieve [2] . The highest carrier mobility in polymer-based organic solar cells is typically on the order of 0.1 cm 2 /Vs [3, 4] . Compared to inorganic semiconductors, carrier mobility in organic solar cells is still low.\nColloidal nanocrystals have a number of attractive features for low-cost solar cells. Nanocrystal colloids offer the primary advantage of organic materials which lies in solution processability. Moreover, nanocrystals provide tunable broadband absorption and the photostability of traditional photovoltaic materials. Various promising nanocrystal-only solar cells have been reported, which were made by spincoating or dip-coating nanocrystals onto substrates. Among the impressive demonstrations were devices which utilize cadmium selenide (CdSe) and cadmium telluride (CdTe) nanorods for heterojunction solar cells [5] , which were found to be air stable. Lead selenide (PbSe) [6] and lead sulfide (PbS) [7] nanocrystals were used in Schottky junction solar cells. These devices are infrared harvesting and can utilize the broad solar spectrum. Although nanocrystalonly solar cells have shown encouraging efficiencies, cadmium, selenium, and lead are toxic materials that may limit their utility for large-scale deployment.\nSilicon has dominated the solar cell market since the first crystalline silicon solar cell was reported to have a 6% power conversion efficiency by Chapin in 1954 [8] .\nSilicon is an abundant and non-toxic material, and it is also well studied in industrial applications. If this conventional material can be used in a novel way (e.g., nanocrystal solution processes), the manufacturing cost of silicon-based solar cells may be reduced. Here, we report a new thin-film formation process which may be applied in silicon-based photovoltaic devices using solution-processable silicon nanocrystals (Si NCs).\n\nExperimental\nBy flowing and dissociating the precursor, silane (SiH 4 ), 10-20 nm Si NCs were synthesized through a non-thermal plasma reactor under vacuum condition [9] . Five percent SiH 4 /Helium (He) was mixed with argon (Ar) and passed through a one inch outer diameter Pyrex tube with a copper electrode wrapped around it. The flow rate of 5% SiH 4 /He and Ar were 35 and 25 standard cubic centimeters per minute (SCCM), respectively. Radio frequency power of 175 Watts was applied to the electrodes at 13.56 MHz. The Si NCs were collected downstream of the plasma on stainless steel meshes. After Si NC deposition finished, the Si NCs were weighed and transferred to an air-tight vial (Sigma-Aldrich, 27150-U) inside a nitrogen-purged glove bag (oxygen level \\ 25 ppm).\nIn traditional colloidal nanocrystal synthesis, the surfaces of nanocrystals are passivated with coordinating ligands to provide solubility of nanocrystals in the solvents. After nanocrystal-film formation, the ligands are usually removed or exchanged with shorter ligands to enhance the interaction between nanocrystals. The presence of ligands, though required for solubility of the NCs, is an impediment, since it requires additional processing steps. Removal of the ligands may also cause detrimental cracking of the NC thin films, as the interparticle distance is reduced. However, in a previous study, we found that stable colloidal suspensions of Si NCs could be produced under certain solution conditions without the use of ligands attached to the NC surfaces [10] . Specifically, Si NCs were found to form stable suspensions in 1,2-dichlorobenzene. While agglomeration of Si NCs is not completely avoided by suspension in 1,2-dichlorobenze (DCB) and agglomerates sometimes of up to a micrometer in size were observed, the suspensions did not show significant precipitation over periods of several days.\nIt should be mentioned that, against common believe, the organic ligands around Si NCs are likely not essential in terminating surface defects such as dangling bonds. The surface of plasma synthesized Si NCs is largely covered with hydrogen, originating from the silian (SiH 4 ) precursor used for plasma synthesis. In [12] , we demonstrated that the surface coverage with hydrogen has a much more significant impact on the photoluminescence quantum yield and the dangling bond density of Si NCs than the coverage with organic ligands.\nFor the formation of Si NC colloids, the following protocol was used: DCB was dried with molecular sieves and degassed by bubbling nitrogen for 60 min in a Schlenk line to reduce the oxygen and moisture level. Si NCs were dispersed in DCB (ACROS) to form a cloudy, yet stable solution. The solution concentration was 8 mg Si NCs/ml DCB. To reduce Si NC agglomeration in the solution, the cloudy solution was sonicated for 20 min. The devices were fabricated by the spin-cast method immediately after sonication. The solution preparation process was conducted in a glove box (oxygen and moisture level \\ 1 ppm).\n\nDevice Fabrication\nA Schottky junction solar cell is likely the simplest photovoltaic device that can be fabricated. While Schottky junction solar cells based on NC films with promising efficiencies were demonstrated based on PbSe [6] or PbS [7] , to our knowledge, no prior demonstration of a Schottky junction solar cell based on Si NCs has been reported.\nA scheme of the device architecture is shown in Fig. 1 . To fabricate Si NC Schottky junction devices, Si NC thin films were spin-cast onto indium tin oxide (ITO)-coated glass substrates at 700 rpm in a glove box. To obtain the 250-nm Si NC thin film, several spin-coating steps were required. After Si NC deposition, devices were completed by the deposition of 100 nm of aluminum on the top of the film as the electrode. The active area of each device was 0.046 cm 2 . Spin-casting of Si NC suspension from DCB led to a rough and densely packed film, as shown by the scanning electron micrograph (SEM) in Fig. 2 . The rough morphology was expected due to the agglomeration of Si NCs. It may negatively affect the device performance. Hence, further improvements in solubilizing Si NCs are desirable.\n\nResults\nSolar cell devices were tested in an enclosure under dry nitrogen atmosphere in order to avoid the oxidation of the Si NCs, which was found to be detrimental for electron conduction through the Si NC films. There were six devices on one substrate; in this study, we found that one device Fig. 1 Schematic of a Si NC photovoltaic device short-circuited while the other five devices had similar performance. The current-voltage (I-V) of one device is shown in Fig. 3a . This device had a 0.02% PCE and a fill factor of 0.26, with short circuit-current density of 0.148 mA/cm 2 and open-circuit voltage of 0.51 V. The other devices showed similar performance. The comparison to the I-V characteristic under dark conditions (i.e., without irradiation of the device) clearly shows that the device exhibits a photovoltaic effect. The fact that the I-V characteristic is almost linear in the forth quadrant suggests that the device has only a small shunt resistance, which would imply the electron-hole recombination is a significant loss channel in this device. This is not surprising, as the hydrogen-terminated surfaces of the Si NCs still provide surface trap states, which may act as recombination centers. The incident photon-to-current conversion efficiency (IPCE) for the Si NCs-only device is shown in Fig. 3b . As to be expected from the relatively poor performance of the device, the IPCE is relatively small with a maximum of * 4% in the ultraviolet.\nThe optical absorption spectrum of Si NC-only films on the ITO substrate was measured and is displayed in Fig. 4 .\nThe IPCE trends of the Schottky photovoltaic device matched the absorption behavior of Si NC film. Figure 4 demonstrates that the Si NC film shows strong absorption only in the blue and ultraviolet range of the spectrum. While the Si NCs used here have a band gap only slightly larger than the Si bulk band gap of 1.1 eV, the absorption in the red-to-green range of the optical spectrum is poor. This is a consequence of the Si NCs still behaving as indirect band gap semiconductor material, a behavior that only breaks down once the Si NC size becomes smaller than *2.5 nm [11] . However, it is unlikely that using smaller nanocrystals would provide any benefit for the performance of the devices. First, the optical absorption cross section of Si NCs was found to decrease with NC size, even for very small nanocrystals [13] . Second, the large increase in surface area and surface-related defects for smaller NCs and the presence of more grain boundaries would be an additional impediment to electron transport. For future studies, it may be interesting to study other means of increasing the absorption of the Si NCs, such as alloying silicon with germanium to for Si x Ge 1-x NCs, which may show improved absorption [14] . \n\nConclusions\nIn conclusion, the results of this study demonstrate that colloidal processing of non-functionalized Si NCs can be a new approach for silicon-based thin-film solar cell fabrication. Compared to the other nanocrystal thin-film formation processes, this process does not involve any attachment, exchange, or removal of ligands, which could reduce fabrication steps and cost. We demonstrated the first Si NC-only Schottky junction photovoltaic devices, which were successfully produced by spin-coating Si NC suspensions in an inert atmosphere. The devices show a clear photovoltaic response, which indicates that the Si NC thin film is continuous without short-circuiting problems. The performance of the photovoltaic devices was poor, likely due to poor absorption of radiation and significant charge carrier recombination. However, the results demonstrate the clear potential of solution-processed Si NCs for the low-cost formation of electronic devices such as solar cells and thin-film transistors.\n", "record_id": "11181068"}