{"text": "Studies on optical characteristics of CuInSe2 thin films\n\nabstract\nCuInSe2 is considered as a striking semiconductor for second generation solar cells. An investigation of optical properties of CuInSe2 thin films is essential to evaluate its perfectibility as high efficiency solar cells. The films were fabricated by thermal co-evaporation technique. For this experiment, a shimadzu spectrophotometer of model number 1201 is used. The optical properties of these films are determined for the wavelength range 350 nm–1100 nm. From the experiment it is evident that the reflectance and transmittance of the films are negligible in comparison to the absorption of these films. The high absorption coefficient of the order of 104/cm of the film material also supports this. The band gap of the CuInSe2 films was evaluated to be 1.1 eV. From XRD and EDAX analysis it is evident that CuInSe2 films are polycrystalline in nature having ideal stoichiometric composition.\n\nIntroduction\nThe energy plays a vital role for development of human civilization. There is certainly a direct correlation between the advancement of a country and its consumption as well as utilization of energy. World reserve of conventional resources of energy are limited and will be used * E-mail: arif_apece@hotmail.com up once. Foreseeing the danger in the near future, the whole world is looking for safe and non-exhaustible energy sources for their future usages. Among the all available alternatives, solar energy is the best option if it can be utilized in a cost effective way. Therefore, research is going on for obtaining reliable solar cells. Among the available solar cell technologies, thin film technique is considered as one of the most viable methods [1] .\nSeveral organic and inorganic semiconductor materials are proposed for thin films solar cells. Among the all, CuInSe 2 is considered as one of the vital solar materials which is still under extensive laboratory research. It has an ideal band gap and high absorption coefficient that provide desired electrical and optical properties for solar cells [2] . In addition, CuInSe 2 offers easy and low cost method to produce large area solar cells at usual room temperatures [3] . Several fabrication technologies are existing to manufacture CuInSe 2 solar thin films [4] and different characteristics of the films are also evaluated for the determination of its perfectibility as high conversion efficiency solar cell [5, 6] . In this paper, the optical properties of CuInSe 2 thin films prepared by co-evaporation technique are determined.\n\nCo-evaporation technique for fabrication of thin films\nThin films for this experiment were prepared by thermal co-evaporation technique on glass substrates in vacuum chamber under pressure of the order of 10 −5 torr having thickness within 1.9 to 2.2 µm. A crossed Cu-In source arrangement with a carbon block at the center was made with tungsten boat for copper and alumina coated tantalum boat for indium. The selenium source was a high capacity graphite Knudsen cell. The copper and indium deposition rates were controlled by feedback to their sources from an Electron Impact Emission Spectroscopy (EIES) detection system whereas the selenium deposition rate was measured by with a quartz crystal monitor. The glass substrates were cleaned first in decon solution, ultrasonic bath and then washed in deionised water and isopropyl alcohol. Different parameters of these films are given below in Table 1 . \n\nResults\nThe observed transmittance, reflectance and absorptance spectra of these films are shown in Figure 2 , Figure 3 and Figure 4 respectively. The optical absorption coefficient (α) for these films is calculated using the formula [7, 8] :\nwhere R, T and represent reflectance, transmittance and film thickness respectively. The absorption coeffi- cients thus calculated are plotted against the wave length which is given in Figure 5 . The general expression for the absorption by excitation of electron across a direct band gap (E ) is given by the following equation [8, 9] :\nwhere ν is the photon energy. Thus a plot of (α ν) 2 against ν will give the value of E and such a plot is shown in Figure 6 . The extinction coefficient ( ) is determined from the following equation [10] :\nwhere, α is the absorption coefficient of the film and λ is the wavelength of the incident light. A plot of extinction coefficients for CuInSe 2 films is shown in Figure 7 . Figure 9 shows the EDS of the CuInSe 2 films. We can see that the sample is Cu-rich in composition and no other impurity can be detected except Cu, In and Se. The atomic \n\nDiscussions\nIn the UV to visible wavelength range the transmittance (%) of the films is very low (Figure 2 ) and from visible to infra-red wavelength the transmission through the film is increasing. The reflectance (%) is also increases (5%-20%) with wavelength from UV to visible range ( Figure 3 ). The absorptance (%) of these films are very high (Figure 4 ) but from the NIR frequencies the absorptance is found to decrease sharply. The absorption coefficients of the film material are high in the order of 10 4 /cm ( Figure 5 ) and its value decreases in the NIR region for all the films. The band gap of the CuInSe 2 thin film is found to be 1.1 eV ( Figure 6 ) which conforms to the previous experiments. The value of extinction coefficient is also found to vary with wavelength with a maximum of 22 × 10 −2 ( Figure 7 ). Three well-defined characteristic peaks at 26.6˚, 44.1å nd 52.4˚, correspond to the diffraction of the (112), (204) and (312) planes, confirms the chalcopyrite structure (Figure 8) . The atomic percentages of films are about 1:1:2 (Cu, In and Se) in all samples, which is close to the ideal stoichiometric composition (Figure 9 ).\n\nConclusion\nFor fabrication of high efficiency inorganic thin film solar cells, CuInSe 2 and its allied materials have got the highest preference worldwide. The study of optical properties of CuInSe 2 thin films is a very important experiment to evaluate the suitability of the fabrication process for real field applications. A special attention was given to maintain the technological parameters of the films during fabrication process. From our experiment, band gap energy of three CuInSe 2 thin films was found to be 1.1 eV having the high values of absorption coefficient which conforms the results of previous experiments by different researchers. Besides the XRD and EDAX analysis reveals that the films are of chalcopyrite structure having ideal stoichiometric composition. We, therefore, can say that the obtained results suggest that CuInSe 2 is a suitable material for fabrication of practical thin film solar cells.\n", "record_id": "135893324"}