{"text": "Photocatalytic removal of hazardous Ponceau S dye using Nano structured Ni-doped TiO2 thin film prepared by chemical method\n\nabstract\nMany attempts have been made by researchers for the removal of various dyes using nano structured Ni-doped TiO2; however, removal of ‘hazardous Ponceau S dye’ using nano structured Ni-doped TiO2 has been not studied yet. In the present work, environmental application of Nano structured Ni doped TiO2 has been studied. Nano structured Ni-doped TiO2 thin films were deposited by the chemical method on a glass substrate. The prepared thin film was characterized by XRD, SEM, and EDX. The crystal size calculated from XRD is about 26.2 nm. The SEM analysis reveals nano spherical morphology of average particle size about 92 nm. The optical analysis was carried by using UV–visible spectroscopy. The band gap estimated from absorbance spectra for thin film was around 3.5 eV, making suitable Ni-doped TiO2 for photocatalytic removal of hazardous Ponceau S dye. In photocatalytic application different parameters like dye concentration, contact time, pH, UV light and sunlight were optimized for the removal of Ponceau S dye, respectively. The change in chemical oxygen demand after photo catalytic treatment was also studied.\n\nIntroduction\nTextile industries use large amounts of dyes for the purpose of coloring, causeing serious environmental issues when these dyes come in contact with water bodies (Chen et al. 2005) . The discharge of effluents containing modern synthetic dyes of high stability to water bodies cause harm to aquatic life (Denizil et al. 2000; Acosta et al. 2005) . Ponceau S is a red colored dye and belongs to the family of azo dyes. Being an azo dye, it may elicit intolerance in people allergic to salicylates (aspirin), it is a histamine liberator, and may intensify symptoms of asthma.\nDifferent methods have been developed to control the pollution due to textile dyes. Among these methods like coagulation, filtration and adsorption with carbon were conventional methods. Since last few years, the photocatalytic decomposition of organic pollutants wastewater using semiconductors as photocatalyst has been a promising technique (Bahanmann et al. 1991; Hermann 1999; Hoffmann et al. 1995; Mills and Hunte 1997; Blake 1999; Boye et al. 2002) . Now a days researchers have focused on the method of photocatalysis by employing the nanosized semiconductor materials as catalyst for water purification; this method is also known as an advanced oxidation process (AOP). The AOP is initiated upon absorption of UV radiation having energy greater than band gap energy by semiconductor photo catalyst with the formation of electron-hole pair (e -/h ? ). After reaction with water, these holes can produce hydroxyl radicals with high oxidizing potential (Fijushima et al. 2000) .\nThe titanium dioxide (TiO 2 ) is most widely used semiconducting material for semiconductor photocatalysis because it is non-toxic, non-expensive and efficient photocatalyst for this purpose (Linsebigler et al. 1995; Kansal et al. 2007 ). The TiO 2 has gained much attention because of strong photocatalytic abilities to purify pollutants in air and water under irradiation (Konstantinou et al. 2001; Buechler et al. 1999) . TiO 2 thin films can be prepared by various methods (Ghorai et al. 2007; Zhang et al. 2005 ).\n\nMaterials and methods\nAll the chemicals were of analytical grade. For photo catalytic study the water soluble Ponceau S dye (M F C 22 H 12 N 4 O 13 S 4 Na 4 and M W 760.56 g) and nanosized Ni doped TiO 2 thin film prepared by chemical bath deposition (CBD) method were used. The structure of Ponceau S dye is shown in Fig. 1 . A stock solution of 100 ppm of Ponceau S dye was prepared in distilled water. Different concentrations (10, 20, 25, 30, 40 and 50 ppm) of Ponceau S dye were prepared from stock solution. The pH of Ponceau S dye solution was adjusted by adding HCl and NaOH. The rate of photocatalytic degradation was followed by measuring the absorbance of sample after different intervals of time by using UV-Visible spectrophotometer (Systronics-2203) using quartz cell of 1 cm path length at max 519 nm. Instrumentation X-ray diffraction measurements were performed on D8 ADVANCE (BRUKER) model X-ray diffractometer using Cu Ka1 radiation of wavelength 1.54060 Å as X-ray source. The XRD was recorded over 2h range of 10°-80°. The scanning electron microphotographs of Ni-doped TiO 2 thin film was obtained using Hitachi s-4800 FE-SEM equipment.\nThe photocatalytic degradation of Ponceau S dye was carried out in a Photocatalytic reactor with a 400 W medium pressure Mercury lamp with nominal wavelength range 220-1,400 nm. The reactor consists of a cylindrical Pyrex glass reactor, a double-walled quartz cooling water jacket to maintain the temperature and prevent the reactor from excessive heating. The reaction solution was stirred with magnetic stirrer at a constant speed. The changes in dye concentration are followed using spectrophotometer (Systronics 2203). The pH measurements are carried out using an equiptronics digital pH meter (Model-E610).\n\nThin film preparation\nThe chemicals used were of analytical grade and solutions were prepared in double distilled water. In preparation of Nidoped TiO 2 thin film by chemical bath deposition method TiCl 4 , ethanol and nickel nitrate were used as starting materials. The thin film was deposited on previously cleaned glass substrate. The chemical bath was prepared by slow addition of TiCl 4 to ethanol; the solution was heated on water bath at 75°C for 2 h after adding nickel nitrate by dipping glass substrate in it. The glass slides were removed from the bath, washed and dried in air. The prepared thin film of TiO 2 was annealed at 450°C for 2 h.\n\nStructural analysis\nPhase and purity of as-deposited Ni-doped TiO 2 thin films have been analyzed by XRD. The XRD pattern for Nidoped TiO 2 thin films annealed at 450°C for 2 h are as shown in Fig. 2 . The defined peaks reveal the nanocrystalline nature of deposited material. Figure 3 shows SEM images of nano crystalline Ni-doped TiO 2 thin film. SEM images show the dense, uniform nanosperes of nano crystalline TiO 2 of average diameter around 90-92 nm.\n\nSurface morphology\nEnergy dispersive X-ray spectrometry Elemental analysis was performed with the help of energy dispersive X-ray spectrometry (EDX). Figure 4 shows EDX images for Ni-doped TiO 2 which shows peaks for Ti, O and Ni. Thus, confirms the doping of Ni over TiO 2 thin film.\n\nOptical studies\nThe UV-visible spectra of Ni-doped TiO 2 thin films were recorded in the range 300-800 nm. Figures 5 and 6 show the wavelength-dependent absorption and transmission spectra of Ni doped TiO 2 thin film, respectively. Transmittance spectra of Ni doped TiO 2 thin film shows that film is highly transparent in the visible wavelength region, with an average transmittance of about 55 %. The optical band gap E g for Ni doped TiO 2 thin films was estimated from absorption spectra. Figure 7 shows plot of (absorbance) 2 versus photon energy (ht), when extrapolated to zero the absorption provides the value of energy band gap (E g ) about 3.5 eV, making it suitable for photocatalytic removal purpose. Photocatalytic behaviours\n\nEffect of initial dye concentration\nA series of experiments were performed to optimize the initial dye concentration. The effect of initial dye concentration on the rate of removal of Ponceau S dye was studied by carrying out a series of experiments with different initial dye concentration (10, 20, 30 and 40 ppm) at constant pH of 9. The results are shown in Fig. 8 . It was observed that the percentage removal decreases with increasing initial concentration of dye.\n\nEffect of contact time\nThe effect of contact time on removal percentage of Ponceau S dye is shown in Fig. 9 . The effect of contact time was studied with 25 ppm initial dye concentration. The percentage removal increases with increasing time. The removal rate increases rapidly in the start and then increases slowly.\n\nEffect of pH\nThe pH of the dye solution plays an important role in the whole process of photocatalytic degradation. Using Ni doped TiO 2 thin films as photocatalyst the degradation of Ponceau S dye was studied in pH range 3-11. It was observed that the rate of removal of Ponceau S dye increases with increasing pH up to 8 and then slightly drops. The effect of pH on removal percentage is shown in Fig. 10 .\n\nChemical oxygen demand\nThe chemical oxygen demand test is a technique to measure the organic strength of wastewater. The test allows \n\nEffect of UV light and sun light\nThe effect of artificial UV light condition in a laboratory and sunlight on the removal percentage of Ponceau S dye using Ni doped TiO 2 thin film was also studied. The results are shown in Table 1 . The results reveal that greater removal is obtained in the presence of UV light than sunlight. In the presence of a catalyst the removal percentage is very high than that in the absence of catalyst for both UV light and sunlight conditions.\n\nConclusion\nNano structured Ni doped TiO 2 thin film was successfully prepared by chemical bath deposition from TiCl 4 , ethanol and nickel nitrate. The prepared thin film was successfully applied for the removal of hazardous Ponceau S dye from aqueous medium. The removal rate was found to be increased significantly with increasing irradiation time while on increasing initial dye concentration the removal rate drops. The removal rate increases from acidic to alkaline region, and maximum removal was obtained at the pH 8, after that removal rate drops slightly. The chemical oxygen demand of aqueous dye solution decreases when exposed photocatalytic treatment. Fig. 11 Effect of photocatalytic treatment on chemical oxygen demand \n", "record_id": "137261967"}