{"text": "Magnetic properties of cobalt ferrite synthesized by hydrothermal method\n\nabstract\nIn this study, the magnetic properties of nanocrystalline cobalt ferrite synthesized via the hydrothermal method have been investigated. The structural properties of the produced powders were investigated using X-ray diffraction (XRD) and scanning electron microscopy (SEM). The observed XRD pattern confirmed the spinel/cubic structure of the prepared cobalt ferrite. The SEM pictures show that the simple hydrothermal method produces uniform sphere-shaped nanopowders. Moreover, infrared spectroscopy was used to confirm the formation of cobalt ferrite particles. Magnetic hysteresis was measured using a vibrating sample magnetometer in a maximum field of 10 kOe. The magnetization of the prepared nanoparticles was investigated, and the saturation magnetization (M s), remanence (M r), and coercivity (H c) were derived from the hysteresis loops. The results revealed that the cobalt ferrite nanoparticles synthesized via the simple hydrothermal method exhibit superior magnetic properties.\n\nIntroduction\nFerrite nanoparticles have been used for a variety of applications due to their potential electromagnetic properties. These materials can find application where magnetic materials, refractory materials, or catalysts are needed [1] . As an example, cobalt oxide has been used as an important p-type semiconductor with direct optical band gaps at 1.48 and 2.19 eV [1] . Co 3 O 4 has been investigated extensively as a promising material in gas-sensing and solar energy absorption and as an effective catalyst in environmental purification and chemical reactions [2, 3] . Co is a wellknown ferromagnetic material which is commonly used as an alloying element in permanent magnets. Co exists in two crystallographic forms: hexagonal close packed (HCP) and face-centered cubic (FCC). HCP holds a stable phase at room temperature, whereas FCC is only stable at temperatures above 450°C [4] . Thus far, liquid-phase synthesis routes are the most successful methods in the preparation of Co nanoparticles. Liquid-phase synthesis processes include metal salt reduction, reverse micelles, hydrothermal/solvothermal methods, and thermal decomposition of organometallic precursors. Among all of these synthesis routes, the hydrothermal/solvothermal method has become popular due to its simplicity, low-cost, and superior morphology of the synthesized cobalt ferrite oxide nanoparticles [5] . The hydrothermal/solvothermal method can be employed to synthesize crystalline structures (films, nanoparticles, single crystals, etc.) from aqueous solutions under high vapor pressure. Controlling the solution recrystallization and the growth of particles in this method result in the production of Co 3 O 4 crystals with various morphologies, such as nanospheres, nanorods [6] , nanocrystals, nanocubes, hollow spheres, nanorod bunches, and urchin-like crystals [7] . Numerous factors which affect the production of cobalt oxide and its characterization, such as pH, temperature, capping agent, and annealing temperature, have been studied elsewhere by the authors [8] . The hydrothermal synthesis method provides an enhanced reaction rate for the production of multi-metal oxide compounds. The particle size of the product depends on the hydrolysis rate and the solubility of the metal oxide. Hydrothermal conditions can be varied to control the nucleation and crystallization of the particles and, hence, crystal size and morphology. In this study, the hydrothermal method has been used to prepare cobalt oxide ferrite, and its magnetic properties have been investigated. The simple hydrothermal method has led to the formation of cobalt ferrite oxide nanoparticles which exhibit superior magnetic properties.\n\nExperimental Materials\nCobalt (II) nitrate hexahydrate Co(NO 3 ) 2 Á6H 2 O (99 %) and iron(III) nitrate nonahydrate Fe (NO 3 ) 3 Á9H 2 O (99.9 %) were obtained from Acros Organics (Morris Plains, NJ) and were used without further purification. Sodium hydroxide (NaOH) was obtained from Sigma Aldrich (St Louis, MO).\n\nSynthesis of CoFe 2 O 4 nanoparticles\nThe hydrothermal method was used to synthesize cobalt ferrite nanoparticles. Stoichiometric aqueous mixtures of cobalt nitrate hexahydrate (Co (NO 3 ) 2 Á6H 2 O), ferric nitrate nanohydrate (Fe (NO 3 ) 3 Á9H 2 O), and NaOH were used as precursors and dissolved in deionized water with a molar proportion of Fe/Co = 2 (50 ml). An aqueous solution of 3 M NaOH was used as the precipitating agent. The asprepared metal nitrate solutions were added to the boiling solution of 3 M NaOH (25 ml) at 150°C. The obtained solution was stirred for 6 h while maintaining the reaction temperature at 150°C. The pH of the mixture was adjusted to 9 to control the nucleation [9] and was further stirred for 3 more hours. The prepared solution was then transferred to a 100 ml Teflon-lined stainless autoclave. The autoclave was sealed and heated to 180°C for 10 h. The pressure in the sealed autoclave became lower than the equilibrium vapor tension of the pure water at this temperature due to the presence of NaOH in the solution. The hydrothermal reaction leading to the production of CoFe 2 O 4 nanoparticles is presented in Eq. (1). After the hydrothermal reaction, the autoclave was turned off and allowed to stand until the temperature dropped to room temperature. The obtained dark powder was washed with water and ethanol three times and dried at 100°C for 5 h. The resulting powder was then collected and calcined at 500°C for 4 h [8] :\nCharacterization X-ray diffraction (XRD) analysis was performed to investigate the crystallography of the prepared powder using a Bruker D8 Focus powder diffractometer with Cu K radiation at a wavelength of 0.15406 nm. The scanning electron microscope (SEM) pictures were used to determine the surface morphology of the synthesized cobalt oxide ferrite using a Zeiss SUPRA55 SEM. The scanning electron micrographs were obtained at an operating voltage of 3 kV. The Fourier transform infrared (FTIR) spectra of the samples were obtained using a thermo-scientific NICOLET6700 instrument. The magnetic properties of the prepared cobalt oxide ferrite were examined using a vibrating sample magnetometer (VSM) (model 7407 Lakeshore) from room temperature to 77 K, with applied field up to 10 kOe (maximum).\n\nResults and discussion\nThe XRD pattern for the obtained nanoparticles is shown in Fig. 1 . The mean crystalline size for each sample was calculated using the Scherrer's equation:\nwhere D is the crystalline size (nm), K presents the Scherrer constant which has a value of 0.89, k is the wavelength (nm), b is the full width at half maxima of the (3 1 1) diffraction peak, and h is the diffraction angle with nearly no impurities [10, 11] . The sharp diffraction peaks indicate the transparency of the nanocrystals with the most intense (3 1 1) reflection.\nAs it can be noted in SEM micrographs (Fig. 2) , CoFe 2 O 4 nanoparticles prepared by the hydrothermal method have a uniform, mono-disperse, and spherical/cubic structure with narrow particle size distribution. Very fine spherical CoFe 2 O 4 particles with some extent of aggregation can be observed in the SEM pictures. The average size of nanoparticles was about 34 nm which is in agreement with the Scherer's equation calculations.\nThe FTIR spectrum describes the position of the ions in the crystal structure and their vibration modes. The two common bands in almost all spinel ferrite are found in the region of 400-600 cm -1 . The frequency bands around 606-616 and 421-430 cm -1 are assigned to the tetrahedral and octahedral clusters and also confirm the presence of Fe metal oxide (M-O) stretching vibration in cobalt ferrite particles in Fig. 3 . The peaks at 600 and 450 cm -1 represent the characteristic peaks of Co 2 O 3 [12, 13] . The antisymmetric stretching, symmetric stretching, out of plane bending, antisymmetric in-plane bending, and symmetric in-plane bending peaks of the cobalt metals are observed at 1629, 1388, 870, 729, and 664 cm -1 , respectively. The broad peak in the frequency range of 3450-3550 cm -1 is attributed to O-H stretching vibrations of the water molecules [14, 15] .\nMagnetization versus the applied field plot at room temperature for the obtained powder is shown in Fig. 4 . The instrument reports an estimation of the magnetic properties of the samples. There is a direct relationship between the coercive force and the particle size. It has been reported that the coercivity increases with the increase in the particle size [16] . The prepared samples exhibited a saturation magnetization (M s ) of 56.88 emu g -1 and remnant magnetization (M r ) of 21.44 emu g -1 . The coercive force (H c ) of the samples was reported to be 507.8 Oe, which is in agreement with other reports showing superior magnetic properties [17] .\n\nConclusion\nCobalt ferrite nanoparticles have been successfully synthesized using the hydrothermal synthesis method which is known to considerably accelerate the formation of CoFe 2-O 4 . The hydrothermal synthesis method yielded fine particles because of the enhancement in the rate of hydrolysis and dehydration of metal salts at elevated temperatures. The SEM and XRD results showed that the obtained nanoparticles had a spherical shape with uniform particle size distribution and cubic crystallography. Moreover, infrared spectroscopy confirmed the formation of cobalt ferrite particles. The hysteresis loops of samples, obtained using a VSM, confirmed the super-paramagnetic behavior of the cobalt ferrite nanoparticles.\nOpen Access This article is distributed under the terms of the Creative Commons Attribution 4.0 International License (http:// creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium, provided you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made.\n", "record_id": "137362119"}