{"text": "Optical properties and bandgap evolution of ALD HfSiOx films\n\nabstract\nHafnium silicate films with pure HfO2 and SiO2 samples as references were fabricated by atomic layer deposition (ALD) in this work. The optical properties of the films as a function of the film composition were measured by vacuum ultraviolet (VUV) ellipsometer in the energy range of 0.6 to 8.5 eV, and they were investigated systematically based on the Gaussian dispersion model. Experimental results show that optical constants and bandgap of the hafnium silicate films can be tuned by the film composition, and a nonlinear change behavior of bandgap with SiO2 fraction was observed. This phenomenon mainly originates from the intermixture of d-state electrons in HfO2 and Si-O antibonding states in SiO2.\n\nBackground\nWith the downscaling of CMOS devices, high-k materials are required to replace SiO 2 as gate dielectrics in order to decrease the direct tunneling leakage current and, at the same time, maintain the gate capacitance at a certain value [1] [2] [3] [4] [5] [6] [7] . Among the potential candidates, hafnium silicate was chosen as the first generation of highk dielectrics for its high dielectric constant and excellent thermal stability [8, 9] . Compared to other deposition methods used for hafnium silicate film fabrication, atomic layer deposition (ALD) has the advantages of precise film thickness and stoichiometry control, which are of great significance to optimize the material especially for the shrinking devices [10] [11] [12] [13] [14] [15] .\nSince accurate determination of the optical properties is an essential prerequisite for device simulations and gives the opportunity to improve material preparation, we have applied vacuum ultraviolet (VUV) spectroscopic ellipsometry to investigate the optical characteristics of a set of hafnium silicate films in this work. It will also gain us an insight into the effect of film composition on the electrical performance and chemical states of hafnium silicate dielectric films.\n\nMethods\nThe targeted HfSiO x thin films were deposited on lightly doped p-type Si (100) substrates by a BENEQ TFS-200 ALD system (BENEQ Oy, Espoo, Finland) at 200°C. The Si wafers were cleaned via RCA cleaning process at first, then prior to film growth, they were cleaned again in a diluted HF solution (50:1) to remove the native oxide and passivate the silicon dangling bonds followed by a deionized water rinsing and drying in N 2 . During deposition process, precursors for Hf, Si, and O were TEMAH, TDMAS, and O 2 plasma respectively. TEMAH was kept at 80°C in a stainless bottle, and TDMAS was kept at room temperature. The O 2 plasma was activated at the power of 100 W. Typical pulsing sequences during the ALD process are 1/3/2/2 s (TEMAH/Ar purge/O 2 plasma/ Ar purge) and 2/2/2/2 s (TDMAS/Ar purge/O 2 plasma/Ar purge) for the growth of HfO 2 and SiO 2 films, respectively. For the HfSiO x films, SiO 2 percentage was controlled by deposition cycle ration of HfO 2 : SiO 2 . Pure HfO 2 , SiO 2 , and five groups of HfSiO x samples with different atomic compositions were prepared.\nFor optical characterization, each sample was measured using a Woollam variable-angle vacuum ultraviolet spectroscopic ellipsometer (SE), and the data were analyzed with the software Complete EASE by J.A. Woollam. The measurements were taken at two angles of incidence, 67.5°and 75°, with a spectroscopic range of 0.6 to 8.5 eV.\nThen, to determine the optical properties of the target samples, such as layer thickness and optical constants, the model-based analysis were carried out. Complete EASE includes a wide range of built-in functions, such as Lorentz, Gaussian, Drude, Tauc-Lorentz, and CodyLorentz. These functions can be used to approach a wide variety of thin film, ranging from dielectrics and organics to semiconductors and metals. In this work, the Cauchy dispersion relation was adopted for the determination of the films thickness and the optical properties were analyzed with the Gaussian dispersion model.\n\nResults and discussion\nThe low energy range of each spectrum (0.6 to 4 eV) was used to determine the thickness of the sample by Cauchy dispersion relation, which is often adopted to describe the refractive index for transparent films in the visible spectral range. The Cauchy formula can be given\nThe extinction coefficient k equals 0 at all used wavelengths. In this equation, the 'A' parameter relates to the approximate amplitude for the material index, while 'B' and 'C' parameters provide the shape and curvature of the index versus wavelength. Film thicknesses of each sample obtained from Cauchy dispersion relation are listed in Table 1 (in the table HfSiO x films are denoted as (HfO 2 ) 1-x (SiO 2 ) x , where x refers to different Si concentrations) together with the MSE values. 'MSE' is an acronym for mean squared error. It is the metric used to quantify the agreement between the experimental data and the parameterized optical model. 'Perfect' agreement would yield a MSE value equal to 0, and large deviations away from 0 will lead to erroneous extracted physical values (i.e., thickness and optical constants) [16, 17] . From Table 1 , it can be seen that for all samples, MSEs are very small values, and error bar of each sample is at least 2 magnitudes smaller than the thickness obtained, proving the correctness of extracted thickness.\nTo analyze the optical properties (behavior of refractive index and extinction coefficient), film thickness acquired above were fixed and Gaussian dispersion model was used with the fitted range expanded to 0.6 to 8.5 eV. The Gaussian oscillator features a Gaussian line shape for the imaginary part of the complex dielectric function ε 2 , with a Kramers-Kronig consistent line shape for the real part of the dielectric function ε 1 [18] :\nIn the equations above, the P stands for the Cauchy principal part of the integral. The Gaussian oscillator model employs four setting parameters: the amplitude A, the broadening parameter B r , the center energy E n , and the non-dispersive term ε 1 (∞). The two fitting parameters B r and E n are in units of energy while A and ε 1 (∞) are dimensionless. ε 1 (∞) represents the contribution of the optical transitions at higher energies and appears as an additional fitting parameter [19] .\nAs an example, the experimental SE data Ψ and Δ of HfSiO x sample with 80% SiO 2 are shown in Figure 1 . For both incidence angles, fairly good agreement between the experimental and fitted spectra are clearly demonstrated, revealing that the Gaussian model works well and optical constants of the film can be exactly determined by the best fitting results. Data of other samples are not shown here due to space limitations, but fitted data for all samples match as well with the experimental data. Figure 2a shows the refractive index n as a function of photon energy for all samples as deduced from the analysis of the SE results. The n value for HfO 2 measured at 550-nm (2.26 eV) wavelength is 1.84, which is similar with the previous report [20] . In addition, as shown in [21] , the refractive index can be related to the evolution of packing density and polarization. Since Si-O bonds tend to be less polar than the corresponding Hf-O bond [22] , the increase of Si concentration in the film would lead to a decrease of the film polarization, then lower polarizability results in the lowering of the refractive index. The evolution of extinction coefficient k is shown in Figure 2b . For all samples, k saturates to zero in the visible region, suggesting the realization of high quality HfSiO x films in terms of optical properties. An abrupt increase in the extinction coefficient for higher photon energy is due to the fundamental bandgap absorption in the films. Moreover, as can be seen in Figure 2b , there is also a mall band tail below the gap. This weak absorption is attributed to the Urbach tail which exists below the bandgap of amorphous materials and due to the disorder of the amorphous network [23, 24] . Furthermore, with the increase of Si concentration, decrease in the magnitude of the exponential tail can be observed, and similar results were obtained by the Cody-Lorentz model and Tauc-Lorentz model [16] . According to J. Price et al., this phenomenon is attributed to Si atoms filling the O 2 vacancies/defects in the HfO 2 films. By filling these vacancies, there is less disorder and therefore, less intraband absorption.\nOptical bandgap of the films were determined by plotting the empirical expression (nαhν) 1/2 versus hν, as shown in Figure 3 , where n, α, and hν stand for the index of refraction, the absorption coefficient, and the photon energy, respectively. The absorption coefficient α can be easily obtained by the equation α = 4πk/λ, where λ is the wavelength of the incidence light [25] . By extrapolating the straight near the band edge to zero, the crossing point with the x-axis is considered to be the optical bandgap of the film. To make it clear, bandgap determination of HfO 2 is taken as an example and is shown in the inset of Figure 3 . The extracted bandgap of pure HfO 2 film is 5.64 eV, in good agreement with the previously reported values 5.25 to 5.8 eV for HfO 2 [23, 26, 27] .\nBased on the method depicted above, the set of optical bandgaps acquired in Figure 3 is plotted in Figure 4 for details. As an exception, the bandgap of pure SiO 2 is not shown in Figure 4 , because although the fitted range is sufficient for most of the samples, it is not for pure SiO 2 and the linear part of the curve in Figure 3 has not appeared yet. It is clearly demonstrated in Figure 4 that with increasing Si concentration, there is a monotonically increase in the bandgap of the films. This change mainly originates from the slight difference in electronic structure. And if we go into details, it can be found that E g increases rapidly when SiO 2 fraction is more than 60%. The similar nonlinear change of HfSiO x bandgap with Si concentration was also observed by others [28, 29] . It is known that the nonbonding O 2p states form the top of the SiO 2 valence band and that the Si-O antibonding states form the bottom of its conduction band [17] . In the case of HfO 2 , the top of valence band are also composed of O 2p states but the bottom of conduction band states are mostly composed of Hf localized 5d state [28] . Similar to the explanation given by H. Kato et al. in the case of ZrSiO x film [29] , the rapid decrease in E g with an increase in Hf concentration is considered to be attributed to the increase in the d-state electrons. When Si fraction is lower than 0.6, it seems that the bottom of the conduction band is almost formed by the Hf d-states, leading to the gradual decrease in E g .\n\nConclusions\nThe optical properties of ALD hafnium silicate films, together with pure HfO 2 and SiO 2 films as references, were investigated systematically based on Gaussian dispersion model. According to the results, optical constants and bandgap of the hafnium silicate films can be tuned by the film composition, and a nonlinear change behavior of bandgap with SiO 2 fraction was observed. This phenomenon mainly originates from the intermixture of d-state electrons in HfO 2 and Si-O antibonding states in SiO 2 . \n", "record_id": "15804005"}