{"text": "Optical and Electronic Properties of Femtosecond Laser-Induced Sulfur-Hyperdoped Silicon N+/P Photodiodes\n\nabstract\nImpurity-mediated near-infrared (NIR) photoresponse in silicon is of great interest for photovoltaics and photodetectors. In this paper, we have fabricated a series of n+/p photodetectors with hyperdoped silicon prepared by ion-implantation and femtosecond pulsed laser. These devices showed a remarkable enhancement on absorption and photoresponse at NIR wavelengths. The device fabricated with implantation dose of 1014 ions/cm2 has exhibited the best performance. The proposed method offers an approach to fabricate low-cost broadband silicon-based photodetectors.\n\nBackground\nTraditional silicon-based devices could not show desirable NIR photoresponse due to limitation of optical bandgap (1.12 eV) of silicon [1] , and many attempts have been made to enhance the absorptance of silicon material, especially at NIR wavelengths [2] [3] [4] [5] [6] [7] [8] [9] . The discovery of chalcogen-supersaturated silicon fabricated by laser irradiation in SF 6 atmosphere demonstrated an approach to enhance the sub-bandgap absorption [10, 11] . In this process, the material can be doped beyond the solubility limit [12] . Besides, light trapping effect caused by the unique pointed cone structure on silicon surface also increases the efficiency of light absorption [13] . In this paper, we have fabricated hyperdoped silicon prepared by ion-implantation and femtosecond pulsed laser. Hall measurement was carried out to measure the electrical properties of hyperdoped silicon. Photodetectors based on n + /p junction demonstrated high performances on both NIR absorption and photoresponse.\n\nMethods\nOne-side polished p-type silicon [100] wafers (300 μm) with resistivity 8-12 Ω cm were ion-implanted with 1.2 keV 32 S + into a depth of approximately 40 nm at room temperature. The implantation doses were 1 × 10 14 , 1 × 10 15 , and 1 × 10 16 ions/cm 2 . Pulsed laser melting (PLM) was carried out by 1 kHz train of 100 fs, 800 nm femtosecond laser pulses with a fluence of 0.5 J/cm 2 . Then, laser spot of 200 μm diameter is focused on the silicon and patterned square areas up to 10 mm × 10 mm. Rapid thermal annealing (RTA) was implemented at 600°C for 30 min in a N 2 atmosphere.\nWe determined the absorptance (A) of the samples by measuring reflectance (R) and transmittance (T) by using a UV-Vis-NIR spectrophotometer (UV3600, Shimadzu, Tokyo, Japan) equipped with an integrating sphere detector [3] . The absorptance was calculated by A = 1-R-T. The concentration and mobility of carriers were measured by Hall Effect measurement system at room temperature (via van der Pauw technique) [14] . To investigate whether the impurity/intermediate band (IB) formed by sulfur impurities in silicon enhances the sub-bandgap photoresponse, we employed a Fouriertransform photocurrent spectroscopy method as described in Ref. [15, 16] , where the chopped FTIR globar light source is focused onto the sample, and the generated photocurrent is then demodulated by an external lock-in amplifier and finally fed back to the external port of the FTIR.\nResults and Discussion Figure 1 shows the absorptance of silicon samples implanted at different doses. The samples processed with PLM showed highest absorptance at visible and NIR wavelengths while as-implanted samples showed lowest absorptance. However, the annealing process reduces the absorption in NIR region of spectra. The high Vis-NIR absorptance of microstructured silicon is ascribed to the following reasons: hyperdoping-induced impurity band and microstructured surface-generated light trapping effect. As illustrated in Fig. 1d , an impurity band induced by dopants is formed in silicon, which is responsible for sub-bandgap absorption [17] . Consequently, the hyperdoped silicon shows high absorptance in NIR range. Meanwhile, laser melting reconstructs the silicon surface and produces an array of cones that leads to multiple reflection and absorption [13] , as displayed in Fig. 1e , f. The processed annealing evidently reduces absorptance at NIR wavelengths range, which mainly caused by the two aspects: (1) annihilate the nanostructures on the silicon surface, decreasing the light trapping effect [18] ; and (2) result in the bond rearrangement within silicon matrix, which optically inactivate sulfur impurities [11] .\nBecause of the similar surface structure created by same laser parameters, the intensity of absorption in NIR range mainly depends on the dopant's impurity levels [19] . In the past, we have illustrated the possible S-related energy levels corresponding to the photoresponse spectral features [20] . It showed the large enhancement observed at NIR region dependently resulted from the S-related energy level (~614 meV), which greatly enhanced the sub-bandgap absorptance. Prior to annealing process, absorption has no dramatic change with respect to the doping dose as shown in Fig. 2a [21] proposed the absorption decrease of below bandgap after annealing process is attributed to the diffusion out of the crystalline grains to the grain boundaries of the supersaturated dopants and defects. These defects include vacancies, dangling bonds, and floating bonds. Once the defects diffuse to the grain boundaries, they would no longer make a contribution to impurity bands in the Si, thus reducing the absorption of below bandgap radiation. Moreover, the literature [22] reported that no remarkable redistribution of S occurred until the annealing temperature reached at 650°C. During this process, the S appears to complex with defect clusters, which means the S atoms will combine with each other at the Si wafer surface. This phenomenon leads to a reduction of the active doping concentration.\nThe carrier density and mobility of microstructured silicon with different ion-implantation doses are shown in Fig. 2b . It is evident that sheet density increases with ion-implantation dose, and mobility decreases with increasing ion-implantation dose. According to ShockleyRead-Hall (SRH) recombination effect, in an indirect bandgap semiconductor such as Si and Ge, the carrier lifetime decreases with the increase of dopant concentration [23, 24] . The decrease of mobility leads to an increase of recombination probability, so the decrease of mobility results in a decrease on electron lifetime and the decrease on mobility with increasing doping dose is consistent with SRH recombination effect. After annealing, the sheet carrier density decreases dramatically due to thermal diffusion effect as we discussed previously. Figure 3 shows the photoresponse with different doping dose, and the inset shows the diagram of n+/p photodetector. The photoresponse at NIR range indicates the appearance of impurity-mediated band. The prominent peak at approximately 960 nm corresponds to the generation of electron-hole pairs in silicon substrate, which are separated by the built-in potential of n + /p junction and collected at the top and bottom Al contacts. This phenomenon is well known as the heterojunction theory in Si devices [25] .\nThe observed photoresponse in NIR is ascribed to the sulfur impurity levels in hyperdoped silicon. Such impurity levels facilitate the below bandgap absorption as mentioned above. The absorbed NIR light is converted into electron-hole pairs, resulting in the enhancement of photoresponse in NIR range (1100~1600 nm) [20] . The device with implantation dose of 10 14 ions/cm 2 shows the highest photoresponse in the wavelength range of 1010-1100 nm. The broad peak has been investigated owning to deep sulfur levels in femtosecond laserprocessed silicon [20, 26] 14 ions/cm 2 shows the highest mobility, are in agreement with the conclusion. Based on this theory, although a sample with higher doping dose shows greater absorptance, there is still a balance between optical absorption and carrier mobility. As presented in Fig. 3 , the device with 10 14 ions/cm 2 is most probable to show the highest photoresponse, which is consistent with the conclusion reported in Ref. [23] . \n\nConclusions\nWe have measured the response of photodetectors based on microstructured silicon with different ion-implantation dose. The incorporation of impurities leads to a remarkable enhancement on absorptance and photoresponse at NIR wavelengths. And device implanted at 10 14 ions/cm 2 exhibits the highest photoresponse. PLM combined with ion-implantation demonstrates a considerable technique for the fabrication of NIR detectors. This technique may offer a feasible approach to fabricate low-cost broadband silicon-based photodetectors.\n", "record_id": "2837337"}