{"text": "Intrinsic Defects and H Doping in WO3\n\nabstract\nWO3 is widely used as industrial catalyst. Intrinsic and/or extrinsic defects can tune the electronic properties and extend applications to gas sensors and optoelectonics. However, H doping is a challenge to WO3, the relevant mechanisms being hardly understood. In this context, we investigate intrinsic defects and H doping by density functional theory and experiments. Formation energies are calculated to determine the lowest energy defect states. O vacancies turn out to be stable in O-poor environment, in agreement with X-ray photoelectron spectroscopy, and O-H bond formation of H interstitial defects is predicted and confirmed by Fourier transform infrared spectroscopy.\n\n\n, while presence of O vacancies results in optical absorption (blue color due to gap narrowing) and electrical conductivity 10, 11 . In addition, the electronic properties, in particular the band gap, are found to be sensitive to the spatial arrangement of the W and O atoms 8, 9 . H, due to its small size, is able to migrate in many inorganic compounds and can occupy interstitial sites without large structural expansion. It is able to induce intrinsic defects that provide free electrons 12, 13 , modify the band gap 14 , interact with O vacancies 15, 16 , and induce insulator-to-conductor transitions 17 . Despite much progress, H doping therefore remains a challenge to metal oxide semiconductors. On the other hand, little is known about its potential to endow semiconductors with novel electronic features.\nAlthough the ground state of WO 3 has a γ-monoclinic structure, the compound can also crystallize in other phases 18 . The electronic properties associated with the different structures have been investigated by density function theory, predicting that O vacancies realize a + 2 charge state in the monoclinic and cubic phases 19 . The energy barrier for O vacancy migration turns out to be higher than 0.37 eV 20 . In the present work we use density functional theory to study the stability of various defects as well as their influence on the electronic structure of WO 3 . In addition, we report facile routes to preparing stoichiometric, O-deficient (WO 3−x ), and H-sufficient (H z WO 3−x ) tungsten oxide. We investigate the electronic and optical properties by Fourier transform infrared (FTIR) and ultraviolet-visible (UV-vis) absorption spectroscopy, combined with X-ray and ultraviolet photoelectron spectroscopy (XPS, UPS).\n\nResults\nThe lattice constants of γ-monoclinic WO 3 are calculated to be a = 7.27 Å, b = 7.36 Å, and c = 7.54 Å, which agrees reasonably well with the experimental values (a = 7.31 Å, b = 7.54 Å, and c = 7.69 Å) and previous theoretical results (a = 7.39 Å, b = 7.64 Å, and c = 7.75 Å) 18 . The structural distortions induced by defects are illustrated in Fig. 1 . We observe that the O atoms surrounding a W vacancy (V w ) stay almost at their original positions, whereas nearby W atoms move towards an O vacancy (V o ), which reduces the W-W distance from 4.18 Å (perfect structure) to 3.72 Å. Serveral locations along the face and body diagonals of the WO 6 unit cell are tested for possible interstitial sites. We find that a W interstitial atom is stable only at the body center (W i ) with a W-O bond length of 2.08 Å on average, which is significantly larger than in the perfect structure As expected, in the O-poor limit the formation energy of V w is much higher than that of V o , which is negative for almost all values of the Fermi level, see Fig. 2 . In the O-rich limit the situation changes qualitatively only for high values of the Fermi level. We observe that V w is neutral when the Fermi level is near the conduction band minimum, while V o realizes a + 2 charge state, in agreement with previous theoretical results 19 . We note that our values for the formation energy of V o are slightly lower than those of ref. 19 , which is largely due to our improved treatment of the k-mesh. For V w we find the thermodynamic transition levels ε(0/− 1), ε(− 1/− 2), ε(− 2/− 3), and ε(− 3/− 6) at 0.79 eV, 1.42 eV, 1.59 eV, and 1.60 eV, respectively. The formation energy of O i -1 is higher than that of O i -2, since the former defect does not form chemical bonds. Due to bonding with six surrounding O atoms, W i is only stable in the + 6 charge state. The formation energy in the O-poor limit is (almost) strictly negative, while O i -1 and O i -2 show positive values. This order changes in the O-rich limit approximately when the Fermi level exceeds the middle of the band gap. We find for both H i -1 and H i -2 strictly negative formation energies because of O-H bonding, reflecting easy introduction of H in WO 3 . Introduction of H in the form of (HO) i is possible only in O-rich environment due to the high formation energy of O i -2. For (HO) i the thermodynamic transition levels ε(+ 1/0) and ε(0/− 1) appear at 1.41 eV and 2.02 eV, respectively, see Fig. 2 . Figure 3 shows for perfect WO 3 a (direct) band gap of 2.63 eV, in agreement with the experimental situation (2.6 eV to 3.2 eV) 18 and a previous theoretical result (2.56 eV) 19 . The valence band maximum is almost purely due to the O 2p states and the conduction band minimum due to the W 5d states. For V w and O i -2 the band gap is reduced to 0.70 eV and 2.23 eV, respectively, due to the presence of in-gap states, and it becomes indirect. For V o , W i , and H i -2 metallic characters are encountered, since the charge introduced by the defects enters the W 5d orbitals. Valence charge densities of the occupied (unoccupied in the case of V w ) in-gap states (entire Brillouin zone) are shown in Fig. 4 . For V w they are located on three of the six neighbouring O atoms (reflecting pronounced charge ordering), while for V o we obtain an almost uniform distribution over all W atoms in the supercell (in agreement with ref. 19 ). In the cases of W i and O i -2, on the other hand, they are largely confined to the interstitial atoms and for H i -2 several W atoms around the defect are involved. . For WO 3−x and H z WO 3−x the W 4f signal is broadened towards lower energy, reflecting the appearance of a new oxidation state lower than + 6. Deconvolution of the spectrum demonstrates two distinct contributions: The W 6+ doublet as found before and a minor doublet with weight ratio 4:3, width of 1.8 eV, and lower binding energies of 34.7 eV for W 4f 7/2 and 36.8 eV for W 4f 5/2 . The new doublet represents W +5 ions 23, 24 , which trace back to the presence of O vacancies. FTIR spectra, see Fig. 6(a) , are measured to further elucidate the local structure changes induced by the different deposition environments. The spectra can be roughly divided into three regions: below 500 cm shoulder near 910 cm −1 , attributed to W= O bonds. The shoulder is suppressed for WO 3−x and H z WO 3−x , reflecting the formation of O vacancies. Peaks observed around 1600 cm −1 , mainly for H z WO 3−x , indicate the presence of O-H bonds, in accordance with our theoretical results. Furthermore, the UV-vis adsorption spectra in Fig. 6(b) demonstrate energy gaps of 3.0 eV, 2.8 eV, and 2.75 eV for WO 3 , WO 3−x , and H z WO 3−x , respectively.\nThe UPS spectra in Fig. 7 show for WO 3 the valence band maximum 2.9 ± 0.1 eV below the Fermi level, reflecting an n-type semiconductor, consistent with earlier experiments 23 . WO 3−x and H z WO 3−x exhibit similar valence band onsets. The main difference between the three oxides is related to the secondary electron cut-off region from which the work function can be estimated. We obtain values of 5.2 eV for WO 3 , WO 3−x and 5.6 eV for H z WO 3−x . The work function of H z WO 3−x thus agrees with that of fresh tungsten oxide samples 27, 28 , while the lower values of WO 3 and WO 3−x can be explained by hygroscopic water uptake that occurs instantaneously in air and reduces the work function 29 . Since it is believed that water interacts with O atoms in the host 30, 31 , H z WO 3−x probably maintains a high work function as the O atoms bonded with intercalated H are not available for this process. It recently has been demonstrated that annealing of WO 3 in H 2 atmosphere leads to O-deficient samples that show an order of magnitude enhancement in the photocurrent density 32 . Moreover, WO 2.72 is a versatile and efficient catalyst for the hydrogenation of linear olefins, cyclic olefins, and aryl nitro groups 33 . In organic photovoltaics and organic light emitting diodes charge transport layers of O-deficient and H-sufficient WO 3 can improve the performance of devices with forward architecture \n\nMethods\nDensity functional theory is employed based on the projector augmented wave method as implemented in the Vienna Ab-initio Simulation Package 35 . The generalized gradient approximation as proposed by Perdew, Burke and Ernzerhof 36 (structure optimization) as well as the screened hybrid density functional proposed by Heyd, Scuseria, and Ernzerhof 37 (formation energy and density of states) are used for the exchange correlation potential. The long range van der Waals interaction is taken into account by means of the DFT-D3 approach 38 . 2 × 2 × 2 supercells are used for all the defects to avoid artificial interaction because of the periodic boundary conditions. The cut-off energy for the plane wave basis is set to 500 eV and the energy tolerance for the iterative solution of the Kohn-Sham equations to 10 −6 eV. All structures are relaxed until the residual forces on the atoms have declined to less than 0.03 eV/Å. We employ 2 × 2 × 2 k-meshes except for the hybrid density functional calculations of charged defects, for which Γ -point calculations are performed (to reduce the computational costs) and the total energy is corrected by comparison to the neutral counterparts (deviations ∼ 0.01 eV as compared to 2 × 2 × 2 k-meshes).\nThe defect formation energy is calculated as\nwhere Δ E(D, q) is the total energy difference between the perfect supercell and the supercell containing defect D in charge state q, n i is the number of atoms of type i removed from the supercell, and μ i is the corresponding chemical potential. Moreover, E VBM and E F , respectively, are the valence band maximum and Fermi level (ranging from 0 eV to 2.63 eV, the size of the band gap). Stability of WO 3 against byproducts and decompositions requires\nH 2 The O-rich and O-poor limits are given by the maximum and minimum values of μ o . Moreover, the thermodynamic transition level, for\n, is defined as (H-rich) . The deposited WO 3 films are characterized by FTIR absorption measurements using a Brooker spectrometer and UV-vis absorption measurements using a Perkin Elmer Lampda 40 UV/vis spectrophotometer. XPS measurements are conducted in ultra high vacuum (∼ 10 −10 Torr) using a Leybold EA-11 analyzer and the unmonochromatized Mg Kα line (photon energy 1253.6 eV) at 15 keV and 20 mA anode current. The instrument is calibrated for the Au 4f 7/2 peak, giving a full width at half maximum of 1.3 eV. The stoichiometry is determined from the XPS W 4f and O 1s core level spectra. After Shirley background subtraction, the photoemission peaks are integrated by fitting the O 1s and W 4f spectra with asymmetric Gaussian-Lorentzian curves. The error is estimated to be ± 10%. UPS spectra are recorded for 10 nm thick films deposited on Si substrate, using the same spectrometer as for the XPS measurements and the He I excitation line (photon energy 21.22 eV). The analyzer resolution is determined to be 0.16 eV from the width of the Au Fermi edge.\n", "record_id": "317542"}