{"text": "Optical properties of thin films of mixed Ni―W oxide made by reactive DC magnetron sputtering\n\nabstract\nAbstract Thin films of Ni x W 1 − x oxides with x = 0.05, 0.19, 0.43 and 0.90 were studied. Films with thicknesses in the range 125–250 nm were deposited on silicon wafers at room temperature by reactive DC magnetron co-sputtering from targets of Ni and W. The films were characterized with X-ray diffraction (XRD), scanning electron microscopy (SEM), and spectroscopic ellipsometry (SE). XRD spectra and SEM micrographs showed that all films were amorphous and possessed a columnar structure. The ellipsometric angles Ψ and Δ of as-deposited films were measured by a rotating analyzer ellipsometer in the UV–visible-near infrared range (0.63–6.18 eV) and by an infrared Fourier transform rotating compensator ellipsometer in the 500–5200 cm −1 wavenumber range. SE measurements were performed at angles of incidence of from 50 ° to 70 °. Parametric models were used to extract thicknesses of the thin films and overlayers of Ni x W 1 − x oxide at different compositions, band gaps and optical constants. Features in the optical spectra of the Ni x W 1 − x oxides were compared with previous data on tungsten oxide, nickel oxide and nickel tungstate.\n\nIntroduction\nAmorphous tungsten oxide (WO 3 ) and polycrystalline nickel oxide (NiO) are among the most widely used electrochromic (EC) materials [1] [2] [3] . They are of great technological importance for the development of coatings with tunable optical properties and have found application in many devices such as \"smart windows\" for energy efficient buildings, information displays, and rear view mirrors for automobiles.\nIntensive research efforts are currently focused on finding new EC materials with improved optical and electro-optical characteristics. One interesting possibility in these endeavours involves the incorporation of transition metal atoms into WO 3 and NiO. With this in mind, we have recently embarked on a detailed study of the Ni x W 1-x oxide system [4] [5] [6] and demonstrated that superior optical properties can be obtained for intermediate compositions [6, 7] .\nIn previous work we have determined the optical constants of amorphous WO 3 and polycrystalline NiO thin films [5] . In the present work, we extend these studies to thin films of Ni x W 1-x oxides with different compositions prepared by co-sputtering. Specifically we use spectroscopic ellipsometry (SE) to characterize these thin films and to investigate the evolution of optical constants with increasing Ni content.\nThe optical constants of the materials under study depend both on composition of the Ni x W 1-x oxide and on the film structure. The composition of the films was characterized by the parameter x, that can be accurately determined by Rutherford Backscattering Spectroscopy (RBS) or X-ray Photoelectron Spectroscopy (XPS) [6] . Previous work using XPS and Raman spectroscopy (RS) has indicated a complex structure, including the presence of amorphous WO 3 as well as nanosized NiO and nickel tungstate (NiWO 4 ) phases in the films. Particularly, XPS and Raman spectroscopy showed clear evidence that Ni x W 1-x O y thin films are composed of WO y , (with y close to 3) and NiWO 4 phases for x<0.5, and that the main constituent is NiWO 4 for x=0.5 [6] . In films with x>0.5 , XPS gave clear evidence for NiO and the presence of reduced tungsten ions (W 5+ ), as well as weak indications of hydrated phases and NiWO 4 [6] . Studies of the film structure are of importance for interpreting the optical properties. For example a grading of the refractive index as well as optical anisotropy may occur, and SE enables us to detect details of such changes. In addition, thickness nonuniformities of the films can be modeled.\n\nSample preparation and characterization\nThe films were prepared with dual-target reactive DC magnetron sputtering using a deposition system based on a Balzers Model UTT 400 unit. The targets were 5-cm-diameter metallic plates of W and Ni having 99.9% purity. Sputtering was carried out under a constant O 2 /Ar gas-flow ratio of 0.15, which is optimal for sputtering of pure tungsten oxide [6] . oxides is given elsewhere [6] .\nThe structure of the films was determined by X-ray diffraction (XRD) using a\nSiemens Model D5000 diffractometer operating with Cu K α radiation in a conventional Θ-2Θ\nsetup. No clear XRD patterns were produced by the Ni x W 1-x oxide films; hence these films are characterized as X-ray amorphous.\nCross-sectional film morphologies were investigated by scanning electron microscopy (SEM) using a LEO Ultra 55 FEG instrument. A typical cross-sectional view on a fractured sample is shown in Fig. 1 . Columnar structures of the films as well as porosity are evident from the SEM micrograph. The thicknesses of the films were found to be in the range 125 < d < 250 nm.\n\nAcquisition and analysis of ellipsometry data\nSpectroscopic ellipsometry measurements were performed with a variable-angle ellipsometer (VASE from J.A. Woollam Co., Inc.) in the 0.63-6.18 eV spectral range with a step of 0.02 eV. In addition, an infrared Fourier transform rotating compensator ellipsometer (J.A.\nWoollam Co., Inc.) was used in the 500-5200 cm -1 wavenumber interval with a resolution of 4 cm -1 . Three to five angles of incidence were used in the 50-70° range. The measured ellipsometric angles Ψ and Δ are defined from the ratio of the reflection coefficients R p and R s for the p and s polarizations, respectively, (i.e., polarization of the electric field parallel and perpendicular to the plane of incidence) [8] according to\nData analysis was performed with the WVASE32 software [9] : the found solutions were evaluated according to the Levenberg-Marquardt method for minimizing the mean-squared error (MSE) defined by\nwhere N is the number of ( Ψ , Δ) pairs, M is the number of fitted parameters in the model and σ are standard deviations of the experimental data points. The superscripts mod and exp indicate model-generated and experimental data, respectively.\nData for the Si substrate with native oxide were first analyzed. The thickness of the SiO 2 layer was determined to be 2.9±0.1 nm by using optical constants of Si and native oxide taken from the literature [10] . In the further calculations, we kept the SiO 2 layer thickness constant.\nThe structural model used in the analysis of \nwhere m is the number of components (m = 2, i.e. Ni x W 1-x oxide and void in our case), and f i and ε i are the volume fraction and the complex dielectric function of component i, respectively. For each sample in the present analysis, the volume fraction of Ni x W 1-x oxide and voids was taken to be 0.5 for the overlayer.\nThe spectral dependencies of the optical properties of the Ni x W 1-x oxides can be described in terms of their complex dielectric function\n, where E is the photon energy. A parametric model was used for ε , and several oscillator models were used as specified next.\nWe first consider models for the optical properties at short wavelengths in the region of the fundamental band gap. In this case a Lorentz (L) oscillator was used as one of the options. In this model the contribution L ε to ε is given by [8] \nwhere ε , A is the amplitude, Γ is a broadening parameter, and 0 E is the resonance energy.\nA Tauc [8] .\nWe now turn to expressions for the dielectric function in the infrared region (IR).\nHere we could use models based on Gaussian absorption profiles. In the Gauss (G) oscillator model, G 2 ε is given by [9] 2 2 2 0 0\nwhere σ is a broadening parameter and G \n\nResults and discussion\nFive samples of Ni x W 1-x oxide, with x equal to 0, 0.05, 0.19, 0.43 and 0.90 were studied. From Table 1 it is evident that the bandgap of the mixed metal oxide films is between 3.2 eV and 3.3 eV for all films with x up to 0.43, and close to the bandgap of amorphous WO 3\n[1]. These mixed oxide films have larger resonance energies and broader TL absorption bands than for pure tungsten oxide [5] . The broadening effect may originate from the larger amount of defects in the two-component material. It should be noted, that Ni 0.90 W 0.10 oxide absorbed in the visible range whereas the other oxides were transparent. The absorption in the visible may be because the nickel oxide contains Ni 3+ which exists in the phases NiOOH and/or Ni 2 O 3 [13] .\nInterband absorption in WO 3 seems to be very dependent on the crystalline structure of the material, as well as on the stoichiometry, and it is difficult to find data for the position of the resonance energy (E 0 ) for amorphous thin films. However, DeVries et al. [14] have studied sputter deposited thin films and found a peak in the imaginary part of the dielectric function at 4.5 eV, in agreement with our data. On the other hand no such peak was seen for evaporated films up to 4.8 eV [15] . For NiWO 4 the maximum appears to be at higher energies in the vicinity of 6 eV [16] . The shift of E 0 towards higher energies as x increases as observed in Table 1 would then be consistent with an enhanced amount of NiWO 4 in the films, in agreement with the conclusions in our earlier investigation [6] . The Ni-rich film with x = 0.9 exhibits a lower imaginary part of the dielectric function in the UV region. This film exhibits a broad peak in the 4 eV to 4.5 eV region, which is consistent with the interband absorption in NiO [17] .\nIn the visible range, the values of n of the studied mixed oxides were very close to n of pure tungsten oxide and smoothly decreased for increasing amounts of Ni (see Fig. 3 ). This behaviour of n can be caused by stoichiometric or structural variations.\nThe origin of the Gauss oscillator at 0.4 eV is unknown, although broad mid-IR absorption at somewhat different energies has been observed previously in WO 3 [14, 18] . This absorption could be associated with gap states or possibly related to polaronic transitions. The IR absorption in WO 3 is dominated by a strong peak close to 0.08 eV, due to the O-W-O stretching mode [14, 15, 18] . In addition to this we also observe a subsidiary peak at 0.09 eV for films with x<0.1, as seen in Fig. 4 . This peak is usually interpreted as due to W=O vibrations [6] and its presence points to some degree of sub-stoichiometry in our tungsten oxide films.\nThe IR absorption for films with higher magnitudes of x seems to be dominated by these vibrations, although the positions differ somewhat. In the case of films with high x, the W=O vibration, which decreases with increasing Ni content as expected, seems to be most prominent. No features due to NiO can be identified probably due to the low energy cutoff in the measurement. \n", "record_id": "53384093"}