{"text": "Electrodeposition mechanism of ZnSe thin film in aqueous solution\n\nabstract\nZnSe is one of the important and excellent II–VI semiconductor materials, which has direct transition band structure. In this paper, ZnSe thin films were prepared by an electrochemical deposition method, and the formation mechanism of ZnSe was studied systematically. Voltammetry and chronoamperometry combined with X-ray diffraction (XRD) and Raman techniques were used to analyze the deposition processes. It is found that the substrate and deposition potentials have a great influence on the phase composition of deposited thin film, and Zn substrate is beneficial to the preparation ZnSe films. Strong selenium–substrate interaction results in the formation of selenium compounds involving electrode materials. The addition of Zn(II) source can affect the reduction potential of Se, and results in the change of reducing mechanism of Se(0) from Se(IV). Se(0) formed from H2Se because the formation of H2Se is more active than forming Se(0) directly from Se(IV), and H2Se can recombine with the substrate material, forming selenium–substrate compounds more quickly.\n\nIntroduction\nZnSe is a promising photovoltaic material because of its optical band gap energy (2.7 eV) and the high absorption coefficient for efficient energy conversions [1, 2] . In the last years, a variety of methods have been employed for the fabrication of ZnSe thin film, such as chemical bath deposition [3, 4] , sol-gel deposition [5, 6] , physical vapor deposition under vacuum [7] , and electrodeposition . Among them, electrodeposition method is relatively inexpensive and simple [30] . Moreover, it is the only technique which can be used for depositing films on large and irregular surfaces, and it enables the fabrication at conditions near chemical equilibrium for ZnSe [31] [32] [33] [34] .\nElectrolytes used for the ZnSe electrodeposition can be divided into three major types: aqueous solutions, organic solutions [15, 17, 27, 35] and high-temperature molten salts [12] . Aqueous solutions have attracted much interest since it is safe and inexpensive. As the standard electrode potentials of Zn 2? /Zn and SeO 3 2-/Se are -1.005 and 0.500 V versus the standard saturated calomel electrode, respectively, the electrodeposition of ZnSe should be difficult because of the wide difference in the reduction potential of Zn and Se ions, and low concentration of selenous acid and high concentration of zinc salt are usually used for this approach. Moreover, it was found that the deposition potential of zinc is shifted toward positive values because of the contribution of Gibbs free energy change of ZnSe formation. Three different mechanisms of ZnSe electrochemical synthesis in aqueous electrolytes have been suggested. Bouroushian et al. [16, 23] suggested that Se and Zn species were deposited by cathodic electroreduction first, and zinc selenide thin films were deposited according to chemical reactions as follows:\nChandramohan et al. [10] and Kowalik et al. [20] suggested that H 2 SeO 3 was first reduced to Se, and subsequently reacted with Zn 2? to form ZnSe on the cathode surface. The reactions for the formation of ZnSe were expressed as follows:\nHowever, it was proposed that Se was reduced to Se 2- state, forming H 2 Se, which was highly reactive. H 2 Se immediately reacted with Zn 2? which was adsorbed on the surface of the substrate and formed ZnSe [9, 29] . The reactions can be expressed by the following equations:\nMoreover, a wide range of studied experimental conditions was examined in order to determine the best way of electrosynthesis of the material, such as pH, reagent concentration, deposition potential, temperature and substrates. The substrates used were Ag, Ti, indium tin oxide (ITO), glass carbon, stainless steel, Al and Cu. In this paper, Cu and Zn were used as the substrates for the electrodeposition of ZnSe. The aim of the present studies was to investigate the mechanism of ZnSe electrodeposition, and a new mechanism was proposed according to our results.\n\nExperimental\nElectrochemical tests were carried out in an acidic solution containing ZnSO 4 and SeO 2 . The concentrations of ZnSO 4 and SeO 2 were 0.200 and 0.002 molÁL -1 , respectively, and pH was adjusted to 2 by sulfuric acid addition. All chemicals were analytical grade and used directly without further purification. The cyclic voltammograms (CV) and chronoamperometric measurements were taken using a potentiostat (CHI660). For all the electrochemical measurements, a conventional three electrode system was used. Zinc tablet or copper tablet was used as working electrode. A platinum wire was used as the counter-electrode, and a platinum wire served as the pseudo-reference electrode. Prior to the measurements, the working electrodes were cleaned as follows. The copper and zinc plates (about 3 cm 2 in geometric area) were polished with emery paper, rinsed with deionized water, then immersed for 30 min in 98 % alcohol solution and thoroughly rinsed with water.\nThe products were characterized by X-ray diffractometer (XRD, MAC Science X 0 Pert PRO) with Cu Ka radiation (k = 0.15406 nm). Scanning electron microscopy (SEM) images were obtained using a Zeiss ultra plus field emission scanning electron microscopy (FESEM) apparatus. The Raman spectra of the products were recorded at ambient temperature on a 633-nm He-Ne laser with a liquid helium cooling system (Jobin-Yvon LabRAM HR800UV).\n\nResults and discussion\nTypical CV curves of aqueous solutions containing different solutes using a copper electrode at pH = 2 are shown in Fig. 1 . As seen in Fig. 1 (1), a reduction peak at about -0.60 V and a small reduction peak at -0.75 V are observed in 0.002 molÁL -1 SeO 2 solution. With the addition of ZnSO 4 to SeO 2 solution, the reduction peaks move to the positive direction as seen from Fig. 1(2) . The reduction peak at -0.60 V is shifted to -0.30 V, and the second reduction peak at -0.75 V appears at -0.60 V.\nElectrodeposition experiments were performed for 2 h at different potentials on Cu substrate to characterize the reduction reaction. XRD was used to characterize the phase of the deposits, and the results are shown in Fig. 2 . As shown in Fig. 2 , there are Se, CuSe and Cu 2 Se phases in the deposits along with peaks for the Cu substrate. No ZnSe or Zn is detected in the deposited coating even when the deposition process was carried out at -1.00 V. Cu 2 Se is also detected for the electrodeposition of ZnSe when using copper as cathode by Skyllas Kazacos and Miller [36] . Electrodeposition mechanism of ZnSe thin film in aqueous solution 817\nAs there are Cu 2 Se and CuSe in the deposits and no Cu source is contained in the solutions, it can be deduced that the deposited Se may react with the Cu substrate, forming Cu 2 Se and CuSe. Another possibility is that selenium atoms diffuse into substrate and then form alloys. To prepare ZnSe, Cu substrate was changed to Zn substrate and the electrodeposition processes were carried out at -0.6 V in the same electrolyte composition. Figures 3 and 4 show XRD pattern and Raman spectrum of the obtained thin films on Zn substrates. As shown in Fig. 3 , the diffraction peaks at 2h = 27.60°, 45.68°, 84.03°, 91.32°are attributed to the (111), (220), (422), (511) planes of cubic ZnSe phase, respectively, which is confirmed using the standard JCPDS data card (No. 01-6920). Se and Zn are also detected in the deposits. Compared with XRD results of copper substrate (Fig. 2) , the appearance of Zn in XRD pattern (Fig. 3) should be attributed to the Zn substrate. Se is caused by the reduction of Se(IV) to Se(0) on Zn cathode. For the Raman spectrum shown in Fig. 4 , two peaks at 252 and 235 cm -1 are observed. As the spectrum of pure ZnSe consists of a longitudinal optical (LO) phonon at 253 cm -1 and the transverse mode (TO) at about 204 cm -1 [37, 38] , the peak at 252 cm -1 indicates the existence of ZnSe in the thin film. The pronounced peak at about 235 cm -1 is attributed to a trigonal Se phase [38, 39] . These results are consistent with XRD results. Figure 5 shows SEM images of ZnSe deposited on Zn substrate at -0.20 and -0.60 V versus Pt for 2 h. It is clearly seen that the deposited thin films are composed of nanoparticles which are homogenous and well cover the Zn substrate. Moreover, during the electrodeposition process, it is observed visually that the cathode becomes dark when using copper as cathode with prolonged electrodeposition time at -0.60 V, while it turns to golden yellow color first and then changes to red when using zinc as cathode. According to Refs. [21, 40] , the reduction process of Se (IV) occurs through two reaction paths, Se(IV) ? Se(0) and Se(IV) ? Se(-II); the product Se(-II) for the second path then reacts with H 2 SeO 3 through a reaction as follows:\nSe obtained via the first process 1 is the gray type of the selenium, which is recognized as electroinactive, while the latter step leads to red Se, which is the only electroactive form of Se(0) [21] . When using copper as cathode, Se(IV) is reduced to Se(0) directly at -0.60 V, and the cathode appears gray and dark. As the reduction reaction shifts to positive (Fig. 1) , the electroactive form of Se(0) is formed because H 2 Se is produced at -0.60 V. The appearance of golden yellow color results from the formation of ZnSe. After the surface of zinc cathode is covered by ZnSe, electroactive Se(0) cannot contact with the Zn cathode but deposits on top of ZnSe instead, appearing as red. Compared to the CV results, it is deduced that the first reduction peak (at -0.60 V in Fig. 1(1) ) belongs to the reduction of Se (IV) to gray Se(0) directly, and the second reduction peak (at -0.80 V in Fig. 1(1) ) is due to the From the above results, it can be concluded that ZnSe can be obtained with the use of Zn substrate, while Cu 2 Se is formed when Cu was used as substrate. It is deduced that the formation mechanism for ZnSe in this experimental condition can be described as following:\nAs pointed out above, ZnSe is formed by the reaction of reduced Se with Zn substrate. ZnSO 4 does not seem to be essential for the formation of ZnSe. To verify this conclusion, electrodeposition processes were carried out using solutions which only contained Se source. Figure 6 shows the Raman result of the deposits obtained in 0.002 molÁL -1 SeO 2 acidic solution. The peaks at 145 and 252 cm -1 show the existence of ZnSe in the deposit, and this confirms the proposed ZnSe formation mechanism. However, the intensity of ZnSe characteristic peaks are smaller compared with the Raman result of deposits obtained at -0.6 V on Zn substrate in ZnSO 4 -SeO 2 solution (Fig. 4) . This indicates that the addition of ZnSO 4 can accelerate the formation of ZnSe. As shown in Fig. 1 , the addition of Zn(II) source results in the positive transfer of the reduce reaction, and it changes the reducing mechanism of Se(0).\n\nConclusion\nZnSe thin films were successfully deposited on Zn substrate using electrodeposition method. Strong seleniumsubstrate interaction results in the formation of selenium compounds involving electrode materials. The presence of Zn(II) in the electrolytic bath is not essential for the deposition of ZnSe when using zinc cathode. However, the addition of Zn(II) source results in the positive transfer of the reduction reaction. It makes a change in the reducing mechanism of Se(0), from direct reduction from Se(IV) to form H 2 Se first, and then form Se(0), which is more active than reducing Se(IV) to Se(0) directly. \n", "record_id": "55005437"}