{"text": "Controllable Synthesis of Single-Crystalline CdO and Cd(OH)2Nanowires by a Simple Hydrothermal Approach\n\nabstract\nSingle-crystalline Cd(OH)2 or CdO nanowires can be selectively synthesized at 150 °C by a simple hydrothermal method using aqueous Cd(NO3)2 as precursor. The method is biosafe, and compared to the conventional oil-water surfactant approach, more environmental-benign. As revealed by the XRD results, CdO or Cd(OH)2 nanowires can be generated in high purity by varying the time of synthesis. The results of FESEM and HRTEM analysis show that the CdO nanowires are formed in bundles. Over the CdO-nanowire bundles, photoluminescence at ~517 nm attributable to near band-edge emission of CdO was recorded. Based on the experimental results, a possible growth mechanism of the products is proposed.\n\nIntroduction\nOne-dimensional (1-D) nanostructures, such as nanowires, nanorods, nanotubes, and nanobelts, have received wide attention in the field of nanoscience [1] . With unique physical properties that are size-and shape dependent, the materials are expected to play a critical role in the technologies of future electronic and optoelectronic devices [2] . 1-D structures of semiconductor materials such as Si [3] , Ge [4] , GaN [5] , GaAs [6] as well as those of ZnO, SnO 2 , In 2 O 3 and CdO [7] are frequently reported in the literature. They are produced by various methods including vaporphase transport [5] , chemical vapor deposition [8] , arc discharge [9] , laser ablation [6] , solution [10] and templatebased method [11] .\nCadmium oxide (CdO) is an important n-type semiconductor with a direct band gap of 2.5 eV and an indirect band gap of 1.98 eV [12] . The difference in band gap originates from cadmium and oxygen vacancies and strongly depends on the procedures of synthesis [13] . Because of the large linear refractive index (n 0 = 2.49), CdO is a promising candidate for optoelectronics applications and can be used in the fabrication of solar cells, phototransistors, photodiodes, transparent electrodes, catalysts and gas sensors [14] [15] [16] [17] . In the past decade, CdO of multifarious 1-D nanostructures (such as nanowires [18] , octahedrons and nanowires on micro-octahedrons [19] , porous nanobelts [20] , nanoneedles [21] , and nanostrands [1] ) have been synthesized and studied. However, the reported CdO nanostructures were produced through the use of a sacrificial template. Jia et al. [20] obtained CdO nanostructures by calcining shape-controlled single-crystalline CdCO 3 . With heating in the presence of oxygen at high temperatures, Zhang et al. [18] prepared CdO nanowires from a layered metalorganic framework assembled by 1-D infinite zigzag chains. It is noted that efficient synthesis of 1-D CdO nanostructures using one-step, template-free, and seedless method is rare.\nCadmium hydroxide, Cd(OH) 2 , is a wide band gap semiconductor with a wide range of possible applications including solar cells, photo transistors and diodes, transparent electrodes, sensors, cathode electrode materials of batteries, and so forth [15, [22] [23] [24] . The applications of Cd(OH) 2 are based on its specific optical and electrical properties. For example, Cd(OH) 2 films show high electrical conductivity as well as high transparency in the visible region of solar spectrum. Cadmium hydroxide has also been proven to be an important precursor that can be converted into cadmium oxide through dehydration or into other functional materials (e.g., CdS, CdSe) by reaction with appropriate elements or compounds [25] .\nHerein, we report a simple hydrothermal method for the preparation of single-crystalline CdO or Cd(OH) 2 nanowires. The approach is efficient and simple and does not involve the use of a template. The synthesis was conducted at 150°C using aqueous Cd(NO 3 ) 2 as the only precursor. By varying the synthesis time, the growth of CdO and Cd(OH) 2 can be selectively controlled. To the best of our knowledge, the fabrication of CdO or Cd(OH) 2 nanowires in such a way has never been reported.\n\nExperimental Details\nFor the synthesis of single-crystalline CdO and Cd(OH) 2 nanowires, 0.1 M Cd(NO 3 ) 2 Á2H 2 O was dissolved in deionized water to form a 40.0-mL solution that was transferred into a Teflon-lined autoclave. The autoclave with its content was kept in an oven at 150°C for 10 h, 24 h, or 48 h. At the end of the hydrothermal treatment, the as-obtained solid material was separated from the yellow turbid solution using a centrifuge and thoroughly washed with absolute ethanol and deionized water (three cycles). The reagents used in the experiments were of analytical grade (purchased from Nanjing Chemical Industrial Co.) and used without further purification.\nThe samples were examined on an X-ray powder diffractometer (XRD) at room temperature (RT) for phase identification using Cu Ka radiation (Model D/Max-RA, Rigaku, Japan). The morphologies of the samples were examined over a high-resolution TEM (HRTEM, model JEOL-2010, Japan) operated at an accelerating voltage of 200 kV and a field-emission scanning electron microscope (FESEM model FEI Sirion 200, America) operated at an accelerating voltage of 5 kV. The photoluminescence (PL) of samples was measured at RT using a He-Cd laser (excitation source: 325 nm).\n\nResults and Discussion\nThe X-ray diffraction (XRD) results of the samples collected at 10, 24, and 48 h are shown in Fig. 1 . The peaks of the 24-h sample (Fig. 1b) are indexed to cubic phase of CdO with lattice constants of a = b = c = 0.4725 nm (JCPDS No. 78-0653). We find that the 48-h sample (Fig. 1c) is mainly Cd(OH) 2 , while the 10-h one is composed of CdO and Cd(OH) 2 . Based on the results, one can see that there is the conversion of Cd(NO 3 ) 2 Á2H 2 O to Cd(OH) 2 in the initial hours of synthesis plausibly by means of hydrolysis (Eq. 1). After 24 h, CdO is formed, likely a result of Cd(OH) 2 decomposition (Eq. 2). At around 48 h, it is found that Cd(OH) 2 is the predominant product. The inter-transformation of CdO and Cd(OH) 2 will be discussed later in this article. It is proposed that the as-prepared bundles of Cd(OH) 2 nanowires can be used as a template for fabricating porous cadmium chalcogenides nanomaterials.\nThe morphology and size of the as-synthesized (150°C, 24 h) CdO-nanowire bundles were characterized by FE-SEM and HRTEM. According to Fig. 2a , the yield of CdO wires (tens of micrometers in length) is high. One can see that the wires are comprised of several nanowires that bundle together, and the average diameter of the wires is around 40 nm (Fig. 2b, c) . In addition, detected also are nanostrands of smaller size which could be considered as ''building blocks'' for the formation of the nanowire bundles. The HRTEM image (Fig. 2d) indicates that the CdO nanowires are single-crystalline, showing spacing (0.273 nm) corresponding to the (111) plane of CdO. In EDX analysis, only Cd and O are detected over the assynthesized CdO bundles (Fig. 2e) . It is apparent that bundles of single-crystalline CdO nanowires can be fabricated by this simple method of hydrothermal synthesis. Shown in Fig. 3 are the FESEM and TEM images of the 10-h and 48-h samples. Over the 10-h sample, one can detect the presence of nanowires that are in the process of gathering into bundles (Fig. 3a-c) . As for the 48-h sample (Fig. 3d-f) , the FESEM and TEM images differ significantly from those of the 10-h (Fig. 3a-c) and 24-h (Fig. 1) samples. The 48-h sample is comprised of wires that are much shorter in length (Fig. 3d) and with ends that are cuspidated (Fig. 3e) . We find that the wires of the 48-h sample readily decompose into nanoparticles during HRTEM analysis (Fig. 3f) . It is known that Cd(OH) 2 nanowires easily decompose to porous CdO nanowires upon heat treatment [26] . The decomposition of the 48-h sample during HRTEM analysis could be a result of electron bombardment. The result of SAED analysis shows that the 10-h and 48-h samples are single-crystalline. Indicated by arrows in Fig. 3b ,e are the positions from where the SAED patterns were taken. At the 10th hour, the product is a mixture of CdO and Cd(OH) 2 , and the SAED pattern is similar to that of 24-h Cd(OH) 2 .\nDespite the exact growth mechanism of the CdO-nanowire bundles is not clear, one can make hypotheses based on the obtained data. As indicated by the XRD results, the reaction processes in different reaction periods can be different. At the initial stage, because of the release of NO 2 during the hydrolysis of Cd(NO 3 ) 2 Á2H 2 O (Eq. 1), the formation of cadmium hydroxide nuclei is promoted. From these nuclei, Cd(OH) 2 compounds gather to form nanostrands (can be observed clearly in Fig. 2c ) of high aspect ratios as demonstrated elsewhere [27] [28] [29] [30] . As shown in Fig. 4 , the nanostrands could serve as building blocks for the formation of ordered nanostructures. As reported by Shinde et al. [31] with the availability of ionic species, nanoparticles accumulated on the positive nanostrands, resulting in the generation of nanowire bundles. Under the adopted hydrothermal conditions, the nanostrands are in the course of assembling into bundles at the 10th hour (Fig. 4) concentration. It is worth pointing out that besides existing as gas in the autoclave, NO 2 dissolves in H 2 O as well as indicated by the turbid solution that is yellow in color. To keep neutrality of the reaction system, the amount of OH -should increase. As a result, the reaction gradually shifts toward the formation of Cd(OH) 2 during the later hours, making Cd(OH) 2 being the major product. In other words, despite of the fact that the reactions of Eqs. 1 and 2 are reversible, and normally the product should be a mixture of CdO and Cd(OH) 2 , high-purity CdO and Cd(OH) 2 can be generated, respectively, at the 24th and 48th hour, as indicated by the results of XRD investigation. Shown in Fig. 5 are the photoluminescence (PL) spectra of the 10-h and 24-h samples. The 24-h bundles show a strong emission peak at *517 nm ascribable to the near band-edge emission of CdO. The 10-h sample exhibits an excitonic peak at *512 nm, showing a modest blue-shift (*5 nm) compared to the corresponding peak of the 24-h sample. The weak emissions detected in both cases are likely to be due to impurities and/or various kinds of defects. With such strong emission peak at *517 nm, the CdO-nanowire bundles can be utilized in the industry of high-quality monochromatic laser.\n\nConclusion\nIn conclusion, we have demonstrated that by means of a facile, low-cost, and template-free approach, bundles of single-crystalline CdO nanowires can be hydrothermally fabricated at 150°C using aqueous Cd(NO 3 ) 2 as precursor. We find that CdO and Cd(OH) 2 can be selectively obtained according to synthesis time. The as-synthesized CdO bundles show strong 517-nm emission and hence can be utilized in the manufacture of gas sensors. Also, the 48-h product can act a good template for the fabrication of CdS and CdO nanostructures. It is envisioned that this simple and low-cost approach can be adopted for the synthesis of nanostrucures of other oxides (such as ZnO, FeO) using the corresponding nitrates as precursors.\n", "record_id": "68518"}